#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActionFromKeyWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActionFromKeyWidget.ActionFromKeyWidget_C
// 0x0028 (0x0258 - 0x0230)
class UActionFromKeyWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             DisplayText;                                       // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FKey                                   DesiredKey;                                        // 0x0240(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ActionFromKeyWidget(int32 EntryPoint);
	void BindingsChanged();
	void Construct();
	void SetWidgetText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActionFromKeyWidget_C">();
	}
	static class UActionFromKeyWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActionFromKeyWidget_C>();
	}
};
static_assert(alignof(UActionFromKeyWidget_C) == 0x000008, "Wrong alignment on UActionFromKeyWidget_C");
static_assert(sizeof(UActionFromKeyWidget_C) == 0x000258, "Wrong size on UActionFromKeyWidget_C");
static_assert(offsetof(UActionFromKeyWidget_C, UberGraphFrame) == 0x000230, "Member 'UActionFromKeyWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActionFromKeyWidget_C, DisplayText) == 0x000238, "Member 'UActionFromKeyWidget_C::DisplayText' has a wrong offset!");
static_assert(offsetof(UActionFromKeyWidget_C, DesiredKey) == 0x000240, "Member 'UActionFromKeyWidget_C::DesiredKey' has a wrong offset!");

}

