#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivePlayersRow

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivePlayersRow.ActivePlayersRow_C
// 0x0058 (0x0288 - 0x0230)
class UActivePlayersRow_C final : public UUserWidget
{
public:
	class UTextBlock*                             PlayerName;                                        // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            LocalPlayerColor;                                  // 0x0238(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            RemotePlayerColor;                                 // 0x0260(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void SetPlayerName(const class FString& Param_PlayerName, bool IsLocalPlayer);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivePlayersRow_C">();
	}
	static class UActivePlayersRow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivePlayersRow_C>();
	}
};
static_assert(alignof(UActivePlayersRow_C) == 0x000008, "Wrong alignment on UActivePlayersRow_C");
static_assert(sizeof(UActivePlayersRow_C) == 0x000288, "Wrong size on UActivePlayersRow_C");
static_assert(offsetof(UActivePlayersRow_C, PlayerName) == 0x000230, "Member 'UActivePlayersRow_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UActivePlayersRow_C, LocalPlayerColor) == 0x000238, "Member 'UActivePlayersRow_C::LocalPlayerColor' has a wrong offset!");
static_assert(offsetof(UActivePlayersRow_C, RemotePlayerColor) == 0x000260, "Member 'UActivePlayersRow_C::RemotePlayerColor' has a wrong offset!");

}

