#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActiveItemSuperShield

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function ActiveItemSuperShield.ActiveItemSuperShield_C.ExecuteUbergraph_ActiveItemSuperShield
// 0x00D8 (0x00D8 - 0x0000)
struct ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class AMarinerPlayerController* PossessingController, class APawn* PossessedPawn)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27C6[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x001C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMarinerCharacter*                      K2Node_DynamicCast_AsMariner_Character;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27C7[0x2];                                     // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27C8[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27C9[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_3;               // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_3;                     // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27CA[0x6];                                     // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMarinerPlayerController*               K2Node_CustomEvent_PossessingController;           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_PossessedPawn;                  // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMarinerPlayerController*               K2Node_DynamicCast_AsMariner_Player_Controller;    // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield) == 0x000008, "Wrong alignment on ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield");
static_assert(sizeof(ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield) == 0x0000D8, "Wrong size on ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield");
static_assert(offsetof(ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield, EntryPoint) == 0x000000, "Member 'ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield, Temp_bool_Has_Been_Initd_Variable_1) == 0x000006, "Member 'ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield, Temp_bool_IsClosed_Variable_1) == 0x000007, "Member 'ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield, Temp_bool_Has_Been_Initd_Variable_2) == 0x000018, "Member 'ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield, K2Node_Event_MyGeometry) == 0x00001C, "Member 'ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield, K2Node_Event_InDeltaTime) == 0x000054, "Member 'ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000058, "Member 'ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield, K2Node_DynamicCast_AsMariner_Character) == 0x000060, "Member 'ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield::K2Node_DynamicCast_AsMariner_Character' has a wrong offset!");
static_assert(offsetof(ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute) == 0x000069, "Member 'ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue) == 0x00006C, "Member 'ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000070, "Member 'ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield, CallFunc_FTrunc_ReturnValue) == 0x000078, "Member 'ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield, K2Node_SwitchInteger_CmpSuccess) == 0x00007C, "Member 'ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield, CallFunc_PlayAnimation_ReturnValue) == 0x000080, "Member 'ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield, CallFunc_PlayAnimation_ReturnValue_1) == 0x000088, "Member 'ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield, CallFunc_PlayAnimation_ReturnValue_2) == 0x000090, "Member 'ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield, Temp_bool_IsClosed_Variable_2) == 0x000098, "Member 'ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield::Temp_bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield, CallFunc_PlayAnimation_ReturnValue_3) == 0x0000A0, "Member 'ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield, Temp_bool_Has_Been_Initd_Variable_3) == 0x0000A8, "Member 'ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield::Temp_bool_Has_Been_Initd_Variable_3' has a wrong offset!");
static_assert(offsetof(ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield, Temp_bool_IsClosed_Variable_3) == 0x0000A9, "Member 'ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield::Temp_bool_IsClosed_Variable_3' has a wrong offset!");
static_assert(offsetof(ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000B0, "Member 'ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield, K2Node_CustomEvent_PossessingController) == 0x0000B8, "Member 'ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield::K2Node_CustomEvent_PossessingController' has a wrong offset!");
static_assert(offsetof(ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield, K2Node_CustomEvent_PossessedPawn) == 0x0000C0, "Member 'ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield::K2Node_CustomEvent_PossessedPawn' has a wrong offset!");
static_assert(offsetof(ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield, K2Node_DynamicCast_AsMariner_Player_Controller) == 0x0000C8, "Member 'ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield::K2Node_DynamicCast_AsMariner_Player_Controller' has a wrong offset!");
static_assert(offsetof(ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield, K2Node_DynamicCast_bSuccess_1) == 0x0000D0, "Member 'ActiveItemSuperShield_C_ExecuteUbergraph_ActiveItemSuperShield::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function ActiveItemSuperShield.ActiveItemSuperShield_C.OnPossessPawn
// 0x0010 (0x0010 - 0x0000)
struct ActiveItemSuperShield_C_OnPossessPawn final
{
public:
	class AMarinerPlayerController*               PossessingController;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  PossessedPawn;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActiveItemSuperShield_C_OnPossessPawn) == 0x000008, "Wrong alignment on ActiveItemSuperShield_C_OnPossessPawn");
static_assert(sizeof(ActiveItemSuperShield_C_OnPossessPawn) == 0x000010, "Wrong size on ActiveItemSuperShield_C_OnPossessPawn");
static_assert(offsetof(ActiveItemSuperShield_C_OnPossessPawn, PossessingController) == 0x000000, "Member 'ActiveItemSuperShield_C_OnPossessPawn::PossessingController' has a wrong offset!");
static_assert(offsetof(ActiveItemSuperShield_C_OnPossessPawn, PossessedPawn) == 0x000008, "Member 'ActiveItemSuperShield_C_OnPossessPawn::PossessedPawn' has a wrong offset!");

// Function ActiveItemSuperShield.ActiveItemSuperShield_C.Tick
// 0x003C (0x003C - 0x0000)
struct ActiveItemSuperShield_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActiveItemSuperShield_C_Tick) == 0x000004, "Wrong alignment on ActiveItemSuperShield_C_Tick");
static_assert(sizeof(ActiveItemSuperShield_C_Tick) == 0x00003C, "Wrong size on ActiveItemSuperShield_C_Tick");
static_assert(offsetof(ActiveItemSuperShield_C_Tick, MyGeometry) == 0x000000, "Member 'ActiveItemSuperShield_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(ActiveItemSuperShield_C_Tick, InDeltaTime) == 0x000038, "Member 'ActiveItemSuperShield_C_Tick::InDeltaTime' has a wrong offset!");

// Function ActiveItemSuperShield.ActiveItemSuperShield_C.Get_HeldItem_Visibility_0
// 0x0001 (0x0001 - 0x0000)
struct ActiveItemSuperShield_C_Get_HeldItem_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActiveItemSuperShield_C_Get_HeldItem_Visibility_0) == 0x000001, "Wrong alignment on ActiveItemSuperShield_C_Get_HeldItem_Visibility_0");
static_assert(sizeof(ActiveItemSuperShield_C_Get_HeldItem_Visibility_0) == 0x000001, "Wrong size on ActiveItemSuperShield_C_Get_HeldItem_Visibility_0");
static_assert(offsetof(ActiveItemSuperShield_C_Get_HeldItem_Visibility_0, ReturnValue) == 0x000000, "Member 'ActiveItemSuperShield_C_Get_HeldItem_Visibility_0::ReturnValue' has a wrong offset!");

}

