#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActiveItemSuperShield

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActiveItemSuperShield.ActiveItemSuperShield_C
// 0x0068 (0x0298 - 0x0230)
class UActiveItemSuperShield_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShieldOut03;                                       // 0x0238(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShieldOut02;                                       // 0x0240(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShieldOut01;                                       // 0x0248(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShieldIn;                                          // 0x0250(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Shield01;                                          // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shield02;                                          // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shield03;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ShieldBase;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ESlateVisibility                              ItemVisibility;                                    // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerItemInteractionComponent*       ItemInteractionComponent;                          // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                AbilitySystemComponent;                            // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ShieldUsesRemaining;                               // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ActiveItemSuperShield(int32 EntryPoint);
	void WidgetAnimationEvt_ShieldOut01_K2Node_WidgetAnimationEvent_0();
	void OnPossessPawn(class AMarinerPlayerController* PossessingController, class APawn* PossessedPawn);
	void ZeroCharges();
	void OneCharge();
	void TwoCharges();
	void ShieldAdded();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	ESlateVisibility Get_HeldItem_Visibility_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActiveItemSuperShield_C">();
	}
	static class UActiveItemSuperShield_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActiveItemSuperShield_C>();
	}
};
static_assert(alignof(UActiveItemSuperShield_C) == 0x000008, "Wrong alignment on UActiveItemSuperShield_C");
static_assert(sizeof(UActiveItemSuperShield_C) == 0x000298, "Wrong size on UActiveItemSuperShield_C");
static_assert(offsetof(UActiveItemSuperShield_C, UberGraphFrame) == 0x000230, "Member 'UActiveItemSuperShield_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActiveItemSuperShield_C, ShieldOut03) == 0x000238, "Member 'UActiveItemSuperShield_C::ShieldOut03' has a wrong offset!");
static_assert(offsetof(UActiveItemSuperShield_C, ShieldOut02) == 0x000240, "Member 'UActiveItemSuperShield_C::ShieldOut02' has a wrong offset!");
static_assert(offsetof(UActiveItemSuperShield_C, ShieldOut01) == 0x000248, "Member 'UActiveItemSuperShield_C::ShieldOut01' has a wrong offset!");
static_assert(offsetof(UActiveItemSuperShield_C, ShieldIn) == 0x000250, "Member 'UActiveItemSuperShield_C::ShieldIn' has a wrong offset!");
static_assert(offsetof(UActiveItemSuperShield_C, Shield01) == 0x000258, "Member 'UActiveItemSuperShield_C::Shield01' has a wrong offset!");
static_assert(offsetof(UActiveItemSuperShield_C, Shield02) == 0x000260, "Member 'UActiveItemSuperShield_C::Shield02' has a wrong offset!");
static_assert(offsetof(UActiveItemSuperShield_C, Shield03) == 0x000268, "Member 'UActiveItemSuperShield_C::Shield03' has a wrong offset!");
static_assert(offsetof(UActiveItemSuperShield_C, ShieldBase) == 0x000270, "Member 'UActiveItemSuperShield_C::ShieldBase' has a wrong offset!");
static_assert(offsetof(UActiveItemSuperShield_C, ItemVisibility) == 0x000278, "Member 'UActiveItemSuperShield_C::ItemVisibility' has a wrong offset!");
static_assert(offsetof(UActiveItemSuperShield_C, ItemInteractionComponent) == 0x000280, "Member 'UActiveItemSuperShield_C::ItemInteractionComponent' has a wrong offset!");
static_assert(offsetof(UActiveItemSuperShield_C, AbilitySystemComponent) == 0x000288, "Member 'UActiveItemSuperShield_C::AbilitySystemComponent' has a wrong offset!");
static_assert(offsetof(UActiveItemSuperShield_C, ShieldUsesRemaining) == 0x000290, "Member 'UActiveItemSuperShield_C::ShieldUsesRemaining' has a wrong offset!");

}

