#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActorsDamagedByAOEListEntry

#include "Basic.hpp"


namespace SDK::Params
{

// Function ActorsDamagedByAOEListEntry.ActorsDamagedByAOEListEntry_C.OnActorsDamagedByAOEListEntryClicked__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct ActorsDamagedByAOEListEntry_C_OnActorsDamagedByAOEListEntryClicked__DelegateSignature final
{
public:
	class FText                                   Param_ActorName;                                   // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(ActorsDamagedByAOEListEntry_C_OnActorsDamagedByAOEListEntryClicked__DelegateSignature) == 0x000008, "Wrong alignment on ActorsDamagedByAOEListEntry_C_OnActorsDamagedByAOEListEntryClicked__DelegateSignature");
static_assert(sizeof(ActorsDamagedByAOEListEntry_C_OnActorsDamagedByAOEListEntryClicked__DelegateSignature) == 0x000018, "Wrong size on ActorsDamagedByAOEListEntry_C_OnActorsDamagedByAOEListEntryClicked__DelegateSignature");
static_assert(offsetof(ActorsDamagedByAOEListEntry_C_OnActorsDamagedByAOEListEntryClicked__DelegateSignature, Param_ActorName) == 0x000000, "Member 'ActorsDamagedByAOEListEntry_C_OnActorsDamagedByAOEListEntryClicked__DelegateSignature::Param_ActorName' has a wrong offset!");

// Function ActorsDamagedByAOEListEntry.ActorsDamagedByAOEListEntry_C.ExecuteUbergraph_ActorsDamagedByAOEListEntry
// 0x0020 (0x0020 - 0x0000)
struct ActorsDamagedByAOEListEntry_C_ExecuteUbergraph_ActorsDamagedByAOEListEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F22[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0008(0x0018)()
};
static_assert(alignof(ActorsDamagedByAOEListEntry_C_ExecuteUbergraph_ActorsDamagedByAOEListEntry) == 0x000008, "Wrong alignment on ActorsDamagedByAOEListEntry_C_ExecuteUbergraph_ActorsDamagedByAOEListEntry");
static_assert(sizeof(ActorsDamagedByAOEListEntry_C_ExecuteUbergraph_ActorsDamagedByAOEListEntry) == 0x000020, "Wrong size on ActorsDamagedByAOEListEntry_C_ExecuteUbergraph_ActorsDamagedByAOEListEntry");
static_assert(offsetof(ActorsDamagedByAOEListEntry_C_ExecuteUbergraph_ActorsDamagedByAOEListEntry, EntryPoint) == 0x000000, "Member 'ActorsDamagedByAOEListEntry_C_ExecuteUbergraph_ActorsDamagedByAOEListEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActorsDamagedByAOEListEntry_C_ExecuteUbergraph_ActorsDamagedByAOEListEntry, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'ActorsDamagedByAOEListEntry_C_ExecuteUbergraph_ActorsDamagedByAOEListEntry::CallFunc_GetText_ReturnValue' has a wrong offset!");

}

