#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActorsDamagedByAOEListEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActorsDamagedByAOEListEntry.ActorsDamagedByAOEListEntry_C
// 0x0028 (0x0258 - 0x0230)
class UActorsDamagedByAOEListEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             ActorName;                                         // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                SelectActorButton;                                 // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastInlineDelegateProperty_             OnActorsDamagedByAOEListEntryClicked;              // 0x0248(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnActorsDamagedByAOEListEntryClicked__DelegateSignature(const class FText& Param_ActorName);
	void ExecuteUbergraph_ActorsDamagedByAOEListEntry(int32 EntryPoint);
	void BndEvt__SelectActorButton_K2Node_ComponentBoundEvent_143_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActorsDamagedByAOEListEntry_C">();
	}
	static class UActorsDamagedByAOEListEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorsDamagedByAOEListEntry_C>();
	}
};
static_assert(alignof(UActorsDamagedByAOEListEntry_C) == 0x000008, "Wrong alignment on UActorsDamagedByAOEListEntry_C");
static_assert(sizeof(UActorsDamagedByAOEListEntry_C) == 0x000258, "Wrong size on UActorsDamagedByAOEListEntry_C");
static_assert(offsetof(UActorsDamagedByAOEListEntry_C, UberGraphFrame) == 0x000230, "Member 'UActorsDamagedByAOEListEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActorsDamagedByAOEListEntry_C, ActorName) == 0x000238, "Member 'UActorsDamagedByAOEListEntry_C::ActorName' has a wrong offset!");
static_assert(offsetof(UActorsDamagedByAOEListEntry_C, SelectActorButton) == 0x000240, "Member 'UActorsDamagedByAOEListEntry_C::SelectActorButton' has a wrong offset!");
static_assert(offsetof(UActorsDamagedByAOEListEntry_C, OnActorsDamagedByAOEListEntryClicked) == 0x000248, "Member 'UActorsDamagedByAOEListEntry_C::OnActorsDamagedByAOEListEntryClicked' has a wrong offset!");

}

