#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotify_CharacterAkEvent

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function AnimNotify_CharacterAkEvent.AnimNotify_CharacterAkEvent_C.Received_Notify
// 0x01A0 (0x01A0 - 0x0000)
struct AnimNotify_CharacterAkEvent_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          bComponentCreated;                                 // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           TargetComponent;                                   // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAkComponent_ComponentCreated;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_GetAkComponent_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_2;             // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAkComponent_ComponentCreated_1;        // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_GetAkComponent_ReturnValue_1;             // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UWorld*                                 CallFunc_GetWorldFromWorldContext_ReturnValue;     // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0110(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsGame_ReturnValue;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0138(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0158(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsEditor_ReturnValue;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAkComponent*>                   K2Node_MakeArray_Array;                            // 0x0170(0x0010)(ConstParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0188(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimNotify_CharacterAkEvent_C_Received_Notify) == 0x000008, "Wrong alignment on AnimNotify_CharacterAkEvent_C_Received_Notify");
static_assert(sizeof(AnimNotify_CharacterAkEvent_C_Received_Notify) == 0x0001A0, "Wrong size on AnimNotify_CharacterAkEvent_C_Received_Notify");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, MeshComp) == 0x000000, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, Animation) == 0x000008, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, ReturnValue) == 0x000010, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, bComponentCreated) == 0x000011, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::bComponentCreated' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, TargetComponent) == 0x000018, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::TargetComponent' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, CallFunc_GetAkComponent_ComponentCreated) == 0x000020, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::CallFunc_GetAkComponent_ComponentCreated' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, CallFunc_GetAkComponent_ReturnValue) == 0x000028, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::CallFunc_GetAkComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000038, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, CallFunc_GetDisplayName_ReturnValue) == 0x000040, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, CallFunc_Concat_StrStr_ReturnValue) == 0x000058, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000068, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, CallFunc_GetOwner_ReturnValue_1) == 0x000078, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, CallFunc_IsValid_ReturnValue_2) == 0x000080, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, CallFunc_GetDisplayName_ReturnValue_1) == 0x000088, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000098, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0000A8, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000B0, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, CallFunc_IsValid_ReturnValue_3) == 0x0000C0, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, CallFunc_GetDisplayName_ReturnValue_2) == 0x0000C8, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::CallFunc_GetDisplayName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000D8, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, CallFunc_GetAkComponent_ComponentCreated_1) == 0x0000E8, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::CallFunc_GetAkComponent_ComponentCreated_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, CallFunc_GetAkComponent_ReturnValue_1) == 0x0000F0, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::CallFunc_GetAkComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0000F8, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, CallFunc_GetWorldFromWorldContext_ReturnValue) == 0x000108, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::CallFunc_GetWorldFromWorldContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, Temp_delegate_Variable) == 0x000110, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, CallFunc_IsGame_ReturnValue) == 0x000120, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::CallFunc_IsGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, CallFunc_Conv_BoolToString_ReturnValue) == 0x000128, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, Temp_delegate_Variable_1) == 0x000138, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000148, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, Temp_struct_Variable) == 0x000158, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, CallFunc_IsEditor_ReturnValue) == 0x000168, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::CallFunc_IsEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, K2Node_MakeArray_Array) == 0x000170, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, CallFunc_Not_PreBool_ReturnValue) == 0x000180, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, CallFunc_IsValid_ReturnValue_4) == 0x000181, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, Temp_struct_Variable_1) == 0x000188, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, CallFunc_PostEvent_ReturnValue) == 0x000198, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_CharacterAkEvent_C_Received_Notify, CallFunc_PostAkEvent_ReturnValue) == 0x00019C, "Member 'AnimNotify_CharacterAkEvent_C_Received_Notify::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

}

