#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AOEDamageCandidatesListEntry

#include "Basic.hpp"


namespace SDK::Params
{

// Function AOEDamageCandidatesListEntry.AOEDamageCandidatesListEntry_C.OnAOEDamageCandidatesListEntryClicked__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct AOEDamageCandidatesListEntry_C_OnAOEDamageCandidatesListEntryClicked__DelegateSignature final
{
public:
	class FText                                   ActorName_0;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AOEDamageCandidatesListEntry_C_OnAOEDamageCandidatesListEntryClicked__DelegateSignature) == 0x000008, "Wrong alignment on AOEDamageCandidatesListEntry_C_OnAOEDamageCandidatesListEntryClicked__DelegateSignature");
static_assert(sizeof(AOEDamageCandidatesListEntry_C_OnAOEDamageCandidatesListEntryClicked__DelegateSignature) == 0x000018, "Wrong size on AOEDamageCandidatesListEntry_C_OnAOEDamageCandidatesListEntryClicked__DelegateSignature");
static_assert(offsetof(AOEDamageCandidatesListEntry_C_OnAOEDamageCandidatesListEntryClicked__DelegateSignature, ActorName_0) == 0x000000, "Member 'AOEDamageCandidatesListEntry_C_OnAOEDamageCandidatesListEntryClicked__DelegateSignature::ActorName_0' has a wrong offset!");

// Function AOEDamageCandidatesListEntry.AOEDamageCandidatesListEntry_C.ExecuteUbergraph_AOEDamageCandidatesListEntry
// 0x0020 (0x0020 - 0x0000)
struct AOEDamageCandidatesListEntry_C_ExecuteUbergraph_AOEDamageCandidatesListEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0008(0x0018)()
};
static_assert(alignof(AOEDamageCandidatesListEntry_C_ExecuteUbergraph_AOEDamageCandidatesListEntry) == 0x000008, "Wrong alignment on AOEDamageCandidatesListEntry_C_ExecuteUbergraph_AOEDamageCandidatesListEntry");
static_assert(sizeof(AOEDamageCandidatesListEntry_C_ExecuteUbergraph_AOEDamageCandidatesListEntry) == 0x000020, "Wrong size on AOEDamageCandidatesListEntry_C_ExecuteUbergraph_AOEDamageCandidatesListEntry");
static_assert(offsetof(AOEDamageCandidatesListEntry_C_ExecuteUbergraph_AOEDamageCandidatesListEntry, EntryPoint) == 0x000000, "Member 'AOEDamageCandidatesListEntry_C_ExecuteUbergraph_AOEDamageCandidatesListEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(AOEDamageCandidatesListEntry_C_ExecuteUbergraph_AOEDamageCandidatesListEntry, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'AOEDamageCandidatesListEntry_C_ExecuteUbergraph_AOEDamageCandidatesListEntry::CallFunc_GetText_ReturnValue' has a wrong offset!");

}

