#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AOEDamageDebugRecordDisplay

#include "Basic.hpp"

#include "Mariner_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AOEDamageDebugRecordDisplay.AOEDamageDebugRecordDisplay_C.ExecuteUbergraph_AOEDamageDebugRecordDisplay
// 0x0048 (0x0048 - 0x0000)
struct AOEDamageDebugRecordDisplay_C_ExecuteUbergraph_AOEDamageDebugRecordDisplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F27[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0010(0x0018)()
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x0030(0x0018)()
};
static_assert(alignof(AOEDamageDebugRecordDisplay_C_ExecuteUbergraph_AOEDamageDebugRecordDisplay) == 0x000008, "Wrong alignment on AOEDamageDebugRecordDisplay_C_ExecuteUbergraph_AOEDamageDebugRecordDisplay");
static_assert(sizeof(AOEDamageDebugRecordDisplay_C_ExecuteUbergraph_AOEDamageDebugRecordDisplay) == 0x000048, "Wrong size on AOEDamageDebugRecordDisplay_C_ExecuteUbergraph_AOEDamageDebugRecordDisplay");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_ExecuteUbergraph_AOEDamageDebugRecordDisplay, EntryPoint) == 0x000000, "Member 'AOEDamageDebugRecordDisplay_C_ExecuteUbergraph_AOEDamageDebugRecordDisplay::EntryPoint' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_ExecuteUbergraph_AOEDamageDebugRecordDisplay, CallFunc_MakeLiteralName_ReturnValue) == 0x000004, "Member 'AOEDamageDebugRecordDisplay_C_ExecuteUbergraph_AOEDamageDebugRecordDisplay::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_ExecuteUbergraph_AOEDamageDebugRecordDisplay, CallFunc_Conv_NameToText_ReturnValue) == 0x000010, "Member 'AOEDamageDebugRecordDisplay_C_ExecuteUbergraph_AOEDamageDebugRecordDisplay::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_ExecuteUbergraph_AOEDamageDebugRecordDisplay, CallFunc_MakeLiteralName_ReturnValue_1) == 0x000028, "Member 'AOEDamageDebugRecordDisplay_C_ExecuteUbergraph_AOEDamageDebugRecordDisplay::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_ExecuteUbergraph_AOEDamageDebugRecordDisplay, CallFunc_Conv_NameToText_ReturnValue_1) == 0x000030, "Member 'AOEDamageDebugRecordDisplay_C_ExecuteUbergraph_AOEDamageDebugRecordDisplay::CallFunc_Conv_NameToText_ReturnValue_1' has a wrong offset!");

// Function AOEDamageDebugRecordDisplay.AOEDamageDebugRecordDisplay_C.CreateNewDamageDebugRecordField
// 0x0048 (0x0048 - 0x0000)
struct AOEDamageDebugRecordDisplay_C_CreateNewDamageDebugRecordField final
{
public:
	class FText                                   FieldName;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   FieldValue;                                        // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UDamageDebugRecordField_C*              CreatedField;                                      // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageDebugRecordField_C*              CallFunc_Create_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AOEDamageDebugRecordDisplay_C_CreateNewDamageDebugRecordField) == 0x000008, "Wrong alignment on AOEDamageDebugRecordDisplay_C_CreateNewDamageDebugRecordField");
static_assert(sizeof(AOEDamageDebugRecordDisplay_C_CreateNewDamageDebugRecordField) == 0x000048, "Wrong size on AOEDamageDebugRecordDisplay_C_CreateNewDamageDebugRecordField");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_CreateNewDamageDebugRecordField, FieldName) == 0x000000, "Member 'AOEDamageDebugRecordDisplay_C_CreateNewDamageDebugRecordField::FieldName' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_CreateNewDamageDebugRecordField, FieldValue) == 0x000018, "Member 'AOEDamageDebugRecordDisplay_C_CreateNewDamageDebugRecordField::FieldValue' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_CreateNewDamageDebugRecordField, CreatedField) == 0x000030, "Member 'AOEDamageDebugRecordDisplay_C_CreateNewDamageDebugRecordField::CreatedField' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_CreateNewDamageDebugRecordField, CallFunc_GetOwningPlayer_ReturnValue) == 0x000038, "Member 'AOEDamageDebugRecordDisplay_C_CreateNewDamageDebugRecordField::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_CreateNewDamageDebugRecordField, CallFunc_Create_ReturnValue) == 0x000040, "Member 'AOEDamageDebugRecordDisplay_C_CreateNewDamageDebugRecordField::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function AOEDamageDebugRecordDisplay.AOEDamageDebugRecordDisplay_C.PopulateFromAOEDamageDebugRecord
// 0x0418 (0x0418 - 0x0000)
struct AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord final
{
public:
	class UMarinerAOEDamageDebugRecord*           DamageRecord;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0008(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_1;           // 0x0020(0x0018)()
	class UDamageDebugRecordField_C*              CallFunc_CreateNewDamageDebugRecordField_CreatedField; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0040)(HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_2;           // 0x0088(0x0018)()
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x00A0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00B8(0x0040)(HasGetValueTypeHash)
	class UDamageDebugRecordField_C*              CallFunc_CreateNewDamageDebugRecordField_CreatedField_1; // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0100(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0110(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_3;           // 0x0128(0x0018)()
	class UDamageDebugRecordField_C*              CallFunc_CreateNewDamageDebugRecordField_CreatedField_2; // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageDebugRecordField_C*              CallFunc_CreateNewDamageDebugRecordField_CreatedField_3; // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_4;           // 0x0150(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_5;           // 0x0168(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0180(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x01C0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0200(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_6;           // 0x0210(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0228(0x0018)()
	class UDamageDebugRecordField_C*              CallFunc_CreateNewDamageDebugRecordField_CreatedField_4; // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageDebugRecordField_C*              CallFunc_CreateNewDamageDebugRecordField_CreatedField_5; // 0x0248(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x0250(0x0018)()
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_2;            // 0x0268(0x0018)()
	class UDamageDebugRecordField_C*              CallFunc_CreateNewDamageDebugRecordField_CreatedField_6; // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageDebugRecordField_C*              CallFunc_CreateNewDamageDebugRecordField_CreatedField_7; // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDamageCandidateActorNames_ReturnValue; // 0x0290(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_3;            // 0x02A0(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F28[0x4];                                     // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDamageDebugRecordField_C*              CallFunc_CreateNewDamageDebugRecordField_CreatedField_8; // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDamagedActorNames_ReturnValue;         // 0x02C8(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F29[0x4];                                     // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetShortDescription_ReturnValue;          // 0x02E0(0x0018)()
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_1;      // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FText ActorName)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0300(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2A[0x4];                                     // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAOEDamageCandidatesListEntry_C*        CallFunc_Create_ReturnValue;                       // 0x0328(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_4;            // 0x0330(0x0018)()
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0348(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F2B[0x3];                                     // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x035C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FText ActorName)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0364(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1F2C[0x4];                                     // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_5;            // 0x0378(0x0018)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActorsDamagedByAOEListEntry_C*         CallFunc_Create_ReturnValue_1;                     // 0x0398(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x03A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F2D[0x3];                                     // 0x03AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2E[0x4];                                     // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_2;      // 0x03B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_3;      // 0x03C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_4;      // 0x03C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2F[0x4];                                     // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_5;      // 0x03D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_6;            // 0x03E8(0x0018)()
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_6;      // 0x0400(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_7;      // 0x0408(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_8;      // 0x0410(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord) == 0x000008, "Wrong alignment on AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord");
static_assert(sizeof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord) == 0x000418, "Wrong size on AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, DamageRecord) == 0x000000, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::DamageRecord' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_Conv_FloatToText_ReturnValue) == 0x000008, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_Conv_FloatToText_ReturnValue_1) == 0x000020, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_Conv_FloatToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_CreateNewDamageDebugRecordField_CreatedField) == 0x000038, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_CreateNewDamageDebugRecordField_CreatedField' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000080, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_Conv_FloatToText_ReturnValue_2) == 0x000088, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_Conv_FloatToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_Conv_NameToText_ReturnValue) == 0x0000A0, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000B8, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_CreateNewDamageDebugRecordField_CreatedField_1) == 0x0000F8, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_CreateNewDamageDebugRecordField_CreatedField_1' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, K2Node_MakeArray_Array) == 0x000100, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_Format_ReturnValue) == 0x000110, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_Conv_FloatToText_ReturnValue_3) == 0x000128, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_Conv_FloatToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_CreateNewDamageDebugRecordField_CreatedField_2) == 0x000140, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_CreateNewDamageDebugRecordField_CreatedField_2' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_CreateNewDamageDebugRecordField_CreatedField_3) == 0x000148, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_CreateNewDamageDebugRecordField_CreatedField_3' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_Conv_FloatToText_ReturnValue_4) == 0x000150, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_Conv_FloatToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_Conv_FloatToText_ReturnValue_5) == 0x000168, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_Conv_FloatToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, K2Node_MakeStruct_FormatArgumentData_2) == 0x000180, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, K2Node_MakeStruct_FormatArgumentData_3) == 0x0001C0, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, K2Node_MakeArray_Array_1) == 0x000200, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_Conv_FloatToText_ReturnValue_6) == 0x000210, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_Conv_FloatToText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_Format_ReturnValue_1) == 0x000228, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_CreateNewDamageDebugRecordField_CreatedField_4) == 0x000240, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_CreateNewDamageDebugRecordField_CreatedField_4' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_CreateNewDamageDebugRecordField_CreatedField_5) == 0x000248, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_CreateNewDamageDebugRecordField_CreatedField_5' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_Conv_NameToText_ReturnValue_1) == 0x000250, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_Conv_NameToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_Conv_NameToText_ReturnValue_2) == 0x000268, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_Conv_NameToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_CreateNewDamageDebugRecordField_CreatedField_6) == 0x000280, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_CreateNewDamageDebugRecordField_CreatedField_6' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_CreateNewDamageDebugRecordField_CreatedField_7) == 0x000288, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_CreateNewDamageDebugRecordField_CreatedField_7' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_GetDamageCandidateActorNames_ReturnValue) == 0x000290, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_GetDamageCandidateActorNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_Conv_NameToText_ReturnValue_3) == 0x0002A0, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_Conv_NameToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_Array_Length_ReturnValue) == 0x0002B8, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_CreateNewDamageDebugRecordField_CreatedField_8) == 0x0002C0, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_CreateNewDamageDebugRecordField_CreatedField_8' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_GetDamagedActorNames_ReturnValue) == 0x0002C8, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_GetDamagedActorNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_Array_Length_ReturnValue_1) == 0x0002D8, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_GetShortDescription_ReturnValue) == 0x0002E0, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_GetShortDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_AddChildToVerticalBox_ReturnValue_1) == 0x0002F8, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_AddChildToVerticalBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, K2Node_CreateDelegate_OutputDelegate) == 0x000300, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, Temp_int_Array_Index_Variable) == 0x000310, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_GetOwningPlayer_ReturnValue) == 0x000318, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_Array_Get_Item) == 0x000320, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_Create_ReturnValue) == 0x000328, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_Conv_NameToText_ReturnValue_4) == 0x000330, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_Conv_NameToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_AddChild_ReturnValue) == 0x000348, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, Temp_int_Loop_Counter_Variable) == 0x000350, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_Less_IntInt_ReturnValue) == 0x000354, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_Add_IntInt_ReturnValue) == 0x000358, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_MakeLiteralName_ReturnValue) == 0x00035C, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, K2Node_CreateDelegate_OutputDelegate_1) == 0x000364, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_Conv_NameToText_ReturnValue_5) == 0x000378, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_Conv_NameToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000390, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_Create_ReturnValue_1) == 0x000398, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_AddChild_ReturnValue_1) == 0x0003A0, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, Temp_int_Loop_Counter_Variable_1) == 0x0003A8, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_Less_IntInt_ReturnValue_1) == 0x0003AC, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_Add_IntInt_ReturnValue_1) == 0x0003B0, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_AddChildToVerticalBox_ReturnValue_2) == 0x0003B8, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_AddChildToVerticalBox_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_AddChildToVerticalBox_ReturnValue_3) == 0x0003C0, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_AddChildToVerticalBox_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_AddChildToVerticalBox_ReturnValue_4) == 0x0003C8, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_AddChildToVerticalBox_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, Temp_int_Array_Index_Variable_1) == 0x0003D0, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_AddChildToVerticalBox_ReturnValue_5) == 0x0003D8, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_AddChildToVerticalBox_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_Array_Get_Item_1) == 0x0003E0, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_Conv_NameToText_ReturnValue_6) == 0x0003E8, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_Conv_NameToText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_AddChildToVerticalBox_ReturnValue_6) == 0x000400, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_AddChildToVerticalBox_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_AddChildToVerticalBox_ReturnValue_7) == 0x000408, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_AddChildToVerticalBox_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord, CallFunc_AddChildToVerticalBox_ReturnValue_8) == 0x000410, "Member 'AOEDamageDebugRecordDisplay_C_PopulateFromAOEDamageDebugRecord::CallFunc_AddChildToVerticalBox_ReturnValue_8' has a wrong offset!");

// Function AOEDamageDebugRecordDisplay.AOEDamageDebugRecordDisplay_C.SelectActorDamagedByAOE
// 0x0158 (0x0158 - 0x0000)
struct AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE final
{
public:
	class FText                                   ActorName;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0030(0x0018)()
	class UDamageDebugRecordField_C*              CallFunc_CreateNewDamageDebugRecordField_CreatedField; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F30[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0060(0x0018)()
	class UDamageDebugRecordField_C*              CallFunc_CreateNewDamageDebugRecordField_CreatedField_1; // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMarinerActorDamagedDebugRecord        CallFunc_GetDamageDebugRecordForActorDamaged_ReturnValue; // 0x0080(0x0040)(NoDestructor)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_1;      // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F31[0x4];                                     // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_1;           // 0x00D8(0x0018)()
	float                                         CallFunc_VSize_ReturnValue;                        // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F32[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDamageDebugRecordField_C*              CallFunc_CreateNewDamageDebugRecordField_CreatedField_2; // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_2;           // 0x0100(0x0018)()
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_2;      // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageDebugRecordField_C*              CallFunc_CreateNewDamageDebugRecordField_CreatedField_3; // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_3;           // 0x0128(0x0018)()
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_3;      // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageDebugRecordField_C*              CallFunc_CreateNewDamageDebugRecordField_CreatedField_4; // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_4;      // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE) == 0x000008, "Wrong alignment on AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE");
static_assert(sizeof(AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE) == 0x000158, "Wrong size on AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE, ActorName) == 0x000000, "Member 'AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE::ActorName' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE, CallFunc_Conv_TextToString_ReturnValue) == 0x000018, "Member 'AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE, CallFunc_Conv_StringToName_ReturnValue) == 0x000028, "Member 'AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE, CallFunc_Conv_FloatToText_ReturnValue) == 0x000030, "Member 'AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE, CallFunc_CreateNewDamageDebugRecordField_CreatedField) == 0x000048, "Member 'AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE::CallFunc_CreateNewDamageDebugRecordField_CreatedField' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000050, "Member 'AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE, CallFunc_NotEqual_NameName_ReturnValue) == 0x000058, "Member 'AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE, CallFunc_Conv_NameToText_ReturnValue) == 0x000060, "Member 'AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE, CallFunc_CreateNewDamageDebugRecordField_CreatedField_1) == 0x000078, "Member 'AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE::CallFunc_CreateNewDamageDebugRecordField_CreatedField_1' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE, CallFunc_GetDamageDebugRecordForActorDamaged_ReturnValue) == 0x000080, "Member 'AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE::CallFunc_GetDamageDebugRecordForActorDamaged_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE, CallFunc_AddChildToVerticalBox_ReturnValue_1) == 0x0000C0, "Member 'AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE::CallFunc_AddChildToVerticalBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000C8, "Member 'AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE, CallFunc_Conv_FloatToText_ReturnValue_1) == 0x0000D8, "Member 'AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE::CallFunc_Conv_FloatToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE, CallFunc_VSize_ReturnValue) == 0x0000F0, "Member 'AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE, CallFunc_CreateNewDamageDebugRecordField_CreatedField_2) == 0x0000F8, "Member 'AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE::CallFunc_CreateNewDamageDebugRecordField_CreatedField_2' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE, CallFunc_Conv_FloatToText_ReturnValue_2) == 0x000100, "Member 'AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE::CallFunc_Conv_FloatToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE, CallFunc_AddChildToVerticalBox_ReturnValue_2) == 0x000118, "Member 'AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE::CallFunc_AddChildToVerticalBox_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE, CallFunc_CreateNewDamageDebugRecordField_CreatedField_3) == 0x000120, "Member 'AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE::CallFunc_CreateNewDamageDebugRecordField_CreatedField_3' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE, CallFunc_Conv_FloatToText_ReturnValue_3) == 0x000128, "Member 'AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE::CallFunc_Conv_FloatToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE, CallFunc_AddChildToVerticalBox_ReturnValue_3) == 0x000140, "Member 'AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE::CallFunc_AddChildToVerticalBox_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE, CallFunc_CreateNewDamageDebugRecordField_CreatedField_4) == 0x000148, "Member 'AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE::CallFunc_CreateNewDamageDebugRecordField_CreatedField_4' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE, CallFunc_AddChildToVerticalBox_ReturnValue_4) == 0x000150, "Member 'AOEDamageDebugRecordDisplay_C_SelectActorDamagedByAOE::CallFunc_AddChildToVerticalBox_ReturnValue_4' has a wrong offset!");

// Function AOEDamageDebugRecordDisplay.AOEDamageDebugRecordDisplay_C.SelectDamageCandidateActor
// 0x0030 (0x0030 - 0x0000)
struct AOEDamageDebugRecordDisplay_C_SelectDamageCandidateActor final
{
public:
	class FText                                   ActorName;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AOEDamageDebugRecordDisplay_C_SelectDamageCandidateActor) == 0x000008, "Wrong alignment on AOEDamageDebugRecordDisplay_C_SelectDamageCandidateActor");
static_assert(sizeof(AOEDamageDebugRecordDisplay_C_SelectDamageCandidateActor) == 0x000030, "Wrong size on AOEDamageDebugRecordDisplay_C_SelectDamageCandidateActor");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_SelectDamageCandidateActor, ActorName) == 0x000000, "Member 'AOEDamageDebugRecordDisplay_C_SelectDamageCandidateActor::ActorName' has a wrong offset!");
static_assert(offsetof(AOEDamageDebugRecordDisplay_C_SelectDamageCandidateActor, CallFunc_Conv_TextToString_ReturnValue) == 0x000018, "Member 'AOEDamageDebugRecordDisplay_C_SelectDamageCandidateActor::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
