#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArrowWidget

#include "Basic.hpp"

#include "Mariner_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ArrowWidget.ArrowWidget_C.PopulateArrow
// 0x00B8 (0x00B8 - 0x0000)
struct ArrowWidget_C_PopulateArrow final
{
public:
	class AMarinerCharacter*                      Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMarinerHostility                             Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTeamIndex_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMarinerHostility                             CallFunc_TryAndGetHostilityRelativeToLocalPlayer_ReturnValue; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMarinerHostility                             Temp_byte_Variable_1;                              // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_6;                            // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_7;                            // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArrowWidget_C_PopulateArrow) == 0x000008, "Wrong alignment on ArrowWidget_C_PopulateArrow");
static_assert(sizeof(ArrowWidget_C_PopulateArrow) == 0x0000B8, "Wrong size on ArrowWidget_C_PopulateArrow");
static_assert(offsetof(ArrowWidget_C_PopulateArrow, Character) == 0x000000, "Member 'ArrowWidget_C_PopulateArrow::Character' has a wrong offset!");
static_assert(offsetof(ArrowWidget_C_PopulateArrow, Temp_byte_Variable) == 0x000008, "Member 'ArrowWidget_C_PopulateArrow::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ArrowWidget_C_PopulateArrow, CallFunc_GetTeamIndex_ReturnValue) == 0x00000C, "Member 'ArrowWidget_C_PopulateArrow::CallFunc_GetTeamIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArrowWidget_C_PopulateArrow, Temp_struct_Variable) == 0x000010, "Member 'ArrowWidget_C_PopulateArrow::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(ArrowWidget_C_PopulateArrow, CallFunc_TryAndGetHostilityRelativeToLocalPlayer_ReturnValue) == 0x000020, "Member 'ArrowWidget_C_PopulateArrow::CallFunc_TryAndGetHostilityRelativeToLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArrowWidget_C_PopulateArrow, Temp_struct_Variable_1) == 0x000024, "Member 'ArrowWidget_C_PopulateArrow::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(ArrowWidget_C_PopulateArrow, Temp_struct_Variable_2) == 0x000034, "Member 'ArrowWidget_C_PopulateArrow::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(ArrowWidget_C_PopulateArrow, Temp_struct_Variable_3) == 0x000044, "Member 'ArrowWidget_C_PopulateArrow::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(ArrowWidget_C_PopulateArrow, Temp_byte_Variable_1) == 0x000054, "Member 'ArrowWidget_C_PopulateArrow::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ArrowWidget_C_PopulateArrow, K2Node_Select_Default) == 0x000058, "Member 'ArrowWidget_C_PopulateArrow::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ArrowWidget_C_PopulateArrow, Temp_struct_Variable_4) == 0x000068, "Member 'ArrowWidget_C_PopulateArrow::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(ArrowWidget_C_PopulateArrow, Temp_struct_Variable_5) == 0x000078, "Member 'ArrowWidget_C_PopulateArrow::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(ArrowWidget_C_PopulateArrow, Temp_struct_Variable_6) == 0x000088, "Member 'ArrowWidget_C_PopulateArrow::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(ArrowWidget_C_PopulateArrow, Temp_struct_Variable_7) == 0x000098, "Member 'ArrowWidget_C_PopulateArrow::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(ArrowWidget_C_PopulateArrow, K2Node_Select_Default_1) == 0x0000A8, "Member 'ArrowWidget_C_PopulateArrow::K2Node_Select_Default_1' has a wrong offset!");

}

