#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArtifactDetails

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ArtifactDetails.ArtifactDetails_C
// 0x0018 (0x0310 - 0x02F8)
class UArtifactDetails_C final : public UMarinerArtifactDetailsWidget
{
public:
	class UImage*                                 Image_84;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_248;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OpacityBacker;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ArtifactDetails_C">();
	}
	static class UArtifactDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArtifactDetails_C>();
	}
};
static_assert(alignof(UArtifactDetails_C) == 0x000008, "Wrong alignment on UArtifactDetails_C");
static_assert(sizeof(UArtifactDetails_C) == 0x000310, "Wrong size on UArtifactDetails_C");
static_assert(offsetof(UArtifactDetails_C, Image_84) == 0x0002F8, "Member 'UArtifactDetails_C::Image_84' has a wrong offset!");
static_assert(offsetof(UArtifactDetails_C, Image_248) == 0x000300, "Member 'UArtifactDetails_C::Image_248' has a wrong offset!");
static_assert(offsetof(UArtifactDetails_C, OpacityBacker) == 0x000308, "Member 'UArtifactDetails_C::OpacityBacker' has a wrong offset!");

}

