#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArtifactsSubMenuButton

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ArtifactsSubMenuButton.ArtifactsSubMenuButton_C
// 0x0050 (0x3020 - 0x2FD0)
class UArtifactsSubMenuButton_C final : public UMarinerArtifactsSubMenuButton
{
public:
	class UWidgetAnimation*                       HoverAnim;                                         // 0x2FD0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ArtifactTypeNamebacker;                            // 0x2FD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x2FE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Border;                                            // 0x2FE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x2FF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Divider;                                           // 0x2FF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x3000(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Material;                                          // 0x3008(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OpacityBacker;                                     // 0x3010(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnviewedItemWidget_C*                  UnviewedWidget;                                    // 0x3018(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FMarinerLayeredButtonAssets GetAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ArtifactsSubMenuButton_C">();
	}
	static class UArtifactsSubMenuButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArtifactsSubMenuButton_C>();
	}
};
static_assert(alignof(UArtifactsSubMenuButton_C) == 0x000008, "Wrong alignment on UArtifactsSubMenuButton_C");
static_assert(sizeof(UArtifactsSubMenuButton_C) == 0x003020, "Wrong size on UArtifactsSubMenuButton_C");
static_assert(offsetof(UArtifactsSubMenuButton_C, HoverAnim) == 0x002FD0, "Member 'UArtifactsSubMenuButton_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UArtifactsSubMenuButton_C, ArtifactTypeNamebacker) == 0x002FD8, "Member 'UArtifactsSubMenuButton_C::ArtifactTypeNamebacker' has a wrong offset!");
static_assert(offsetof(UArtifactsSubMenuButton_C, Background) == 0x002FE0, "Member 'UArtifactsSubMenuButton_C::Background' has a wrong offset!");
static_assert(offsetof(UArtifactsSubMenuButton_C, Border) == 0x002FE8, "Member 'UArtifactsSubMenuButton_C::Border' has a wrong offset!");
static_assert(offsetof(UArtifactsSubMenuButton_C, Button) == 0x002FF0, "Member 'UArtifactsSubMenuButton_C::Button' has a wrong offset!");
static_assert(offsetof(UArtifactsSubMenuButton_C, Divider) == 0x002FF8, "Member 'UArtifactsSubMenuButton_C::Divider' has a wrong offset!");
static_assert(offsetof(UArtifactsSubMenuButton_C, InvalidationBox_0) == 0x003000, "Member 'UArtifactsSubMenuButton_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UArtifactsSubMenuButton_C, Material) == 0x003008, "Member 'UArtifactsSubMenuButton_C::Material' has a wrong offset!");
static_assert(offsetof(UArtifactsSubMenuButton_C, OpacityBacker) == 0x003010, "Member 'UArtifactsSubMenuButton_C::OpacityBacker' has a wrong offset!");
static_assert(offsetof(UArtifactsSubMenuButton_C, UnviewedWidget) == 0x003018, "Member 'UArtifactsSubMenuButton_C::UnviewedWidget' has a wrong offset!");

}

