#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArtifactProgressBar

#include "Basic.hpp"

#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function ArtifactProgressBar.ArtifactProgressBar_C.ExecuteUbergraph_ArtifactProgressBar
// 0x0028 (0x0028 - 0x0000)
struct ArtifactProgressBar_C_ExecuteUbergraph_ArtifactProgressBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInit;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_CurrentLevel;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_CurrentLevelPercent;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
};
static_assert(alignof(ArtifactProgressBar_C_ExecuteUbergraph_ArtifactProgressBar) == 0x000008, "Wrong alignment on ArtifactProgressBar_C_ExecuteUbergraph_ArtifactProgressBar");
static_assert(sizeof(ArtifactProgressBar_C_ExecuteUbergraph_ArtifactProgressBar) == 0x000028, "Wrong size on ArtifactProgressBar_C_ExecuteUbergraph_ArtifactProgressBar");
static_assert(offsetof(ArtifactProgressBar_C_ExecuteUbergraph_ArtifactProgressBar, EntryPoint) == 0x000000, "Member 'ArtifactProgressBar_C_ExecuteUbergraph_ArtifactProgressBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(ArtifactProgressBar_C_ExecuteUbergraph_ArtifactProgressBar, K2Node_Event_bIsInit) == 0x000004, "Member 'ArtifactProgressBar_C_ExecuteUbergraph_ArtifactProgressBar::K2Node_Event_bIsInit' has a wrong offset!");
static_assert(offsetof(ArtifactProgressBar_C_ExecuteUbergraph_ArtifactProgressBar, K2Node_Event_CurrentLevel) == 0x000008, "Member 'ArtifactProgressBar_C_ExecuteUbergraph_ArtifactProgressBar::K2Node_Event_CurrentLevel' has a wrong offset!");
static_assert(offsetof(ArtifactProgressBar_C_ExecuteUbergraph_ArtifactProgressBar, K2Node_Event_CurrentLevelPercent) == 0x00000C, "Member 'ArtifactProgressBar_C_ExecuteUbergraph_ArtifactProgressBar::K2Node_Event_CurrentLevelPercent' has a wrong offset!");
static_assert(offsetof(ArtifactProgressBar_C_ExecuteUbergraph_ArtifactProgressBar, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'ArtifactProgressBar_C_ExecuteUbergraph_ArtifactProgressBar::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function ArtifactProgressBar.ArtifactProgressBar_C.BPOnLevelSet
// 0x000C (0x000C - 0x0000)
struct ArtifactProgressBar_C_BPOnLevelSet final
{
public:
	bool                                          bIsInit;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentLevel;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentLevelPercent;                               // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArtifactProgressBar_C_BPOnLevelSet) == 0x000004, "Wrong alignment on ArtifactProgressBar_C_BPOnLevelSet");
static_assert(sizeof(ArtifactProgressBar_C_BPOnLevelSet) == 0x00000C, "Wrong size on ArtifactProgressBar_C_BPOnLevelSet");
static_assert(offsetof(ArtifactProgressBar_C_BPOnLevelSet, bIsInit) == 0x000000, "Member 'ArtifactProgressBar_C_BPOnLevelSet::bIsInit' has a wrong offset!");
static_assert(offsetof(ArtifactProgressBar_C_BPOnLevelSet, CurrentLevel) == 0x000004, "Member 'ArtifactProgressBar_C_BPOnLevelSet::CurrentLevel' has a wrong offset!");
static_assert(offsetof(ArtifactProgressBar_C_BPOnLevelSet, CurrentLevelPercent) == 0x000008, "Member 'ArtifactProgressBar_C_BPOnLevelSet::CurrentLevelPercent' has a wrong offset!");

// Function ArtifactProgressBar.ArtifactProgressBar_C.GetAnimations
// 0x0030 (0x0030 - 0x0000)
struct ArtifactProgressBar_C_GetAnimations final
{
public:
	struct FMarinerAnimatedProgressWidgetAnimations ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FMarinerAnimatedProgressWidgetAnimations K2Node_MakeStruct_MarinerAnimatedProgressWidgetAnimations; // 0x0018(0x0018)(NoDestructor)
};
static_assert(alignof(ArtifactProgressBar_C_GetAnimations) == 0x000008, "Wrong alignment on ArtifactProgressBar_C_GetAnimations");
static_assert(sizeof(ArtifactProgressBar_C_GetAnimations) == 0x000030, "Wrong size on ArtifactProgressBar_C_GetAnimations");
static_assert(offsetof(ArtifactProgressBar_C_GetAnimations, ReturnValue) == 0x000000, "Member 'ArtifactProgressBar_C_GetAnimations::ReturnValue' has a wrong offset!");
static_assert(offsetof(ArtifactProgressBar_C_GetAnimations, K2Node_MakeStruct_MarinerAnimatedProgressWidgetAnimations) == 0x000018, "Member 'ArtifactProgressBar_C_GetAnimations::K2Node_MakeStruct_MarinerAnimatedProgressWidgetAnimations' has a wrong offset!");

}

