#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArtifactProgressionPreview

#include "Basic.hpp"

#include "Mariner_structs.hpp"
#include "MangoClient_structs.hpp"


namespace SDK::Params
{

// Function ArtifactProgressionPreview.ArtifactProgressionPreview_C.ExecuteUbergraph_ArtifactProgressionPreview
// 0x02F0 (0x02F0 - 0x0000)
struct ArtifactProgressionPreview_C_ExecuteUbergraph_ArtifactProgressionPreview final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B8A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoPlayerManager*                    CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMangoProfile                          CallFunc_GetMangoProfile_ReturnValue;              // 0x0010(0x02E0)(ConstParm)
};
static_assert(alignof(ArtifactProgressionPreview_C_ExecuteUbergraph_ArtifactProgressionPreview) == 0x000008, "Wrong alignment on ArtifactProgressionPreview_C_ExecuteUbergraph_ArtifactProgressionPreview");
static_assert(sizeof(ArtifactProgressionPreview_C_ExecuteUbergraph_ArtifactProgressionPreview) == 0x0002F0, "Wrong size on ArtifactProgressionPreview_C_ExecuteUbergraph_ArtifactProgressionPreview");
static_assert(offsetof(ArtifactProgressionPreview_C_ExecuteUbergraph_ArtifactProgressionPreview, EntryPoint) == 0x000000, "Member 'ArtifactProgressionPreview_C_ExecuteUbergraph_ArtifactProgressionPreview::EntryPoint' has a wrong offset!");
static_assert(offsetof(ArtifactProgressionPreview_C_ExecuteUbergraph_ArtifactProgressionPreview, CallFunc_Get_ReturnValue) == 0x000008, "Member 'ArtifactProgressionPreview_C_ExecuteUbergraph_ArtifactProgressionPreview::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArtifactProgressionPreview_C_ExecuteUbergraph_ArtifactProgressionPreview, CallFunc_GetMangoProfile_ReturnValue) == 0x000010, "Member 'ArtifactProgressionPreview_C_ExecuteUbergraph_ArtifactProgressionPreview::CallFunc_GetMangoProfile_ReturnValue' has a wrong offset!");

// Function ArtifactProgressionPreview.ArtifactProgressionPreview_C.GetAssets
// 0x00D0 (0x00D0 - 0x0000)
struct ArtifactProgressionPreview_C_GetAssets final
{
public:
	struct FMarinerLayeredButtonAssets            ReturnValue;                                       // 0x0000(0x0068)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference)
	struct FMarinerLayeredButtonAssets            K2Node_MakeStruct_MarinerLayeredButtonAssets;      // 0x0068(0x0068)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(ArtifactProgressionPreview_C_GetAssets) == 0x000008, "Wrong alignment on ArtifactProgressionPreview_C_GetAssets");
static_assert(sizeof(ArtifactProgressionPreview_C_GetAssets) == 0x0000D0, "Wrong size on ArtifactProgressionPreview_C_GetAssets");
static_assert(offsetof(ArtifactProgressionPreview_C_GetAssets, ReturnValue) == 0x000000, "Member 'ArtifactProgressionPreview_C_GetAssets::ReturnValue' has a wrong offset!");
static_assert(offsetof(ArtifactProgressionPreview_C_GetAssets, K2Node_MakeStruct_MarinerLayeredButtonAssets) == 0x000068, "Member 'ArtifactProgressionPreview_C_GetAssets::K2Node_MakeStruct_MarinerLayeredButtonAssets' has a wrong offset!");

}

