#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArtifactInfoSmallWidget

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ArtifactInfoSmallWidget.ArtifactInfoSmallWidget_C
// 0x0050 (0x3338 - 0x32E8)
class UArtifactInfoSmallWidget_C final : public UMarinerArtifactInfoSmallWidget
{
public:
	class UWidgetAnimation*                       ExpandAnimation;                                   // 0x32E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x32F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x32F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Border;                                            // 0x3300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Bound_TextArtifactName;                            // 0x3308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x3310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Content_Frame;                                     // 0x3318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x3320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Mterial;                                           // 0x3328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OpacityBacker;                                     // 0x3330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FMarinerLayeredButtonAssets GetAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ArtifactInfoSmallWidget_C">();
	}
	static class UArtifactInfoSmallWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArtifactInfoSmallWidget_C>();
	}
};
static_assert(alignof(UArtifactInfoSmallWidget_C) == 0x000008, "Wrong alignment on UArtifactInfoSmallWidget_C");
static_assert(sizeof(UArtifactInfoSmallWidget_C) == 0x003338, "Wrong size on UArtifactInfoSmallWidget_C");
static_assert(offsetof(UArtifactInfoSmallWidget_C, ExpandAnimation) == 0x0032E8, "Member 'UArtifactInfoSmallWidget_C::ExpandAnimation' has a wrong offset!");
static_assert(offsetof(UArtifactInfoSmallWidget_C, HoverAnim) == 0x0032F0, "Member 'UArtifactInfoSmallWidget_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UArtifactInfoSmallWidget_C, Background) == 0x0032F8, "Member 'UArtifactInfoSmallWidget_C::Background' has a wrong offset!");
static_assert(offsetof(UArtifactInfoSmallWidget_C, Border) == 0x003300, "Member 'UArtifactInfoSmallWidget_C::Border' has a wrong offset!");
static_assert(offsetof(UArtifactInfoSmallWidget_C, Bound_TextArtifactName) == 0x003308, "Member 'UArtifactInfoSmallWidget_C::Bound_TextArtifactName' has a wrong offset!");
static_assert(offsetof(UArtifactInfoSmallWidget_C, Button) == 0x003310, "Member 'UArtifactInfoSmallWidget_C::Button' has a wrong offset!");
static_assert(offsetof(UArtifactInfoSmallWidget_C, Content_Frame) == 0x003318, "Member 'UArtifactInfoSmallWidget_C::Content_Frame' has a wrong offset!");
static_assert(offsetof(UArtifactInfoSmallWidget_C, Image) == 0x003320, "Member 'UArtifactInfoSmallWidget_C::Image' has a wrong offset!");
static_assert(offsetof(UArtifactInfoSmallWidget_C, Mterial) == 0x003328, "Member 'UArtifactInfoSmallWidget_C::Mterial' has a wrong offset!");
static_assert(offsetof(UArtifactInfoSmallWidget_C, OpacityBacker) == 0x003330, "Member 'UArtifactInfoSmallWidget_C::OpacityBacker' has a wrong offset!");

}

