#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArtifactInfoWidget

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ArtifactInfoWidget.ArtifactInfoWidget_C
// 0x0040 (0x3378 - 0x3338)
class UArtifactInfoWidget_C final : public UMarinerArtifactInfoWidget
{
public:
	class UWidgetAnimation*                       ExpandAnimation;                                   // 0x3338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x3340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x3348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Border;                                            // 0x3350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x3358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Contentframe;                                      // 0x3360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Material;                                          // 0x3368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OpacityBacker;                                     // 0x3370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FMarinerLayeredButtonAssets GetAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ArtifactInfoWidget_C">();
	}
	static class UArtifactInfoWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArtifactInfoWidget_C>();
	}
};
static_assert(alignof(UArtifactInfoWidget_C) == 0x000008, "Wrong alignment on UArtifactInfoWidget_C");
static_assert(sizeof(UArtifactInfoWidget_C) == 0x003378, "Wrong size on UArtifactInfoWidget_C");
static_assert(offsetof(UArtifactInfoWidget_C, ExpandAnimation) == 0x003338, "Member 'UArtifactInfoWidget_C::ExpandAnimation' has a wrong offset!");
static_assert(offsetof(UArtifactInfoWidget_C, HoverAnim) == 0x003340, "Member 'UArtifactInfoWidget_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UArtifactInfoWidget_C, Background) == 0x003348, "Member 'UArtifactInfoWidget_C::Background' has a wrong offset!");
static_assert(offsetof(UArtifactInfoWidget_C, Border) == 0x003350, "Member 'UArtifactInfoWidget_C::Border' has a wrong offset!");
static_assert(offsetof(UArtifactInfoWidget_C, Button) == 0x003358, "Member 'UArtifactInfoWidget_C::Button' has a wrong offset!");
static_assert(offsetof(UArtifactInfoWidget_C, Contentframe) == 0x003360, "Member 'UArtifactInfoWidget_C::Contentframe' has a wrong offset!");
static_assert(offsetof(UArtifactInfoWidget_C, Material) == 0x003368, "Member 'UArtifactInfoWidget_C::Material' has a wrong offset!");
static_assert(offsetof(UArtifactInfoWidget_C, OpacityBacker) == 0x003370, "Member 'UArtifactInfoWidget_C::OpacityBacker' has a wrong offset!");

}

