#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArtifactHighlight

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function ArtifactHighlight.ArtifactHighlight_C.SetArtifact
// 0x0070 (0x0070 - 0x0000)
struct ArtifactHighlight_C_SetArtifact final
{
public:
	class UMarinerArtifactDataAsset*              Artifact_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemLoadResponse*                      ItemLoadResponse_0;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CurrentCharacterClass;                             // 0x0010(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          AllowState_0;                                      // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x003C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0058(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArtifactHighlight_C_SetArtifact) == 0x000008, "Wrong alignment on ArtifactHighlight_C_SetArtifact");
static_assert(sizeof(ArtifactHighlight_C_SetArtifact) == 0x000070, "Wrong size on ArtifactHighlight_C_SetArtifact");
static_assert(offsetof(ArtifactHighlight_C_SetArtifact, Artifact_0) == 0x000000, "Member 'ArtifactHighlight_C_SetArtifact::Artifact_0' has a wrong offset!");
static_assert(offsetof(ArtifactHighlight_C_SetArtifact, ItemLoadResponse_0) == 0x000008, "Member 'ArtifactHighlight_C_SetArtifact::ItemLoadResponse_0' has a wrong offset!");
static_assert(offsetof(ArtifactHighlight_C_SetArtifact, CurrentCharacterClass) == 0x000010, "Member 'ArtifactHighlight_C_SetArtifact::CurrentCharacterClass' has a wrong offset!");
static_assert(offsetof(ArtifactHighlight_C_SetArtifact, AllowState_0) == 0x000038, "Member 'ArtifactHighlight_C_SetArtifact::AllowState_0' has a wrong offset!");
static_assert(offsetof(ArtifactHighlight_C_SetArtifact, Temp_delegate_Variable) == 0x00003C, "Member 'ArtifactHighlight_C_SetArtifact::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(ArtifactHighlight_C_SetArtifact, CallFunc_GetOwningPlayer_ReturnValue) == 0x000050, "Member 'ArtifactHighlight_C_SetArtifact::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArtifactHighlight_C_SetArtifact, Temp_struct_Variable) == 0x000058, "Member 'ArtifactHighlight_C_SetArtifact::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(ArtifactHighlight_C_SetArtifact, CallFunc_PostEvent_ReturnValue) == 0x000068, "Member 'ArtifactHighlight_C_SetArtifact::CallFunc_PostEvent_ReturnValue' has a wrong offset!");

// Function ArtifactHighlight.ArtifactHighlight_C.Populate
// 0x0001 (0x0001 - 0x0000)
struct ArtifactHighlight_C_Populate final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ArtifactHighlight_C_Populate) == 0x000001, "Wrong alignment on ArtifactHighlight_C_Populate");
static_assert(sizeof(ArtifactHighlight_C_Populate) == 0x000001, "Wrong size on ArtifactHighlight_C_Populate");
static_assert(offsetof(ArtifactHighlight_C_Populate, ReturnValue) == 0x000000, "Member 'ArtifactHighlight_C_Populate::ReturnValue' has a wrong offset!");

}

