#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArtifactProgressBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ArtifactProgressBar.ArtifactProgressBar_C
// 0x0040 (0x0338 - 0x02F8)
class UArtifactProgressBar_C final : public UMarinerAnimatedProgressWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       BarProgressLoop;                                   // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LevelUpAnim;                                       // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             CharacterLevelNumber;                              // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fuelparticles;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FuelParticlessmall;                                // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow;                                              // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shockwave;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ArtifactProgressBar(int32 EntryPoint);
	void BPOnLevelSet(bool bIsInit, int32 CurrentLevel, float CurrentLevelPercent);

	struct FMarinerAnimatedProgressWidgetAnimations GetAnimations() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ArtifactProgressBar_C">();
	}
	static class UArtifactProgressBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArtifactProgressBar_C>();
	}
};
static_assert(alignof(UArtifactProgressBar_C) == 0x000008, "Wrong alignment on UArtifactProgressBar_C");
static_assert(sizeof(UArtifactProgressBar_C) == 0x000338, "Wrong size on UArtifactProgressBar_C");
static_assert(offsetof(UArtifactProgressBar_C, UberGraphFrame) == 0x0002F8, "Member 'UArtifactProgressBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UArtifactProgressBar_C, BarProgressLoop) == 0x000300, "Member 'UArtifactProgressBar_C::BarProgressLoop' has a wrong offset!");
static_assert(offsetof(UArtifactProgressBar_C, LevelUpAnim) == 0x000308, "Member 'UArtifactProgressBar_C::LevelUpAnim' has a wrong offset!");
static_assert(offsetof(UArtifactProgressBar_C, CharacterLevelNumber) == 0x000310, "Member 'UArtifactProgressBar_C::CharacterLevelNumber' has a wrong offset!");
static_assert(offsetof(UArtifactProgressBar_C, Fuelparticles) == 0x000318, "Member 'UArtifactProgressBar_C::Fuelparticles' has a wrong offset!");
static_assert(offsetof(UArtifactProgressBar_C, FuelParticlessmall) == 0x000320, "Member 'UArtifactProgressBar_C::FuelParticlessmall' has a wrong offset!");
static_assert(offsetof(UArtifactProgressBar_C, Glow) == 0x000328, "Member 'UArtifactProgressBar_C::Glow' has a wrong offset!");
static_assert(offsetof(UArtifactProgressBar_C, Shockwave) == 0x000330, "Member 'UArtifactProgressBar_C::Shockwave' has a wrong offset!");

}

