#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AsyncCharacterSpawner

#include "Basic.hpp"

#include "MangoClient_structs.hpp"


namespace SDK::Params
{

// Function AsyncCharacterSpawner.AsyncCharacterSpawner_C.ExecuteUbergraph_AsyncCharacterSpawner
// 0x03D0 (0x03D0 - 0x0000)
struct AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20A0[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerSkinCollectionDataAsset*        K2Node_DynamicCast_AsMariner_Skin_Collection_Data_Asset; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20A1[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class UMangoPlayerManager*                    CallFunc_Get_ReturnValue;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UMarinerSkinCollectionDataAsset> CallFunc_GetEquippedSkinForProfile_ReturnValue;    // 0x0048(0x0028)(HasGetValueTypeHash)
	class UMarinerPlayableCharacter*              K2Node_CustomEvent_Character;                      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterCustomizationPedestalInterior_C* K2Node_CustomEvent_InteriorPedestal;               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMarinerCharacterSpawner*               K2Node_CustomEvent_CharacterSpawner;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20A2[0x6];                                     // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterCustomizationPedestalInterior_C* CallFunc_SetInteriorPedestal_AsCharacter_Customization_Pedestal_Interior; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20A3[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterCustomizationPedestalInterior_C* K2Node_Select_Default;                             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMarinerCharacterSpawner*               CallFunc_SetCharacterSpawner_AsMariner_Character_Spawner; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20A4[0x6];                                     // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AMarinerCharacterSpawner*               K2Node_Select_Default_1;                           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMangoPlayerManager*                    CallFunc_Get_ReturnValue_1;                        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMangoProfile                          CallFunc_GetMangoProfile_ReturnValue;              // 0x00C8(0x02E0)(ConstParm)
	TSoftObjectPtr<class UMarinerSkinCollectionDataAsset> CallFunc_GetEquippedSkinForProfile_ReturnValue_1;  // 0x03A8(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner) == 0x000008, "Wrong alignment on AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner");
static_assert(sizeof(AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner) == 0x0003D0, "Wrong size on AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner");
static_assert(offsetof(AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner, EntryPoint) == 0x000000, "Member 'AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner, Temp_object_Variable) == 0x000008, "Member 'AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner, Temp_bool_Variable) == 0x000010, "Member 'AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner, K2Node_DynamicCast_AsMariner_Skin_Collection_Data_Asset) == 0x000018, "Member 'AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner::K2Node_DynamicCast_AsMariner_Skin_Collection_Data_Asset' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner, K2Node_CustomEvent_Loaded) == 0x000028, "Member 'AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner, CallFunc_Get_ReturnValue) == 0x000040, "Member 'AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner, CallFunc_GetEquippedSkinForProfile_ReturnValue) == 0x000048, "Member 'AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner::CallFunc_GetEquippedSkinForProfile_ReturnValue' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner, K2Node_CustomEvent_Character) == 0x000070, "Member 'AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner, K2Node_CustomEvent_InteriorPedestal) == 0x000078, "Member 'AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner::K2Node_CustomEvent_InteriorPedestal' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner, K2Node_CustomEvent_CharacterSpawner) == 0x000080, "Member 'AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner::K2Node_CustomEvent_CharacterSpawner' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner, CallFunc_IsValid_ReturnValue_1) == 0x000089, "Member 'AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner, CallFunc_SetInteriorPedestal_AsCharacter_Customization_Pedestal_Interior) == 0x000090, "Member 'AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner::CallFunc_SetInteriorPedestal_AsCharacter_Customization_Pedestal_Interior' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner, CallFunc_IsValid_ReturnValue_2) == 0x000098, "Member 'AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner, K2Node_Select_Default) == 0x0000A0, "Member 'AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner, CallFunc_SetCharacterSpawner_AsMariner_Character_Spawner) == 0x0000A8, "Member 'AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner::CallFunc_SetCharacterSpawner_AsMariner_Character_Spawner' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner, Temp_bool_Variable_1) == 0x0000B0, "Member 'AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner, CallFunc_IsValid_ReturnValue_3) == 0x0000B1, "Member 'AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner, K2Node_Select_Default_1) == 0x0000B8, "Member 'AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner, CallFunc_Get_ReturnValue_1) == 0x0000C0, "Member 'AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner, CallFunc_GetMangoProfile_ReturnValue) == 0x0000C8, "Member 'AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner::CallFunc_GetMangoProfile_ReturnValue' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner, CallFunc_GetEquippedSkinForProfile_ReturnValue_1) == 0x0003A8, "Member 'AsyncCharacterSpawner_C_ExecuteUbergraph_AsyncCharacterSpawner::CallFunc_GetEquippedSkinForProfile_ReturnValue_1' has a wrong offset!");

// Function AsyncCharacterSpawner.AsyncCharacterSpawner_C.SpawnCharacter
// 0x0018 (0x0018 - 0x0000)
struct AsyncCharacterSpawner_C_SpawnCharacter final
{
public:
	class UMarinerPlayableCharacter*              Param_Character;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterCustomizationPedestalInterior_C* Param_InteriorPedestal;                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMarinerCharacterSpawner*               Param_CharacterSpawner;                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AsyncCharacterSpawner_C_SpawnCharacter) == 0x000008, "Wrong alignment on AsyncCharacterSpawner_C_SpawnCharacter");
static_assert(sizeof(AsyncCharacterSpawner_C_SpawnCharacter) == 0x000018, "Wrong size on AsyncCharacterSpawner_C_SpawnCharacter");
static_assert(offsetof(AsyncCharacterSpawner_C_SpawnCharacter, Param_Character) == 0x000000, "Member 'AsyncCharacterSpawner_C_SpawnCharacter::Param_Character' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_SpawnCharacter, Param_InteriorPedestal) == 0x000008, "Member 'AsyncCharacterSpawner_C_SpawnCharacter::Param_InteriorPedestal' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_SpawnCharacter, Param_CharacterSpawner) == 0x000010, "Member 'AsyncCharacterSpawner_C_SpawnCharacter::Param_CharacterSpawner' has a wrong offset!");

// Function AsyncCharacterSpawner.AsyncCharacterSpawner_C.OnLoaded_F8D3428441E64AA3B00A23A70D7A2FF4
// 0x0008 (0x0008 - 0x0000)
struct AsyncCharacterSpawner_C_OnLoaded_F8D3428441E64AA3B00A23A70D7A2FF4 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AsyncCharacterSpawner_C_OnLoaded_F8D3428441E64AA3B00A23A70D7A2FF4) == 0x000008, "Wrong alignment on AsyncCharacterSpawner_C_OnLoaded_F8D3428441E64AA3B00A23A70D7A2FF4");
static_assert(sizeof(AsyncCharacterSpawner_C_OnLoaded_F8D3428441E64AA3B00A23A70D7A2FF4) == 0x000008, "Wrong size on AsyncCharacterSpawner_C_OnLoaded_F8D3428441E64AA3B00A23A70D7A2FF4");
static_assert(offsetof(AsyncCharacterSpawner_C_OnLoaded_F8D3428441E64AA3B00A23A70D7A2FF4, Loaded) == 0x000000, "Member 'AsyncCharacterSpawner_C_OnLoaded_F8D3428441E64AA3B00A23A70D7A2FF4::Loaded' has a wrong offset!");

// Function AsyncCharacterSpawner.AsyncCharacterSpawner_C.SetCharacterSpawner
// 0x0030 (0x0030 - 0x0000)
struct AsyncCharacterSpawner_C_SetCharacterSpawner final
{
public:
	class AMarinerCharacterSpawner*               AsMariner_Character_Spawner;                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors;            // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMarinerCharacterSpawner*               K2Node_DynamicCast_AsMariner_Character_Spawner;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AsyncCharacterSpawner_C_SetCharacterSpawner) == 0x000008, "Wrong alignment on AsyncCharacterSpawner_C_SetCharacterSpawner");
static_assert(sizeof(AsyncCharacterSpawner_C_SetCharacterSpawner) == 0x000030, "Wrong size on AsyncCharacterSpawner_C_SetCharacterSpawner");
static_assert(offsetof(AsyncCharacterSpawner_C_SetCharacterSpawner, AsMariner_Character_Spawner) == 0x000000, "Member 'AsyncCharacterSpawner_C_SetCharacterSpawner::AsMariner_Character_Spawner' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_SetCharacterSpawner, CallFunc_GetAllActorsWithTag_OutActors) == 0x000008, "Member 'AsyncCharacterSpawner_C_SetCharacterSpawner::CallFunc_GetAllActorsWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_SetCharacterSpawner, CallFunc_Array_Get_Item) == 0x000018, "Member 'AsyncCharacterSpawner_C_SetCharacterSpawner::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_SetCharacterSpawner, K2Node_DynamicCast_AsMariner_Character_Spawner) == 0x000020, "Member 'AsyncCharacterSpawner_C_SetCharacterSpawner::K2Node_DynamicCast_AsMariner_Character_Spawner' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_SetCharacterSpawner, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'AsyncCharacterSpawner_C_SetCharacterSpawner::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AsyncCharacterSpawner.AsyncCharacterSpawner_C.SetInteriorPedestal
// 0x0030 (0x0030 - 0x0000)
struct AsyncCharacterSpawner_C_SetInteriorPedestal final
{
public:
	class ACharacterCustomizationPedestalInterior_C* AsCharacter_Customization_Pedestal_Interior;       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors;            // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterCustomizationPedestalInterior_C* K2Node_DynamicCast_AsCharacter_Customization_Pedestal_Interior; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AsyncCharacterSpawner_C_SetInteriorPedestal) == 0x000008, "Wrong alignment on AsyncCharacterSpawner_C_SetInteriorPedestal");
static_assert(sizeof(AsyncCharacterSpawner_C_SetInteriorPedestal) == 0x000030, "Wrong size on AsyncCharacterSpawner_C_SetInteriorPedestal");
static_assert(offsetof(AsyncCharacterSpawner_C_SetInteriorPedestal, AsCharacter_Customization_Pedestal_Interior) == 0x000000, "Member 'AsyncCharacterSpawner_C_SetInteriorPedestal::AsCharacter_Customization_Pedestal_Interior' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_SetInteriorPedestal, CallFunc_GetAllActorsWithTag_OutActors) == 0x000008, "Member 'AsyncCharacterSpawner_C_SetInteriorPedestal::CallFunc_GetAllActorsWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_SetInteriorPedestal, CallFunc_Array_Get_Item) == 0x000018, "Member 'AsyncCharacterSpawner_C_SetInteriorPedestal::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_SetInteriorPedestal, K2Node_DynamicCast_AsCharacter_Customization_Pedestal_Interior) == 0x000020, "Member 'AsyncCharacterSpawner_C_SetInteriorPedestal::K2Node_DynamicCast_AsCharacter_Customization_Pedestal_Interior' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_SetInteriorPedestal, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'AsyncCharacterSpawner_C_SetInteriorPedestal::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AsyncCharacterSpawner.AsyncCharacterSpawner_C.SetLocalProfile
// 0x02E8 (0x02E8 - 0x0000)
struct AsyncCharacterSpawner_C_SetLocalProfile final
{
public:
	class UMangoPlayerManager*                    CallFunc_Get_ReturnValue;                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMangoProfile                          CallFunc_GetMangoProfile_ReturnValue;              // 0x0008(0x02E0)(ConstParm)
};
static_assert(alignof(AsyncCharacterSpawner_C_SetLocalProfile) == 0x000008, "Wrong alignment on AsyncCharacterSpawner_C_SetLocalProfile");
static_assert(sizeof(AsyncCharacterSpawner_C_SetLocalProfile) == 0x0002E8, "Wrong size on AsyncCharacterSpawner_C_SetLocalProfile");
static_assert(offsetof(AsyncCharacterSpawner_C_SetLocalProfile, CallFunc_Get_ReturnValue) == 0x000000, "Member 'AsyncCharacterSpawner_C_SetLocalProfile::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(AsyncCharacterSpawner_C_SetLocalProfile, CallFunc_GetMangoProfile_ReturnValue) == 0x000008, "Member 'AsyncCharacterSpawner_C_SetLocalProfile::CallFunc_GetMangoProfile_ReturnValue' has a wrong offset!");

}

