#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AsyncCharacterSpawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MangoClient_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AsyncCharacterSpawner.AsyncCharacterSpawner_C
// 0x0300 (0x0330 - 0x0030)
class UAsyncCharacterSpawner_C final : public UMarinerAsyncUIFlowHandler
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AMarinerCharacterSpawner*               CharacterSpawner;                                  // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterCustomizationPedestalInterior_C* InteriorPedestal;                                  // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMangoProfile                          LocalProfile;                                      // 0x0048(0x02E0)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMarinerPlayableCharacter*              Character;                                         // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AsyncCharacterSpawner(int32 EntryPoint);
	void RemoveCharacter();
	void SpawnCharacter(class UMarinerPlayableCharacter* Param_Character, class ACharacterCustomizationPedestalInterior_C* Param_InteriorPedestal, class AMarinerCharacterSpawner* Param_CharacterSpawner);
	void ApplySkinToCharacter();
	void OnLoaded_F8D3428441E64AA3B00A23A70D7A2FF4(class UObject* Loaded);
	void SetCharacterSpawner(class AMarinerCharacterSpawner** AsMariner_Character_Spawner);
	void SetInteriorPedestal(class ACharacterCustomizationPedestalInterior_C** AsCharacter_Customization_Pedestal_Interior);
	void SetLocalProfile();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AsyncCharacterSpawner_C">();
	}
	static class UAsyncCharacterSpawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncCharacterSpawner_C>();
	}
};
static_assert(alignof(UAsyncCharacterSpawner_C) == 0x000008, "Wrong alignment on UAsyncCharacterSpawner_C");
static_assert(sizeof(UAsyncCharacterSpawner_C) == 0x000330, "Wrong size on UAsyncCharacterSpawner_C");
static_assert(offsetof(UAsyncCharacterSpawner_C, UberGraphFrame) == 0x000030, "Member 'UAsyncCharacterSpawner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAsyncCharacterSpawner_C, CharacterSpawner) == 0x000038, "Member 'UAsyncCharacterSpawner_C::CharacterSpawner' has a wrong offset!");
static_assert(offsetof(UAsyncCharacterSpawner_C, InteriorPedestal) == 0x000040, "Member 'UAsyncCharacterSpawner_C::InteriorPedestal' has a wrong offset!");
static_assert(offsetof(UAsyncCharacterSpawner_C, LocalProfile) == 0x000048, "Member 'UAsyncCharacterSpawner_C::LocalProfile' has a wrong offset!");
static_assert(offsetof(UAsyncCharacterSpawner_C, Character) == 0x000328, "Member 'UAsyncCharacterSpawner_C::Character' has a wrong offset!");

}

