#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AsyncFlowCommon

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function AsyncFlowCommon.AsyncFlowCommon_C.BeginQuitGame
// 0x01A8 (0x01A8 - 0x0000)
struct AsyncFlowCommon_C_BeginQuitGame final
{
public:
	TDelegate<void(struct FKey& KeyPressed)>      K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(struct FKey& KeyPressed)>      K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMarinerMessageBoxData                 K2Node_MakeStruct_MarinerMessageBoxData;           // 0x0028(0x0170)(ContainsInstancedReference)
	class UMarinerGameInstance*                   K2Node_DynamicCast_AsMariner_Game_Instance;        // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AsyncFlowCommon_C_BeginQuitGame) == 0x000008, "Wrong alignment on AsyncFlowCommon_C_BeginQuitGame");
static_assert(sizeof(AsyncFlowCommon_C_BeginQuitGame) == 0x0001A8, "Wrong size on AsyncFlowCommon_C_BeginQuitGame");
static_assert(offsetof(AsyncFlowCommon_C_BeginQuitGame, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'AsyncFlowCommon_C_BeginQuitGame::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AsyncFlowCommon_C_BeginQuitGame, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'AsyncFlowCommon_C_BeginQuitGame::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AsyncFlowCommon_C_BeginQuitGame, CallFunc_GetGameInstance_ReturnValue) == 0x000020, "Member 'AsyncFlowCommon_C_BeginQuitGame::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AsyncFlowCommon_C_BeginQuitGame, K2Node_MakeStruct_MarinerMessageBoxData) == 0x000028, "Member 'AsyncFlowCommon_C_BeginQuitGame::K2Node_MakeStruct_MarinerMessageBoxData' has a wrong offset!");
static_assert(offsetof(AsyncFlowCommon_C_BeginQuitGame, K2Node_DynamicCast_AsMariner_Game_Instance) == 0x000198, "Member 'AsyncFlowCommon_C_BeginQuitGame::K2Node_DynamicCast_AsMariner_Game_Instance' has a wrong offset!");
static_assert(offsetof(AsyncFlowCommon_C_BeginQuitGame, K2Node_DynamicCast_bSuccess) == 0x0001A0, "Member 'AsyncFlowCommon_C_BeginQuitGame::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AsyncFlowCommon.AsyncFlowCommon_C.ConfirmQuit
// 0x0020 (0x0020 - 0x0000)
struct AsyncFlowCommon_C_ConfirmQuit final
{
public:
	struct FKey                                   KeyPressed;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AsyncFlowCommon_C_ConfirmQuit) == 0x000008, "Wrong alignment on AsyncFlowCommon_C_ConfirmQuit");
static_assert(sizeof(AsyncFlowCommon_C_ConfirmQuit) == 0x000020, "Wrong size on AsyncFlowCommon_C_ConfirmQuit");
static_assert(offsetof(AsyncFlowCommon_C_ConfirmQuit, KeyPressed) == 0x000000, "Member 'AsyncFlowCommon_C_ConfirmQuit::KeyPressed' has a wrong offset!");
static_assert(offsetof(AsyncFlowCommon_C_ConfirmQuit, CallFunc_PostEventAtLocation_ReturnValue) == 0x000018, "Member 'AsyncFlowCommon_C_ConfirmQuit::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");

// Function AsyncFlowCommon.AsyncFlowCommon_C.DummyCallback
// 0x0018 (0x0018 - 0x0000)
struct AsyncFlowCommon_C_DummyCallback final
{
public:
	struct FKey                                   KeyPressed;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(AsyncFlowCommon_C_DummyCallback) == 0x000008, "Wrong alignment on AsyncFlowCommon_C_DummyCallback");
static_assert(sizeof(AsyncFlowCommon_C_DummyCallback) == 0x000018, "Wrong size on AsyncFlowCommon_C_DummyCallback");
static_assert(offsetof(AsyncFlowCommon_C_DummyCallback, KeyPressed) == 0x000000, "Member 'AsyncFlowCommon_C_DummyCallback::KeyPressed' has a wrong offset!");

}

