#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AvatarWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AvatarWidget.AvatarWidget_C.ExecuteUbergraph_AvatarWidget
// 0x0130 (0x0130 - 0x0000)
struct AvatarWidget_C_ExecuteUbergraph_AvatarWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2329[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0008(0x0070)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_232A[0x2];                                     // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0084(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_232B[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x00C0(0x0070)(ConstParm)
};
static_assert(alignof(AvatarWidget_C_ExecuteUbergraph_AvatarWidget) == 0x000008, "Wrong alignment on AvatarWidget_C_ExecuteUbergraph_AvatarWidget");
static_assert(sizeof(AvatarWidget_C_ExecuteUbergraph_AvatarWidget) == 0x000130, "Wrong size on AvatarWidget_C_ExecuteUbergraph_AvatarWidget");
static_assert(offsetof(AvatarWidget_C_ExecuteUbergraph_AvatarWidget, EntryPoint) == 0x000000, "Member 'AvatarWidget_C_ExecuteUbergraph_AvatarWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AvatarWidget_C_ExecuteUbergraph_AvatarWidget, K2Node_Event_MouseEvent) == 0x000008, "Member 'AvatarWidget_C_ExecuteUbergraph_AvatarWidget::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(AvatarWidget_C_ExecuteUbergraph_AvatarWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000078, "Member 'AvatarWidget_C_ExecuteUbergraph_AvatarWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AvatarWidget_C_ExecuteUbergraph_AvatarWidget, K2Node_SwitchEnum_CmpSuccess) == 0x000080, "Member 'AvatarWidget_C_ExecuteUbergraph_AvatarWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AvatarWidget_C_ExecuteUbergraph_AvatarWidget, K2Node_SwitchEnum_CmpSuccess_1) == 0x000081, "Member 'AvatarWidget_C_ExecuteUbergraph_AvatarWidget::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(AvatarWidget_C_ExecuteUbergraph_AvatarWidget, K2Node_Event_MyGeometry) == 0x000084, "Member 'AvatarWidget_C_ExecuteUbergraph_AvatarWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(AvatarWidget_C_ExecuteUbergraph_AvatarWidget, K2Node_Event_MouseEvent_1) == 0x0000C0, "Member 'AvatarWidget_C_ExecuteUbergraph_AvatarWidget::K2Node_Event_MouseEvent_1' has a wrong offset!");

// Function AvatarWidget.AvatarWidget_C.OnMouseButtonDown
// 0x0160 (0x0160 - 0x0000)
struct AvatarWidget_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(AvatarWidget_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on AvatarWidget_C_OnMouseButtonDown");
static_assert(sizeof(AvatarWidget_C_OnMouseButtonDown) == 0x000160, "Wrong size on AvatarWidget_C_OnMouseButtonDown");
static_assert(offsetof(AvatarWidget_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'AvatarWidget_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(AvatarWidget_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'AvatarWidget_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(AvatarWidget_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'AvatarWidget_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");

// Function AvatarWidget.AvatarWidget_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct AvatarWidget_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AvatarWidget_C_OnMouseEnter) == 0x000008, "Wrong alignment on AvatarWidget_C_OnMouseEnter");
static_assert(sizeof(AvatarWidget_C_OnMouseEnter) == 0x0000A8, "Wrong size on AvatarWidget_C_OnMouseEnter");
static_assert(offsetof(AvatarWidget_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'AvatarWidget_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(AvatarWidget_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'AvatarWidget_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function AvatarWidget.AvatarWidget_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct AvatarWidget_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AvatarWidget_C_OnMouseLeave) == 0x000008, "Wrong alignment on AvatarWidget_C_OnMouseLeave");
static_assert(sizeof(AvatarWidget_C_OnMouseLeave) == 0x000070, "Wrong size on AvatarWidget_C_OnMouseLeave");
static_assert(offsetof(AvatarWidget_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'AvatarWidget_C_OnMouseLeave::MouseEvent' has a wrong offset!");

}

