#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlastPassTierPurchaseMessageBox

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BlastPassTierPurchaseMessageBox.BlastPassTierPurchaseMessageBox_C
// 0x0038 (0x04A0 - 0x0468)
class UBlastPassTierPurchaseMessageBox_C final : public UMarinerBlastPassTierPurchaseMessageBox
{
public:
	class UImage*                                 HeaderMIddle;                                      // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_100;                                         // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_118;                                         // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_218;                                         // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Material;                                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OpacityBacker;                                     // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopBar;                                            // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BlastPassTierPurchaseMessageBox_C">();
	}
	static class UBlastPassTierPurchaseMessageBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlastPassTierPurchaseMessageBox_C>();
	}
};
static_assert(alignof(UBlastPassTierPurchaseMessageBox_C) == 0x000008, "Wrong alignment on UBlastPassTierPurchaseMessageBox_C");
static_assert(sizeof(UBlastPassTierPurchaseMessageBox_C) == 0x0004A0, "Wrong size on UBlastPassTierPurchaseMessageBox_C");
static_assert(offsetof(UBlastPassTierPurchaseMessageBox_C, HeaderMIddle) == 0x000468, "Member 'UBlastPassTierPurchaseMessageBox_C::HeaderMIddle' has a wrong offset!");
static_assert(offsetof(UBlastPassTierPurchaseMessageBox_C, Image_100) == 0x000470, "Member 'UBlastPassTierPurchaseMessageBox_C::Image_100' has a wrong offset!");
static_assert(offsetof(UBlastPassTierPurchaseMessageBox_C, Image_118) == 0x000478, "Member 'UBlastPassTierPurchaseMessageBox_C::Image_118' has a wrong offset!");
static_assert(offsetof(UBlastPassTierPurchaseMessageBox_C, Image_218) == 0x000480, "Member 'UBlastPassTierPurchaseMessageBox_C::Image_218' has a wrong offset!");
static_assert(offsetof(UBlastPassTierPurchaseMessageBox_C, Material) == 0x000488, "Member 'UBlastPassTierPurchaseMessageBox_C::Material' has a wrong offset!");
static_assert(offsetof(UBlastPassTierPurchaseMessageBox_C, OpacityBacker) == 0x000490, "Member 'UBlastPassTierPurchaseMessageBox_C::OpacityBacker' has a wrong offset!");
static_assert(offsetof(UBlastPassTierPurchaseMessageBox_C, TopBar) == 0x000498, "Member 'UBlastPassTierPurchaseMessageBox_C::TopBar' has a wrong offset!");

}

