#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlastPassSeason

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BlastPassSeason.BlastPassSeason_C
// 0x0030 (0x0260 - 0x0230)
class UBlastPassSeason_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             SeasonHeaderText_1;                                // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTimerWidget_C*                         SeasonTimer;                                       // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         StartTimeRemaining;                                // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastInlineDelegateProperty_             OnSeasonCompleted;                                 // 0x0250(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnSeasonCompleted__DelegateSignature();
	void ExecuteUbergraph_BlastPassSeason(int32 EntryPoint);
	void Construct();
	void OnCountdownExpired();
	void RefreshTimer();
	void StartTimer();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BlastPassSeason_C">();
	}
	static class UBlastPassSeason_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlastPassSeason_C>();
	}
};
static_assert(alignof(UBlastPassSeason_C) == 0x000008, "Wrong alignment on UBlastPassSeason_C");
static_assert(sizeof(UBlastPassSeason_C) == 0x000260, "Wrong size on UBlastPassSeason_C");
static_assert(offsetof(UBlastPassSeason_C, UberGraphFrame) == 0x000230, "Member 'UBlastPassSeason_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBlastPassSeason_C, SeasonHeaderText_1) == 0x000238, "Member 'UBlastPassSeason_C::SeasonHeaderText_1' has a wrong offset!");
static_assert(offsetof(UBlastPassSeason_C, SeasonTimer) == 0x000240, "Member 'UBlastPassSeason_C::SeasonTimer' has a wrong offset!");
static_assert(offsetof(UBlastPassSeason_C, StartTimeRemaining) == 0x000248, "Member 'UBlastPassSeason_C::StartTimeRemaining' has a wrong offset!");
static_assert(offsetof(UBlastPassSeason_C, OnSeasonCompleted) == 0x000250, "Member 'UBlastPassSeason_C::OnSeasonCompleted' has a wrong offset!");

}

