#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlastPassOfferMessageBox

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BlastPassOfferMessageBox.BlastPassOfferMessageBox_C
// 0x0040 (0x04B8 - 0x0478)
class UBlastPassOfferMessageBox_C final : public UMarinerBlastPassOfferMessageBox
{
public:
	class UImage*                                 BlastPassLogoR;                                    // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBlastPassTierWidget_C*                 BlastPassTierWidget_76;                            // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bound_CostIcon;                                    // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_80;                                          // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_259;                                         // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Material;                                          // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WhiteCircle;                                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Windowframe;                                       // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BlastPassOfferMessageBox_C">();
	}
	static class UBlastPassOfferMessageBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlastPassOfferMessageBox_C>();
	}
};
static_assert(alignof(UBlastPassOfferMessageBox_C) == 0x000008, "Wrong alignment on UBlastPassOfferMessageBox_C");
static_assert(sizeof(UBlastPassOfferMessageBox_C) == 0x0004B8, "Wrong size on UBlastPassOfferMessageBox_C");
static_assert(offsetof(UBlastPassOfferMessageBox_C, BlastPassLogoR) == 0x000478, "Member 'UBlastPassOfferMessageBox_C::BlastPassLogoR' has a wrong offset!");
static_assert(offsetof(UBlastPassOfferMessageBox_C, BlastPassTierWidget_76) == 0x000480, "Member 'UBlastPassOfferMessageBox_C::BlastPassTierWidget_76' has a wrong offset!");
static_assert(offsetof(UBlastPassOfferMessageBox_C, Bound_CostIcon) == 0x000488, "Member 'UBlastPassOfferMessageBox_C::Bound_CostIcon' has a wrong offset!");
static_assert(offsetof(UBlastPassOfferMessageBox_C, Image_80) == 0x000490, "Member 'UBlastPassOfferMessageBox_C::Image_80' has a wrong offset!");
static_assert(offsetof(UBlastPassOfferMessageBox_C, Image_259) == 0x000498, "Member 'UBlastPassOfferMessageBox_C::Image_259' has a wrong offset!");
static_assert(offsetof(UBlastPassOfferMessageBox_C, Material) == 0x0004A0, "Member 'UBlastPassOfferMessageBox_C::Material' has a wrong offset!");
static_assert(offsetof(UBlastPassOfferMessageBox_C, WhiteCircle) == 0x0004A8, "Member 'UBlastPassOfferMessageBox_C::WhiteCircle' has a wrong offset!");
static_assert(offsetof(UBlastPassOfferMessageBox_C, Windowframe) == 0x0004B0, "Member 'UBlastPassOfferMessageBox_C::Windowframe' has a wrong offset!");

}

