#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlastPassMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_structs.hpp"
#include "Mariner_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BlastPassMenu.BlastPassMenu_C
// 0x0080 (0x0560 - 0x04E0)
class UBlastPassMenu_C final : public UMarinerMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ULeavePartyButton_C*                    ActivatePassButton;                                // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 bgimage;                                           // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBlastPassSeason_C*                     BlastPassSeason;                                   // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBlastPassTierWidget_C*                 BlastPassTierWidget;                               // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FreeBar;                                           // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FreeBG;                                            // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PremiumBar;                                        // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PremiumBG;                                         // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressionBlastPassWidget_C*          ProgressionWidget;                                 // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULeavePartyButton_C*                    PurchaseToTierButton;                              // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerHorizontalBox*                  RootPanel;                                         // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBlastPassProgressBar_C*                SummaryBlastPassBar;                               // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UIBacker;                                          // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             UpsellText;                                        // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         StartingTier;                                      // 0x0558(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BlastPassMenu(int32 EntryPoint);
	void OnSeasonChanged(const struct FMangoBlastPassDefinition& Definition);
	void BndEvt__PurchaseToTierButton_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature(class UMarinerLayeredButton* Instance);
	void OnPurchaseFlowComplete(bool bOfferPurchased);
	void BP_OnEntered(bool bFromSubMenu);
	void BndEvt__ActivatePassButton_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature(class UMarinerLayeredButton* Instance);
	void BP_OnExited(bool bToSubLayer);
	void BuildMenu();
	void ActivatePass();
	bool HandleInput(EMarinerInputActions InInput);
	void OnProgressionButtonSelected(class UMiniRewardButton_C* ButtonInstance);
	void SetStartingTier(int32 Tier);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BlastPassMenu_C">();
	}
	static class UBlastPassMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlastPassMenu_C>();
	}
};
static_assert(alignof(UBlastPassMenu_C) == 0x000008, "Wrong alignment on UBlastPassMenu_C");
static_assert(sizeof(UBlastPassMenu_C) == 0x000560, "Wrong size on UBlastPassMenu_C");
static_assert(offsetof(UBlastPassMenu_C, UberGraphFrame) == 0x0004E0, "Member 'UBlastPassMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBlastPassMenu_C, ActivatePassButton) == 0x0004E8, "Member 'UBlastPassMenu_C::ActivatePassButton' has a wrong offset!");
static_assert(offsetof(UBlastPassMenu_C, bgimage) == 0x0004F0, "Member 'UBlastPassMenu_C::bgimage' has a wrong offset!");
static_assert(offsetof(UBlastPassMenu_C, BlastPassSeason) == 0x0004F8, "Member 'UBlastPassMenu_C::BlastPassSeason' has a wrong offset!");
static_assert(offsetof(UBlastPassMenu_C, BlastPassTierWidget) == 0x000500, "Member 'UBlastPassMenu_C::BlastPassTierWidget' has a wrong offset!");
static_assert(offsetof(UBlastPassMenu_C, FreeBar) == 0x000508, "Member 'UBlastPassMenu_C::FreeBar' has a wrong offset!");
static_assert(offsetof(UBlastPassMenu_C, FreeBG) == 0x000510, "Member 'UBlastPassMenu_C::FreeBG' has a wrong offset!");
static_assert(offsetof(UBlastPassMenu_C, PremiumBar) == 0x000518, "Member 'UBlastPassMenu_C::PremiumBar' has a wrong offset!");
static_assert(offsetof(UBlastPassMenu_C, PremiumBG) == 0x000520, "Member 'UBlastPassMenu_C::PremiumBG' has a wrong offset!");
static_assert(offsetof(UBlastPassMenu_C, ProgressionWidget) == 0x000528, "Member 'UBlastPassMenu_C::ProgressionWidget' has a wrong offset!");
static_assert(offsetof(UBlastPassMenu_C, PurchaseToTierButton) == 0x000530, "Member 'UBlastPassMenu_C::PurchaseToTierButton' has a wrong offset!");
static_assert(offsetof(UBlastPassMenu_C, RootPanel) == 0x000538, "Member 'UBlastPassMenu_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UBlastPassMenu_C, SummaryBlastPassBar) == 0x000540, "Member 'UBlastPassMenu_C::SummaryBlastPassBar' has a wrong offset!");
static_assert(offsetof(UBlastPassMenu_C, UIBacker) == 0x000548, "Member 'UBlastPassMenu_C::UIBacker' has a wrong offset!");
static_assert(offsetof(UBlastPassMenu_C, UpsellText) == 0x000550, "Member 'UBlastPassMenu_C::UpsellText' has a wrong offset!");
static_assert(offsetof(UBlastPassMenu_C, StartingTier) == 0x000558, "Member 'UBlastPassMenu_C::StartingTier' has a wrong offset!");

}

