#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlastPassTierPurchaseMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MangoClient_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function BlastPassTierPurchaseMenu.BlastPassTierPurchaseMenu_C.ExecuteUbergraph_BlastPassTierPurchaseMenu
// 0x0118 (0x0118 - 0x0000)
struct BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoPlayerManager*                    CallFunc_Get_ReturnValue;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HandleInput_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HandleInput_ReturnValue_1;                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoPlayerManager*                    CallFunc_Get_ReturnValue_1;                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveSelf_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Tier;                           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFromSubMenu;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMarinerInputInterface> CallFunc_SetActiveInputWidget_InputWidget_CastInput; // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerInputType                              K2Node_Event_InputType;                            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoCMSManager*                       CallFunc_Get_ReturnValue_2;                        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMangoBlastPassDefinition              CallFunc_TryGetActiveBlastPassDefinition_OutDefinition; // 0x0060(0x0068)()
	bool                                          CallFunc_TryGetActiveBlastPassDefinition_ReturnValue; // 0x00C8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMangoBlastPassProgression             CallFunc_GetBlastPassProgression_OutProgression;   // 0x00D0(0x0028)()
	bool                                          CallFunc_GetBlastPassProgression_ReturnValue;      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoInventoryManager*                 CallFunc_Get_ReturnValue_3;                        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActiveBlastPassSeasonOwned_ReturnValue; // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu) == 0x000008, "Wrong alignment on BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu");
static_assert(sizeof(BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu) == 0x000118, "Wrong size on BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu, EntryPoint) == 0x000000, "Member 'BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu, CallFunc_Get_ReturnValue) == 0x000018, "Member 'BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu, Temp_bool_Variable) == 0x000020, "Member 'BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu, CallFunc_HandleInput_ReturnValue) == 0x000021, "Member 'BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu::CallFunc_HandleInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu, CallFunc_HandleInput_ReturnValue_1) == 0x000022, "Member 'BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu::CallFunc_HandleInput_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu, CallFunc_Get_ReturnValue_1) == 0x000028, "Member 'BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu, CallFunc_RemoveSelf_ReturnValue) == 0x000030, "Member 'BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu::CallFunc_RemoveSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu, K2Node_CustomEvent_Tier) == 0x000034, "Member 'BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu::K2Node_CustomEvent_Tier' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu, K2Node_Event_bFromSubMenu) == 0x000038, "Member 'BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu::K2Node_Event_bFromSubMenu' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu, CallFunc_Greater_IntInt_ReturnValue) == 0x000039, "Member 'BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu, CallFunc_SetActiveInputWidget_InputWidget_CastInput) == 0x000040, "Member 'BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu::CallFunc_SetActiveInputWidget_InputWidget_CastInput' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu, K2Node_Event_InputType) == 0x000050, "Member 'BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu::K2Node_Event_InputType' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu, CallFunc_Get_ReturnValue_2) == 0x000058, "Member 'BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu::CallFunc_Get_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu, CallFunc_TryGetActiveBlastPassDefinition_OutDefinition) == 0x000060, "Member 'BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu::CallFunc_TryGetActiveBlastPassDefinition_OutDefinition' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu, CallFunc_TryGetActiveBlastPassDefinition_ReturnValue) == 0x0000C8, "Member 'BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu::CallFunc_TryGetActiveBlastPassDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu, CallFunc_GetBlastPassProgression_OutProgression) == 0x0000D0, "Member 'BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu::CallFunc_GetBlastPassProgression_OutProgression' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu, CallFunc_GetBlastPassProgression_ReturnValue) == 0x0000F8, "Member 'BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu::CallFunc_GetBlastPassProgression_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu, CallFunc_Get_ReturnValue_3) == 0x000100, "Member 'BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu::CallFunc_Get_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu, CallFunc_Add_IntInt_ReturnValue) == 0x000108, "Member 'BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu, CallFunc_IsActiveBlastPassSeasonOwned_ReturnValue) == 0x00010C, "Member 'BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu::CallFunc_IsActiveBlastPassSeasonOwned_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu, K2Node_Select_Default) == 0x000110, "Member 'BlastPassTierPurchaseMenu_C_ExecuteUbergraph_BlastPassTierPurchaseMenu::K2Node_Select_Default' has a wrong offset!");

// Function BlastPassTierPurchaseMenu.BlastPassTierPurchaseMenu_C.HandleInputDeviceChanged
// 0x0001 (0x0001 - 0x0000)
struct BlastPassTierPurchaseMenu_C_HandleInputDeviceChanged final
{
public:
	EPlayerInputType                              InputType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BlastPassTierPurchaseMenu_C_HandleInputDeviceChanged) == 0x000001, "Wrong alignment on BlastPassTierPurchaseMenu_C_HandleInputDeviceChanged");
static_assert(sizeof(BlastPassTierPurchaseMenu_C_HandleInputDeviceChanged) == 0x000001, "Wrong size on BlastPassTierPurchaseMenu_C_HandleInputDeviceChanged");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_HandleInputDeviceChanged, InputType) == 0x000000, "Member 'BlastPassTierPurchaseMenu_C_HandleInputDeviceChanged::InputType' has a wrong offset!");

// Function BlastPassTierPurchaseMenu.BlastPassTierPurchaseMenu_C.BP_OnEntered
// 0x0001 (0x0001 - 0x0000)
struct BlastPassTierPurchaseMenu_C_BP_OnEntered final
{
public:
	bool                                          bFromSubMenu;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BlastPassTierPurchaseMenu_C_BP_OnEntered) == 0x000001, "Wrong alignment on BlastPassTierPurchaseMenu_C_BP_OnEntered");
static_assert(sizeof(BlastPassTierPurchaseMenu_C_BP_OnEntered) == 0x000001, "Wrong size on BlastPassTierPurchaseMenu_C_BP_OnEntered");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_BP_OnEntered, bFromSubMenu) == 0x000000, "Member 'BlastPassTierPurchaseMenu_C_BP_OnEntered::bFromSubMenu' has a wrong offset!");

// Function BlastPassTierPurchaseMenu.BlastPassTierPurchaseMenu_C.SetTierToInit
// 0x0004 (0x0004 - 0x0000)
struct BlastPassTierPurchaseMenu_C_SetTierToInit final
{
public:
	int32                                         Tier;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BlastPassTierPurchaseMenu_C_SetTierToInit) == 0x000004, "Wrong alignment on BlastPassTierPurchaseMenu_C_SetTierToInit");
static_assert(sizeof(BlastPassTierPurchaseMenu_C_SetTierToInit) == 0x000004, "Wrong size on BlastPassTierPurchaseMenu_C_SetTierToInit");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_SetTierToInit, Tier) == 0x000000, "Member 'BlastPassTierPurchaseMenu_C_SetTierToInit::Tier' has a wrong offset!");

// Function BlastPassTierPurchaseMenu.BlastPassTierPurchaseMenu_C.HandleInput
// 0x0068 (0x0068 - 0x0000)
struct BlastPassTierPurchaseMenu_C_HandleInput final
{
public:
	EMarinerInputActions                          InInput;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HandleInput_ReturnValue;                  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_ChangeMaxDisplayedTier_ReturnValue;       // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ChangeMaxDisplayedTier_ReturnValue_1;     // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0028(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x003C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0050(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BlastPassTierPurchaseMenu_C_HandleInput) == 0x000008, "Wrong alignment on BlastPassTierPurchaseMenu_C_HandleInput");
static_assert(sizeof(BlastPassTierPurchaseMenu_C_HandleInput) == 0x000068, "Wrong size on BlastPassTierPurchaseMenu_C_HandleInput");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_HandleInput, InInput) == 0x000000, "Member 'BlastPassTierPurchaseMenu_C_HandleInput::InInput' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_HandleInput, ReturnValue) == 0x000001, "Member 'BlastPassTierPurchaseMenu_C_HandleInput::ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_HandleInput, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BlastPassTierPurchaseMenu_C_HandleInput::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_HandleInput, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'BlastPassTierPurchaseMenu_C_HandleInput::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_HandleInput, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000011, "Member 'BlastPassTierPurchaseMenu_C_HandleInput::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_HandleInput, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000012, "Member 'BlastPassTierPurchaseMenu_C_HandleInput::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_HandleInput, CallFunc_HandleInput_ReturnValue) == 0x000013, "Member 'BlastPassTierPurchaseMenu_C_HandleInput::CallFunc_HandleInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_HandleInput, Temp_delegate_Variable) == 0x000014, "Member 'BlastPassTierPurchaseMenu_C_HandleInput::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_HandleInput, CallFunc_ChangeMaxDisplayedTier_ReturnValue) == 0x000024, "Member 'BlastPassTierPurchaseMenu_C_HandleInput::CallFunc_ChangeMaxDisplayedTier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_HandleInput, CallFunc_ChangeMaxDisplayedTier_ReturnValue_1) == 0x000025, "Member 'BlastPassTierPurchaseMenu_C_HandleInput::CallFunc_ChangeMaxDisplayedTier_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_HandleInput, Temp_struct_Variable) == 0x000028, "Member 'BlastPassTierPurchaseMenu_C_HandleInput::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_HandleInput, CallFunc_PostEvent_ReturnValue) == 0x000038, "Member 'BlastPassTierPurchaseMenu_C_HandleInput::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_HandleInput, Temp_delegate_Variable_1) == 0x00003C, "Member 'BlastPassTierPurchaseMenu_C_HandleInput::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_HandleInput, Temp_struct_Variable_1) == 0x000050, "Member 'BlastPassTierPurchaseMenu_C_HandleInput::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_HandleInput, CallFunc_PostEvent_ReturnValue_1) == 0x000060, "Member 'BlastPassTierPurchaseMenu_C_HandleInput::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");

// Function BlastPassTierPurchaseMenu.BlastPassTierPurchaseMenu_C.UpdateTiersAndCostToPurchase
// 0x02D0 (0x02D0 - 0x0000)
struct BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoCMSManager*                       CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMangoBlastPassDefinition              CallFunc_TryGetActiveBlastPassDefinition_OutDefinition; // 0x0018(0x0068)()
	bool                                          CallFunc_TryGetActiveBlastPassDefinition_ReturnValue; // 0x0080(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTiersToPurchase_Tiers;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxDisplayedTier_ReturnValue;          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0090(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00D0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0110(0x0010)(ZeroConstructor, ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0120(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0160(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0178(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0190(0x0018)()
	int32                                         CallFunc_GetMinDisplayedTier_ReturnValue;          // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x01B0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x01C8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0208(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0248(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0258(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0268(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x0280(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBlastPassTierPurchaseCost_ReturnValue; // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x02A0(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x02B8(0x0018)()
};
static_assert(alignof(BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase) == 0x000008, "Wrong alignment on BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase");
static_assert(sizeof(BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase) == 0x0002D0, "Wrong size on BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase, Temp_bool_Variable) == 0x000000, "Member 'BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase, CallFunc_Get_ReturnValue) == 0x000008, "Member 'BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase, Temp_bool_Variable_1) == 0x000010, "Member 'BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase, CallFunc_TryGetActiveBlastPassDefinition_OutDefinition) == 0x000018, "Member 'BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase::CallFunc_TryGetActiveBlastPassDefinition_OutDefinition' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase, CallFunc_TryGetActiveBlastPassDefinition_ReturnValue) == 0x000080, "Member 'BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase::CallFunc_TryGetActiveBlastPassDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase, CallFunc_GetTiersToPurchase_Tiers) == 0x000084, "Member 'BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase::CallFunc_GetTiersToPurchase_Tiers' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase, CallFunc_GetMaxDisplayedTier_ReturnValue) == 0x000088, "Member 'BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase::CallFunc_GetMaxDisplayedTier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase, K2Node_MakeStruct_FormatArgumentData) == 0x000090, "Member 'BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000D0, "Member 'BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase, K2Node_MakeArray_Array) == 0x000110, "Member 'BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase, K2Node_MakeStruct_FormatArgumentData_2) == 0x000120, "Member 'BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase, CallFunc_Format_ReturnValue) == 0x000160, "Member 'BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase, K2Node_MakeArray_Array_1) == 0x000178, "Member 'BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000188, "Member 'BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase, CallFunc_Format_ReturnValue_1) == 0x000190, "Member 'BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase, CallFunc_GetMinDisplayedTier_ReturnValue) == 0x0001A8, "Member 'BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase::CallFunc_GetMinDisplayedTier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase, K2Node_Select_Default) == 0x0001B0, "Member 'BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase, K2Node_MakeStruct_FormatArgumentData_3) == 0x0001C8, "Member 'BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase, K2Node_MakeStruct_FormatArgumentData_4) == 0x000208, "Member 'BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase, K2Node_MakeArray_Array_2) == 0x000248, "Member 'BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase, K2Node_MakeArray_Array_3) == 0x000258, "Member 'BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase, CallFunc_Format_ReturnValue_2) == 0x000268, "Member 'BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase, CallFunc_Format_ReturnValue_3) == 0x000280, "Member 'BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000298, "Member 'BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase, CallFunc_GetBlastPassTierPurchaseCost_ReturnValue) == 0x00029C, "Member 'BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase::CallFunc_GetBlastPassTierPurchaseCost_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase, CallFunc_Conv_IntToText_ReturnValue) == 0x0002A0, "Member 'BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase, K2Node_Select_Default_1) == 0x0002B8, "Member 'BlastPassTierPurchaseMenu_C_UpdateTiersAndCostToPurchase::K2Node_Select_Default_1' has a wrong offset!");

// Function BlastPassTierPurchaseMenu.BlastPassTierPurchaseMenu_C.GetTiersToPurchase
// 0x0014 (0x0014 - 0x0000)
struct BlastPassTierPurchaseMenu_C_GetTiersToPurchase final
{
public:
	int32                                         Tiers;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxDisplayedTier_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMinDisplayedTier_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BlastPassTierPurchaseMenu_C_GetTiersToPurchase) == 0x000004, "Wrong alignment on BlastPassTierPurchaseMenu_C_GetTiersToPurchase");
static_assert(sizeof(BlastPassTierPurchaseMenu_C_GetTiersToPurchase) == 0x000014, "Wrong size on BlastPassTierPurchaseMenu_C_GetTiersToPurchase");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_GetTiersToPurchase, Tiers) == 0x000000, "Member 'BlastPassTierPurchaseMenu_C_GetTiersToPurchase::Tiers' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_GetTiersToPurchase, CallFunc_GetMaxDisplayedTier_ReturnValue) == 0x000004, "Member 'BlastPassTierPurchaseMenu_C_GetTiersToPurchase::CallFunc_GetMaxDisplayedTier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_GetTiersToPurchase, CallFunc_GetMinDisplayedTier_ReturnValue) == 0x000008, "Member 'BlastPassTierPurchaseMenu_C_GetTiersToPurchase::CallFunc_GetMinDisplayedTier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_GetTiersToPurchase, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'BlastPassTierPurchaseMenu_C_GetTiersToPurchase::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_GetTiersToPurchase, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BlastPassTierPurchaseMenu_C_GetTiersToPurchase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BlastPassTierPurchaseMenu.BlastPassTierPurchaseMenu_C.BeginPurchase
// 0x0098 (0x0098 - 0x0000)
struct BlastPassTierPurchaseMenu_C_BeginPurchase final
{
public:
	class UMarinerAsyncUIFlowHandler*             CallFunc_Get_ReturnValue;                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMangoCMSManager*                       CallFunc_Get_ReturnValue_1;                        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsyncFlowOffers_C*                     K2Node_DynamicCast_AsAsync_Flow_Offers;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMangoBlastPassDefinition              CallFunc_TryGetActiveBlastPassDefinition_OutDefinition; // 0x0020(0x0068)()
	bool                                          CallFunc_TryGetActiveBlastPassDefinition_ReturnValue; // 0x0088(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMinDisplayedTier_ReturnValue;          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxDisplayedTier_ReturnValue;          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BlastPassTierPurchaseMenu_C_BeginPurchase) == 0x000008, "Wrong alignment on BlastPassTierPurchaseMenu_C_BeginPurchase");
static_assert(sizeof(BlastPassTierPurchaseMenu_C_BeginPurchase) == 0x000098, "Wrong size on BlastPassTierPurchaseMenu_C_BeginPurchase");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_BeginPurchase, CallFunc_Get_ReturnValue) == 0x000000, "Member 'BlastPassTierPurchaseMenu_C_BeginPurchase::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassTierPurchaseMenu_C_BeginPurchase, CallFunc_Get_ReturnValue_1) == 0x000008, "Member 'BlastPassTierPurchaseMenu_C_BeginPurchase::CallFunc_Get_ReturnValue_1' has a wrong offset!");
