#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlastPassMenu

#include "Basic.hpp"

#include "Mariner_structs.hpp"
#include "MangoClient_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BlastPassMenu.BlastPassMenu_C.ExecuteUbergraph_BlastPassMenu
// 0x0120 (0x0120 - 0x0000)
struct BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMarinerInputInterface> CallFunc_SetActiveInputWidget_InputWidget_CastInput; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(struct FMangoBlastPassDefinition& Definition)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bToSubLayer;                          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerLayeredButton*                  K2Node_ComponentBoundEvent_Instance_1;             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFromSubMenu;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bOfferPurchased;                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerLayeredButton*                  K2Node_ComponentBoundEvent_Instance;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuStackLayer*                 CallFunc_PushLayerToActiveStack_ReturnValue;       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UMiniRewardButton_C* ButtonInstance)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class UMarinerAsyncUIFlowHandler*             CallFunc_Get_ReturnValue;                          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsyncFlowOffers_C*                     K2Node_DynamicCast_AsAsync_Flow_Offers;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerAsyncUIFlowHandler*             CallFunc_Get_ReturnValue_1;                        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsyncFlowOffers_C*                     K2Node_DynamicCast_AsAsync_Flow_Offers_1;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoBlastPassManager*                 CallFunc_Get_ReturnValue_2;                        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMangoBlastPassDefinition              K2Node_CustomEvent_Definition;                     // 0x00A0(0x0068)(ConstParm)
	class UMangoBlastPassManager*                 CallFunc_Get_ReturnValue_3;                        // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bOfferPurchased)>         K2Node_CreateDelegate_OutputDelegate_2;            // 0x0110(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu) == 0x000008, "Wrong alignment on BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu");
static_assert(sizeof(BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu) == 0x000120, "Wrong size on BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu");
static_assert(offsetof(BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu, EntryPoint) == 0x000000, "Member 'BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu, CallFunc_SetActiveInputWidget_InputWidget_CastInput) == 0x000008, "Member 'BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu::CallFunc_SetActiveInputWidget_InputWidget_CastInput' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu, K2Node_Event_bToSubLayer) == 0x000028, "Member 'BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu::K2Node_Event_bToSubLayer' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu, K2Node_ComponentBoundEvent_Instance_1) == 0x000030, "Member 'BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu::K2Node_ComponentBoundEvent_Instance_1' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu, K2Node_Event_bFromSubMenu) == 0x000038, "Member 'BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu::K2Node_Event_bFromSubMenu' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu, K2Node_CustomEvent_bOfferPurchased) == 0x000039, "Member 'BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu::K2Node_CustomEvent_bOfferPurchased' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu, K2Node_ComponentBoundEvent_Instance) == 0x000040, "Member 'BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu::K2Node_ComponentBoundEvent_Instance' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu, CallFunc_GetMenuManager_ReturnValue) == 0x000048, "Member 'BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu, CallFunc_PushLayerToActiveStack_ReturnValue) == 0x000050, "Member 'BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu::CallFunc_PushLayerToActiveStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000058, "Member 'BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu, CallFunc_Get_ReturnValue) == 0x000068, "Member 'BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu, K2Node_DynamicCast_AsAsync_Flow_Offers) == 0x000070, "Member 'BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu::K2Node_DynamicCast_AsAsync_Flow_Offers' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu, CallFunc_Get_ReturnValue_1) == 0x000080, "Member 'BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu, K2Node_DynamicCast_AsAsync_Flow_Offers_1) == 0x000088, "Member 'BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu::K2Node_DynamicCast_AsAsync_Flow_Offers_1' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu, CallFunc_Get_ReturnValue_2) == 0x000098, "Member 'BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu::CallFunc_Get_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu, K2Node_CustomEvent_Definition) == 0x0000A0, "Member 'BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu::K2Node_CustomEvent_Definition' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu, CallFunc_Get_ReturnValue_3) == 0x000108, "Member 'BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu::CallFunc_Get_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x000110, "Member 'BlastPassMenu_C_ExecuteUbergraph_BlastPassMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function BlastPassMenu.BlastPassMenu_C.OnSeasonChanged
// 0x0068 (0x0068 - 0x0000)
struct BlastPassMenu_C_OnSeasonChanged final
{
public:
	struct FMangoBlastPassDefinition              Definition;                                        // 0x0000(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BlastPassMenu_C_OnSeasonChanged) == 0x000008, "Wrong alignment on BlastPassMenu_C_OnSeasonChanged");
static_assert(sizeof(BlastPassMenu_C_OnSeasonChanged) == 0x000068, "Wrong size on BlastPassMenu_C_OnSeasonChanged");
static_assert(offsetof(BlastPassMenu_C_OnSeasonChanged, Definition) == 0x000000, "Member 'BlastPassMenu_C_OnSeasonChanged::Definition' has a wrong offset!");

// Function BlastPassMenu.BlastPassMenu_C.BndEvt__PurchaseToTierButton_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BlastPassMenu_C_BndEvt__PurchaseToTierButton_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature final
{
public:
	class UMarinerLayeredButton*                  Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BlastPassMenu_C_BndEvt__PurchaseToTierButton_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on BlastPassMenu_C_BndEvt__PurchaseToTierButton_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature");
static_assert(sizeof(BlastPassMenu_C_BndEvt__PurchaseToTierButton_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong size on BlastPassMenu_C_BndEvt__PurchaseToTierButton_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature");
static_assert(offsetof(BlastPassMenu_C_BndEvt__PurchaseToTierButton_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature, Instance) == 0x000000, "Member 'BlastPassMenu_C_BndEvt__PurchaseToTierButton_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature::Instance' has a wrong offset!");

// Function BlastPassMenu.BlastPassMenu_C.OnPurchaseFlowComplete
// 0x0001 (0x0001 - 0x0000)
struct BlastPassMenu_C_OnPurchaseFlowComplete final
{
public:
	bool                                          bOfferPurchased;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BlastPassMenu_C_OnPurchaseFlowComplete) == 0x000001, "Wrong alignment on BlastPassMenu_C_OnPurchaseFlowComplete");
static_assert(sizeof(BlastPassMenu_C_OnPurchaseFlowComplete) == 0x000001, "Wrong size on BlastPassMenu_C_OnPurchaseFlowComplete");
static_assert(offsetof(BlastPassMenu_C_OnPurchaseFlowComplete, bOfferPurchased) == 0x000000, "Member 'BlastPassMenu_C_OnPurchaseFlowComplete::bOfferPurchased' has a wrong offset!");

// Function BlastPassMenu.BlastPassMenu_C.BP_OnEntered
// 0x0001 (0x0001 - 0x0000)
struct BlastPassMenu_C_BP_OnEntered final
{
public:
	bool                                          bFromSubMenu;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BlastPassMenu_C_BP_OnEntered) == 0x000001, "Wrong alignment on BlastPassMenu_C_BP_OnEntered");
static_assert(sizeof(BlastPassMenu_C_BP_OnEntered) == 0x000001, "Wrong size on BlastPassMenu_C_BP_OnEntered");
static_assert(offsetof(BlastPassMenu_C_BP_OnEntered, bFromSubMenu) == 0x000000, "Member 'BlastPassMenu_C_BP_OnEntered::bFromSubMenu' has a wrong offset!");

// Function BlastPassMenu.BlastPassMenu_C.BndEvt__ActivatePassButton_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BlastPassMenu_C_BndEvt__ActivatePassButton_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature final
{
public:
	class UMarinerLayeredButton*                  Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BlastPassMenu_C_BndEvt__ActivatePassButton_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on BlastPassMenu_C_BndEvt__ActivatePassButton_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature");
static_assert(sizeof(BlastPassMenu_C_BndEvt__ActivatePassButton_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong size on BlastPassMenu_C_BndEvt__ActivatePassButton_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature");
static_assert(offsetof(BlastPassMenu_C_BndEvt__ActivatePassButton_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature, Instance) == 0x000000, "Member 'BlastPassMenu_C_BndEvt__ActivatePassButton_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature::Instance' has a wrong offset!");

// Function BlastPassMenu.BlastPassMenu_C.BP_OnExited
// 0x0001 (0x0001 - 0x0000)
struct BlastPassMenu_C_BP_OnExited final
{
public:
	bool                                          bToSubLayer;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BlastPassMenu_C_BP_OnExited) == 0x000001, "Wrong alignment on BlastPassMenu_C_BP_OnExited");
static_assert(sizeof(BlastPassMenu_C_BP_OnExited) == 0x000001, "Wrong size on BlastPassMenu_C_BP_OnExited");
static_assert(offsetof(BlastPassMenu_C_BP_OnExited, bToSubLayer) == 0x000000, "Member 'BlastPassMenu_C_BP_OnExited::bToSubLayer' has a wrong offset!");

// Function BlastPassMenu.BlastPassMenu_C.BuildMenu
// 0x00F0 (0x00F0 - 0x0000)
struct BlastPassMenu_C_BuildMenu final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoCMSManager*                       CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMangoPlayerManager*                    CallFunc_Get_ReturnValue_1;                        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActiveBlastPassAtMaxTier_ReturnValue;   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoPlayerManager*                    CallFunc_Get_ReturnValue_2;                        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMangoBlastPassProgression             CallFunc_GetActiveBlastPassProgression_OutProgression; // 0x0028(0x0028)()
	bool                                          CallFunc_GetActiveBlastPassProgression_ReturnValue; // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBlastPassMaxTier_OutMaxTier;           // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBlastPassMaxTier_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoInventoryManager*                 CallFunc_Get_ReturnValue_3;                        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActiveBlastPassSeasonOwned_ReturnValue; // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoCMSManager*                       CallFunc_Get_ReturnValue_4;                        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMangoBlastPassDefinition              CallFunc_TryGetActiveBlastPassDefinition_OutDefinition; // 0x0080(0x0068)()
	bool                                          CallFunc_TryGetActiveBlastPassDefinition_ReturnValue; // 0x00E8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BlastPassMenu_C_BuildMenu) == 0x000008, "Wrong alignment on BlastPassMenu_C_BuildMenu");
static_assert(sizeof(BlastPassMenu_C_BuildMenu) == 0x0000F0, "Wrong size on BlastPassMenu_C_BuildMenu");
static_assert(offsetof(BlastPassMenu_C_BuildMenu, Temp_byte_Variable) == 0x000000, "Member 'BlastPassMenu_C_BuildMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_BuildMenu, CallFunc_Get_ReturnValue) == 0x000008, "Member 'BlastPassMenu_C_BuildMenu::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_BuildMenu, CallFunc_Get_ReturnValue_1) == 0x000010, "Member 'BlastPassMenu_C_BuildMenu::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_BuildMenu, CallFunc_IsActiveBlastPassAtMaxTier_ReturnValue) == 0x000018, "Member 'BlastPassMenu_C_BuildMenu::CallFunc_IsActiveBlastPassAtMaxTier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_BuildMenu, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'BlastPassMenu_C_BuildMenu::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_BuildMenu, Temp_byte_Variable_1) == 0x00001A, "Member 'BlastPassMenu_C_BuildMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_BuildMenu, Temp_bool_Variable) == 0x00001B, "Member 'BlastPassMenu_C_BuildMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_BuildMenu, Temp_byte_Variable_2) == 0x00001C, "Member 'BlastPassMenu_C_BuildMenu::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_BuildMenu, CallFunc_Get_ReturnValue_2) == 0x000020, "Member 'BlastPassMenu_C_BuildMenu::CallFunc_Get_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_BuildMenu, CallFunc_GetActiveBlastPassProgression_OutProgression) == 0x000028, "Member 'BlastPassMenu_C_BuildMenu::CallFunc_GetActiveBlastPassProgression_OutProgression' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_BuildMenu, CallFunc_GetActiveBlastPassProgression_ReturnValue) == 0x000050, "Member 'BlastPassMenu_C_BuildMenu::CallFunc_GetActiveBlastPassProgression_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_BuildMenu, Temp_byte_Variable_3) == 0x000051, "Member 'BlastPassMenu_C_BuildMenu::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_BuildMenu, CallFunc_GetBlastPassMaxTier_OutMaxTier) == 0x000054, "Member 'BlastPassMenu_C_BuildMenu::CallFunc_GetBlastPassMaxTier_OutMaxTier' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_BuildMenu, CallFunc_GetBlastPassMaxTier_ReturnValue) == 0x000058, "Member 'BlastPassMenu_C_BuildMenu::CallFunc_GetBlastPassMaxTier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_BuildMenu, CallFunc_Get_ReturnValue_3) == 0x000060, "Member 'BlastPassMenu_C_BuildMenu::CallFunc_Get_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_BuildMenu, CallFunc_IsActiveBlastPassSeasonOwned_ReturnValue) == 0x000068, "Member 'BlastPassMenu_C_BuildMenu::CallFunc_IsActiveBlastPassSeasonOwned_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_BuildMenu, CallFunc_BooleanAND_ReturnValue) == 0x000069, "Member 'BlastPassMenu_C_BuildMenu::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_BuildMenu, K2Node_Select_Default) == 0x00006A, "Member 'BlastPassMenu_C_BuildMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_BuildMenu, Temp_bool_Variable_1) == 0x00006B, "Member 'BlastPassMenu_C_BuildMenu::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_BuildMenu, CallFunc_Get_ReturnValue_4) == 0x000070, "Member 'BlastPassMenu_C_BuildMenu::CallFunc_Get_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_BuildMenu, K2Node_Select_Default_1) == 0x000078, "Member 'BlastPassMenu_C_BuildMenu::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_BuildMenu, CallFunc_TryGetActiveBlastPassDefinition_OutDefinition) == 0x000080, "Member 'BlastPassMenu_C_BuildMenu::CallFunc_TryGetActiveBlastPassDefinition_OutDefinition' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_BuildMenu, CallFunc_TryGetActiveBlastPassDefinition_ReturnValue) == 0x0000E8, "Member 'BlastPassMenu_C_BuildMenu::CallFunc_TryGetActiveBlastPassDefinition_ReturnValue' has a wrong offset!");

// Function BlastPassMenu.BlastPassMenu_C.ActivatePass
// 0x0090 (0x0090 - 0x0000)
struct BlastPassMenu_C_ActivatePass final
{
public:
	class UMarinerAsyncUIFlowHandler*             CallFunc_Get_ReturnValue;                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMangoCMSManager*                       CallFunc_Get_ReturnValue_1;                        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsyncFlowOffers_C*                     K2Node_DynamicCast_AsAsync_Flow_Offers;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMangoBlastPassDefinition              CallFunc_TryGetActiveBlastPassDefinition_OutDefinition; // 0x0020(0x0068)()
	bool                                          CallFunc_TryGetActiveBlastPassDefinition_ReturnValue; // 0x0088(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BlastPassMenu_C_ActivatePass) == 0x000008, "Wrong alignment on BlastPassMenu_C_ActivatePass");
static_assert(sizeof(BlastPassMenu_C_ActivatePass) == 0x000090, "Wrong size on BlastPassMenu_C_ActivatePass");
static_assert(offsetof(BlastPassMenu_C_ActivatePass, CallFunc_Get_ReturnValue) == 0x000000, "Member 'BlastPassMenu_C_ActivatePass::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_ActivatePass, CallFunc_Get_ReturnValue_1) == 0x000008, "Member 'BlastPassMenu_C_ActivatePass::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_ActivatePass, K2Node_DynamicCast_AsAsync_Flow_Offers) == 0x000010, "Member 'BlastPassMenu_C_ActivatePass::K2Node_DynamicCast_AsAsync_Flow_Offers' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_ActivatePass, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BlastPassMenu_C_ActivatePass::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_ActivatePass, CallFunc_TryGetActiveBlastPassDefinition_OutDefinition) == 0x000020, "Member 'BlastPassMenu_C_ActivatePass::CallFunc_TryGetActiveBlastPassDefinition_OutDefinition' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_ActivatePass, CallFunc_TryGetActiveBlastPassDefinition_ReturnValue) == 0x000088, "Member 'BlastPassMenu_C_ActivatePass::CallFunc_TryGetActiveBlastPassDefinition_ReturnValue' has a wrong offset!");

// Function BlastPassMenu.BlastPassMenu_C.HandleInput
// 0x0020 (0x0020 - 0x0000)
struct BlastPassMenu_C_HandleInput final
{
public:
	EMarinerInputActions                          InInput;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HandleInput_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMarinerInputInterface> CallFunc_HandleInput_self_CastInput;               // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HandleInput_ReturnValue_1;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsChangePageInput_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BlastPassMenu_C_HandleInput) == 0x000008, "Wrong alignment on BlastPassMenu_C_HandleInput");
static_assert(sizeof(BlastPassMenu_C_HandleInput) == 0x000020, "Wrong size on BlastPassMenu_C_HandleInput");
static_assert(offsetof(BlastPassMenu_C_HandleInput, InInput) == 0x000000, "Member 'BlastPassMenu_C_HandleInput::InInput' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_HandleInput, ReturnValue) == 0x000001, "Member 'BlastPassMenu_C_HandleInput::ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_HandleInput, CallFunc_HandleInput_ReturnValue) == 0x000002, "Member 'BlastPassMenu_C_HandleInput::CallFunc_HandleInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_HandleInput, CallFunc_HandleInput_self_CastInput) == 0x000008, "Member 'BlastPassMenu_C_HandleInput::CallFunc_HandleInput_self_CastInput' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_HandleInput, CallFunc_HandleInput_ReturnValue_1) == 0x000018, "Member 'BlastPassMenu_C_HandleInput::CallFunc_HandleInput_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_HandleInput, CallFunc_IsChangePageInput_ReturnValue) == 0x000019, "Member 'BlastPassMenu_C_HandleInput::CallFunc_IsChangePageInput_ReturnValue' has a wrong offset!");

// Function BlastPassMenu.BlastPassMenu_C.OnProgressionButtonSelected
// 0x0180 (0x0180 - 0x0000)
struct BlastPassMenu_C_OnProgressionButtonSelected final
{
public:
	class UMiniRewardButton_C*                    ButtonInstance;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMangoCMSManager*                       CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMarinerUIItemButtonData               CallFunc_GetUIItemButtonData_ReturnValue;          // 0x0010(0x0070)(ConstParm)
	struct FMangoBlastPassDefinition              CallFunc_TryGetActiveBlastPassDefinition_OutDefinition; // 0x0080(0x0068)()
	bool                                          CallFunc_TryGetActiveBlastPassDefinition_ReturnValue; // 0x00E8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoInventoryManager*                 CallFunc_Get_ReturnValue_1;                        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMangoPlayerManager*                    CallFunc_Get_ReturnValue_2;                        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBlastPassOwned_ReturnValue;             // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMangoBlastPassProgression             CallFunc_GetBlastPassProgression_OutProgression;   // 0x0108(0x0028)()
	bool                                          CallFunc_GetBlastPassProgression_ReturnValue;      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerAsyncUIFlowHandler*             CallFunc_Get_ReturnValue_3;                        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncFlowOffers_C*                     K2Node_DynamicCast_AsAsync_Flow_Offers;            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue;               // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuStackLayer*                 CallFunc_GetLayerByClass_ReturnValue;              // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuStackLayer*                 CallFunc_PushLayerToActiveStack_ReturnValue;       // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlastPassTierPurchaseMenu_C*           K2Node_DynamicCast_AsBlast_Pass_Tier_Purchase_Menu; // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BlastPassMenu_C_OnProgressionButtonSelected) == 0x000008, "Wrong alignment on BlastPassMenu_C_OnProgressionButtonSelected");
static_assert(sizeof(BlastPassMenu_C_OnProgressionButtonSelected) == 0x000180, "Wrong size on BlastPassMenu_C_OnProgressionButtonSelected");
static_assert(offsetof(BlastPassMenu_C_OnProgressionButtonSelected, ButtonInstance) == 0x000000, "Member 'BlastPassMenu_C_OnProgressionButtonSelected::ButtonInstance' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_OnProgressionButtonSelected, CallFunc_Get_ReturnValue) == 0x000008, "Member 'BlastPassMenu_C_OnProgressionButtonSelected::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_OnProgressionButtonSelected, CallFunc_GetUIItemButtonData_ReturnValue) == 0x000010, "Member 'BlastPassMenu_C_OnProgressionButtonSelected::CallFunc_GetUIItemButtonData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_OnProgressionButtonSelected, CallFunc_TryGetActiveBlastPassDefinition_OutDefinition) == 0x000080, "Member 'BlastPassMenu_C_OnProgressionButtonSelected::CallFunc_TryGetActiveBlastPassDefinition_OutDefinition' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_OnProgressionButtonSelected, CallFunc_TryGetActiveBlastPassDefinition_ReturnValue) == 0x0000E8, "Member 'BlastPassMenu_C_OnProgressionButtonSelected::CallFunc_TryGetActiveBlastPassDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_OnProgressionButtonSelected, CallFunc_Get_ReturnValue_1) == 0x0000F0, "Member 'BlastPassMenu_C_OnProgressionButtonSelected::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_OnProgressionButtonSelected, CallFunc_Get_ReturnValue_2) == 0x0000F8, "Member 'BlastPassMenu_C_OnProgressionButtonSelected::CallFunc_Get_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_OnProgressionButtonSelected, CallFunc_IsBlastPassOwned_ReturnValue) == 0x000100, "Member 'BlastPassMenu_C_OnProgressionButtonSelected::CallFunc_IsBlastPassOwned_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_OnProgressionButtonSelected, CallFunc_GetBlastPassProgression_OutProgression) == 0x000108, "Member 'BlastPassMenu_C_OnProgressionButtonSelected::CallFunc_GetBlastPassProgression_OutProgression' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_OnProgressionButtonSelected, CallFunc_GetBlastPassProgression_ReturnValue) == 0x000130, "Member 'BlastPassMenu_C_OnProgressionButtonSelected::CallFunc_GetBlastPassProgression_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_OnProgressionButtonSelected, CallFunc_Get_ReturnValue_3) == 0x000138, "Member 'BlastPassMenu_C_OnProgressionButtonSelected::CallFunc_Get_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_OnProgressionButtonSelected, CallFunc_Greater_IntInt_ReturnValue) == 0x000140, "Member 'BlastPassMenu_C_OnProgressionButtonSelected::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_OnProgressionButtonSelected, K2Node_DynamicCast_AsAsync_Flow_Offers) == 0x000148, "Member 'BlastPassMenu_C_OnProgressionButtonSelected::K2Node_DynamicCast_AsAsync_Flow_Offers' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_OnProgressionButtonSelected, K2Node_DynamicCast_bSuccess) == 0x000150, "Member 'BlastPassMenu_C_OnProgressionButtonSelected::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_OnProgressionButtonSelected, CallFunc_GetMenuManager_ReturnValue) == 0x000158, "Member 'BlastPassMenu_C_OnProgressionButtonSelected::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_OnProgressionButtonSelected, CallFunc_GetLayerByClass_ReturnValue) == 0x000160, "Member 'BlastPassMenu_C_OnProgressionButtonSelected::CallFunc_GetLayerByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_OnProgressionButtonSelected, CallFunc_PushLayerToActiveStack_ReturnValue) == 0x000168, "Member 'BlastPassMenu_C_OnProgressionButtonSelected::CallFunc_PushLayerToActiveStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_OnProgressionButtonSelected, K2Node_DynamicCast_AsBlast_Pass_Tier_Purchase_Menu) == 0x000170, "Member 'BlastPassMenu_C_OnProgressionButtonSelected::K2Node_DynamicCast_AsBlast_Pass_Tier_Purchase_Menu' has a wrong offset!");
static_assert(offsetof(BlastPassMenu_C_OnProgressionButtonSelected, K2Node_DynamicCast_bSuccess_1) == 0x000178, "Member 'BlastPassMenu_C_OnProgressionButtonSelected::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BlastPassMenu.BlastPassMenu_C.SetStartingTier
// 0x0004 (0x0004 - 0x0000)
struct BlastPassMenu_C_SetStartingTier final
{
public:
	int32                                         Tier;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BlastPassMenu_C_SetStartingTier) == 0x000004, "Wrong alignment on BlastPassMenu_C_SetStartingTier");
static_assert(sizeof(BlastPassMenu_C_SetStartingTier) == 0x000004, "Wrong size on BlastPassMenu_C_SetStartingTier");
static_assert(offsetof(BlastPassMenu_C_SetStartingTier, Tier) == 0x000000, "Member 'BlastPassMenu_C_SetStartingTier::Tier' has a wrong offset!");

}

