#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlastPassSplashMessageBox

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BlastPassSplashMessageBox.BlastPassSplashMessageBox_C
// 0x0038 (0x04C8 - 0x0490)
class UBlastPassSplashMessageBox_C final : public UMarinerMessageBox
{
public:
	class UImage*                                 Center;                                            // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_228;                                         // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_313;                                         // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_349;                                         // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Material;                                          // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OpacityBacker;                                     // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopBar;                                            // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BlastPassSplashMessageBox_C">();
	}
	static class UBlastPassSplashMessageBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlastPassSplashMessageBox_C>();
	}
};
static_assert(alignof(UBlastPassSplashMessageBox_C) == 0x000008, "Wrong alignment on UBlastPassSplashMessageBox_C");
static_assert(sizeof(UBlastPassSplashMessageBox_C) == 0x0004C8, "Wrong size on UBlastPassSplashMessageBox_C");
static_assert(offsetof(UBlastPassSplashMessageBox_C, Center) == 0x000490, "Member 'UBlastPassSplashMessageBox_C::Center' has a wrong offset!");
static_assert(offsetof(UBlastPassSplashMessageBox_C, Image_228) == 0x000498, "Member 'UBlastPassSplashMessageBox_C::Image_228' has a wrong offset!");
static_assert(offsetof(UBlastPassSplashMessageBox_C, Image_313) == 0x0004A0, "Member 'UBlastPassSplashMessageBox_C::Image_313' has a wrong offset!");
static_assert(offsetof(UBlastPassSplashMessageBox_C, Image_349) == 0x0004A8, "Member 'UBlastPassSplashMessageBox_C::Image_349' has a wrong offset!");
static_assert(offsetof(UBlastPassSplashMessageBox_C, Material) == 0x0004B0, "Member 'UBlastPassSplashMessageBox_C::Material' has a wrong offset!");
static_assert(offsetof(UBlastPassSplashMessageBox_C, OpacityBacker) == 0x0004B8, "Member 'UBlastPassSplashMessageBox_C::OpacityBacker' has a wrong offset!");
static_assert(offsetof(UBlastPassSplashMessageBox_C, TopBar) == 0x0004C0, "Member 'UBlastPassSplashMessageBox_C::TopBar' has a wrong offset!");

}

