#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlastPassTierPurchaseMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_structs.hpp"
#include "Mariner_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BlastPassTierPurchaseMenu.BlastPassTierPurchaseMenu_C
// 0x0098 (0x0578 - 0x04E0)
class UBlastPassTierPurchaseMenu_C final : public UMarinerMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BasicBG;                                           // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 bgimage;                                           // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBlastPassTierWidget_C*                 BlastPassTierWidget;                               // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CurrencyText;                                      // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPrompt_C*                       DefaultPrompt;                                     // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Divider;                                           // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FreeBar;                                           // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Header;                                            // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PremiumBar;                                        // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PremiumBG;                                         // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressionBlastPassWidget_C*          ProgressionBlastPassWidget;                        // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerVerticalBox*                    RootPanel;                                         // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChangeTierWidget_C*                    TierDownWidget;                                    // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TiersToPurchase;                                   // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChangeTierWidget_C*                    TierUpWidget;                                      // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Uicontainer;                                       // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Uicontainer_1;                                     // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         TierToInit;                                        // 0x0570(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BlastPassTierPurchaseMenu(int32 EntryPoint);
	void BndEvt__TierDownWidget_K2Node_ComponentBoundEvent_2_OnSelected__DelegateSignature();
	void BndEvt__TierUpWidget_K2Node_ComponentBoundEvent_0_OnSelected__DelegateSignature();
	void HandleInputDeviceChanged(EPlayerInputType InputType);
	void BP_OnEntered(bool bFromSubMenu);
	void SetTierToInit(int32 Tier);
	void OnProfileRefreshed();
	bool HandleInput(EMarinerInputActions InInput);
	void UpdateTiersAndCostToPurchase();
	void GetTiersToPurchase(int32* Tiers);
	void BeginPurchase();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BlastPassTierPurchaseMenu_C">();
	}
	static class UBlastPassTierPurchaseMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlastPassTierPurchaseMenu_C>();
	}
};
static_assert(alignof(UBlastPassTierPurchaseMenu_C) == 0x000008, "Wrong alignment on UBlastPassTierPurchaseMenu_C");
static_assert(sizeof(UBlastPassTierPurchaseMenu_C) == 0x000578, "Wrong size on UBlastPassTierPurchaseMenu_C");
static_assert(offsetof(UBlastPassTierPurchaseMenu_C, UberGraphFrame) == 0x0004E0, "Member 'UBlastPassTierPurchaseMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBlastPassTierPurchaseMenu_C, BasicBG) == 0x0004E8, "Member 'UBlastPassTierPurchaseMenu_C::BasicBG' has a wrong offset!");
static_assert(offsetof(UBlastPassTierPurchaseMenu_C, bgimage) == 0x0004F0, "Member 'UBlastPassTierPurchaseMenu_C::bgimage' has a wrong offset!");
static_assert(offsetof(UBlastPassTierPurchaseMenu_C, BlastPassTierWidget) == 0x0004F8, "Member 'UBlastPassTierPurchaseMenu_C::BlastPassTierWidget' has a wrong offset!");
static_assert(offsetof(UBlastPassTierPurchaseMenu_C, CurrencyText) == 0x000500, "Member 'UBlastPassTierPurchaseMenu_C::CurrencyText' has a wrong offset!");
static_assert(offsetof(UBlastPassTierPurchaseMenu_C, DefaultPrompt) == 0x000508, "Member 'UBlastPassTierPurchaseMenu_C::DefaultPrompt' has a wrong offset!");
static_assert(offsetof(UBlastPassTierPurchaseMenu_C, Divider) == 0x000510, "Member 'UBlastPassTierPurchaseMenu_C::Divider' has a wrong offset!");
static_assert(offsetof(UBlastPassTierPurchaseMenu_C, FreeBar) == 0x000518, "Member 'UBlastPassTierPurchaseMenu_C::FreeBar' has a wrong offset!");
static_assert(offsetof(UBlastPassTierPurchaseMenu_C, Header) == 0x000520, "Member 'UBlastPassTierPurchaseMenu_C::Header' has a wrong offset!");
static_assert(offsetof(UBlastPassTierPurchaseMenu_C, PremiumBar) == 0x000528, "Member 'UBlastPassTierPurchaseMenu_C::PremiumBar' has a wrong offset!");
static_assert(offsetof(UBlastPassTierPurchaseMenu_C, PremiumBG) == 0x000530, "Member 'UBlastPassTierPurchaseMenu_C::PremiumBG' has a wrong offset!");
static_assert(offsetof(UBlastPassTierPurchaseMenu_C, ProgressionBlastPassWidget) == 0x000538, "Member 'UBlastPassTierPurchaseMenu_C::ProgressionBlastPassWidget' has a wrong offset!");
static_assert(offsetof(UBlastPassTierPurchaseMenu_C, RootPanel) == 0x000540, "Member 'UBlastPassTierPurchaseMenu_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UBlastPassTierPurchaseMenu_C, TierDownWidget) == 0x000548, "Member 'UBlastPassTierPurchaseMenu_C::TierDownWidget' has a wrong offset!");
static_assert(offsetof(UBlastPassTierPurchaseMenu_C, TiersToPurchase) == 0x000550, "Member 'UBlastPassTierPurchaseMenu_C::TiersToPurchase' has a wrong offset!");
static_assert(offsetof(UBlastPassTierPurchaseMenu_C, TierUpWidget) == 0x000558, "Member 'UBlastPassTierPurchaseMenu_C::TierUpWidget' has a wrong offset!");
static_assert(offsetof(UBlastPassTierPurchaseMenu_C, Uicontainer) == 0x000560, "Member 'UBlastPassTierPurchaseMenu_C::Uicontainer' has a wrong offset!");
static_assert(offsetof(UBlastPassTierPurchaseMenu_C, Uicontainer_1) == 0x000568, "Member 'UBlastPassTierPurchaseMenu_C::Uicontainer_1' has a wrong offset!");
static_assert(offsetof(UBlastPassTierPurchaseMenu_C, TierToInit) == 0x000570, "Member 'UBlastPassTierPurchaseMenu_C::TierToInit' has a wrong offset!");

}

