#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ConsumableItem

#include "Basic.hpp"

#include "ItemBoxPayload_structs.hpp"
#include "Engine_structs.hpp"
#include "ItemBoxTypes_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_MarinerItem_classes.hpp"
#include "Mariner_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ConsumableItem.BP_ConsumableItem_C
// 0x0090 (0x0730 - 0x06A0)
class ABP_ConsumableItem_C final : public ABP_MarinerItem_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_ConsumableItem_C;                // 0x06A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         AnimateSpawn_Progress_D79DC263437152A3ADD47391A466C08E; // 0x06A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            AnimateSpawn__Direction_D79DC263437152A3ADD47391A466C08E; // 0x06AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_278E[0x3];                                     // 0x06AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     AnimateSpawn;                                      // 0x06B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ItemBoxScale;                                      // 0x06B8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_278F[0x4];                                     // 0x06C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemBoxPayload                        ItemBoxRepPayload;                                 // 0x06C8(0x0020)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCurrentlyInItemBox;                              // 0x06E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsOnSpawnPoint;                                    // 0x06E9(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2790[0x6];                                     // 0x06EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            ItemBoxMesh;                                       // 0x06F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableDynamicCollisionsOnPickup;                   // 0x06F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2791[0x7];                                     // 0x06F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        ItemBoxThrusterEmitter;                            // 0x0700(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ItemBoxThrusterOffset;                             // 0x0708(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ItemBoxThrusterRotation;                           // 0x0714(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                ItemBoxThrusterScale;                              // 0x0720(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ConsumableItem(int32 EntryPoint);
	void BP_DisabledToPool();
	void BP_EnabledFromPool();
	void RealityChanged(EMarinerRealityState OldReality, EMarinerRealityState NewReality);
	void ReceiveBeginPlay();
	void OnWillPickUp();
	void AnimateSpawn__UpdateFunc();
	void AnimateSpawn__FinishedFunc();
	void ResetStaticMesh();
	void ServerSetItemBoxType(EItemBoxTypes ItemBoxType);
	void OnRep_ItemBoxRepPayload();
	void SetupItemBoxMesh(EItemBoxTypes ItemBoxType);
	void SetupItemBoxMaterial(EItemBoxTypes ItemBoxType);
	void HandleItemSpecificRealityChange(EMarinerRealityState NewReality);
	void Swap_To_item_Box_Materials();
	void ResetDefaultStaticMeshValues();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ConsumableItem_C">();
	}
	static class ABP_ConsumableItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ConsumableItem_C>();
	}
};
static_assert(alignof(ABP_ConsumableItem_C) == 0x000008, "Wrong alignment on ABP_ConsumableItem_C");
static_assert(sizeof(ABP_ConsumableItem_C) == 0x000730, "Wrong size on ABP_ConsumableItem_C");
static_assert(offsetof(ABP_ConsumableItem_C, UberGraphFrame_BP_ConsumableItem_C) == 0x0006A0, "Member 'ABP_ConsumableItem_C::UberGraphFrame_BP_ConsumableItem_C' has a wrong offset!");
static_assert(offsetof(ABP_ConsumableItem_C, AnimateSpawn_Progress_D79DC263437152A3ADD47391A466C08E) == 0x0006A8, "Member 'ABP_ConsumableItem_C::AnimateSpawn_Progress_D79DC263437152A3ADD47391A466C08E' has a wrong offset!");
static_assert(offsetof(ABP_ConsumableItem_C, AnimateSpawn__Direction_D79DC263437152A3ADD47391A466C08E) == 0x0006AC, "Member 'ABP_ConsumableItem_C::AnimateSpawn__Direction_D79DC263437152A3ADD47391A466C08E' has a wrong offset!");
static_assert(offsetof(ABP_ConsumableItem_C, AnimateSpawn) == 0x0006B0, "Member 'ABP_ConsumableItem_C::AnimateSpawn' has a wrong offset!");
static_assert(offsetof(ABP_ConsumableItem_C, ItemBoxScale) == 0x0006B8, "Member 'ABP_ConsumableItem_C::ItemBoxScale' has a wrong offset!");
static_assert(offsetof(ABP_ConsumableItem_C, ItemBoxRepPayload) == 0x0006C8, "Member 'ABP_ConsumableItem_C::ItemBoxRepPayload' has a wrong offset!");
static_assert(offsetof(ABP_ConsumableItem_C, IsCurrentlyInItemBox) == 0x0006E8, "Member 'ABP_ConsumableItem_C::IsCurrentlyInItemBox' has a wrong offset!");
static_assert(offsetof(ABP_ConsumableItem_C, IsOnSpawnPoint) == 0x0006E9, "Member 'ABP_ConsumableItem_C::IsOnSpawnPoint' has a wrong offset!");
static_assert(offsetof(ABP_ConsumableItem_C, ItemBoxMesh) == 0x0006F0, "Member 'ABP_ConsumableItem_C::ItemBoxMesh' has a wrong offset!");
static_assert(offsetof(ABP_ConsumableItem_C, EnableDynamicCollisionsOnPickup) == 0x0006F8, "Member 'ABP_ConsumableItem_C::EnableDynamicCollisionsOnPickup' has a wrong offset!");
static_assert(offsetof(ABP_ConsumableItem_C, ItemBoxThrusterEmitter) == 0x000700, "Member 'ABP_ConsumableItem_C::ItemBoxThrusterEmitter' has a wrong offset!");
static_assert(offsetof(ABP_ConsumableItem_C, ItemBoxThrusterOffset) == 0x000708, "Member 'ABP_ConsumableItem_C::ItemBoxThrusterOffset' has a wrong offset!");
static_assert(offsetof(ABP_ConsumableItem_C, ItemBoxThrusterRotation) == 0x000714, "Member 'ABP_ConsumableItem_C::ItemBoxThrusterRotation' has a wrong offset!");
static_assert(offsetof(ABP_ConsumableItem_C, ItemBoxThrusterScale) == 0x000720, "Member 'ABP_ConsumableItem_C::ItemBoxThrusterScale' has a wrong offset!");

}

