#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ConsumableItem

#include "Basic.hpp"

#include "Mariner_structs.hpp"
#include "ItemBoxTypes_structs.hpp"
#include "ItemBoxPayload_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_ConsumableItem.BP_ConsumableItem_C.ExecuteUbergraph_BP_ConsumableItem
// 0x0090 (0x0090 - 0x0000)
struct BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0018(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0028(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0038(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EMarinerRealityState OldReality, EMarinerRealityState NewReality)> K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerRealityObjectManager*           CallFunc_GetRealityManager_ReturnValue;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMarinerRealityState                          CallFunc_GetCurrentReality_ReturnValue;            // 0x007C(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMarinerRealityState                          K2Node_CustomEvent_OldReality;                     // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMarinerRealityState                          K2Node_CustomEvent_NewReality;                     // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldItemUsePool_ReturnValue;            // 0x007F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerRealityObjectManager*           CallFunc_GetRealityManager_ReturnValue_1;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem) == 0x000008, "Wrong alignment on BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem");
static_assert(sizeof(BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem) == 0x000090, "Wrong size on BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem");
static_assert(offsetof(BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem, EntryPoint) == 0x000000, "Member 'BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem, Temp_struct_Variable) == 0x000008, "Member 'BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem, Temp_delegate_Variable) == 0x000018, "Member 'BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem, Temp_struct_Variable_1) == 0x000028, "Member 'BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem, Temp_delegate_Variable_1) == 0x000038, "Member 'BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00005C, "Member 'BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem, CallFunc_PostEventAtLocation_ReturnValue) == 0x000068, "Member 'BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem, CallFunc_GetRealityManager_ReturnValue) == 0x000070, "Member 'BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem::CallFunc_GetRealityManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem, CallFunc_PostEvent_ReturnValue) == 0x000078, "Member 'BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem, CallFunc_GetCurrentReality_ReturnValue) == 0x00007C, "Member 'BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem::CallFunc_GetCurrentReality_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem, K2Node_CustomEvent_OldReality) == 0x00007D, "Member 'BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem::K2Node_CustomEvent_OldReality' has a wrong offset!");
static_assert(offsetof(BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem, K2Node_CustomEvent_NewReality) == 0x00007E, "Member 'BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem::K2Node_CustomEvent_NewReality' has a wrong offset!");
static_assert(offsetof(BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem, CallFunc_ShouldItemUsePool_ReturnValue) == 0x00007F, "Member 'BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem::CallFunc_ShouldItemUsePool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem, CallFunc_PostEvent_ReturnValue_1) == 0x000080, "Member 'BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem, CallFunc_GetRealityManager_ReturnValue_1) == 0x000088, "Member 'BP_ConsumableItem_C_ExecuteUbergraph_BP_ConsumableItem::CallFunc_GetRealityManager_ReturnValue_1' has a wrong offset!");

// Function BP_ConsumableItem.BP_ConsumableItem_C.RealityChanged
// 0x0002 (0x0002 - 0x0000)
struct BP_ConsumableItem_C_RealityChanged final
{
public:
	EMarinerRealityState                          OldReality;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMarinerRealityState                          NewReality;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConsumableItem_C_RealityChanged) == 0x000001, "Wrong alignment on BP_ConsumableItem_C_RealityChanged");
static_assert(sizeof(BP_ConsumableItem_C_RealityChanged) == 0x000002, "Wrong size on BP_ConsumableItem_C_RealityChanged");
static_assert(offsetof(BP_ConsumableItem_C_RealityChanged, OldReality) == 0x000000, "Member 'BP_ConsumableItem_C_RealityChanged::OldReality' has a wrong offset!");
static_assert(offsetof(BP_ConsumableItem_C_RealityChanged, NewReality) == 0x000001, "Member 'BP_ConsumableItem_C_RealityChanged::NewReality' has a wrong offset!");

// Function BP_ConsumableItem.BP_ConsumableItem_C.ResetStaticMesh
// 0x0010 (0x0010 - 0x0000)
struct BP_ConsumableItem_C_ResetStaticMesh final
{
public:
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConsumableItem_C_ResetStaticMesh) == 0x000008, "Wrong alignment on BP_ConsumableItem_C_ResetStaticMesh");
static_assert(sizeof(BP_ConsumableItem_C_ResetStaticMesh) == 0x000010, "Wrong size on BP_ConsumableItem_C_ResetStaticMesh");
static_assert(offsetof(BP_ConsumableItem_C_ResetStaticMesh, CallFunc_SetStaticMesh_ReturnValue) == 0x000000, "Member 'BP_ConsumableItem_C_ResetStaticMesh::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsumableItem_C_ResetStaticMesh, CallFunc_GetMaterial_ReturnValue) == 0x000008, "Member 'BP_ConsumableItem_C_ResetStaticMesh::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");

// Function BP_ConsumableItem.BP_ConsumableItem_C.ServerSetItemBoxType
// 0x0058 (0x0058 - 0x0000)
struct BP_ConsumableItem_C_ServerSetItemBoxType final
{
public:
	EItemBoxTypes                                 ItemBoxType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemBoxPayload                        K2Node_MakeStruct_ItemBoxPayload;                  // 0x0008(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemBoxPayload                        K2Node_MakeStruct_ItemBoxPayload_1;                // 0x0038(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConsumableItem_C_ServerSetItemBoxType) == 0x000008, "Wrong alignment on BP_ConsumableItem_C_ServerSetItemBoxType");
static_assert(sizeof(BP_ConsumableItem_C_ServerSetItemBoxType) == 0x000058, "Wrong size on BP_ConsumableItem_C_ServerSetItemBoxType");
static_assert(offsetof(BP_ConsumableItem_C_ServerSetItemBoxType, ItemBoxType) == 0x000000, "Member 'BP_ConsumableItem_C_ServerSetItemBoxType::ItemBoxType' has a wrong offset!");
static_assert(offsetof(BP_ConsumableItem_C_ServerSetItemBoxType, CallFunc_HasAuthority_ReturnValue) == 0x000001, "Member 'BP_ConsumableItem_C_ServerSetItemBoxType::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsumableItem_C_ServerSetItemBoxType, K2Node_MakeStruct_ItemBoxPayload) == 0x000008, "Member 'BP_ConsumableItem_C_ServerSetItemBoxType::K2Node_MakeStruct_ItemBoxPayload' has a wrong offset!");
static_assert(offsetof(BP_ConsumableItem_C_ServerSetItemBoxType, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'BP_ConsumableItem_C_ServerSetItemBoxType::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsumableItem_C_ServerSetItemBoxType, CallFunc_GetActorScale3D_ReturnValue) == 0x00002C, "Member 'BP_ConsumableItem_C_ServerSetItemBoxType::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsumableItem_C_ServerSetItemBoxType, K2Node_MakeStruct_ItemBoxPayload_1) == 0x000038, "Member 'BP_ConsumableItem_C_ServerSetItemBoxType::K2Node_MakeStruct_ItemBoxPayload_1' has a wrong offset!");

// Function BP_ConsumableItem.BP_ConsumableItem_C.OnRep_ItemBoxRepPayload
// 0x0001 (0x0001 - 0x0000)
struct BP_ConsumableItem_C_OnRep_ItemBoxRepPayload final
{
public:
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ConsumableItem_C_OnRep_ItemBoxRepPayload) == 0x000001, "Wrong alignment on BP_ConsumableItem_C_OnRep_ItemBoxRepPayload");
static_assert(sizeof(BP_ConsumableItem_C_OnRep_ItemBoxRepPayload) == 0x000001, "Wrong size on BP_ConsumableItem_C_OnRep_ItemBoxRepPayload");
static_assert(offsetof(BP_ConsumableItem_C_OnRep_ItemBoxRepPayload, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000000, "Member 'BP_ConsumableItem_C_OnRep_ItemBoxRepPayload::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_ConsumableItem.BP_ConsumableItem_C.SetupItemBoxMesh
// 0x0002 (0x0002 - 0x0000)
struct BP_ConsumableItem_C_SetupItemBoxMesh final
{
public:
	EItemBoxTypes                                 ItemBoxType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ConsumableItem_C_SetupItemBoxMesh) == 0x000001, "Wrong alignment on BP_ConsumableItem_C_SetupItemBoxMesh");
static_assert(sizeof(BP_ConsumableItem_C_SetupItemBoxMesh) == 0x000002, "Wrong size on BP_ConsumableItem_C_SetupItemBoxMesh");
static_assert(offsetof(BP_ConsumableItem_C_SetupItemBoxMesh, ItemBoxType) == 0x000000, "Member 'BP_ConsumableItem_C_SetupItemBoxMesh::ItemBoxType' has a wrong offset!");
static_assert(offsetof(BP_ConsumableItem_C_SetupItemBoxMesh, CallFunc_SetStaticMesh_ReturnValue) == 0x000001, "Member 'BP_ConsumableItem_C_SetupItemBoxMesh::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function BP_ConsumableItem.BP_ConsumableItem_C.SetupItemBoxMaterial
// 0x0002 (0x0002 - 0x0000)
struct BP_ConsumableItem_C_SetupItemBoxMaterial final
{
public:
	EItemBoxTypes                                 ItemBoxType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ConsumableItem_C_SetupItemBoxMaterial) == 0x000001, "Wrong alignment on BP_ConsumableItem_C_SetupItemBoxMaterial");
static_assert(sizeof(BP_ConsumableItem_C_SetupItemBoxMaterial) == 0x000002, "Wrong size on BP_ConsumableItem_C_SetupItemBoxMaterial");
static_assert(offsetof(BP_ConsumableItem_C_SetupItemBoxMaterial, ItemBoxType) == 0x000000, "Member 'BP_ConsumableItem_C_SetupItemBoxMaterial::ItemBoxType' has a wrong offset!");
static_assert(offsetof(BP_ConsumableItem_C_SetupItemBoxMaterial, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'BP_ConsumableItem_C_SetupItemBoxMaterial::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_ConsumableItem.BP_ConsumableItem_C.HandleItemSpecificRealityChange
// 0x0002 (0x0002 - 0x0000)
struct BP_ConsumableItem_C_HandleItemSpecificRealityChange final
{
public:
	EMarinerRealityState                          NewReality;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ConsumableItem_C_HandleItemSpecificRealityChange) == 0x000001, "Wrong alignment on BP_ConsumableItem_C_HandleItemSpecificRealityChange");
static_assert(sizeof(BP_ConsumableItem_C_HandleItemSpecificRealityChange) == 0x000002, "Wrong size on BP_ConsumableItem_C_HandleItemSpecificRealityChange");
static_assert(offsetof(BP_ConsumableItem_C_HandleItemSpecificRealityChange, NewReality) == 0x000000, "Member 'BP_ConsumableItem_C_HandleItemSpecificRealityChange::NewReality' has a wrong offset!");
static_assert(offsetof(BP_ConsumableItem_C_HandleItemSpecificRealityChange, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'BP_ConsumableItem_C_HandleItemSpecificRealityChange::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_ConsumableItem.BP_ConsumableItem_C.Swap To item Box Materials
// 0x0010 (0x0010 - 0x0000)
struct BP_ConsumableItem_C_Swap_To_item_Box_Materials final
{
public:
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue_1;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConsumableItem_C_Swap_To_item_Box_Materials) == 0x000008, "Wrong alignment on BP_ConsumableItem_C_Swap_To_item_Box_Materials");
static_assert(sizeof(BP_ConsumableItem_C_Swap_To_item_Box_Materials) == 0x000010, "Wrong size on BP_ConsumableItem_C_Swap_To_item_Box_Materials");
static_assert(offsetof(BP_ConsumableItem_C_Swap_To_item_Box_Materials, CallFunc_GetMaterial_ReturnValue) == 0x000000, "Member 'BP_ConsumableItem_C_Swap_To_item_Box_Materials::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsumableItem_C_Swap_To_item_Box_Materials, CallFunc_GetMaterial_ReturnValue_1) == 0x000008, "Member 'BP_ConsumableItem_C_Swap_To_item_Box_Materials::CallFunc_GetMaterial_ReturnValue_1' has a wrong offset!");

// Function BP_ConsumableItem.BP_ConsumableItem_C.ResetDefaultStaticMeshValues
// 0x0001 (0x0001 - 0x0000)
struct BP_ConsumableItem_C_ResetDefaultStaticMeshValues final
{
public:
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ConsumableItem_C_ResetDefaultStaticMeshValues) == 0x000001, "Wrong alignment on BP_ConsumableItem_C_ResetDefaultStaticMeshValues");
static_assert(sizeof(BP_ConsumableItem_C_ResetDefaultStaticMeshValues) == 0x000001, "Wrong size on BP_ConsumableItem_C_ResetDefaultStaticMeshValues");
static_assert(offsetof(BP_ConsumableItem_C_ResetDefaultStaticMeshValues, CallFunc_SetStaticMesh_ReturnValue) == 0x000000, "Member 'BP_ConsumableItem_C_ResetDefaultStaticMeshValues::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

}

