#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MarinerPlayerState

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MarinerPlayerState.BP_MarinerPlayerState_C
// 0x0060 (0x0608 - 0x05A8)
class ABP_MarinerPlayerState_C : public AMarinerPlayerState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, float>                    CharacterSpecificSyncValues;                       // 0x05B8(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_MarinerPlayerState(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MarinerPlayerState_C">();
	}
	static class ABP_MarinerPlayerState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MarinerPlayerState_C>();
	}
};
static_assert(alignof(ABP_MarinerPlayerState_C) == 0x000008, "Wrong alignment on ABP_MarinerPlayerState_C");
static_assert(sizeof(ABP_MarinerPlayerState_C) == 0x000608, "Wrong size on ABP_MarinerPlayerState_C");
static_assert(offsetof(ABP_MarinerPlayerState_C, UberGraphFrame) == 0x0005A8, "Member 'ABP_MarinerPlayerState_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MarinerPlayerState_C, DefaultSceneRoot) == 0x0005B0, "Member 'ABP_MarinerPlayerState_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_MarinerPlayerState_C, CharacterSpecificSyncValues) == 0x0005B8, "Member 'ABP_MarinerPlayerState_C::CharacterSpecificSyncValues' has a wrong offset!");

}

