#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MMV_Slider_GrappleRope

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MMV_Slider_GrappleRope.BP_MMV_Slider_GrappleRope_C
// 0x0020 (0x0238 - 0x0218)
class ABP_MMV_Slider_GrappleRope_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0218(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCableComponent*                        Cable;                                             // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ASkeletalMeshActor*                     TargetActor;                                       // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         FadeOut;                                           // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MMV_Slider_GrappleRope(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MMV_Slider_GrappleRope_C">();
	}
	static class ABP_MMV_Slider_GrappleRope_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MMV_Slider_GrappleRope_C>();
	}
};
static_assert(alignof(ABP_MMV_Slider_GrappleRope_C) == 0x000008, "Wrong alignment on ABP_MMV_Slider_GrappleRope_C");
static_assert(sizeof(ABP_MMV_Slider_GrappleRope_C) == 0x000238, "Wrong size on ABP_MMV_Slider_GrappleRope_C");
static_assert(offsetof(ABP_MMV_Slider_GrappleRope_C, UberGraphFrame) == 0x000218, "Member 'ABP_MMV_Slider_GrappleRope_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MMV_Slider_GrappleRope_C, Cable) == 0x000220, "Member 'ABP_MMV_Slider_GrappleRope_C::Cable' has a wrong offset!");
static_assert(offsetof(ABP_MMV_Slider_GrappleRope_C, TargetActor) == 0x000228, "Member 'ABP_MMV_Slider_GrappleRope_C::TargetActor' has a wrong offset!");
static_assert(offsetof(ABP_MMV_Slider_GrappleRope_C, FadeOut) == 0x000230, "Member 'ABP_MMV_Slider_GrappleRope_C::FadeOut' has a wrong offset!");

}

