#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TrialsPostGameMenu

#include "Basic.hpp"

#include "MangoClient_structs.hpp"
#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_TrialsPostGameMenu.BP_TrialsPostGameMenu_C
// 0x0018 (0x0518 - 0x0500)
class UBP_TrialsPostGameMenu_C final : public UMarinerTrialsPostGameMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0500(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             BP_TimerText;                                      // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPromptBanner_C*                 DefaultPromptBanner;                               // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_TrialsPostGameMenu(int32 EntryPoint);
	void BP_OnEntered(bool bFromSubMenu);
	void SetTimeText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TrialsPostGameMenu_C">();
	}
	static class UBP_TrialsPostGameMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_TrialsPostGameMenu_C>();
	}
};
static_assert(alignof(UBP_TrialsPostGameMenu_C) == 0x000008, "Wrong alignment on UBP_TrialsPostGameMenu_C");
static_assert(sizeof(UBP_TrialsPostGameMenu_C) == 0x000518, "Wrong size on UBP_TrialsPostGameMenu_C");
static_assert(offsetof(UBP_TrialsPostGameMenu_C, UberGraphFrame) == 0x000500, "Member 'UBP_TrialsPostGameMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_TrialsPostGameMenu_C, BP_TimerText) == 0x000508, "Member 'UBP_TrialsPostGameMenu_C::BP_TimerText' has a wrong offset!");
static_assert(offsetof(UBP_TrialsPostGameMenu_C, DefaultPromptBanner) == 0x000510, "Member 'UBP_TrialsPostGameMenu_C::DefaultPromptBanner' has a wrong offset!");

}

