#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_FindClosestPointOnNavNearEnemy

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTT_FindClosestPointOnNavNearEnemy.BTT_FindClosestPointOnNavNearEnemy_C.ExecuteUbergraph_BTT_FindClosestPointOnNavNearEnemy
// 0x0058 (0x0058 - 0x0000)
struct BTT_FindClosestPointOnNavNearEnemy_C_ExecuteUbergraph_BTT_FindClosestPointOnNavNearEnemy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_257C[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetBlackboardValueAsVector_ReturnValue;   // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_257D[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OwnerActor;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_257E[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x0038(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation; // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue; // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTT_FindClosestPointOnNavNearEnemy_C_ExecuteUbergraph_BTT_FindClosestPointOnNavNearEnemy) == 0x000008, "Wrong alignment on BTT_FindClosestPointOnNavNearEnemy_C_ExecuteUbergraph_BTT_FindClosestPointOnNavNearEnemy");
static_assert(sizeof(BTT_FindClosestPointOnNavNearEnemy_C_ExecuteUbergraph_BTT_FindClosestPointOnNavNearEnemy) == 0x000058, "Wrong size on BTT_FindClosestPointOnNavNearEnemy_C_ExecuteUbergraph_BTT_FindClosestPointOnNavNearEnemy");
static_assert(offsetof(BTT_FindClosestPointOnNavNearEnemy_C_ExecuteUbergraph_BTT_FindClosestPointOnNavNearEnemy, EntryPoint) == 0x000000, "Member 'BTT_FindClosestPointOnNavNearEnemy_C_ExecuteUbergraph_BTT_FindClosestPointOnNavNearEnemy::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_FindClosestPointOnNavNearEnemy_C_ExecuteUbergraph_BTT_FindClosestPointOnNavNearEnemy, Temp_bool_Variable) == 0x000004, "Member 'BTT_FindClosestPointOnNavNearEnemy_C_ExecuteUbergraph_BTT_FindClosestPointOnNavNearEnemy::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BTT_FindClosestPointOnNavNearEnemy_C_ExecuteUbergraph_BTT_FindClosestPointOnNavNearEnemy, CallFunc_GetBlackboardValueAsVector_ReturnValue) == 0x000008, "Member 'BTT_FindClosestPointOnNavNearEnemy_C_ExecuteUbergraph_BTT_FindClosestPointOnNavNearEnemy::CallFunc_GetBlackboardValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_FindClosestPointOnNavNearEnemy_C_ExecuteUbergraph_BTT_FindClosestPointOnNavNearEnemy, K2Node_Event_OwnerActor) == 0x000018, "Member 'BTT_FindClosestPointOnNavNearEnemy_C_ExecuteUbergraph_BTT_FindClosestPointOnNavNearEnemy::K2Node_Event_OwnerActor' has a wrong offset!");
static_assert(offsetof(BTT_FindClosestPointOnNavNearEnemy_C_ExecuteUbergraph_BTT_FindClosestPointOnNavNearEnemy, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000020, "Member 'BTT_FindClosestPointOnNavNearEnemy_C_ExecuteUbergraph_BTT_FindClosestPointOnNavNearEnemy::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_FindClosestPointOnNavNearEnemy_C_ExecuteUbergraph_BTT_FindClosestPointOnNavNearEnemy, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BTT_FindClosestPointOnNavNearEnemy_C_ExecuteUbergraph_BTT_FindClosestPointOnNavNearEnemy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_FindClosestPointOnNavNearEnemy_C_ExecuteUbergraph_BTT_FindClosestPointOnNavNearEnemy, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00002C, "Member 'BTT_FindClosestPointOnNavNearEnemy_C_ExecuteUbergraph_BTT_FindClosestPointOnNavNearEnemy::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_FindClosestPointOnNavNearEnemy_C_ExecuteUbergraph_BTT_FindClosestPointOnNavNearEnemy, K2Node_Select_Default) == 0x000038, "Member 'BTT_FindClosestPointOnNavNearEnemy_C_ExecuteUbergraph_BTT_FindClosestPointOnNavNearEnemy::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BTT_FindClosestPointOnNavNearEnemy_C_ExecuteUbergraph_BTT_FindClosestPointOnNavNearEnemy, CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation) == 0x000044, "Member 'BTT_FindClosestPointOnNavNearEnemy_C_ExecuteUbergraph_BTT_FindClosestPointOnNavNearEnemy::CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation' has a wrong offset!");
static_assert(offsetof(BTT_FindClosestPointOnNavNearEnemy_C_ExecuteUbergraph_BTT_FindClosestPointOnNavNearEnemy, CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue) == 0x000050, "Member 'BTT_FindClosestPointOnNavNearEnemy_C_ExecuteUbergraph_BTT_FindClosestPointOnNavNearEnemy::CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_FindClosestPointOnNavNearEnemy_C_ExecuteUbergraph_BTT_FindClosestPointOnNavNearEnemy, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x000051, "Member 'BTT_FindClosestPointOnNavNearEnemy_C_ExecuteUbergraph_BTT_FindClosestPointOnNavNearEnemy::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");

// Function BTT_FindClosestPointOnNavNearEnemy.BTT_FindClosestPointOnNavNearEnemy_C.ReceiveExecute
// 0x0008 (0x0008 - 0x0000)
struct BTT_FindClosestPointOnNavNearEnemy_C_ReceiveExecute final
{
public:
	class AActor*                                 OwnerActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_FindClosestPointOnNavNearEnemy_C_ReceiveExecute) == 0x000008, "Wrong alignment on BTT_FindClosestPointOnNavNearEnemy_C_ReceiveExecute");
static_assert(sizeof(BTT_FindClosestPointOnNavNearEnemy_C_ReceiveExecute) == 0x000008, "Wrong size on BTT_FindClosestPointOnNavNearEnemy_C_ReceiveExecute");
static_assert(offsetof(BTT_FindClosestPointOnNavNearEnemy_C_ReceiveExecute, OwnerActor) == 0x000000, "Member 'BTT_FindClosestPointOnNavNearEnemy_C_ReceiveExecute::OwnerActor' has a wrong offset!");

}

