#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_FindClosestPointOnNavNearEnemy

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_FindClosestPointOnNavNearEnemy.BTT_FindClosestPointOnNavNearEnemy_C
// 0x0060 (0x0108 - 0x00A8)
class UBTT_FindClosestPointOnNavNearEnemy_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 Enemy;                                             // 0x00B0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 Destination;                                       // 0x00D8(0x0028)(Edit, BlueprintVisible)
	float                                         Radius;                                            // 0x0100(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTT_FindClosestPointOnNavNearEnemy(int32 EntryPoint);
	void ReceiveExecute(class AActor* OwnerActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTT_FindClosestPointOnNavNearEnemy_C">();
	}
	static class UBTT_FindClosestPointOnNavNearEnemy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_FindClosestPointOnNavNearEnemy_C>();
	}
};
static_assert(alignof(UBTT_FindClosestPointOnNavNearEnemy_C) == 0x000008, "Wrong alignment on UBTT_FindClosestPointOnNavNearEnemy_C");
static_assert(sizeof(UBTT_FindClosestPointOnNavNearEnemy_C) == 0x000108, "Wrong size on UBTT_FindClosestPointOnNavNearEnemy_C");
static_assert(offsetof(UBTT_FindClosestPointOnNavNearEnemy_C, UberGraphFrame) == 0x0000A8, "Member 'UBTT_FindClosestPointOnNavNearEnemy_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTT_FindClosestPointOnNavNearEnemy_C, Enemy) == 0x0000B0, "Member 'UBTT_FindClosestPointOnNavNearEnemy_C::Enemy' has a wrong offset!");
static_assert(offsetof(UBTT_FindClosestPointOnNavNearEnemy_C, Destination) == 0x0000D8, "Member 'UBTT_FindClosestPointOnNavNearEnemy_C::Destination' has a wrong offset!");
static_assert(offsetof(UBTT_FindClosestPointOnNavNearEnemy_C, Radius) == 0x000100, "Member 'UBTT_FindClosestPointOnNavNearEnemy_C::Radius' has a wrong offset!");

}

