#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ButtonLayout

#include "Basic.hpp"

#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function ButtonLayout.ButtonLayout_C.ExecuteUbergraph_ButtonLayout
// 0x0008 (0x0008 - 0x0000)
struct ButtonLayout_C_ExecuteUbergraph_ButtonLayout final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlatformPC_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ButtonLayout_C_ExecuteUbergraph_ButtonLayout) == 0x000004, "Wrong alignment on ButtonLayout_C_ExecuteUbergraph_ButtonLayout");
static_assert(sizeof(ButtonLayout_C_ExecuteUbergraph_ButtonLayout) == 0x000008, "Wrong size on ButtonLayout_C_ExecuteUbergraph_ButtonLayout");
static_assert(offsetof(ButtonLayout_C_ExecuteUbergraph_ButtonLayout, EntryPoint) == 0x000000, "Member 'ButtonLayout_C_ExecuteUbergraph_ButtonLayout::EntryPoint' has a wrong offset!");
static_assert(offsetof(ButtonLayout_C_ExecuteUbergraph_ButtonLayout, CallFunc_IsPlatformPC_ReturnValue) == 0x000004, "Member 'ButtonLayout_C_ExecuteUbergraph_ButtonLayout::CallFunc_IsPlatformPC_ReturnValue' has a wrong offset!");

// Function ButtonLayout.ButtonLayout_C.Refresh
// 0x0048 (0x0048 - 0x0000)
struct ButtonLayout_C_Refresh final
{
public:
	EPlayerInputType                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20B9[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameInstance*                   K2Node_DynamicCast_AsMariner_Game_Instance;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20BA[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerInputOverlay*                   CallFunc_GetInputOverlay_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerInputType                              CallFunc_GetLastActiveGamepadType_ReturnValue;     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20BB[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ButtonLayout_C_Refresh) == 0x000008, "Wrong alignment on ButtonLayout_C_Refresh");
static_assert(sizeof(ButtonLayout_C_Refresh) == 0x000048, "Wrong size on ButtonLayout_C_Refresh");
static_assert(offsetof(ButtonLayout_C_Refresh, Temp_byte_Variable) == 0x000000, "Member 'ButtonLayout_C_Refresh::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ButtonLayout_C_Refresh, Temp_object_Variable) == 0x000008, "Member 'ButtonLayout_C_Refresh::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ButtonLayout_C_Refresh, Temp_object_Variable_1) == 0x000010, "Member 'ButtonLayout_C_Refresh::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(ButtonLayout_C_Refresh, CallFunc_GetGameInstance_ReturnValue) == 0x000018, "Member 'ButtonLayout_C_Refresh::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ButtonLayout_C_Refresh, K2Node_DynamicCast_AsMariner_Game_Instance) == 0x000020, "Member 'ButtonLayout_C_Refresh::K2Node_DynamicCast_AsMariner_Game_Instance' has a wrong offset!");
static_assert(offsetof(ButtonLayout_C_Refresh, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'ButtonLayout_C_Refresh::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ButtonLayout_C_Refresh, CallFunc_GetInputOverlay_ReturnValue) == 0x000030, "Member 'ButtonLayout_C_Refresh::CallFunc_GetInputOverlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(ButtonLayout_C_Refresh, CallFunc_GetLastActiveGamepadType_ReturnValue) == 0x000038, "Member 'ButtonLayout_C_Refresh::CallFunc_GetLastActiveGamepadType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ButtonLayout_C_Refresh, K2Node_Select_Default) == 0x000040, "Member 'ButtonLayout_C_Refresh::K2Node_Select_Default' has a wrong offset!");

}

