#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChallengeGroup

#include "Basic.hpp"

#include "MangoClient_structs.hpp"
#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChallengeGroup.ChallengeGroup_C
// 0x0050 (0x0300 - 0x02B0)
class UChallengeGroup_C final : public UMarinerUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMarinerVerticalBox*                    ContentPanel;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Header;                                            // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               HeaderPanel;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   HeaderText;                                        // 0x02D0(0x0018)(Edit, BlueprintVisible)
	class UChallengeButton_C*                     PendingChallengeButton;                            // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastInlineDelegateProperty_             ProgressAnimationComplete;                         // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ProgressAnimationComplete__DelegateSignature();
	void ExecuteUbergraph_ChallengeGroup(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void AddChallenge(struct FMangoQuestDescription& Quest, bool AllowInput, class UChallengeButton_C** ButtonInstance);
	void ClearChallenges();
	void DummyCallback(struct FKey& KeyPressed);
	void RefreshChallenge(struct FMangoQuestDescription& Quest);
	void GetChallenge(EMangoQuestSlot Slot_0, class UChallengeButton_C** Widget);
	void UpdateHeader();
	void AddOrRefreshChallenge(struct FMangoQuestDescription& Quest, bool AllowInput);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChallengeGroup_C">();
	}
	static class UChallengeGroup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChallengeGroup_C>();
	}
};
static_assert(alignof(UChallengeGroup_C) == 0x000008, "Wrong alignment on UChallengeGroup_C");
static_assert(sizeof(UChallengeGroup_C) == 0x000300, "Wrong size on UChallengeGroup_C");
static_assert(offsetof(UChallengeGroup_C, UberGraphFrame) == 0x0002B0, "Member 'UChallengeGroup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChallengeGroup_C, ContentPanel) == 0x0002B8, "Member 'UChallengeGroup_C::ContentPanel' has a wrong offset!");
static_assert(offsetof(UChallengeGroup_C, Header) == 0x0002C0, "Member 'UChallengeGroup_C::Header' has a wrong offset!");
static_assert(offsetof(UChallengeGroup_C, HeaderPanel) == 0x0002C8, "Member 'UChallengeGroup_C::HeaderPanel' has a wrong offset!");
static_assert(offsetof(UChallengeGroup_C, HeaderText) == 0x0002D0, "Member 'UChallengeGroup_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UChallengeGroup_C, PendingChallengeButton) == 0x0002E8, "Member 'UChallengeGroup_C::PendingChallengeButton' has a wrong offset!");
static_assert(offsetof(UChallengeGroup_C, ProgressAnimationComplete) == 0x0002F0, "Member 'UChallengeGroup_C::ProgressAnimationComplete' has a wrong offset!");

}

