#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChangeTierWidget

#include "Basic.hpp"

#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function ChangeTierWidget.ChangeTierWidget_C.ExecuteUbergraph_ChangeTierWidget
// 0x0050 (0x0050 - 0x0000)
struct ChangeTierWidget_C_ExecuteUbergraph_ChangeTierWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameInstance*                   CallFunc_GetMarinerGameInstance_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerInputType                              CallFunc_GetActiveInputType_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerInputOverlay*                   CallFunc_GetInputOverlay_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPlayerInputType InputType)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class UMarinerGameInstance*                   CallFunc_GetMarinerGameInstance_ReturnValue_1;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerLayeredButton*                  K2Node_ComponentBoundEvent_Instance;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerInputOverlay*                   CallFunc_GetInputOverlay_ReturnValue_1;            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChangeTierWidget_C_ExecuteUbergraph_ChangeTierWidget) == 0x000008, "Wrong alignment on ChangeTierWidget_C_ExecuteUbergraph_ChangeTierWidget");
static_assert(sizeof(ChangeTierWidget_C_ExecuteUbergraph_ChangeTierWidget) == 0x000050, "Wrong size on ChangeTierWidget_C_ExecuteUbergraph_ChangeTierWidget");
static_assert(offsetof(ChangeTierWidget_C_ExecuteUbergraph_ChangeTierWidget, EntryPoint) == 0x000000, "Member 'ChangeTierWidget_C_ExecuteUbergraph_ChangeTierWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(ChangeTierWidget_C_ExecuteUbergraph_ChangeTierWidget, CallFunc_GetMarinerGameInstance_ReturnValue) == 0x000008, "Member 'ChangeTierWidget_C_ExecuteUbergraph_ChangeTierWidget::CallFunc_GetMarinerGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeTierWidget_C_ExecuteUbergraph_ChangeTierWidget, CallFunc_GetActiveInputType_ReturnValue) == 0x000010, "Member 'ChangeTierWidget_C_ExecuteUbergraph_ChangeTierWidget::CallFunc_GetActiveInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeTierWidget_C_ExecuteUbergraph_ChangeTierWidget, CallFunc_GetInputOverlay_ReturnValue) == 0x000018, "Member 'ChangeTierWidget_C_ExecuteUbergraph_ChangeTierWidget::CallFunc_GetInputOverlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeTierWidget_C_ExecuteUbergraph_ChangeTierWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'ChangeTierWidget_C_ExecuteUbergraph_ChangeTierWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ChangeTierWidget_C_ExecuteUbergraph_ChangeTierWidget, CallFunc_GetMarinerGameInstance_ReturnValue_1) == 0x000030, "Member 'ChangeTierWidget_C_ExecuteUbergraph_ChangeTierWidget::CallFunc_GetMarinerGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChangeTierWidget_C_ExecuteUbergraph_ChangeTierWidget, K2Node_ComponentBoundEvent_Instance) == 0x000038, "Member 'ChangeTierWidget_C_ExecuteUbergraph_ChangeTierWidget::K2Node_ComponentBoundEvent_Instance' has a wrong offset!");
static_assert(offsetof(ChangeTierWidget_C_ExecuteUbergraph_ChangeTierWidget, CallFunc_GetInputOverlay_ReturnValue_1) == 0x000040, "Member 'ChangeTierWidget_C_ExecuteUbergraph_ChangeTierWidget::CallFunc_GetInputOverlay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChangeTierWidget_C_ExecuteUbergraph_ChangeTierWidget, K2Node_Event_IsDesignTime) == 0x000048, "Member 'ChangeTierWidget_C_ExecuteUbergraph_ChangeTierWidget::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function ChangeTierWidget.ChangeTierWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ChangeTierWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChangeTierWidget_C_PreConstruct) == 0x000001, "Wrong alignment on ChangeTierWidget_C_PreConstruct");
static_assert(sizeof(ChangeTierWidget_C_PreConstruct) == 0x000001, "Wrong size on ChangeTierWidget_C_PreConstruct");
static_assert(offsetof(ChangeTierWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ChangeTierWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ChangeTierWidget.ChangeTierWidget_C.BndEvt__KBMButton_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ChangeTierWidget_C_BndEvt__KBMButton_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature final
{
public:
	class UMarinerLayeredButton*                  Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChangeTierWidget_C_BndEvt__KBMButton_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on ChangeTierWidget_C_BndEvt__KBMButton_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature");
static_assert(sizeof(ChangeTierWidget_C_BndEvt__KBMButton_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong size on ChangeTierWidget_C_BndEvt__KBMButton_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature");
static_assert(offsetof(ChangeTierWidget_C_BndEvt__KBMButton_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature, Instance) == 0x000000, "Member 'ChangeTierWidget_C_BndEvt__KBMButton_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature::Instance' has a wrong offset!");

// Function ChangeTierWidget.ChangeTierWidget_C.UpdateInputType
// 0x0010 (0x0010 - 0x0000)
struct ChangeTierWidget_C_UpdateInputType final
{
public:
	EPlayerInputType                              InputType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerInputType                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChangeTierWidget_C_UpdateInputType) == 0x000008, "Wrong alignment on ChangeTierWidget_C_UpdateInputType");
static_assert(sizeof(ChangeTierWidget_C_UpdateInputType) == 0x000010, "Wrong size on ChangeTierWidget_C_UpdateInputType");
static_assert(offsetof(ChangeTierWidget_C_UpdateInputType, InputType) == 0x000000, "Member 'ChangeTierWidget_C_UpdateInputType::InputType' has a wrong offset!");
static_assert(offsetof(ChangeTierWidget_C_UpdateInputType, Temp_byte_Variable) == 0x000001, "Member 'ChangeTierWidget_C_UpdateInputType::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ChangeTierWidget_C_UpdateInputType, K2Node_Select_Default) == 0x000008, "Member 'ChangeTierWidget_C_UpdateInputType::K2Node_Select_Default' has a wrong offset!");

}

