#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChangeTierWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Mariner_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChangeTierWidget.ChangeTierWidget_C
// 0x0260 (0x0510 - 0x02B0)
class UChangeTierWidget_C final : public UMarinerUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 GenericIcon;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        InputSwitcher;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULeavePartyButton_C*                    KBMButton;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PS4Icon;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 XboxIcon;                                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastInlineDelegateProperty_             OnSelected;                                        // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FSlateBrush                            KBMBrush;                                          // 0x02F0(0x0088)(Edit, BlueprintVisible)
	struct FSlateBrush                            XboxBrush;                                         // 0x0378(0x0088)(Edit, BlueprintVisible)
	struct FSlateBrush                            PS4Brush;                                          // 0x0400(0x0088)(Edit, BlueprintVisible)
	struct FSlateBrush                            GenericBrush;                                      // 0x0488(0x0088)(Edit, BlueprintVisible)

public:
	void OnSelected__DelegateSignature();
	void ExecuteUbergraph_ChangeTierWidget(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void BndEvt__KBMButton_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature(class UMarinerLayeredButton* Instance);
	void Destruct();
	void Construct();
	void UpdateInputType(EPlayerInputType InputType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChangeTierWidget_C">();
	}
	static class UChangeTierWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChangeTierWidget_C>();
	}
};
static_assert(alignof(UChangeTierWidget_C) == 0x000008, "Wrong alignment on UChangeTierWidget_C");
static_assert(sizeof(UChangeTierWidget_C) == 0x000510, "Wrong size on UChangeTierWidget_C");
static_assert(offsetof(UChangeTierWidget_C, UberGraphFrame) == 0x0002B0, "Member 'UChangeTierWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChangeTierWidget_C, GenericIcon) == 0x0002B8, "Member 'UChangeTierWidget_C::GenericIcon' has a wrong offset!");
static_assert(offsetof(UChangeTierWidget_C, InputSwitcher) == 0x0002C0, "Member 'UChangeTierWidget_C::InputSwitcher' has a wrong offset!");
static_assert(offsetof(UChangeTierWidget_C, KBMButton) == 0x0002C8, "Member 'UChangeTierWidget_C::KBMButton' has a wrong offset!");
static_assert(offsetof(UChangeTierWidget_C, PS4Icon) == 0x0002D0, "Member 'UChangeTierWidget_C::PS4Icon' has a wrong offset!");
static_assert(offsetof(UChangeTierWidget_C, XboxIcon) == 0x0002D8, "Member 'UChangeTierWidget_C::XboxIcon' has a wrong offset!");
static_assert(offsetof(UChangeTierWidget_C, OnSelected) == 0x0002E0, "Member 'UChangeTierWidget_C::OnSelected' has a wrong offset!");
static_assert(offsetof(UChangeTierWidget_C, KBMBrush) == 0x0002F0, "Member 'UChangeTierWidget_C::KBMBrush' has a wrong offset!");
static_assert(offsetof(UChangeTierWidget_C, XboxBrush) == 0x000378, "Member 'UChangeTierWidget_C::XboxBrush' has a wrong offset!");
static_assert(offsetof(UChangeTierWidget_C, PS4Brush) == 0x000400, "Member 'UChangeTierWidget_C::PS4Brush' has a wrong offset!");
static_assert(offsetof(UChangeTierWidget_C, GenericBrush) == 0x000488, "Member 'UChangeTierWidget_C::GenericBrush' has a wrong offset!");

}

