#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChangeProfileButton

#include "Basic.hpp"

#include "Mariner_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function ChangeProfileButton.ChangeProfileButton_C.ExecuteUbergraph_ChangeProfileButton
// 0x0038 (0x0038 - 0x0000)
struct ChangeProfileButton_C_ExecuteUbergraph_ChangeProfileButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0010(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0020(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChangeProfileButton_C_ExecuteUbergraph_ChangeProfileButton) == 0x000008, "Wrong alignment on ChangeProfileButton_C_ExecuteUbergraph_ChangeProfileButton");
static_assert(sizeof(ChangeProfileButton_C_ExecuteUbergraph_ChangeProfileButton) == 0x000038, "Wrong size on ChangeProfileButton_C_ExecuteUbergraph_ChangeProfileButton");
static_assert(offsetof(ChangeProfileButton_C_ExecuteUbergraph_ChangeProfileButton, EntryPoint) == 0x000000, "Member 'ChangeProfileButton_C_ExecuteUbergraph_ChangeProfileButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(ChangeProfileButton_C_ExecuteUbergraph_ChangeProfileButton, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'ChangeProfileButton_C_ExecuteUbergraph_ChangeProfileButton::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeProfileButton_C_ExecuteUbergraph_ChangeProfileButton, Temp_struct_Variable) == 0x000010, "Member 'ChangeProfileButton_C_ExecuteUbergraph_ChangeProfileButton::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(ChangeProfileButton_C_ExecuteUbergraph_ChangeProfileButton, Temp_delegate_Variable) == 0x000020, "Member 'ChangeProfileButton_C_ExecuteUbergraph_ChangeProfileButton::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(ChangeProfileButton_C_ExecuteUbergraph_ChangeProfileButton, CallFunc_PostEvent_ReturnValue) == 0x000030, "Member 'ChangeProfileButton_C_ExecuteUbergraph_ChangeProfileButton::CallFunc_PostEvent_ReturnValue' has a wrong offset!");

// Function ChangeProfileButton.ChangeProfileButton_C.GetAssets
// 0x00D0 (0x00D0 - 0x0000)
struct ChangeProfileButton_C_GetAssets final
{
public:
	struct FMarinerLayeredButtonAssets            ReturnValue;                                       // 0x0000(0x0068)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference)
	struct FMarinerLayeredButtonAssets            K2Node_MakeStruct_MarinerLayeredButtonAssets;      // 0x0068(0x0068)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(ChangeProfileButton_C_GetAssets) == 0x000008, "Wrong alignment on ChangeProfileButton_C_GetAssets");
static_assert(sizeof(ChangeProfileButton_C_GetAssets) == 0x0000D0, "Wrong size on ChangeProfileButton_C_GetAssets");
static_assert(offsetof(ChangeProfileButton_C_GetAssets, ReturnValue) == 0x000000, "Member 'ChangeProfileButton_C_GetAssets::ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeProfileButton_C_GetAssets, K2Node_MakeStruct_MarinerLayeredButtonAssets) == 0x000068, "Member 'ChangeProfileButton_C_GetAssets::K2Node_MakeStruct_MarinerLayeredButtonAssets' has a wrong offset!");

}

