#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChangeProfileButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChangeProfileButton.ChangeProfileButton_C
// 0x0058 (0x2FD0 - 0x2F78)
class UChangeProfileButton_C final : public UMarinerLayeredButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x2F78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DailyLoginAddedAnim;                               // 0x2F80(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoveredAnim;                                       // 0x2F88(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x2F90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Border;                                            // 0x2F98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DailyLoginAddedFrame;                              // 0x2FA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x2FA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LabelText;                                         // 0x2FB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Material;                                          // 0x2FB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerButton*                         OverlayButton;                                     // 0x2FC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnviewedItemWidget_C*                  UnviewedWidget;                                    // 0x2FC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ChangeProfileButton(int32 EntryPoint);
	void BndEvt__OverlayButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();

	struct FMarinerLayeredButtonAssets GetAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChangeProfileButton_C">();
	}
	static class UChangeProfileButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChangeProfileButton_C>();
	}
};
static_assert(alignof(UChangeProfileButton_C) == 0x000008, "Wrong alignment on UChangeProfileButton_C");
static_assert(sizeof(UChangeProfileButton_C) == 0x002FD0, "Wrong size on UChangeProfileButton_C");
static_assert(offsetof(UChangeProfileButton_C, UberGraphFrame) == 0x002F78, "Member 'UChangeProfileButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChangeProfileButton_C, DailyLoginAddedAnim) == 0x002F80, "Member 'UChangeProfileButton_C::DailyLoginAddedAnim' has a wrong offset!");
static_assert(offsetof(UChangeProfileButton_C, HoveredAnim) == 0x002F88, "Member 'UChangeProfileButton_C::HoveredAnim' has a wrong offset!");
static_assert(offsetof(UChangeProfileButton_C, Background) == 0x002F90, "Member 'UChangeProfileButton_C::Background' has a wrong offset!");
static_assert(offsetof(UChangeProfileButton_C, Border) == 0x002F98, "Member 'UChangeProfileButton_C::Border' has a wrong offset!");
static_assert(offsetof(UChangeProfileButton_C, DailyLoginAddedFrame) == 0x002FA0, "Member 'UChangeProfileButton_C::DailyLoginAddedFrame' has a wrong offset!");
static_assert(offsetof(UChangeProfileButton_C, Icon) == 0x002FA8, "Member 'UChangeProfileButton_C::Icon' has a wrong offset!");
static_assert(offsetof(UChangeProfileButton_C, LabelText) == 0x002FB0, "Member 'UChangeProfileButton_C::LabelText' has a wrong offset!");
static_assert(offsetof(UChangeProfileButton_C, Material) == 0x002FB8, "Member 'UChangeProfileButton_C::Material' has a wrong offset!");
static_assert(offsetof(UChangeProfileButton_C, OverlayButton) == 0x002FC0, "Member 'UChangeProfileButton_C::OverlayButton' has a wrong offset!");
static_assert(offsetof(UChangeProfileButton_C, UnviewedWidget) == 0x002FC8, "Member 'UChangeProfileButton_C::UnviewedWidget' has a wrong offset!");

}

