#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterCommonGameMode

#include "Basic.hpp"


namespace SDK::Params
{

// Function CharacterCommonGameMode.CharacterCommonGameMode_C.OnUpdateWidgetVisibility__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct CharacterCommonGameMode_C_OnUpdateWidgetVisibility__DelegateSignature final
{
public:
	bool                                          ShouldDisplay;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterCommonGameMode_C_OnUpdateWidgetVisibility__DelegateSignature) == 0x000001, "Wrong alignment on CharacterCommonGameMode_C_OnUpdateWidgetVisibility__DelegateSignature");
static_assert(sizeof(CharacterCommonGameMode_C_OnUpdateWidgetVisibility__DelegateSignature) == 0x000001, "Wrong size on CharacterCommonGameMode_C_OnUpdateWidgetVisibility__DelegateSignature");
static_assert(offsetof(CharacterCommonGameMode_C_OnUpdateWidgetVisibility__DelegateSignature, ShouldDisplay) == 0x000000, "Member 'CharacterCommonGameMode_C_OnUpdateWidgetVisibility__DelegateSignature::ShouldDisplay' has a wrong offset!");

// Function CharacterCommonGameMode.CharacterCommonGameMode_C.RemoveGameModeWidget
// 0x0001 (0x0001 - 0x0000)
struct CharacterCommonGameMode_C_RemoveGameModeWidget final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterCommonGameMode_C_RemoveGameModeWidget) == 0x000001, "Wrong alignment on CharacterCommonGameMode_C_RemoveGameModeWidget");
static_assert(sizeof(CharacterCommonGameMode_C_RemoveGameModeWidget) == 0x000001, "Wrong size on CharacterCommonGameMode_C_RemoveGameModeWidget");
static_assert(offsetof(CharacterCommonGameMode_C_RemoveGameModeWidget, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'CharacterCommonGameMode_C_RemoveGameModeWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CharacterCommonGameMode.CharacterCommonGameMode_C.CreateGameModeWidget
// 0x0038 (0x0038 - 0x0000)
struct CharacterCommonGameMode_C_CreateGameModeWidget final
{
public:
	class UClass*                                 WidgetClass;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerPinGameModeWidget*              WidgetInstance;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerPinGameModeWidget*              K2Node_DynamicCast_AsMariner_Pin_Game_Mode_Widget; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterCommonGameMode_C_CreateGameModeWidget) == 0x000008, "Wrong alignment on CharacterCommonGameMode_C_CreateGameModeWidget");
static_assert(sizeof(CharacterCommonGameMode_C_CreateGameModeWidget) == 0x000038, "Wrong size on CharacterCommonGameMode_C_CreateGameModeWidget");
static_assert(offsetof(CharacterCommonGameMode_C_CreateGameModeWidget, WidgetClass) == 0x000000, "Member 'CharacterCommonGameMode_C_CreateGameModeWidget::WidgetClass' has a wrong offset!");
static_assert(offsetof(CharacterCommonGameMode_C_CreateGameModeWidget, WidgetInstance) == 0x000008, "Member 'CharacterCommonGameMode_C_CreateGameModeWidget::WidgetInstance' has a wrong offset!");
static_assert(offsetof(CharacterCommonGameMode_C_CreateGameModeWidget, CallFunc_Create_ReturnValue) == 0x000010, "Member 'CharacterCommonGameMode_C_CreateGameModeWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonGameMode_C_CreateGameModeWidget, CallFunc_IsValidClass_ReturnValue) == 0x000018, "Member 'CharacterCommonGameMode_C_CreateGameModeWidget::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonGameMode_C_CreateGameModeWidget, K2Node_DynamicCast_AsMariner_Pin_Game_Mode_Widget) == 0x000020, "Member 'CharacterCommonGameMode_C_CreateGameModeWidget::K2Node_DynamicCast_AsMariner_Pin_Game_Mode_Widget' has a wrong offset!");
static_assert(offsetof(CharacterCommonGameMode_C_CreateGameModeWidget, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'CharacterCommonGameMode_C_CreateGameModeWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CharacterCommonGameMode_C_CreateGameModeWidget, CallFunc_AddChild_ReturnValue) == 0x000030, "Member 'CharacterCommonGameMode_C_CreateGameModeWidget::CallFunc_AddChild_ReturnValue' has a wrong offset!");

}

