#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterStoryandAbilities

#include "Basic.hpp"


namespace SDK::Params
{

// Function CharacterStoryandAbilities.CharacterStoryandAbilities_C.ExecuteUbergraph_CharacterStoryandAbilities
// 0x0028 (0x0028 - 0x0000)
struct CharacterStoryandAbilities_C_ExecuteUbergraph_CharacterStoryandAbilities final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerPlayableCharacter*              K2Node_CustomEvent_PlayableCharacter;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMarinerInputInterface> CallFunc_SetActiveInputWidget_InputWidget_CastInput; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bFromSubMenu;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterStoryandAbilities_C_ExecuteUbergraph_CharacterStoryandAbilities) == 0x000008, "Wrong alignment on CharacterStoryandAbilities_C_ExecuteUbergraph_CharacterStoryandAbilities");
static_assert(sizeof(CharacterStoryandAbilities_C_ExecuteUbergraph_CharacterStoryandAbilities) == 0x000028, "Wrong size on CharacterStoryandAbilities_C_ExecuteUbergraph_CharacterStoryandAbilities");
static_assert(offsetof(CharacterStoryandAbilities_C_ExecuteUbergraph_CharacterStoryandAbilities, EntryPoint) == 0x000000, "Member 'CharacterStoryandAbilities_C_ExecuteUbergraph_CharacterStoryandAbilities::EntryPoint' has a wrong offset!");
static_assert(offsetof(CharacterStoryandAbilities_C_ExecuteUbergraph_CharacterStoryandAbilities, K2Node_CustomEvent_PlayableCharacter) == 0x000008, "Member 'CharacterStoryandAbilities_C_ExecuteUbergraph_CharacterStoryandAbilities::K2Node_CustomEvent_PlayableCharacter' has a wrong offset!");
static_assert(offsetof(CharacterStoryandAbilities_C_ExecuteUbergraph_CharacterStoryandAbilities, CallFunc_SetActiveInputWidget_InputWidget_CastInput) == 0x000010, "Member 'CharacterStoryandAbilities_C_ExecuteUbergraph_CharacterStoryandAbilities::CallFunc_SetActiveInputWidget_InputWidget_CastInput' has a wrong offset!");
static_assert(offsetof(CharacterStoryandAbilities_C_ExecuteUbergraph_CharacterStoryandAbilities, K2Node_Event_bFromSubMenu) == 0x000020, "Member 'CharacterStoryandAbilities_C_ExecuteUbergraph_CharacterStoryandAbilities::K2Node_Event_bFromSubMenu' has a wrong offset!");

// Function CharacterStoryandAbilities.CharacterStoryandAbilities_C.PopulateCharacter
// 0x0008 (0x0008 - 0x0000)
struct CharacterStoryandAbilities_C_PopulateCharacter final
{
public:
	class UMarinerPlayableCharacter*              PlayableCharacter;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterStoryandAbilities_C_PopulateCharacter) == 0x000008, "Wrong alignment on CharacterStoryandAbilities_C_PopulateCharacter");
static_assert(sizeof(CharacterStoryandAbilities_C_PopulateCharacter) == 0x000008, "Wrong size on CharacterStoryandAbilities_C_PopulateCharacter");
static_assert(offsetof(CharacterStoryandAbilities_C_PopulateCharacter, PlayableCharacter) == 0x000000, "Member 'CharacterStoryandAbilities_C_PopulateCharacter::PlayableCharacter' has a wrong offset!");

// Function CharacterStoryandAbilities.CharacterStoryandAbilities_C.BP_OnEntered
// 0x0001 (0x0001 - 0x0000)
struct CharacterStoryandAbilities_C_BP_OnEntered final
{
public:
	bool                                          bFromSubMenu;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterStoryandAbilities_C_BP_OnEntered) == 0x000001, "Wrong alignment on CharacterStoryandAbilities_C_BP_OnEntered");
static_assert(sizeof(CharacterStoryandAbilities_C_BP_OnEntered) == 0x000001, "Wrong size on CharacterStoryandAbilities_C_BP_OnEntered");
static_assert(offsetof(CharacterStoryandAbilities_C_BP_OnEntered, bFromSubMenu) == 0x000000, "Member 'CharacterStoryandAbilities_C_BP_OnEntered::bFromSubMenu' has a wrong offset!");

// Function CharacterStoryandAbilities.CharacterStoryandAbilities_C.Populate
// 0x0020 (0x0020 - 0x0000)
struct CharacterStoryandAbilities_C_Populate final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerVoiceOverManager*               CallFunc_GetVoiceOverManager_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Populate_ReturnValue;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterStoryandAbilities_C_Populate) == 0x000008, "Wrong alignment on CharacterStoryandAbilities_C_Populate");
static_assert(sizeof(CharacterStoryandAbilities_C_Populate) == 0x000020, "Wrong size on CharacterStoryandAbilities_C_Populate");
static_assert(offsetof(CharacterStoryandAbilities_C_Populate, ReturnValue) == 0x000000, "Member 'CharacterStoryandAbilities_C_Populate::ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterStoryandAbilities_C_Populate, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'CharacterStoryandAbilities_C_Populate::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterStoryandAbilities_C_Populate, CallFunc_GetVoiceOverManager_ReturnValue) == 0x000010, "Member 'CharacterStoryandAbilities_C_Populate::CallFunc_GetVoiceOverManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterStoryandAbilities_C_Populate, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'CharacterStoryandAbilities_C_Populate::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterStoryandAbilities_C_Populate, CallFunc_Populate_ReturnValue) == 0x000019, "Member 'CharacterStoryandAbilities_C_Populate::CallFunc_Populate_ReturnValue' has a wrong offset!");

}

