#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterCustomization_ReturnTrails

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CharacterCustomization_ReturnTrails.CharacterCustomization_ReturnTrails_C.ExecuteUbergraph_CharacterCustomization_ReturnTrails
// 0x01B8 (0x01B8 - 0x0000)
struct CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerPlayableCharacter*              CallFunc_GetCurrentCharacter_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0010(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0020(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0030(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0040(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_2;                            // 0x0050(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0060(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_3;                            // 0x0070(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x0080(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<class AReturnTrailCutomizationHandler_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x0090(0x0010)(ZeroConstructor, ReferenceParm)
	class UObject*                                Temp_object_Variable;                              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AReturnTrailCutomizationHandler_C*      CallFunc_Array_Get_Item;                           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerItemLoadResponseButton*         K2Node_Event_ButtonInstance;                       // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerCMSItemDataAsset*               CallFunc_GetLoadedCMSItemDataAsset_ReturnValue;    // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPathName_ReturnValue;                  // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UMarinerReturnTrailDataAsset*           K2Node_DynamicCast_AsMariner_Return_Trail_Data_Asset; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0100(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0118(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0160(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0170(0x0018)()
	int32                                         CallFunc_PostEvent_ReturnValue_2;                  // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFromSubMenu;                         // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bToSubLayer;                          // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18E[0x2];                                      // 0x018E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_3;                  // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x01A4(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails) == 0x000008, "Wrong alignment on CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails");
static_assert(sizeof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails) == 0x0001B8, "Wrong size on CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, EntryPoint) == 0x000000, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::EntryPoint' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, CallFunc_GetCurrentCharacter_ReturnValue) == 0x000008, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::CallFunc_GetCurrentCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, Temp_struct_Variable) == 0x000010, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, Temp_delegate_Variable) == 0x000020, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, Temp_struct_Variable_1) == 0x000030, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, Temp_delegate_Variable_1) == 0x000040, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, Temp_struct_Variable_2) == 0x000050, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, Temp_delegate_Variable_2) == 0x000060, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, Temp_struct_Variable_3) == 0x000070, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, Temp_delegate_Variable_3) == 0x000080, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, CallFunc_GetAllActorsOfClass_OutActors) == 0x000090, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, Temp_object_Variable) == 0x0000A0, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, K2Node_DynamicCast_AsParticle_System) == 0x0000B0, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::K2Node_DynamicCast_AsParticle_System' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, CallFunc_Array_Length_ReturnValue) == 0x0000BC, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, CallFunc_Greater_IntInt_ReturnValue) == 0x0000C0, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, K2Node_Event_ButtonInstance) == 0x0000C8, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::K2Node_Event_ButtonInstance' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, CallFunc_PostEvent_ReturnValue) == 0x0000D0, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, CallFunc_GetLoadedCMSItemDataAsset_ReturnValue) == 0x0000D8, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::CallFunc_GetLoadedCMSItemDataAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, CallFunc_GetPathName_ReturnValue) == 0x0000E0, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::CallFunc_GetPathName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, K2Node_DynamicCast_AsMariner_Return_Trail_Data_Asset) == 0x0000F0, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::K2Node_DynamicCast_AsMariner_Return_Trail_Data_Asset' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, K2Node_DynamicCast_bSuccess_1) == 0x0000F8, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, CallFunc_Conv_StringToText_ReturnValue) == 0x000100, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, K2Node_MakeStruct_FormatArgumentData) == 0x000118, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, CallFunc_PostEvent_ReturnValue_1) == 0x000158, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, K2Node_MakeArray_Array) == 0x000160, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, CallFunc_Format_ReturnValue) == 0x000170, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, CallFunc_PostEvent_ReturnValue_2) == 0x000188, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::CallFunc_PostEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, K2Node_Event_bFromSubMenu) == 0x00018C, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::K2Node_Event_bFromSubMenu' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, K2Node_Event_bToSubLayer) == 0x00018D, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::K2Node_Event_bToSubLayer' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, CallFunc_GetOwningPlayer_ReturnValue) == 0x000190, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, K2Node_CustomEvent_Loaded) == 0x000198, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, CallFunc_PostEvent_ReturnValue_3) == 0x0001A0, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::CallFunc_PostEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails, K2Node_CreateDelegate_OutputDelegate) == 0x0001A4, "Member 'CharacterCustomization_ReturnTrails_C_ExecuteUbergraph_CharacterCustomization_ReturnTrails::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function CharacterCustomization_ReturnTrails.CharacterCustomization_ReturnTrails_C.BP_OnExited
// 0x0001 (0x0001 - 0x0000)
struct CharacterCustomization_ReturnTrails_C_BP_OnExited final
{
public:
	bool                                          bToSubLayer;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterCustomization_ReturnTrails_C_BP_OnExited) == 0x000001, "Wrong alignment on CharacterCustomization_ReturnTrails_C_BP_OnExited");
static_assert(sizeof(CharacterCustomization_ReturnTrails_C_BP_OnExited) == 0x000001, "Wrong size on CharacterCustomization_ReturnTrails_C_BP_OnExited");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_BP_OnExited, bToSubLayer) == 0x000000, "Member 'CharacterCustomization_ReturnTrails_C_BP_OnExited::bToSubLayer' has a wrong offset!");

// Function CharacterCustomization_ReturnTrails.CharacterCustomization_ReturnTrails_C.BP_OnEntered
// 0x0001 (0x0001 - 0x0000)
struct CharacterCustomization_ReturnTrails_C_BP_OnEntered final
{
public:
	bool                                          bFromSubMenu;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterCustomization_ReturnTrails_C_BP_OnEntered) == 0x000001, "Wrong alignment on CharacterCustomization_ReturnTrails_C_BP_OnEntered");
static_assert(sizeof(CharacterCustomization_ReturnTrails_C_BP_OnEntered) == 0x000001, "Wrong size on CharacterCustomization_ReturnTrails_C_BP_OnEntered");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_BP_OnEntered, bFromSubMenu) == 0x000000, "Member 'CharacterCustomization_ReturnTrails_C_BP_OnEntered::bFromSubMenu' has a wrong offset!");

// Function CharacterCustomization_ReturnTrails.CharacterCustomization_ReturnTrails_C.OnLoaded_786CCF914375DEA3F863D3B864B0F5F4
// 0x0008 (0x0008 - 0x0000)
struct CharacterCustomization_ReturnTrails_C_OnLoaded_786CCF914375DEA3F863D3B864B0F5F4 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterCustomization_ReturnTrails_C_OnLoaded_786CCF914375DEA3F863D3B864B0F5F4) == 0x000008, "Wrong alignment on CharacterCustomization_ReturnTrails_C_OnLoaded_786CCF914375DEA3F863D3B864B0F5F4");
static_assert(sizeof(CharacterCustomization_ReturnTrails_C_OnLoaded_786CCF914375DEA3F863D3B864B0F5F4) == 0x000008, "Wrong size on CharacterCustomization_ReturnTrails_C_OnLoaded_786CCF914375DEA3F863D3B864B0F5F4");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_OnLoaded_786CCF914375DEA3F863D3B864B0F5F4, Loaded) == 0x000000, "Member 'CharacterCustomization_ReturnTrails_C_OnLoaded_786CCF914375DEA3F863D3B864B0F5F4::Loaded' has a wrong offset!");

// Function CharacterCustomization_ReturnTrails.CharacterCustomization_ReturnTrails_C.VisualizeSelectedButton
// 0x0008 (0x0008 - 0x0000)
struct CharacterCustomization_ReturnTrails_C_VisualizeSelectedButton final
{
public:
	class UMarinerItemLoadResponseButton*         ButtonInstance;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterCustomization_ReturnTrails_C_VisualizeSelectedButton) == 0x000008, "Wrong alignment on CharacterCustomization_ReturnTrails_C_VisualizeSelectedButton");
static_assert(sizeof(CharacterCustomization_ReturnTrails_C_VisualizeSelectedButton) == 0x000008, "Wrong size on CharacterCustomization_ReturnTrails_C_VisualizeSelectedButton");
static_assert(offsetof(CharacterCustomization_ReturnTrails_C_VisualizeSelectedButton, ButtonInstance) == 0x000000, "Member 'CharacterCustomization_ReturnTrails_C_VisualizeSelectedButton::ButtonInstance' has a wrong offset!");

}

