#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterCustomization_Emote

#include "Basic.hpp"


namespace SDK::Params
{

// Function CharacterCustomization_Emote.CharacterCustomization_Emote_C.ExecuteUbergraph_CharacterCustomization_Emote
// 0x0020 (0x0020 - 0x0000)
struct CharacterCustomization_Emote_C_ExecuteUbergraph_CharacterCustomization_Emote final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemLoadResponse*                      K2Node_Event_LoadResponse;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerCMSItemDataAsset*               K2Node_Event_DataAsset;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerPlayableCharacter*              K2Node_Event_Character;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterCustomization_Emote_C_ExecuteUbergraph_CharacterCustomization_Emote) == 0x000008, "Wrong alignment on CharacterCustomization_Emote_C_ExecuteUbergraph_CharacterCustomization_Emote");
static_assert(sizeof(CharacterCustomization_Emote_C_ExecuteUbergraph_CharacterCustomization_Emote) == 0x000020, "Wrong size on CharacterCustomization_Emote_C_ExecuteUbergraph_CharacterCustomization_Emote");
static_assert(offsetof(CharacterCustomization_Emote_C_ExecuteUbergraph_CharacterCustomization_Emote, EntryPoint) == 0x000000, "Member 'CharacterCustomization_Emote_C_ExecuteUbergraph_CharacterCustomization_Emote::EntryPoint' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_Emote_C_ExecuteUbergraph_CharacterCustomization_Emote, K2Node_Event_LoadResponse) == 0x000008, "Member 'CharacterCustomization_Emote_C_ExecuteUbergraph_CharacterCustomization_Emote::K2Node_Event_LoadResponse' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_Emote_C_ExecuteUbergraph_CharacterCustomization_Emote, K2Node_Event_DataAsset) == 0x000010, "Member 'CharacterCustomization_Emote_C_ExecuteUbergraph_CharacterCustomization_Emote::K2Node_Event_DataAsset' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_Emote_C_ExecuteUbergraph_CharacterCustomization_Emote, K2Node_Event_Character) == 0x000018, "Member 'CharacterCustomization_Emote_C_ExecuteUbergraph_CharacterCustomization_Emote::K2Node_Event_Character' has a wrong offset!");

// Function CharacterCustomization_Emote.CharacterCustomization_Emote_C.PopulateUnlockPreview
// 0x0018 (0x0018 - 0x0000)
struct CharacterCustomization_Emote_C_PopulateUnlockPreview final
{
public:
	class UItemLoadResponse*                      LoadResponse;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerCMSItemDataAsset*               DataAsset;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerPlayableCharacter*              Character;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterCustomization_Emote_C_PopulateUnlockPreview) == 0x000008, "Wrong alignment on CharacterCustomization_Emote_C_PopulateUnlockPreview");
static_assert(sizeof(CharacterCustomization_Emote_C_PopulateUnlockPreview) == 0x000018, "Wrong size on CharacterCustomization_Emote_C_PopulateUnlockPreview");
static_assert(offsetof(CharacterCustomization_Emote_C_PopulateUnlockPreview, LoadResponse) == 0x000000, "Member 'CharacterCustomization_Emote_C_PopulateUnlockPreview::LoadResponse' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_Emote_C_PopulateUnlockPreview, DataAsset) == 0x000008, "Member 'CharacterCustomization_Emote_C_PopulateUnlockPreview::DataAsset' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_Emote_C_PopulateUnlockPreview, Character) == 0x000010, "Member 'CharacterCustomization_Emote_C_PopulateUnlockPreview::Character' has a wrong offset!");

}

