#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterSelectCancelCharacterButton

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CharacterSelectCancelCharacterButton.CharacterSelectCancelCharacterButton_C
// 0x0050 (0x2FC8 - 0x2F78)
class UCharacterSelectCancelCharacterButton_C final : public UMarinerLayeredButton
{
public:
	class UWidgetAnimation*                       ButtonIdleAnim;                                    // 0x2F78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x2F80(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x2F88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Border;                                            // 0x2F90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x2F98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x2FA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Material;                                          // 0x2FA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PrimaryText;                                       // 0x2FB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPromptBanner_C*                 PromptBanner;                                      // 0x2FB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               RootSizeBox;                                       // 0x2FC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FMarinerLayeredButtonAssets GetAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CharacterSelectCancelCharacterButton_C">();
	}
	static class UCharacterSelectCancelCharacterButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterSelectCancelCharacterButton_C>();
	}
};
static_assert(alignof(UCharacterSelectCancelCharacterButton_C) == 0x000008, "Wrong alignment on UCharacterSelectCancelCharacterButton_C");
static_assert(sizeof(UCharacterSelectCancelCharacterButton_C) == 0x002FC8, "Wrong size on UCharacterSelectCancelCharacterButton_C");
static_assert(offsetof(UCharacterSelectCancelCharacterButton_C, ButtonIdleAnim) == 0x002F78, "Member 'UCharacterSelectCancelCharacterButton_C::ButtonIdleAnim' has a wrong offset!");
static_assert(offsetof(UCharacterSelectCancelCharacterButton_C, HoverAnim) == 0x002F80, "Member 'UCharacterSelectCancelCharacterButton_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UCharacterSelectCancelCharacterButton_C, Background) == 0x002F88, "Member 'UCharacterSelectCancelCharacterButton_C::Background' has a wrong offset!");
static_assert(offsetof(UCharacterSelectCancelCharacterButton_C, Border) == 0x002F90, "Member 'UCharacterSelectCancelCharacterButton_C::Border' has a wrong offset!");
static_assert(offsetof(UCharacterSelectCancelCharacterButton_C, Button) == 0x002F98, "Member 'UCharacterSelectCancelCharacterButton_C::Button' has a wrong offset!");
static_assert(offsetof(UCharacterSelectCancelCharacterButton_C, Icon) == 0x002FA0, "Member 'UCharacterSelectCancelCharacterButton_C::Icon' has a wrong offset!");
static_assert(offsetof(UCharacterSelectCancelCharacterButton_C, Material) == 0x002FA8, "Member 'UCharacterSelectCancelCharacterButton_C::Material' has a wrong offset!");
static_assert(offsetof(UCharacterSelectCancelCharacterButton_C, PrimaryText) == 0x002FB0, "Member 'UCharacterSelectCancelCharacterButton_C::PrimaryText' has a wrong offset!");
static_assert(offsetof(UCharacterSelectCancelCharacterButton_C, PromptBanner) == 0x002FB8, "Member 'UCharacterSelectCancelCharacterButton_C::PromptBanner' has a wrong offset!");
static_assert(offsetof(UCharacterSelectCancelCharacterButton_C, RootSizeBox) == 0x002FC0, "Member 'UCharacterSelectCancelCharacterButton_C::RootSizeBox' has a wrong offset!");

}

