#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterCommonPin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameModeEnums_structs.hpp"
#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function CharacterCommonPin.CharacterCommonPin_C.ExecuteUbergraph_CharacterCommonPin
// 0x0210 (0x0210 - 0x0000)
struct CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EWidgetAnimationState                         CallFunc_GetWidgetAnimationState_ReturnValue;      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetOnTimerCompleted_ReturnValue;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AMarinerCharacter*                      CallFunc_GetCharacterReference_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEdgeOfScreen;                        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bHasLineOfSight;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMarinerArenaReturnState                      K2Node_Event_PreviousState;                        // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMarinerArenaReturnState                      K2Node_Event_NewState;                             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_Event_GameModeWidget;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMarinerPlayerState*                    K2Node_Event_PlayerState;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerPinGameModeWidget*              CallFunc_CreateGameModeWidget_WidgetInstance;      // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_Event_Brush;                                // 0x0050(0x0088)(ConstParm)
	bool                                          K2Node_Event_bForcesPinVisible;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bImageCanDim;                         // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AMarinerGameState*                      K2Node_DynamicCast_AsMariner_Game_State;           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInNameViewCone;                      // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerDamageableComponent*            Temp_object_Variable;                              // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMegablasted_ReturnValue;                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bForcedOn;                            // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Text;                                 // 0x0100(0x0018)(ConstParm)
	int32                                         K2Node_CustomEvent_OnePlayerWithStockTeamIndex;    // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMarinerPlayerState*                    K2Node_Event_MegablastInstigator;                  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0128(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_NewActorReference;                    // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMarinerCharacter*                      K2Node_DynamicCast_AsMariner_Character;            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x017C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMarinerPlayerState*                    K2Node_DynamicCast_AsMariner_Player_State;         // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlastbarNavpinMegablast_C*             CallFunc_CreateMegablastWidget_BlastbarWidget;     // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_1;                           // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMarinerDamageableObjectInterface> K2Node_DynamicCast_AsMariner_Damageable_Object_Interface; // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerDamageableComponent*            CallFunc_BP_GetDamageableComponent_ReturnValue;    // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ForceHide;                      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UMarinerDamageableComponent*      K2Node_CustomEvent_RelevantDamageableComponent;    // 0x01E8(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewAmount;                      // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_OldAmount;                      // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01FC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GetMatchStatus_CanPlayMessages;           // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin) == 0x000008, "Wrong alignment on CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin");
static_assert(sizeof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin) == 0x000210, "Wrong size on CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, EntryPoint) == 0x000000, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::EntryPoint' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, Temp_bool_Variable) == 0x000004, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, CallFunc_GetWidgetAnimationState_ReturnValue) == 0x000005, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::CallFunc_GetWidgetAnimationState_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, CallFunc_SetOnTimerCompleted_ReturnValue) == 0x000006, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::CallFunc_SetOnTimerCompleted_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000007, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, CallFunc_GetCharacterReference_ReturnValue) == 0x000008, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::CallFunc_GetCharacterReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, K2Node_Event_bEdgeOfScreen) == 0x000010, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::K2Node_Event_bEdgeOfScreen' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, K2Node_Event_bHasLineOfSight) == 0x000011, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::K2Node_Event_bHasLineOfSight' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, K2Node_Event_PreviousState) == 0x000012, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::K2Node_Event_PreviousState' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, K2Node_Event_NewState) == 0x000013, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::K2Node_Event_NewState' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, K2Node_Select_Default) == 0x000018, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000020, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, K2Node_Event_GameModeWidget) == 0x000030, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::K2Node_Event_GameModeWidget' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, K2Node_Event_PlayerState) == 0x000038, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::K2Node_Event_PlayerState' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, CallFunc_CreateGameModeWidget_WidgetInstance) == 0x000040, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::CallFunc_CreateGameModeWidget_WidgetInstance' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, CallFunc_GetGameState_ReturnValue) == 0x000048, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, K2Node_Event_Brush) == 0x000050, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::K2Node_Event_Brush' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, K2Node_Event_bForcesPinVisible) == 0x0000D8, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::K2Node_Event_bForcesPinVisible' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, K2Node_Event_bImageCanDim) == 0x0000D9, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::K2Node_Event_bImageCanDim' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, K2Node_DynamicCast_AsMariner_Game_State) == 0x0000E0, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::K2Node_DynamicCast_AsMariner_Game_State' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, K2Node_Event_bInNameViewCone) == 0x0000E9, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::K2Node_Event_bInNameViewCone' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, Temp_object_Variable) == 0x0000F0, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, CallFunc_IsMegablasted_ReturnValue) == 0x0000F8, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::CallFunc_IsMegablasted_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, K2Node_Event_bForcedOn) == 0x0000F9, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::K2Node_Event_bForcedOn' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, K2Node_Event_Text) == 0x000100, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::K2Node_Event_Text' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, K2Node_CustomEvent_OnePlayerWithStockTeamIndex) == 0x000118, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::K2Node_CustomEvent_OnePlayerWithStockTeamIndex' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, K2Node_Event_MegablastInstigator) == 0x000120, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::K2Node_Event_MegablastInstigator' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, K2Node_Event_MyGeometry) == 0x000128, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, K2Node_Event_InDeltaTime) == 0x000160, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, K2Node_Event_NewActorReference) == 0x000168, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::K2Node_Event_NewActorReference' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, K2Node_DynamicCast_AsMariner_Character) == 0x000170, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::K2Node_DynamicCast_AsMariner_Character' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, K2Node_DynamicCast_bSuccess_1) == 0x000178, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, CallFunc_MakeVector2D_ReturnValue) == 0x00017C, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, K2Node_DynamicCast_AsMariner_Player_State) == 0x000188, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::K2Node_DynamicCast_AsMariner_Player_State' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, K2Node_DynamicCast_bSuccess_2) == 0x000190, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, CallFunc_CreateMegablastWidget_BlastbarWidget) == 0x000198, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::CallFunc_CreateMegablastWidget_BlastbarWidget' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, CallFunc_GetOwningPlayer_ReturnValue) == 0x0001A0, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, Temp_bool_Variable_1) == 0x0001A8, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001A9, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, K2Node_Select_Default_1) == 0x0001B0, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x0001B8, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, K2Node_DynamicCast_AsMariner_Damageable_Object_Interface) == 0x0001C0, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::K2Node_DynamicCast_AsMariner_Damageable_Object_Interface' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, K2Node_DynamicCast_bSuccess_3) == 0x0001D0, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, CallFunc_BP_GetDamageableComponent_ReturnValue) == 0x0001D8, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::CallFunc_BP_GetDamageableComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, K2Node_CustomEvent_ForceHide) == 0x0001E0, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::K2Node_CustomEvent_ForceHide' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, K2Node_CustomEvent_RelevantDamageableComponent) == 0x0001E8, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::K2Node_CustomEvent_RelevantDamageableComponent' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, K2Node_CustomEvent_NewAmount) == 0x0001F0, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::K2Node_CustomEvent_NewAmount' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, K2Node_CustomEvent_OldAmount) == 0x0001F4, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::K2Node_CustomEvent_OldAmount' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0001F8, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, K2Node_CreateDelegate_OutputDelegate) == 0x0001FC, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin, CallFunc_GetMatchStatus_CanPlayMessages) == 0x00020C, "Member 'CharacterCommonPin_C_ExecuteUbergraph_CharacterCommonPin::CallFunc_GetMatchStatus_CanPlayMessages' has a wrong offset!");

// Function CharacterCommonPin.CharacterCommonPin_C.OnDamaged
// 0x0010 (0x0010 - 0x0000)
struct CharacterCommonPin_C_OnDamaged final
{
public:
	const class UMarinerDamageableComponent*      RelevantDamageableComponent;                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewAmount;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldAmount;                                         // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterCommonPin_C_OnDamaged) == 0x000008, "Wrong alignment on CharacterCommonPin_C_OnDamaged");
static_assert(sizeof(CharacterCommonPin_C_OnDamaged) == 0x000010, "Wrong size on CharacterCommonPin_C_OnDamaged");
static_assert(offsetof(CharacterCommonPin_C_OnDamaged, RelevantDamageableComponent) == 0x000000, "Member 'CharacterCommonPin_C_OnDamaged::RelevantDamageableComponent' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_OnDamaged, NewAmount) == 0x000008, "Member 'CharacterCommonPin_C_OnDamaged::NewAmount' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_OnDamaged, OldAmount) == 0x00000C, "Member 'CharacterCommonPin_C_OnDamaged::OldAmount' has a wrong offset!");

// Function CharacterCommonPin.CharacterCommonPin_C.SetForceHideDamage
// 0x0001 (0x0001 - 0x0000)
struct CharacterCommonPin_C_SetForceHideDamage final
{
public:
	bool                                          ForceHide;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterCommonPin_C_SetForceHideDamage) == 0x000001, "Wrong alignment on CharacterCommonPin_C_SetForceHideDamage");
static_assert(sizeof(CharacterCommonPin_C_SetForceHideDamage) == 0x000001, "Wrong size on CharacterCommonPin_C_SetForceHideDamage");
static_assert(offsetof(CharacterCommonPin_C_SetForceHideDamage, ForceHide) == 0x000000, "Member 'CharacterCommonPin_C_SetForceHideDamage::ForceHide' has a wrong offset!");

// Function CharacterCommonPin.CharacterCommonPin_C.OnActorReferenceChanged
// 0x0008 (0x0008 - 0x0000)
struct CharacterCommonPin_C_OnActorReferenceChanged final
{
public:
	class AActor*                                 NewActorReference;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterCommonPin_C_OnActorReferenceChanged) == 0x000008, "Wrong alignment on CharacterCommonPin_C_OnActorReferenceChanged");
static_assert(sizeof(CharacterCommonPin_C_OnActorReferenceChanged) == 0x000008, "Wrong size on CharacterCommonPin_C_OnActorReferenceChanged");
static_assert(offsetof(CharacterCommonPin_C_OnActorReferenceChanged, NewActorReference) == 0x000000, "Member 'CharacterCommonPin_C_OnActorReferenceChanged::NewActorReference' has a wrong offset!");

// Function CharacterCommonPin.CharacterCommonPin_C.Tick
// 0x003C (0x003C - 0x0000)
struct CharacterCommonPin_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterCommonPin_C_Tick) == 0x000004, "Wrong alignment on CharacterCommonPin_C_Tick");
static_assert(sizeof(CharacterCommonPin_C_Tick) == 0x00003C, "Wrong size on CharacterCommonPin_C_Tick");
static_assert(offsetof(CharacterCommonPin_C_Tick, MyGeometry) == 0x000000, "Member 'CharacterCommonPin_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_Tick, InDeltaTime) == 0x000038, "Member 'CharacterCommonPin_C_Tick::InDeltaTime' has a wrong offset!");

// Function CharacterCommonPin.CharacterCommonPin_C.HandleMegablastEvent
// 0x0008 (0x0008 - 0x0000)
struct CharacterCommonPin_C_HandleMegablastEvent final
{
public:
	class AMarinerPlayerState*                    MegablastInstigator;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterCommonPin_C_HandleMegablastEvent) == 0x000008, "Wrong alignment on CharacterCommonPin_C_HandleMegablastEvent");
static_assert(sizeof(CharacterCommonPin_C_HandleMegablastEvent) == 0x000008, "Wrong size on CharacterCommonPin_C_HandleMegablastEvent");
static_assert(offsetof(CharacterCommonPin_C_HandleMegablastEvent, MegablastInstigator) == 0x000000, "Member 'CharacterCommonPin_C_HandleMegablastEvent::MegablastInstigator' has a wrong offset!");

// Function CharacterCommonPin.CharacterCommonPin_C.FlashLastPlayerPin
// 0x0004 (0x0004 - 0x0000)
struct CharacterCommonPin_C_FlashLastPlayerPin final
{
public:
	int32                                         OnePlayerWithStockTeamIndex;                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterCommonPin_C_FlashLastPlayerPin) == 0x000004, "Wrong alignment on CharacterCommonPin_C_FlashLastPlayerPin");
static_assert(sizeof(CharacterCommonPin_C_FlashLastPlayerPin) == 0x000004, "Wrong size on CharacterCommonPin_C_FlashLastPlayerPin");
static_assert(offsetof(CharacterCommonPin_C_FlashLastPlayerPin, OnePlayerWithStockTeamIndex) == 0x000000, "Member 'CharacterCommonPin_C_FlashLastPlayerPin::OnePlayerWithStockTeamIndex' has a wrong offset!");

// Function CharacterCommonPin.CharacterCommonPin_C.SetActionText
// 0x0018 (0x0018 - 0x0000)
struct CharacterCommonPin_C_SetActionText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(CharacterCommonPin_C_SetActionText) == 0x000008, "Wrong alignment on CharacterCommonPin_C_SetActionText");
static_assert(sizeof(CharacterCommonPin_C_SetActionText) == 0x000018, "Wrong size on CharacterCommonPin_C_SetActionText");
static_assert(offsetof(CharacterCommonPin_C_SetActionText, Text) == 0x000000, "Member 'CharacterCommonPin_C_SetActionText::Text' has a wrong offset!");

// Function CharacterCommonPin.CharacterCommonPin_C.SetForcedOn
// 0x0001 (0x0001 - 0x0000)
struct CharacterCommonPin_C_SetForcedOn final
{
public:
	bool                                          bForcedOn;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterCommonPin_C_SetForcedOn) == 0x000001, "Wrong alignment on CharacterCommonPin_C_SetForcedOn");
static_assert(sizeof(CharacterCommonPin_C_SetForcedOn) == 0x000001, "Wrong size on CharacterCommonPin_C_SetForcedOn");
static_assert(offsetof(CharacterCommonPin_C_SetForcedOn, bForcedOn) == 0x000000, "Member 'CharacterCommonPin_C_SetForcedOn::bForcedOn' has a wrong offset!");

// Function CharacterCommonPin.CharacterCommonPin_C.SetIcon
// 0x0090 (0x0090 - 0x0000)
struct CharacterCommonPin_C_SetIcon final
{
public:
	struct FSlateBrush                            Brush;                                             // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bForcesPinVisible;                                 // 0x0088(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bImageCanDim;                                      // 0x0089(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterCommonPin_C_SetIcon) == 0x000008, "Wrong alignment on CharacterCommonPin_C_SetIcon");
static_assert(sizeof(CharacterCommonPin_C_SetIcon) == 0x000090, "Wrong size on CharacterCommonPin_C_SetIcon");
static_assert(offsetof(CharacterCommonPin_C_SetIcon, Brush) == 0x000000, "Member 'CharacterCommonPin_C_SetIcon::Brush' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_SetIcon, bForcesPinVisible) == 0x000088, "Member 'CharacterCommonPin_C_SetIcon::bForcesPinVisible' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_SetIcon, bImageCanDim) == 0x000089, "Member 'CharacterCommonPin_C_SetIcon::bImageCanDim' has a wrong offset!");

// Function CharacterCommonPin.CharacterCommonPin_C.SetGameModeWidget
// 0x0010 (0x0010 - 0x0000)
struct CharacterCommonPin_C_SetGameModeWidget final
{
public:
	TSubclassOf<class UMarinerPinGameModeWidget>  GameModeWidget_0;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AMarinerPlayerState*                    PlayerState;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterCommonPin_C_SetGameModeWidget) == 0x000008, "Wrong alignment on CharacterCommonPin_C_SetGameModeWidget");
static_assert(sizeof(CharacterCommonPin_C_SetGameModeWidget) == 0x000010, "Wrong size on CharacterCommonPin_C_SetGameModeWidget");
static_assert(offsetof(CharacterCommonPin_C_SetGameModeWidget, GameModeWidget_0) == 0x000000, "Member 'CharacterCommonPin_C_SetGameModeWidget::GameModeWidget_0' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_SetGameModeWidget, PlayerState) == 0x000008, "Member 'CharacterCommonPin_C_SetGameModeWidget::PlayerState' has a wrong offset!");

// Function CharacterCommonPin.CharacterCommonPin_C.OnCharacterArenaReturnStateChanged
// 0x0002 (0x0002 - 0x0000)
struct CharacterCommonPin_C_OnCharacterArenaReturnStateChanged final
{
public:
	EMarinerArenaReturnState                      PreviousState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMarinerArenaReturnState                      NewState;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterCommonPin_C_OnCharacterArenaReturnStateChanged) == 0x000001, "Wrong alignment on CharacterCommonPin_C_OnCharacterArenaReturnStateChanged");
static_assert(sizeof(CharacterCommonPin_C_OnCharacterArenaReturnStateChanged) == 0x000002, "Wrong size on CharacterCommonPin_C_OnCharacterArenaReturnStateChanged");
static_assert(offsetof(CharacterCommonPin_C_OnCharacterArenaReturnStateChanged, PreviousState) == 0x000000, "Member 'CharacterCommonPin_C_OnCharacterArenaReturnStateChanged::PreviousState' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_OnCharacterArenaReturnStateChanged, NewState) == 0x000001, "Member 'CharacterCommonPin_C_OnCharacterArenaReturnStateChanged::NewState' has a wrong offset!");

// Function CharacterCommonPin.CharacterCommonPin_C.OnHasLineOfSightToActorChanged
// 0x0001 (0x0001 - 0x0000)
struct CharacterCommonPin_C_OnHasLineOfSightToActorChanged final
{
public:
	bool                                          bHasLineOfSight;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterCommonPin_C_OnHasLineOfSightToActorChanged) == 0x000001, "Wrong alignment on CharacterCommonPin_C_OnHasLineOfSightToActorChanged");
static_assert(sizeof(CharacterCommonPin_C_OnHasLineOfSightToActorChanged) == 0x000001, "Wrong size on CharacterCommonPin_C_OnHasLineOfSightToActorChanged");
static_assert(offsetof(CharacterCommonPin_C_OnHasLineOfSightToActorChanged, bHasLineOfSight) == 0x000000, "Member 'CharacterCommonPin_C_OnHasLineOfSightToActorChanged::bHasLineOfSight' has a wrong offset!");

// Function CharacterCommonPin.CharacterCommonPin_C.OnIsAtEdgeOfScreenChanged
// 0x0001 (0x0001 - 0x0000)
struct CharacterCommonPin_C_OnIsAtEdgeOfScreenChanged final
{
public:
	bool                                          bEdgeOfScreen;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterCommonPin_C_OnIsAtEdgeOfScreenChanged) == 0x000001, "Wrong alignment on CharacterCommonPin_C_OnIsAtEdgeOfScreenChanged");
static_assert(sizeof(CharacterCommonPin_C_OnIsAtEdgeOfScreenChanged) == 0x000001, "Wrong size on CharacterCommonPin_C_OnIsAtEdgeOfScreenChanged");
static_assert(offsetof(CharacterCommonPin_C_OnIsAtEdgeOfScreenChanged, bEdgeOfScreen) == 0x000000, "Member 'CharacterCommonPin_C_OnIsAtEdgeOfScreenChanged::bEdgeOfScreen' has a wrong offset!");

// Function CharacterCommonPin.CharacterCommonPin_C.OnInNameViewConeChanged
// 0x0001 (0x0001 - 0x0000)
struct CharacterCommonPin_C_OnInNameViewConeChanged final
{
public:
	bool                                          bInNameViewCone;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterCommonPin_C_OnInNameViewConeChanged) == 0x000001, "Wrong alignment on CharacterCommonPin_C_OnInNameViewConeChanged");
static_assert(sizeof(CharacterCommonPin_C_OnInNameViewConeChanged) == 0x000001, "Wrong size on CharacterCommonPin_C_OnInNameViewConeChanged");
static_assert(offsetof(CharacterCommonPin_C_OnInNameViewConeChanged, bInNameViewCone) == 0x000000, "Member 'CharacterCommonPin_C_OnInNameViewConeChanged::bInNameViewCone' has a wrong offset!");

// Function CharacterCommonPin.CharacterCommonPin_C.RefreshAll
// 0x0078 (0x0078 - 0x0000)
struct CharacterCommonPin_C_RefreshAll final
{
public:
	TDelegate<void(class UMarinerAnimatedWidget* Instance, EWidgetAnimationState NewState)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UMarinerAnimatedWidget* Instance, EWidgetAnimationState NewState)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class AMarinerCharacter*                      CallFunc_GetCharacterReference_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMarinerPlayerState*                    K2Node_DynamicCast_AsMariner_Player_State;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerProfileObjectManager*           CallFunc_GetProfileObjectManager_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMarinerPlayerState*                    K2Node_DynamicCast_AsMariner_Player_State_1;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerSkinUIData*                     CallFunc_GetSkinUIData_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTeamIndex_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMarinerHostility                             CallFunc_TryAndGetHostilityRelativeToLocalPlayer_ReturnValue; // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMarinerTeamColorbyHostility_bIsValid;  // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F[0x1];                                       // 0x005F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 CallFunc_GetMarinerTeamColorbyHostility_ReturnValue; // 0x0060(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAccumulatedDamage_ReturnValue;         // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterCommonPin_C_RefreshAll) == 0x000008, "Wrong alignment on CharacterCommonPin_C_RefreshAll");
static_assert(sizeof(CharacterCommonPin_C_RefreshAll) == 0x000078, "Wrong size on CharacterCommonPin_C_RefreshAll");
static_assert(offsetof(CharacterCommonPin_C_RefreshAll, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'CharacterCommonPin_C_RefreshAll::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_RefreshAll, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'CharacterCommonPin_C_RefreshAll::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_RefreshAll, CallFunc_GetCharacterReference_ReturnValue) == 0x000020, "Member 'CharacterCommonPin_C_RefreshAll::CallFunc_GetCharacterReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_RefreshAll, K2Node_DynamicCast_AsMariner_Player_State) == 0x000028, "Member 'CharacterCommonPin_C_RefreshAll::K2Node_DynamicCast_AsMariner_Player_State' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_RefreshAll, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'CharacterCommonPin_C_RefreshAll::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_RefreshAll, CallFunc_GetProfileObjectManager_ReturnValue) == 0x000038, "Member 'CharacterCommonPin_C_RefreshAll::CallFunc_GetProfileObjectManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_RefreshAll, K2Node_DynamicCast_AsMariner_Player_State_1) == 0x000040, "Member 'CharacterCommonPin_C_RefreshAll::K2Node_DynamicCast_AsMariner_Player_State_1' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_RefreshAll, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'CharacterCommonPin_C_RefreshAll::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_RefreshAll, CallFunc_GetSkinUIData_ReturnValue) == 0x000050, "Member 'CharacterCommonPin_C_RefreshAll::CallFunc_GetSkinUIData_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_RefreshAll, CallFunc_GetTeamIndex_ReturnValue) == 0x000058, "Member 'CharacterCommonPin_C_RefreshAll::CallFunc_GetTeamIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_RefreshAll, CallFunc_IsValid_ReturnValue) == 0x00005C, "Member 'CharacterCommonPin_C_RefreshAll::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_RefreshAll, CallFunc_TryAndGetHostilityRelativeToLocalPlayer_ReturnValue) == 0x00005D, "Member 'CharacterCommonPin_C_RefreshAll::CallFunc_TryAndGetHostilityRelativeToLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_RefreshAll, CallFunc_GetMarinerTeamColorbyHostility_bIsValid) == 0x00005E, "Member 'CharacterCommonPin_C_RefreshAll::CallFunc_GetMarinerTeamColorbyHostility_bIsValid' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_RefreshAll, CallFunc_GetMarinerTeamColorbyHostility_ReturnValue) == 0x000060, "Member 'CharacterCommonPin_C_RefreshAll::CallFunc_GetMarinerTeamColorbyHostility_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_RefreshAll, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000064, "Member 'CharacterCommonPin_C_RefreshAll::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_RefreshAll, CallFunc_GetAccumulatedDamage_ReturnValue) == 0x000074, "Member 'CharacterCommonPin_C_RefreshAll::CallFunc_GetAccumulatedDamage_ReturnValue' has a wrong offset!");

// Function CharacterCommonPin.CharacterCommonPin_C.UpdateNameForcedOn
// 0x0010 (0x0010 - 0x0000)
struct CharacterCommonPin_C_UpdateNameForcedOn final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetWidgetActive_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetWidgetActive_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetWidgetActive_ReturnValue_2;            // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterCommonPin_C_UpdateNameForcedOn) == 0x000001, "Wrong alignment on CharacterCommonPin_C_UpdateNameForcedOn");
static_assert(sizeof(CharacterCommonPin_C_UpdateNameForcedOn) == 0x000010, "Wrong size on CharacterCommonPin_C_UpdateNameForcedOn");
static_assert(offsetof(CharacterCommonPin_C_UpdateNameForcedOn, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'CharacterCommonPin_C_UpdateNameForcedOn::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_UpdateNameForcedOn, CallFunc_GetWidgetActive_ReturnValue) == 0x000001, "Member 'CharacterCommonPin_C_UpdateNameForcedOn::CallFunc_GetWidgetActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_UpdateNameForcedOn, CallFunc_Not_PreBool_ReturnValue_1) == 0x000002, "Member 'CharacterCommonPin_C_UpdateNameForcedOn::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_UpdateNameForcedOn, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'CharacterCommonPin_C_UpdateNameForcedOn::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_UpdateNameForcedOn, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x000004, "Member 'CharacterCommonPin_C_UpdateNameForcedOn::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_UpdateNameForcedOn, CallFunc_GetWidgetActive_ReturnValue_1) == 0x000005, "Member 'CharacterCommonPin_C_UpdateNameForcedOn::CallFunc_GetWidgetActive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_UpdateNameForcedOn, CallFunc_Not_PreBool_ReturnValue_2) == 0x000006, "Member 'CharacterCommonPin_C_UpdateNameForcedOn::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_UpdateNameForcedOn, CallFunc_GetWidgetActive_ReturnValue_2) == 0x000007, "Member 'CharacterCommonPin_C_UpdateNameForcedOn::CallFunc_GetWidgetActive_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_UpdateNameForcedOn, CallFunc_Not_PreBool_ReturnValue_3) == 0x000008, "Member 'CharacterCommonPin_C_UpdateNameForcedOn::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_UpdateNameForcedOn, CallFunc_Not_PreBool_ReturnValue_4) == 0x000009, "Member 'CharacterCommonPin_C_UpdateNameForcedOn::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_UpdateNameForcedOn, CallFunc_BooleanAND_ReturnValue_1) == 0x00000A, "Member 'CharacterCommonPin_C_UpdateNameForcedOn::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_UpdateNameForcedOn, CallFunc_Not_PreBool_ReturnValue_5) == 0x00000B, "Member 'CharacterCommonPin_C_UpdateNameForcedOn::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_UpdateNameForcedOn, CallFunc_BooleanOR_ReturnValue) == 0x00000C, "Member 'CharacterCommonPin_C_UpdateNameForcedOn::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_UpdateNameForcedOn, CallFunc_BooleanAND_ReturnValue_2) == 0x00000D, "Member 'CharacterCommonPin_C_UpdateNameForcedOn::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_UpdateNameForcedOn, CallFunc_BooleanAND_ReturnValue_3) == 0x00000E, "Member 'CharacterCommonPin_C_UpdateNameForcedOn::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_UpdateNameForcedOn, CallFunc_BooleanAND_ReturnValue_4) == 0x00000F, "Member 'CharacterCommonPin_C_UpdateNameForcedOn::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");

// Function CharacterCommonPin.CharacterCommonPin_C.UpdateGameModeForcedOn
// 0x000D (0x000D - 0x0000)
struct CharacterCommonPin_C_UpdateGameModeForcedOn final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue_1;     // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterCommonPin_C_UpdateGameModeForcedOn) == 0x000001, "Wrong alignment on CharacterCommonPin_C_UpdateGameModeForcedOn");
static_assert(sizeof(CharacterCommonPin_C_UpdateGameModeForcedOn) == 0x00000D, "Wrong size on CharacterCommonPin_C_UpdateGameModeForcedOn");
static_assert(offsetof(CharacterCommonPin_C_UpdateGameModeForcedOn, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'CharacterCommonPin_C_UpdateGameModeForcedOn::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_UpdateGameModeForcedOn, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x000001, "Member 'CharacterCommonPin_C_UpdateGameModeForcedOn::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_UpdateGameModeForcedOn, CallFunc_K2_IsTimerActiveHandle_ReturnValue_1) == 0x000002, "Member 'CharacterCommonPin_C_UpdateGameModeForcedOn::CallFunc_K2_IsTimerActiveHandle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_UpdateGameModeForcedOn, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'CharacterCommonPin_C_UpdateGameModeForcedOn::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_UpdateGameModeForcedOn, CallFunc_Not_PreBool_ReturnValue_1) == 0x000004, "Member 'CharacterCommonPin_C_UpdateGameModeForcedOn::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_UpdateGameModeForcedOn, CallFunc_Not_PreBool_ReturnValue_2) == 0x000005, "Member 'CharacterCommonPin_C_UpdateGameModeForcedOn::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_UpdateGameModeForcedOn, CallFunc_BooleanAND_ReturnValue) == 0x000006, "Member 'CharacterCommonPin_C_UpdateGameModeForcedOn::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_UpdateGameModeForcedOn, CallFunc_Not_PreBool_ReturnValue_3) == 0x000007, "Member 'CharacterCommonPin_C_UpdateGameModeForcedOn::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_UpdateGameModeForcedOn, CallFunc_BooleanOR_ReturnValue_1) == 0x000008, "Member 'CharacterCommonPin_C_UpdateGameModeForcedOn::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_UpdateGameModeForcedOn, CallFunc_Not_PreBool_ReturnValue_4) == 0x000009, "Member 'CharacterCommonPin_C_UpdateGameModeForcedOn::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_UpdateGameModeForcedOn, CallFunc_BooleanAND_ReturnValue_1) == 0x00000A, "Member 'CharacterCommonPin_C_UpdateGameModeForcedOn::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_UpdateGameModeForcedOn, CallFunc_BooleanAND_ReturnValue_2) == 0x00000B, "Member 'CharacterCommonPin_C_UpdateGameModeForcedOn::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharacterCommonPin_C_UpdateGameModeForcedOn, CallFunc_BooleanAND_ReturnValue_3) == 0x00000C, "Member 'CharacterCommonPin_C_UpdateGameModeForcedOn::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");

// Function CharacterCommonPin.CharacterCommonPin_C.OnGutterWidgetAnimationStateChanged
// 0x0018 (0x0018 - 0x0000)
struct CharacterCommonPin_C_OnGutterWidgetAnimationStateChanged final
{
public:
