#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterArtifactsButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CharacterArtifactsButton.CharacterArtifactsButton_C
// 0x0058 (0x2FD0 - 0x2F78)
class UCharacterArtifactsButton_C final : public UMarinerLayeredButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x2F78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoveredAnim;                                       // 0x2F80(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x2F88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Border;                                            // 0x2F90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCMSItemButton_C*                       CMSItemButton;                                     // 0x2F98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cog;                                               // 0x2FA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                HitArea;                                           // 0x2FA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_106;                                         // 0x2FB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Material;                                          // 0x2FB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_CharacterArtifactsButton_C;                   // 0x2FC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnviewedItemWidget_C*                  UnviewedWidget;                                    // 0x2FC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CharacterArtifactsButton(int32 EntryPoint);
	void Construct();
	void ResetCMSButtonToDefaults();
	void SetItemData(class UItemLoadResponse* ItemData);

	struct FMarinerLayeredButtonAssets GetAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CharacterArtifactsButton_C">();
	}
	static class UCharacterArtifactsButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterArtifactsButton_C>();
	}
};
static_assert(alignof(UCharacterArtifactsButton_C) == 0x000008, "Wrong alignment on UCharacterArtifactsButton_C");
static_assert(sizeof(UCharacterArtifactsButton_C) == 0x002FD0, "Wrong size on UCharacterArtifactsButton_C");
static_assert(offsetof(UCharacterArtifactsButton_C, UberGraphFrame) == 0x002F78, "Member 'UCharacterArtifactsButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCharacterArtifactsButton_C, HoveredAnim) == 0x002F80, "Member 'UCharacterArtifactsButton_C::HoveredAnim' has a wrong offset!");
static_assert(offsetof(UCharacterArtifactsButton_C, Background) == 0x002F88, "Member 'UCharacterArtifactsButton_C::Background' has a wrong offset!");
static_assert(offsetof(UCharacterArtifactsButton_C, Border) == 0x002F90, "Member 'UCharacterArtifactsButton_C::Border' has a wrong offset!");
static_assert(offsetof(UCharacterArtifactsButton_C, CMSItemButton) == 0x002F98, "Member 'UCharacterArtifactsButton_C::CMSItemButton' has a wrong offset!");
static_assert(offsetof(UCharacterArtifactsButton_C, Cog) == 0x002FA0, "Member 'UCharacterArtifactsButton_C::Cog' has a wrong offset!");
static_assert(offsetof(UCharacterArtifactsButton_C, HitArea) == 0x002FA8, "Member 'UCharacterArtifactsButton_C::HitArea' has a wrong offset!");
static_assert(offsetof(UCharacterArtifactsButton_C, Image_106) == 0x002FB0, "Member 'UCharacterArtifactsButton_C::Image_106' has a wrong offset!");
static_assert(offsetof(UCharacterArtifactsButton_C, Material) == 0x002FB8, "Member 'UCharacterArtifactsButton_C::Material' has a wrong offset!");
static_assert(offsetof(UCharacterArtifactsButton_C, Name_CharacterArtifactsButton_C) == 0x002FC0, "Member 'UCharacterArtifactsButton_C::Name_CharacterArtifactsButton_C' has a wrong offset!");
static_assert(offsetof(UCharacterArtifactsButton_C, UnviewedWidget) == 0x002FC8, "Member 'UCharacterArtifactsButton_C::UnviewedWidget' has a wrong offset!");

}

