#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterFeaturesMenu

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "MangoClient_structs.hpp"
#include "Mariner_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function CharacterFeaturesMenu.CharacterFeaturesMenu_C.ExecuteUbergraph_CharacterFeaturesMenu
// 0x0290 (0x0290 - 0x0000)
struct CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_207F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UItemLoadResponse*>              Temp_object_Variable;                              // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void(class UMarinerLayeredButton* Instance, bool bFromKeyboard, bool bFromMouse)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2080[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFrontendSkinUILoadResponse*            Temp_object_Variable_1;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0038(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0048(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UMarinerAnimatedWidget* Instance, EWidgetAnimationState NewState)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	class UMarinerMenuStackLayer*                 CallFunc_PushLayerToActiveStack_ReturnValue;       // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFromSubMenu;                         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2081[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryBaseMenu_C*                   K2Node_DynamicCast_AsInventory_Base_Menu;          // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2082[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue_1;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMarinerInputInterface> CallFunc_SetActiveInputWidget_InputWidget_CastInput; // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMarinerMenuStackLayer*                 CallFunc_PushLayerToActiveStack_ReturnValue_1;     // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventoryBaseMenu_C*                   K2Node_DynamicCast_AsInventory_Base_Menu_1;        // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2083[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerLayeredButton*                  K2Node_ComponentBoundEvent_Instance_5;             // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerLayeredButton*                  K2Node_ComponentBoundEvent_Instance_4;             // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerLayeredButton*                  K2Node_CustomEvent_Instance_2;                     // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bFromKeyboard;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bFromMouse;                     // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2084[0x6];                                     // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerLayeredButton*                  K2Node_CustomEvent_Instance_1;                     // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2085[0x4];                                     // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemLoadResponse*                      CallFunc_Array_Get_Item;                           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerPlayableCharacter*              CallFunc_GetCurrentCharacter_Character;            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2086[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerLayeredButton*                  K2Node_ComponentBoundEvent_Instance_3;             // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue_2;             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuStackLayer*                 CallFunc_PushLayerToActiveStack_ReturnValue_2;     // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventoryBaseMenu_C*                   K2Node_DynamicCast_AsInventory_Base_Menu_2;        // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2087[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterCustomization_C*              K2Node_CustomEvent_ParentMenu;                     // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMangoPlayerManager*                    CallFunc_Get_ReturnValue;                          // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bToSubLayer;                          // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2088[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFrontendSkinUILoadResponse*            K2Node_CustomEvent_SkinData;                       // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UItemLoadResponse*>              K2Node_CustomEvent_ItemData;                       // 0x0150(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(class UFrontendSkinUILoadResponse* SkinData, TArray<class UItemLoadResponse*>& ItemData)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0160(0x0010)(ZeroConstructor, NoDestructor)
	class UMarinerPlayableCharacter*              CallFunc_GetCurrentCharacter_Character_1;          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerLoadEquippedDataForCharacter*   CallFunc_LoadEquippedDataForCharacter_ReturnValue; // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2089[0x3];                                     // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0184(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_208A[0x4];                                     // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerAnimatedWidget*                 K2Node_CustomEvent_Instance;                       // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWidgetAnimationState                         K2Node_CustomEvent_NewState;                       // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_208B[0x2];                                     // 0x01A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x01A4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_208C[0x4];                                     // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerLayeredButton*                  K2Node_ComponentBoundEvent_Instance_2;             // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue_3;             // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuStackLayer*                 CallFunc_PushLayerToActiveStack_ReturnValue_3;     // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerPlayableCharacter*              CallFunc_GetCurrentCharacter_Character_2;          // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterProgressionMenu_C*            K2Node_DynamicCast_AsCharacter_Progression_Menu;   // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_208D[0x7];                                     // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_208E[0x4];                                     // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerPlayableCharacter*              CallFunc_GetCurrentCharacter_Character_3;          // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerPlayableCharacter*              CallFunc_GetCurrentCharacter_Character_4;          // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue_4;             // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuStackLayer*                 CallFunc_PushLayerToActiveStack_ReturnValue_4;     // 0x0210(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMainArtifactsMenu*              K2Node_DynamicCast_AsMariner_Main_Artifacts_Menu;  // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_208F[0x7];                                     // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerPlayableCharacter*              CallFunc_GetCurrentCharacter_Character_5;          // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerLayeredButton*                  K2Node_ComponentBoundEvent_Instance_1;             // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerPlayableCharacter*              CallFunc_GetCurrentCharacter_Character_6;          // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UMarinerLayeredButton* Instance)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0240(0x0010)(ZeroConstructor, NoDestructor)
	class UMarinerLayeredButton*                  K2Node_ComponentBoundEvent_Instance;               // 0x0250(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2090[0x4];                                     // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue_5;             // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuStackLayer*                 CallFunc_PushLayerToActiveStack_ReturnValue_5;     // 0x0268(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2091[0x7];                                     // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerInventoryBaseMenu*              K2Node_DynamicCast_AsMariner_Inventory_Base_Menu;  // 0x0278(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2092[0x3];                                     // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerPlayableCharacter*              CallFunc_GetCurrentCharacter_Character_7;          // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu) == 0x000008, "Wrong alignment on CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu");
static_assert(sizeof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu) == 0x000290, "Wrong size on CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, EntryPoint) == 0x000000, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, Temp_object_Variable) == 0x000008, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, Temp_object_Variable_1) == 0x000030, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, Temp_struct_Variable) == 0x000038, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, Temp_delegate_Variable) == 0x000048, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, CallFunc_GetMenuManager_ReturnValue) == 0x000058, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000060, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, CallFunc_PushLayerToActiveStack_ReturnValue) == 0x000070, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::CallFunc_PushLayerToActiveStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_Event_bFromSubMenu) == 0x000078, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_Event_bFromSubMenu' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_DynamicCast_AsInventory_Base_Menu) == 0x000080, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_DynamicCast_AsInventory_Base_Menu' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, CallFunc_GetMenuManager_ReturnValue_1) == 0x000090, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::CallFunc_GetMenuManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, CallFunc_SetActiveInputWidget_InputWidget_CastInput) == 0x000098, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::CallFunc_SetActiveInputWidget_InputWidget_CastInput' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, CallFunc_PushLayerToActiveStack_ReturnValue_1) == 0x0000A8, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::CallFunc_PushLayerToActiveStack_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_DynamicCast_AsInventory_Base_Menu_1) == 0x0000B0, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_DynamicCast_AsInventory_Base_Menu_1' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_DynamicCast_bSuccess_1) == 0x0000B8, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_ComponentBoundEvent_Instance_5) == 0x0000C0, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_ComponentBoundEvent_Instance_5' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_ComponentBoundEvent_Instance_4) == 0x0000C8, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_ComponentBoundEvent_Instance_4' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_CustomEvent_Instance_2) == 0x0000D0, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_CustomEvent_Instance_2' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_CustomEvent_bFromKeyboard) == 0x0000D8, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_CustomEvent_bFromKeyboard' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_CustomEvent_bFromMouse) == 0x0000D9, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_CustomEvent_bFromMouse' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_CustomEvent_Instance_1) == 0x0000E0, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_CustomEvent_Instance_1' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, Temp_int_Array_Index_Variable) == 0x0000E8, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, CallFunc_Array_Get_Item) == 0x0000F0, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, CallFunc_GetCurrentCharacter_Character) == 0x0000F8, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::CallFunc_GetCurrentCharacter_Character' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_SwitchEnum_CmpSuccess) == 0x000100, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_ComponentBoundEvent_Instance_3) == 0x000108, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_ComponentBoundEvent_Instance_3' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, CallFunc_GetMenuManager_ReturnValue_2) == 0x000110, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::CallFunc_GetMenuManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, CallFunc_PushLayerToActiveStack_ReturnValue_2) == 0x000118, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::CallFunc_PushLayerToActiveStack_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_DynamicCast_AsInventory_Base_Menu_2) == 0x000120, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_DynamicCast_AsInventory_Base_Menu_2' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_DynamicCast_bSuccess_2) == 0x000128, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_CustomEvent_ParentMenu) == 0x000130, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_CustomEvent_ParentMenu' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, CallFunc_Get_ReturnValue) == 0x000138, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_Event_bToSubLayer) == 0x000140, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_Event_bToSubLayer' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_CustomEvent_SkinData) == 0x000148, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_CustomEvent_SkinData' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_CustomEvent_ItemData) == 0x000150, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_CustomEvent_ItemData' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x000160, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, CallFunc_GetCurrentCharacter_Character_1) == 0x000170, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::CallFunc_GetCurrentCharacter_Character_1' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, CallFunc_LoadEquippedDataForCharacter_ReturnValue) == 0x000178, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::CallFunc_LoadEquippedDataForCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, CallFunc_IsValid_ReturnValue) == 0x000180, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_CreateDelegate_OutputDelegate_3) == 0x000184, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_CustomEvent_Instance) == 0x000198, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_CustomEvent_Instance' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_CustomEvent_NewState) == 0x0001A0, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_CustomEvent_NewState' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001A1, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001A4, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_ComponentBoundEvent_Instance_2) == 0x0001B8, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_ComponentBoundEvent_Instance_2' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, CallFunc_GetMenuManager_ReturnValue_3) == 0x0001C0, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::CallFunc_GetMenuManager_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, CallFunc_PushLayerToActiveStack_ReturnValue_3) == 0x0001C8, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::CallFunc_PushLayerToActiveStack_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, CallFunc_GetCurrentCharacter_Character_2) == 0x0001D0, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::CallFunc_GetCurrentCharacter_Character_2' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_DynamicCast_AsCharacter_Progression_Menu) == 0x0001D8, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_DynamicCast_AsCharacter_Progression_Menu' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_DynamicCast_bSuccess_3) == 0x0001E0, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, CallFunc_GetOwningPlayer_ReturnValue) == 0x0001E8, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, CallFunc_PostEvent_ReturnValue) == 0x0001F0, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, CallFunc_GetCurrentCharacter_Character_3) == 0x0001F8, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::CallFunc_GetCurrentCharacter_Character_3' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, CallFunc_GetCurrentCharacter_Character_4) == 0x000200, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::CallFunc_GetCurrentCharacter_Character_4' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, CallFunc_GetMenuManager_ReturnValue_4) == 0x000208, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::CallFunc_GetMenuManager_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, CallFunc_PushLayerToActiveStack_ReturnValue_4) == 0x000210, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::CallFunc_PushLayerToActiveStack_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_DynamicCast_AsMariner_Main_Artifacts_Menu) == 0x000218, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_DynamicCast_AsMariner_Main_Artifacts_Menu' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_DynamicCast_bSuccess_4) == 0x000220, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, CallFunc_GetCurrentCharacter_Character_5) == 0x000228, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::CallFunc_GetCurrentCharacter_Character_5' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_ComponentBoundEvent_Instance_1) == 0x000230, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_ComponentBoundEvent_Instance_1' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, CallFunc_GetCurrentCharacter_Character_6) == 0x000238, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::CallFunc_GetCurrentCharacter_Character_6' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_CreateDelegate_OutputDelegate_5) == 0x000240, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_ComponentBoundEvent_Instance) == 0x000250, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_ComponentBoundEvent_Instance' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, Temp_int_Loop_Counter_Variable) == 0x000258, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, CallFunc_GetMenuManager_ReturnValue_5) == 0x000260, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::CallFunc_GetMenuManager_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, CallFunc_PushLayerToActiveStack_ReturnValue_5) == 0x000268, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::CallFunc_PushLayerToActiveStack_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, CallFunc_Less_IntInt_ReturnValue) == 0x000270, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_DynamicCast_AsMariner_Inventory_Base_Menu) == 0x000278, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_DynamicCast_AsMariner_Inventory_Base_Menu' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, K2Node_DynamicCast_bSuccess_5) == 0x000280, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, CallFunc_Add_IntInt_ReturnValue) == 0x000284, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu, CallFunc_GetCurrentCharacter_Character_7) == 0x000288, "Member 'CharacterFeaturesMenu_C_ExecuteUbergraph_CharacterFeaturesMenu::CallFunc_GetCurrentCharacter_Character_7' has a wrong offset!");

// Function CharacterFeaturesMenu.CharacterFeaturesMenu_C.BndEvt__Emotes_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CharacterFeaturesMenu_C_BndEvt__Emotes_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature final
{
public:
	class UMarinerLayeredButton*                  Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterFeaturesMenu_C_BndEvt__Emotes_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on CharacterFeaturesMenu_C_BndEvt__Emotes_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature");
static_assert(sizeof(CharacterFeaturesMenu_C_BndEvt__Emotes_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong size on CharacterFeaturesMenu_C_BndEvt__Emotes_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature");
static_assert(offsetof(CharacterFeaturesMenu_C_BndEvt__Emotes_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature, Instance) == 0x000000, "Member 'CharacterFeaturesMenu_C_BndEvt__Emotes_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature::Instance' has a wrong offset!");

// Function CharacterFeaturesMenu.CharacterFeaturesMenu_C.BndEvt__CharacterArtifactsButton_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CharacterFeaturesMenu_C_BndEvt__CharacterArtifactsButton_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature final
{
public:
	class UMarinerLayeredButton*                  Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterFeaturesMenu_C_BndEvt__CharacterArtifactsButton_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on CharacterFeaturesMenu_C_BndEvt__CharacterArtifactsButton_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature");
static_assert(sizeof(CharacterFeaturesMenu_C_BndEvt__CharacterArtifactsButton_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong size on CharacterFeaturesMenu_C_BndEvt__CharacterArtifactsButton_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature");
static_assert(offsetof(CharacterFeaturesMenu_C_BndEvt__CharacterArtifactsButton_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature, Instance) == 0x000000, "Member 'CharacterFeaturesMenu_C_BndEvt__CharacterArtifactsButton_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature::Instance' has a wrong offset!");

// Function CharacterFeaturesMenu.CharacterFeaturesMenu_C.BndEvt__Progression_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CharacterFeaturesMenu_C_BndEvt__Progression_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature final
{
public:
	class UMarinerLayeredButton*                  Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterFeaturesMenu_C_BndEvt__Progression_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on CharacterFeaturesMenu_C_BndEvt__Progression_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature");
static_assert(sizeof(CharacterFeaturesMenu_C_BndEvt__Progression_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong size on CharacterFeaturesMenu_C_BndEvt__Progression_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature");
static_assert(offsetof(CharacterFeaturesMenu_C_BndEvt__Progression_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature, Instance) == 0x000000, "Member 'CharacterFeaturesMenu_C_BndEvt__Progression_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature::Instance' has a wrong offset!");

// Function CharacterFeaturesMenu.CharacterFeaturesMenu_C.OnStateChanged
// 0x0010 (0x0010 - 0x0000)
struct CharacterFeaturesMenu_C_OnStateChanged final
{
public:
	class UMarinerAnimatedWidget*                 Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWidgetAnimationState                         NewState;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterFeaturesMenu_C_OnStateChanged) == 0x000008, "Wrong alignment on CharacterFeaturesMenu_C_OnStateChanged");
static_assert(sizeof(CharacterFeaturesMenu_C_OnStateChanged) == 0x000010, "Wrong size on CharacterFeaturesMenu_C_OnStateChanged");
static_assert(offsetof(CharacterFeaturesMenu_C_OnStateChanged, Instance) == 0x000000, "Member 'CharacterFeaturesMenu_C_OnStateChanged::Instance' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_OnStateChanged, NewState) == 0x000008, "Member 'CharacterFeaturesMenu_C_OnStateChanged::NewState' has a wrong offset!");

// Function CharacterFeaturesMenu.CharacterFeaturesMenu_C.BP_OnExited
// 0x0001 (0x0001 - 0x0000)
struct CharacterFeaturesMenu_C_BP_OnExited final
{
public:
	bool                                          bToSubLayer;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterFeaturesMenu_C_BP_OnExited) == 0x000001, "Wrong alignment on CharacterFeaturesMenu_C_BP_OnExited");
static_assert(sizeof(CharacterFeaturesMenu_C_BP_OnExited) == 0x000001, "Wrong size on CharacterFeaturesMenu_C_BP_OnExited");
static_assert(offsetof(CharacterFeaturesMenu_C_BP_OnExited, bToSubLayer) == 0x000000, "Member 'CharacterFeaturesMenu_C_BP_OnExited::bToSubLayer' has a wrong offset!");

// Function CharacterFeaturesMenu.CharacterFeaturesMenu_C.PopulateCharacter
// 0x0008 (0x0008 - 0x0000)
struct CharacterFeaturesMenu_C_PopulateCharacter final
{
public:
	class UCharacterCustomization_C*              Param_ParentMenu;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterFeaturesMenu_C_PopulateCharacter) == 0x000008, "Wrong alignment on CharacterFeaturesMenu_C_PopulateCharacter");
static_assert(sizeof(CharacterFeaturesMenu_C_PopulateCharacter) == 0x000008, "Wrong size on CharacterFeaturesMenu_C_PopulateCharacter");
static_assert(offsetof(CharacterFeaturesMenu_C_PopulateCharacter, Param_ParentMenu) == 0x000000, "Member 'CharacterFeaturesMenu_C_PopulateCharacter::Param_ParentMenu' has a wrong offset!");

// Function CharacterFeaturesMenu.CharacterFeaturesMenu_C.BndEvt__ReturnTrail_K2Node_ComponentBoundEvent_28_OnLayeredButtonEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CharacterFeaturesMenu_C_BndEvt__ReturnTrail_K2Node_ComponentBoundEvent_28_OnLayeredButtonEvent__DelegateSignature final
{
public:
	class UMarinerLayeredButton*                  Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterFeaturesMenu_C_BndEvt__ReturnTrail_K2Node_ComponentBoundEvent_28_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on CharacterFeaturesMenu_C_BndEvt__ReturnTrail_K2Node_ComponentBoundEvent_28_OnLayeredButtonEvent__DelegateSignature");
static_assert(sizeof(CharacterFeaturesMenu_C_BndEvt__ReturnTrail_K2Node_ComponentBoundEvent_28_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong size on CharacterFeaturesMenu_C_BndEvt__ReturnTrail_K2Node_ComponentBoundEvent_28_OnLayeredButtonEvent__DelegateSignature");
static_assert(offsetof(CharacterFeaturesMenu_C_BndEvt__ReturnTrail_K2Node_ComponentBoundEvent_28_OnLayeredButtonEvent__DelegateSignature, Instance) == 0x000000, "Member 'CharacterFeaturesMenu_C_BndEvt__ReturnTrail_K2Node_ComponentBoundEvent_28_OnLayeredButtonEvent__DelegateSignature::Instance' has a wrong offset!");

// Function CharacterFeaturesMenu.CharacterFeaturesMenu_C.OnUnhovered
// 0x0008 (0x0008 - 0x0000)
struct CharacterFeaturesMenu_C_OnUnhovered final
{
public:
	class UMarinerLayeredButton*                  Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterFeaturesMenu_C_OnUnhovered) == 0x000008, "Wrong alignment on CharacterFeaturesMenu_C_OnUnhovered");
static_assert(sizeof(CharacterFeaturesMenu_C_OnUnhovered) == 0x000008, "Wrong size on CharacterFeaturesMenu_C_OnUnhovered");
static_assert(offsetof(CharacterFeaturesMenu_C_OnUnhovered, Instance) == 0x000000, "Member 'CharacterFeaturesMenu_C_OnUnhovered::Instance' has a wrong offset!");

// Function CharacterFeaturesMenu.CharacterFeaturesMenu_C.OnHovered
// 0x0010 (0x0010 - 0x0000)
struct CharacterFeaturesMenu_C_OnHovered final
{
public:
	class UMarinerLayeredButton*                  Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromKeyboard;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFromMouse;                                        // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterFeaturesMenu_C_OnHovered) == 0x000008, "Wrong alignment on CharacterFeaturesMenu_C_OnHovered");
static_assert(sizeof(CharacterFeaturesMenu_C_OnHovered) == 0x000010, "Wrong size on CharacterFeaturesMenu_C_OnHovered");
static_assert(offsetof(CharacterFeaturesMenu_C_OnHovered, Instance) == 0x000000, "Member 'CharacterFeaturesMenu_C_OnHovered::Instance' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_OnHovered, bFromKeyboard) == 0x000008, "Member 'CharacterFeaturesMenu_C_OnHovered::bFromKeyboard' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_OnHovered, bFromMouse) == 0x000009, "Member 'CharacterFeaturesMenu_C_OnHovered::bFromMouse' has a wrong offset!");

// Function CharacterFeaturesMenu.CharacterFeaturesMenu_C.BndEvt__VFX_K2Node_ComponentBoundEvent_350_OnLayeredButtonEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CharacterFeaturesMenu_C_BndEvt__VFX_K2Node_ComponentBoundEvent_350_OnLayeredButtonEvent__DelegateSignature final
{
public:
	class UMarinerLayeredButton*                  Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterFeaturesMenu_C_BndEvt__VFX_K2Node_ComponentBoundEvent_350_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on CharacterFeaturesMenu_C_BndEvt__VFX_K2Node_ComponentBoundEvent_350_OnLayeredButtonEvent__DelegateSignature");
static_assert(sizeof(CharacterFeaturesMenu_C_BndEvt__VFX_K2Node_ComponentBoundEvent_350_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong size on CharacterFeaturesMenu_C_BndEvt__VFX_K2Node_ComponentBoundEvent_350_OnLayeredButtonEvent__DelegateSignature");
static_assert(offsetof(CharacterFeaturesMenu_C_BndEvt__VFX_K2Node_ComponentBoundEvent_350_OnLayeredButtonEvent__DelegateSignature, Instance) == 0x000000, "Member 'CharacterFeaturesMenu_C_BndEvt__VFX_K2Node_ComponentBoundEvent_350_OnLayeredButtonEvent__DelegateSignature::Instance' has a wrong offset!");

// Function CharacterFeaturesMenu.CharacterFeaturesMenu_C.BndEvt__Skins_K2Node_ComponentBoundEvent_80_OnLayeredButtonEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CharacterFeaturesMenu_C_BndEvt__Skins_K2Node_ComponentBoundEvent_80_OnLayeredButtonEvent__DelegateSignature final
{
public:
	class UMarinerLayeredButton*                  Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterFeaturesMenu_C_BndEvt__Skins_K2Node_ComponentBoundEvent_80_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on CharacterFeaturesMenu_C_BndEvt__Skins_K2Node_ComponentBoundEvent_80_OnLayeredButtonEvent__DelegateSignature");
static_assert(sizeof(CharacterFeaturesMenu_C_BndEvt__Skins_K2Node_ComponentBoundEvent_80_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong size on CharacterFeaturesMenu_C_BndEvt__Skins_K2Node_ComponentBoundEvent_80_OnLayeredButtonEvent__DelegateSignature");
static_assert(offsetof(CharacterFeaturesMenu_C_BndEvt__Skins_K2Node_ComponentBoundEvent_80_OnLayeredButtonEvent__DelegateSignature, Instance) == 0x000000, "Member 'CharacterFeaturesMenu_C_BndEvt__Skins_K2Node_ComponentBoundEvent_80_OnLayeredButtonEvent__DelegateSignature::Instance' has a wrong offset!");

// Function CharacterFeaturesMenu.CharacterFeaturesMenu_C.BP_OnEntered
// 0x0001 (0x0001 - 0x0000)
struct CharacterFeaturesMenu_C_BP_OnEntered final
{
public:
	bool                                          bFromSubMenu;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterFeaturesMenu_C_BP_OnEntered) == 0x000001, "Wrong alignment on CharacterFeaturesMenu_C_BP_OnEntered");
static_assert(sizeof(CharacterFeaturesMenu_C_BP_OnEntered) == 0x000001, "Wrong size on CharacterFeaturesMenu_C_BP_OnEntered");
static_assert(offsetof(CharacterFeaturesMenu_C_BP_OnEntered, bFromSubMenu) == 0x000000, "Member 'CharacterFeaturesMenu_C_BP_OnEntered::bFromSubMenu' has a wrong offset!");

// Function CharacterFeaturesMenu.CharacterFeaturesMenu_C.LoadFinished_BC85127E41FD4B8187170DA83E530CAD
// 0x0018 (0x0018 - 0x0000)
struct CharacterFeaturesMenu_C_LoadFinished_BC85127E41FD4B8187170DA83E530CAD final
{
public:
	class UFrontendSkinUILoadResponse*            SkinData;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UItemLoadResponse*>              ItemData;                                          // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(CharacterFeaturesMenu_C_LoadFinished_BC85127E41FD4B8187170DA83E530CAD) == 0x000008, "Wrong alignment on CharacterFeaturesMenu_C_LoadFinished_BC85127E41FD4B8187170DA83E530CAD");
static_assert(sizeof(CharacterFeaturesMenu_C_LoadFinished_BC85127E41FD4B8187170DA83E530CAD) == 0x000018, "Wrong size on CharacterFeaturesMenu_C_LoadFinished_BC85127E41FD4B8187170DA83E530CAD");
static_assert(offsetof(CharacterFeaturesMenu_C_LoadFinished_BC85127E41FD4B8187170DA83E530CAD, SkinData) == 0x000000, "Member 'CharacterFeaturesMenu_C_LoadFinished_BC85127E41FD4B8187170DA83E530CAD::SkinData' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_LoadFinished_BC85127E41FD4B8187170DA83E530CAD, ItemData) == 0x000008, "Member 'CharacterFeaturesMenu_C_LoadFinished_BC85127E41FD4B8187170DA83E530CAD::ItemData' has a wrong offset!");

// Function CharacterFeaturesMenu.CharacterFeaturesMenu_C.HandleInput
// 0x0004 (0x0004 - 0x0000)
struct CharacterFeaturesMenu_C_HandleInput final
{
public:
	EMarinerInputActions                          InInput;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HandleInput_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterFeaturesMenu_C_HandleInput) == 0x000001, "Wrong alignment on CharacterFeaturesMenu_C_HandleInput");
static_assert(sizeof(CharacterFeaturesMenu_C_HandleInput) == 0x000004, "Wrong size on CharacterFeaturesMenu_C_HandleInput");
static_assert(offsetof(CharacterFeaturesMenu_C_HandleInput, InInput) == 0x000000, "Member 'CharacterFeaturesMenu_C_HandleInput::InInput' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_HandleInput, ReturnValue) == 0x000001, "Member 'CharacterFeaturesMenu_C_HandleInput::ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_HandleInput, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'CharacterFeaturesMenu_C_HandleInput::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_HandleInput, CallFunc_HandleInput_ReturnValue) == 0x000003, "Member 'CharacterFeaturesMenu_C_HandleInput::CallFunc_HandleInput_ReturnValue' has a wrong offset!");

// Function CharacterFeaturesMenu.CharacterFeaturesMenu_C.UpdatePrompts
// 0x0798 (0x0798 - 0x0000)
struct CharacterFeaturesMenu_C_UpdatePrompts final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2093[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMarinerLinearColorStates              K2Node_MakeStruct_MarinerLinearColorStates;        // 0x0004(0x0030)(NoDestructor)
	uint8                                         Pad_2094[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0038(0x0088)()
	struct FMarinerLinearColorStates              K2Node_MakeStruct_MarinerLinearColorStates_1;      // 0x00C0(0x0030)(NoDestructor)
	struct FMarinerPromptIconData                 K2Node_MakeStruct_MarinerPromptIconData;           // 0x00F0(0x00D8)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x01C8(0x0088)()
	struct FMarinerPromptData                     K2Node_MakeStruct_MarinerPromptData;               // 0x0250(0x0118)()
	struct FMarinerPromptIconData                 K2Node_MakeStruct_MarinerPromptIconData_1;         // 0x0368(0x00D8)()
	struct FMarinerPromptData                     K2Node_MakeStruct_MarinerPromptData_1;             // 0x0440(0x0118)()
	struct FMarinerPromptData                     K2Node_MakeStruct_MarinerPromptData_2;             // 0x0558(0x0118)()
	bool                                          CallFunc_AddHostPrompt_ReturnValue;                // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ClearHostPrompts_ReturnValue;             // 0x0671(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2095[0x6];                                     // 0x0672(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMarinerPromptData                     K2Node_Select_Default;                             // 0x0678(0x0118)(ConstParm)
	bool                                          CallFunc_AddHostPrompt_ReturnValue_1;              // 0x0790(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterFeaturesMenu_C_UpdatePrompts) == 0x000008, "Wrong alignment on CharacterFeaturesMenu_C_UpdatePrompts");
static_assert(sizeof(CharacterFeaturesMenu_C_UpdatePrompts) == 0x000798, "Wrong size on CharacterFeaturesMenu_C_UpdatePrompts");
static_assert(offsetof(CharacterFeaturesMenu_C_UpdatePrompts, Temp_bool_Variable) == 0x000000, "Member 'CharacterFeaturesMenu_C_UpdatePrompts::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_UpdatePrompts, K2Node_MakeStruct_MarinerLinearColorStates) == 0x000004, "Member 'CharacterFeaturesMenu_C_UpdatePrompts::K2Node_MakeStruct_MarinerLinearColorStates' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_UpdatePrompts, K2Node_MakeStruct_SlateBrush) == 0x000038, "Member 'CharacterFeaturesMenu_C_UpdatePrompts::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_UpdatePrompts, K2Node_MakeStruct_MarinerLinearColorStates_1) == 0x0000C0, "Member 'CharacterFeaturesMenu_C_UpdatePrompts::K2Node_MakeStruct_MarinerLinearColorStates_1' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_UpdatePrompts, K2Node_MakeStruct_MarinerPromptIconData) == 0x0000F0, "Member 'CharacterFeaturesMenu_C_UpdatePrompts::K2Node_MakeStruct_MarinerPromptIconData' has a wrong offset!");
static_assert(offsetof(CharacterFeaturesMenu_C_UpdatePrompts, K2Node_MakeStruct_SlateBrush_1) == 0x0001C8, "Member 'CharacterFeaturesMenu_C_UpdatePrompts::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");
