#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterCommonActionText

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Mariner_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function CharacterCommonActionText.CharacterCommonActionText_C.PopulateActionText
// 0x0020 (0x0020 - 0x0000)
struct CharacterCommonActionText_C_PopulateActionText final
{
public:
	class FText                                   Param_ActionText;                                  // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterCommonActionText_C_PopulateActionText) == 0x000008, "Wrong alignment on CharacterCommonActionText_C_PopulateActionText");
static_assert(sizeof(CharacterCommonActionText_C_PopulateActionText) == 0x000020, "Wrong size on CharacterCommonActionText_C_PopulateActionText");
static_assert(offsetof(CharacterCommonActionText_C_PopulateActionText, Param_ActionText) == 0x000000, "Member 'CharacterCommonActionText_C_PopulateActionText::Param_ActionText' has a wrong offset!");
static_assert(offsetof(CharacterCommonActionText_C_PopulateActionText, Temp_byte_Variable) == 0x000018, "Member 'CharacterCommonActionText_C_PopulateActionText::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CharacterCommonActionText_C_PopulateActionText, CallFunc_TextIsEmpty_ReturnValue) == 0x000019, "Member 'CharacterCommonActionText_C_PopulateActionText::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonActionText_C_PopulateActionText, Temp_byte_Variable_1) == 0x00001A, "Member 'CharacterCommonActionText_C_PopulateActionText::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CharacterCommonActionText_C_PopulateActionText, Temp_bool_Variable) == 0x00001B, "Member 'CharacterCommonActionText_C_PopulateActionText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CharacterCommonActionText_C_PopulateActionText, K2Node_Select_Default) == 0x00001C, "Member 'CharacterCommonActionText_C_PopulateActionText::K2Node_Select_Default' has a wrong offset!");

// Function CharacterCommonActionText.CharacterCommonActionText_C.PopulateTeam
// 0x0058 (0x0058 - 0x0000)
struct CharacterCommonActionText_C_PopulateTeam final
{
public:
	class AMarinerCharacter*                      Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMarinerPlayerState*                    K2Node_DynamicCast_AsMariner_Player_State;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_258C[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTeamIndex_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMarinerHostility                             CallFunc_TryAndGetHostilityRelativeToLocalPlayer_ReturnValue; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMarinerTeamColorbyHostility_bIsValid;  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_258D[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 CallFunc_GetMarinerTeamColorbyHostility_ReturnValue; // 0x001C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0030(0x0028)()
};
static_assert(alignof(CharacterCommonActionText_C_PopulateTeam) == 0x000008, "Wrong alignment on CharacterCommonActionText_C_PopulateTeam");
static_assert(sizeof(CharacterCommonActionText_C_PopulateTeam) == 0x000058, "Wrong size on CharacterCommonActionText_C_PopulateTeam");
static_assert(offsetof(CharacterCommonActionText_C_PopulateTeam, Character) == 0x000000, "Member 'CharacterCommonActionText_C_PopulateTeam::Character' has a wrong offset!");
static_assert(offsetof(CharacterCommonActionText_C_PopulateTeam, K2Node_DynamicCast_AsMariner_Player_State) == 0x000008, "Member 'CharacterCommonActionText_C_PopulateTeam::K2Node_DynamicCast_AsMariner_Player_State' has a wrong offset!");
static_assert(offsetof(CharacterCommonActionText_C_PopulateTeam, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'CharacterCommonActionText_C_PopulateTeam::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CharacterCommonActionText_C_PopulateTeam, CallFunc_GetTeamIndex_ReturnValue) == 0x000014, "Member 'CharacterCommonActionText_C_PopulateTeam::CallFunc_GetTeamIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonActionText_C_PopulateTeam, CallFunc_TryAndGetHostilityRelativeToLocalPlayer_ReturnValue) == 0x000018, "Member 'CharacterCommonActionText_C_PopulateTeam::CallFunc_TryAndGetHostilityRelativeToLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonActionText_C_PopulateTeam, CallFunc_GetMarinerTeamColorbyHostility_bIsValid) == 0x000019, "Member 'CharacterCommonActionText_C_PopulateTeam::CallFunc_GetMarinerTeamColorbyHostility_bIsValid' has a wrong offset!");
static_assert(offsetof(CharacterCommonActionText_C_PopulateTeam, CallFunc_GetMarinerTeamColorbyHostility_ReturnValue) == 0x00001C, "Member 'CharacterCommonActionText_C_PopulateTeam::CallFunc_GetMarinerTeamColorbyHostility_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonActionText_C_PopulateTeam, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000020, "Member 'CharacterCommonActionText_C_PopulateTeam::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonActionText_C_PopulateTeam, K2Node_MakeStruct_SlateColor) == 0x000030, "Member 'CharacterCommonActionText_C_PopulateTeam::K2Node_MakeStruct_SlateColor' has a wrong offset!");

}

