#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterFeaturesMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_structs.hpp"
#include "Mariner_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CharacterFeaturesMenu.CharacterFeaturesMenu_C
// 0x0058 (0x0538 - 0x04E0)
class UCharacterFeaturesMenu_C final : public UMarinerMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCharacterArtifactsButton_C*            Artifacts;                                         // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerGridPanel*                      ContentPanel;                                      // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterFeatureEmotesButton_C*        Emotes;                                            // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterFeatureCMSItemButton_C*       MegaBlast;                                         // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterProgressButton_C*             Progression;                                       // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterFeatureCMSItemButton_C*       ReturnTrail;                                       // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterFeatureSkinButton_C*          Skins;                                             // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterStoryandAbilities_C*          StoryAndAbilities;                                 // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterCustomization_C*              ParentMenu;                                        // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NextLevelReward;                                   // 0x0530(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RewardIndex;                                       // 0x0534(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CharacterFeaturesMenu(int32 EntryPoint);
	void BndEvt__Emotes_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature(class UMarinerLayeredButton* Instance);
	void BndEvt__CharacterArtifactsButton_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature(class UMarinerLayeredButton* Instance);
	void BndEvt__Progression_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature(class UMarinerLayeredButton* Instance);
	void OnStateChanged(class UMarinerAnimatedWidget* Instance, EWidgetAnimationState NewState);
	void RefreshEquippedIcons();
	void BP_OnExited(bool bToSubLayer);
	void OnProfileUpdated();
	void PopulateCharacter(class UCharacterCustomization_C* ParentMenu_0);
	void BndEvt__ReturnTrail_K2Node_ComponentBoundEvent_28_OnLayeredButtonEvent__DelegateSignature(class UMarinerLayeredButton* Instance);
	void OnUnhovered(class UMarinerLayeredButton* Instance);
	void OnHovered(class UMarinerLayeredButton* Instance, bool bFromKeyboard, bool bFromMouse);
	void BndEvt__VFX_K2Node_ComponentBoundEvent_350_OnLayeredButtonEvent__DelegateSignature(class UMarinerLayeredButton* Instance);
	void BndEvt__Skins_K2Node_ComponentBoundEvent_80_OnLayeredButtonEvent__DelegateSignature(class UMarinerLayeredButton* Instance);
	void BP_OnEntered(bool bFromSubMenu);
	void LoadFinished_BC85127E41FD4B8187170DA83E530CAD(class UFrontendSkinUILoadResponse* SkinData, const TArray<class UItemLoadResponse*>& ItemData);
	void LoadFailed_BC85127E41FD4B8187170DA83E530CAD();
	bool HandleInput(EMarinerInputActions InInput);
	void UpdatePrompts();
	void HandleCharacterProgressionButton(class UMarinerPlayableCharacter* Character);
	void GetCharacterProfileProgression(class UMarinerPlayableCharacter* Character, bool* bProgressionFound, struct FMangoCharacterProgression* Progression_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CharacterFeaturesMenu_C">();
	}
	static class UCharacterFeaturesMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterFeaturesMenu_C>();
	}
};
static_assert(alignof(UCharacterFeaturesMenu_C) == 0x000008, "Wrong alignment on UCharacterFeaturesMenu_C");
static_assert(sizeof(UCharacterFeaturesMenu_C) == 0x000538, "Wrong size on UCharacterFeaturesMenu_C");
static_assert(offsetof(UCharacterFeaturesMenu_C, UberGraphFrame) == 0x0004E0, "Member 'UCharacterFeaturesMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCharacterFeaturesMenu_C, Artifacts) == 0x0004E8, "Member 'UCharacterFeaturesMenu_C::Artifacts' has a wrong offset!");
static_assert(offsetof(UCharacterFeaturesMenu_C, ContentPanel) == 0x0004F0, "Member 'UCharacterFeaturesMenu_C::ContentPanel' has a wrong offset!");
static_assert(offsetof(UCharacterFeaturesMenu_C, Emotes) == 0x0004F8, "Member 'UCharacterFeaturesMenu_C::Emotes' has a wrong offset!");
static_assert(offsetof(UCharacterFeaturesMenu_C, MegaBlast) == 0x000500, "Member 'UCharacterFeaturesMenu_C::MegaBlast' has a wrong offset!");
static_assert(offsetof(UCharacterFeaturesMenu_C, Progression) == 0x000508, "Member 'UCharacterFeaturesMenu_C::Progression' has a wrong offset!");
static_assert(offsetof(UCharacterFeaturesMenu_C, ReturnTrail) == 0x000510, "Member 'UCharacterFeaturesMenu_C::ReturnTrail' has a wrong offset!");
static_assert(offsetof(UCharacterFeaturesMenu_C, Skins) == 0x000518, "Member 'UCharacterFeaturesMenu_C::Skins' has a wrong offset!");
static_assert(offsetof(UCharacterFeaturesMenu_C, StoryAndAbilities) == 0x000520, "Member 'UCharacterFeaturesMenu_C::StoryAndAbilities' has a wrong offset!");
static_assert(offsetof(UCharacterFeaturesMenu_C, ParentMenu) == 0x000528, "Member 'UCharacterFeaturesMenu_C::ParentMenu' has a wrong offset!");
static_assert(offsetof(UCharacterFeaturesMenu_C, NextLevelReward) == 0x000530, "Member 'UCharacterFeaturesMenu_C::NextLevelReward' has a wrong offset!");
static_assert(offsetof(UCharacterFeaturesMenu_C, RewardIndex) == 0x000534, "Member 'UCharacterFeaturesMenu_C::RewardIndex' has a wrong offset!");

}

