#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterCustomization_Emote

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CharacterCustomization_Emote.CharacterCustomization_Emote_C
// 0x0068 (0x16F0 - 0x1688)
class UCharacterCustomization_Emote_C final : public UMarinerEmoteCustomizationMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1688(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UEmoteCategoryButton_C*                 ChatButton;                                        // 0x1690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEmoteSlot_C*                           EmoteMenuSlot1;                                    // 0x1698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEmoteSlot_C*                           EmoteMenuSlot2;                                    // 0x16A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEmoteSlot_C*                           EmoteMenuSlot3;                                    // 0x16A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEmoteSlot_C*                           EmoteMenuSlot4;                                    // 0x16B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPrompt_C*                       LTPrompt;                                          // 0x16B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemProgressionWidget_C*               ProgressionMessage;                                // 0x16C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPurchasePreviewWidget_C*               PurchasePreviewWidget;                             // 0x16C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEmoteCategoryButton_C*                 ReadyButton;                                       // 0x16D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPrompt_C*                       RTPrompt;                                          // 0x16D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEmoteCategoryButton_C*                 VictoryButton;                                     // 0x16E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemLoadResponse*                      ActiveItemResponse;                                // 0x16E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CharacterCustomization_Emote(int32 EntryPoint);
	void PopulateUnlockPreview(class UItemLoadResponse* LoadResponse, class UMarinerCMSItemDataAsset* DataAsset, class UMarinerPlayableCharacter* Character);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CharacterCustomization_Emote_C">();
	}
	static class UCharacterCustomization_Emote_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterCustomization_Emote_C>();
	}
};
static_assert(alignof(UCharacterCustomization_Emote_C) == 0x000008, "Wrong alignment on UCharacterCustomization_Emote_C");
static_assert(sizeof(UCharacterCustomization_Emote_C) == 0x0016F0, "Wrong size on UCharacterCustomization_Emote_C");
static_assert(offsetof(UCharacterCustomization_Emote_C, UberGraphFrame) == 0x001688, "Member 'UCharacterCustomization_Emote_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCharacterCustomization_Emote_C, ChatButton) == 0x001690, "Member 'UCharacterCustomization_Emote_C::ChatButton' has a wrong offset!");
static_assert(offsetof(UCharacterCustomization_Emote_C, EmoteMenuSlot1) == 0x001698, "Member 'UCharacterCustomization_Emote_C::EmoteMenuSlot1' has a wrong offset!");
static_assert(offsetof(UCharacterCustomization_Emote_C, EmoteMenuSlot2) == 0x0016A0, "Member 'UCharacterCustomization_Emote_C::EmoteMenuSlot2' has a wrong offset!");
static_assert(offsetof(UCharacterCustomization_Emote_C, EmoteMenuSlot3) == 0x0016A8, "Member 'UCharacterCustomization_Emote_C::EmoteMenuSlot3' has a wrong offset!");
static_assert(offsetof(UCharacterCustomization_Emote_C, EmoteMenuSlot4) == 0x0016B0, "Member 'UCharacterCustomization_Emote_C::EmoteMenuSlot4' has a wrong offset!");
static_assert(offsetof(UCharacterCustomization_Emote_C, LTPrompt) == 0x0016B8, "Member 'UCharacterCustomization_Emote_C::LTPrompt' has a wrong offset!");
static_assert(offsetof(UCharacterCustomization_Emote_C, ProgressionMessage) == 0x0016C0, "Member 'UCharacterCustomization_Emote_C::ProgressionMessage' has a wrong offset!");
static_assert(offsetof(UCharacterCustomization_Emote_C, PurchasePreviewWidget) == 0x0016C8, "Member 'UCharacterCustomization_Emote_C::PurchasePreviewWidget' has a wrong offset!");
static_assert(offsetof(UCharacterCustomization_Emote_C, ReadyButton) == 0x0016D0, "Member 'UCharacterCustomization_Emote_C::ReadyButton' has a wrong offset!");
static_assert(offsetof(UCharacterCustomization_Emote_C, RTPrompt) == 0x0016D8, "Member 'UCharacterCustomization_Emote_C::RTPrompt' has a wrong offset!");
static_assert(offsetof(UCharacterCustomization_Emote_C, VictoryButton) == 0x0016E0, "Member 'UCharacterCustomization_Emote_C::VictoryButton' has a wrong offset!");
static_assert(offsetof(UCharacterCustomization_Emote_C, ActiveItemResponse) == 0x0016E8, "Member 'UCharacterCustomization_Emote_C::ActiveItemResponse' has a wrong offset!");

}

