#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterCommonGuttered

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Mariner_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CharacterCommonGuttered.CharacterCommonGuttered_C.PopulateTeam
// 0x0030 (0x0030 - 0x0000)
struct CharacterCommonGuttered_C_PopulateTeam final
{
public:
	class AMarinerCharacter*                      Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMarinerPlayerState*                    K2Node_DynamicCast_AsMariner_Player_State;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2590[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTeamIndex_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMarinerHostility                             CallFunc_TryAndGetHostilityRelativeToLocalPlayer_ReturnValue; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMarinerTeamColorbyHostility_bIsValid;  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2591[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 CallFunc_GetMarinerTeamColorbyHostility_ReturnValue; // 0x001C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterCommonGuttered_C_PopulateTeam) == 0x000008, "Wrong alignment on CharacterCommonGuttered_C_PopulateTeam");
static_assert(sizeof(CharacterCommonGuttered_C_PopulateTeam) == 0x000030, "Wrong size on CharacterCommonGuttered_C_PopulateTeam");
static_assert(offsetof(CharacterCommonGuttered_C_PopulateTeam, Character) == 0x000000, "Member 'CharacterCommonGuttered_C_PopulateTeam::Character' has a wrong offset!");
static_assert(offsetof(CharacterCommonGuttered_C_PopulateTeam, K2Node_DynamicCast_AsMariner_Player_State) == 0x000008, "Member 'CharacterCommonGuttered_C_PopulateTeam::K2Node_DynamicCast_AsMariner_Player_State' has a wrong offset!");
static_assert(offsetof(CharacterCommonGuttered_C_PopulateTeam, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'CharacterCommonGuttered_C_PopulateTeam::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CharacterCommonGuttered_C_PopulateTeam, CallFunc_GetTeamIndex_ReturnValue) == 0x000014, "Member 'CharacterCommonGuttered_C_PopulateTeam::CallFunc_GetTeamIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonGuttered_C_PopulateTeam, CallFunc_TryAndGetHostilityRelativeToLocalPlayer_ReturnValue) == 0x000018, "Member 'CharacterCommonGuttered_C_PopulateTeam::CallFunc_TryAndGetHostilityRelativeToLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonGuttered_C_PopulateTeam, CallFunc_GetMarinerTeamColorbyHostility_bIsValid) == 0x000019, "Member 'CharacterCommonGuttered_C_PopulateTeam::CallFunc_GetMarinerTeamColorbyHostility_bIsValid' has a wrong offset!");
static_assert(offsetof(CharacterCommonGuttered_C_PopulateTeam, CallFunc_GetMarinerTeamColorbyHostility_ReturnValue) == 0x00001C, "Member 'CharacterCommonGuttered_C_PopulateTeam::CallFunc_GetMarinerTeamColorbyHostility_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonGuttered_C_PopulateTeam, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000020, "Member 'CharacterCommonGuttered_C_PopulateTeam::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");

// Function CharacterCommonGuttered.CharacterCommonGuttered_C.SetCirclePinRenderAngle
// 0x0004 (0x0004 - 0x0000)
struct CharacterCommonGuttered_C_SetCirclePinRenderAngle final
{
public:
	float                                         RenderAngle;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterCommonGuttered_C_SetCirclePinRenderAngle) == 0x000004, "Wrong alignment on CharacterCommonGuttered_C_SetCirclePinRenderAngle");
static_assert(sizeof(CharacterCommonGuttered_C_SetCirclePinRenderAngle) == 0x000004, "Wrong size on CharacterCommonGuttered_C_SetCirclePinRenderAngle");
static_assert(offsetof(CharacterCommonGuttered_C_SetCirclePinRenderAngle, RenderAngle) == 0x000000, "Member 'CharacterCommonGuttered_C_SetCirclePinRenderAngle::RenderAngle' has a wrong offset!");

// Function CharacterCommonGuttered.CharacterCommonGuttered_C.SetIconBrush
// 0x0088 (0x0088 - 0x0000)
struct CharacterCommonGuttered_C_SetIconBrush final
{
public:
	struct FSlateBrush                            Param_IconBrush;                                   // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(CharacterCommonGuttered_C_SetIconBrush) == 0x000008, "Wrong alignment on CharacterCommonGuttered_C_SetIconBrush");
static_assert(sizeof(CharacterCommonGuttered_C_SetIconBrush) == 0x000088, "Wrong size on CharacterCommonGuttered_C_SetIconBrush");
static_assert(offsetof(CharacterCommonGuttered_C_SetIconBrush, Param_IconBrush) == 0x000000, "Member 'CharacterCommonGuttered_C_SetIconBrush::Param_IconBrush' has a wrong offset!");

// Function CharacterCommonGuttered.CharacterCommonGuttered_C.PlayFlashAnimation
// 0x0008 (0x0008 - 0x0000)
struct CharacterCommonGuttered_C_PlayFlashAnimation final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterCommonGuttered_C_PlayFlashAnimation) == 0x000008, "Wrong alignment on CharacterCommonGuttered_C_PlayFlashAnimation");
static_assert(sizeof(CharacterCommonGuttered_C_PlayFlashAnimation) == 0x000008, "Wrong size on CharacterCommonGuttered_C_PlayFlashAnimation");
static_assert(offsetof(CharacterCommonGuttered_C_PlayFlashAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'CharacterCommonGuttered_C_PlayFlashAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function CharacterCommonGuttered.CharacterCommonGuttered_C.SetCharacterBrush
// 0x0088 (0x0088 - 0x0000)
struct CharacterCommonGuttered_C_SetCharacterBrush final
{
public:
	struct FSlateBrush                            Param_CharacterBrush;                              // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(CharacterCommonGuttered_C_SetCharacterBrush) == 0x000008, "Wrong alignment on CharacterCommonGuttered_C_SetCharacterBrush");
static_assert(sizeof(CharacterCommonGuttered_C_SetCharacterBrush) == 0x000088, "Wrong size on CharacterCommonGuttered_C_SetCharacterBrush");
static_assert(offsetof(CharacterCommonGuttered_C_SetCharacterBrush, Param_CharacterBrush) == 0x000000, "Member 'CharacterCommonGuttered_C_SetCharacterBrush::Param_CharacterBrush' has a wrong offset!");

// Function CharacterCommonGuttered.CharacterCommonGuttered_C.RefreshIcon
// 0x00A0 (0x00A0 - 0x0000)
struct CharacterCommonGuttered_C_RefreshIcon final
{
public:
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0000(0x0088)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterCommonGuttered_C_RefreshIcon) == 0x000008, "Wrong alignment on CharacterCommonGuttered_C_RefreshIcon");
static_assert(sizeof(CharacterCommonGuttered_C_RefreshIcon) == 0x0000A0, "Wrong size on CharacterCommonGuttered_C_RefreshIcon");
static_assert(offsetof(CharacterCommonGuttered_C_RefreshIcon, K2Node_MakeStruct_SlateBrush) == 0x000000, "Member 'CharacterCommonGuttered_C_RefreshIcon::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(CharacterCommonGuttered_C_RefreshIcon, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000088, "Member 'CharacterCommonGuttered_C_RefreshIcon::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonGuttered_C_RefreshIcon, K2Node_DynamicCast_AsTexture_2D) == 0x000090, "Member 'CharacterCommonGuttered_C_RefreshIcon::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(CharacterCommonGuttered_C_RefreshIcon, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'CharacterCommonGuttered_C_RefreshIcon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CharacterCommonGuttered_C_RefreshIcon, CallFunc_IsValid_ReturnValue) == 0x000099, "Member 'CharacterCommonGuttered_C_RefreshIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonGuttered_C_RefreshIcon, CallFunc_IsValid_ReturnValue_1) == 0x00009A, "Member 'CharacterCommonGuttered_C_RefreshIcon::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function CharacterCommonGuttered.CharacterCommonGuttered_C.SetGameModeWidget
// 0x0020 (0x0020 - 0x0000)
struct CharacterCommonGuttered_C_SetGameModeWidget final
{
public:
	class UClass*                                 Param_GameModeWidget;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMarinerPlayerState*                    PlayerState;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerPinGameModeWidget*              CallFunc_GetClassDefaultObject_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerPinGameModeWidget*              CallFunc_CreateGameModeWidget_WidgetInstance;      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterCommonGuttered_C_SetGameModeWidget) == 0x000008, "Wrong alignment on CharacterCommonGuttered_C_SetGameModeWidget");
static_assert(sizeof(CharacterCommonGuttered_C_SetGameModeWidget) == 0x000020, "Wrong size on CharacterCommonGuttered_C_SetGameModeWidget");
static_assert(offsetof(CharacterCommonGuttered_C_SetGameModeWidget, Param_GameModeWidget) == 0x000000, "Member 'CharacterCommonGuttered_C_SetGameModeWidget::Param_GameModeWidget' has a wrong offset!");
static_assert(offsetof(CharacterCommonGuttered_C_SetGameModeWidget, PlayerState) == 0x000008, "Member 'CharacterCommonGuttered_C_SetGameModeWidget::PlayerState' has a wrong offset!");
static_assert(offsetof(CharacterCommonGuttered_C_SetGameModeWidget, CallFunc_GetClassDefaultObject_ReturnValue) == 0x000010, "Member 'CharacterCommonGuttered_C_SetGameModeWidget::CallFunc_GetClassDefaultObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCommonGuttered_C_SetGameModeWidget, CallFunc_CreateGameModeWidget_WidgetInstance) == 0x000018, "Member 'CharacterCommonGuttered_C_SetGameModeWidget::CallFunc_CreateGameModeWidget_WidgetInstance' has a wrong offset!");

}

