#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterCustomization_MegaBlasts

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InventoryBaseMenu_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CharacterCustomization_MegaBlasts.CharacterCustomization_MegaBlasts_C
// 0x0028 (0x1330 - 0x1308)
class UCharacterCustomization_MegaBlasts_C final : public UInventoryBaseMenu_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CharacterCustomization_MegaBlasts_C; // 0x1308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	UMulticastInlineDelegateProperty_             EmitterSet;                                        // 0x1310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastInlineDelegateProperty_             EmitterCleared;                                    // 0x1320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void EmitterSet__DelegateSignature(class UParticleSystem* ParticleSystem);
	void EmitterCleared__DelegateSignature();
	void ExecuteUbergraph_CharacterCustomization_MegaBlasts(int32 EntryPoint);
	void EndVisualization();
	void OnLoaded_A1EB50DD40C2FA6DBFE243BBAEBF3D7C(class UObject* Loaded);
	void VisualizeSelectedButton(class UMarinerItemLoadResponseButton* ButtonInstance);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CharacterCustomization_MegaBlasts_C">();
	}
	static class UCharacterCustomization_MegaBlasts_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterCustomization_MegaBlasts_C>();
	}
};
static_assert(alignof(UCharacterCustomization_MegaBlasts_C) == 0x000008, "Wrong alignment on UCharacterCustomization_MegaBlasts_C");
static_assert(sizeof(UCharacterCustomization_MegaBlasts_C) == 0x001330, "Wrong size on UCharacterCustomization_MegaBlasts_C");
static_assert(offsetof(UCharacterCustomization_MegaBlasts_C, UberGraphFrame_CharacterCustomization_MegaBlasts_C) == 0x001308, "Member 'UCharacterCustomization_MegaBlasts_C::UberGraphFrame_CharacterCustomization_MegaBlasts_C' has a wrong offset!");
static_assert(offsetof(UCharacterCustomization_MegaBlasts_C, EmitterSet) == 0x001310, "Member 'UCharacterCustomization_MegaBlasts_C::EmitterSet' has a wrong offset!");
static_assert(offsetof(UCharacterCustomization_MegaBlasts_C, EmitterCleared) == 0x001320, "Member 'UCharacterCustomization_MegaBlasts_C::EmitterCleared' has a wrong offset!");

}

