#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterSelectMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_structs.hpp"
#include "Mariner_classes.hpp"
#include "UMG_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CharacterSelectMenu.CharacterSelectMenu_C
// 0x00F8 (0x0700 - 0x0608)
class UCharacterSelectMenu_C final : public UMarinerCharacterSelectMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ResetAnim;                                         // 0x0610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PlayerUnSelectedCharacter;                         // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PlayerSelectedCharacter;                           // 0x0620(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AbilityTabSlideOut;                                // 0x0628(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AbilityTabSlideIn;                                 // 0x0630(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SlideIn;                                           // 0x0638(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       EnteredLockState;                                  // 0x0640(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SlideOut;                                          // 0x0648(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Bottomglow;                                        // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_SelectCharacter;                       // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CharacterDifficulty;                               // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterSelectAbilities_C*            CharacterSelectAbilities;                          // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerOverlay*                        CharacterSelectAbilitiesOverlay;                   // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CharacterSelectFrame;                              // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DifficultyText;                                    // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flash;                                             // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FrameMaterial;                                     // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow;                                              // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lightning;                                         // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMapDataSmall_C*                        MapDataSmallWidget;                                // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Material;                                          // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OpacityBacker;                                     // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPreGameCountdown_C*                    PreGameCountDownWidget;                            // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootPanel;                                         // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Selected_particles;                                // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              SelectedText;                                      // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPrompt_C*                       ShowAbilitiesPrompt;                               // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextREADY;                                         // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Title;                                             // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          AbilitiesInfoOpen;                                 // 0x06F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CharacterSelectMenu(int32 EntryPoint);
	void WidgetAnimationEvt_AbilityTabSlideOut_K2Node_WidgetAnimationEvent_0();
	void OnInitialRandomCharacterSet(const TSoftClassPtr<class UClass>& Character);
	void CanvasPanel_SelectCharacter_ToggleVisibility_(ESlateVisibility InVisibility);
	void BP_OnButtonActivityStateHasBeenChanged();
	void Construct();
	void BP_OnCharacterSelectionFailed();
	void OnCountdownEnteredLockState();
	void OnCharacterSelectionReleased();
	void OnCharacterSelectionLocked();
	void OnSoftSelectionChanged(const TSoftClassPtr<class UClass>& SelectedCharacter);
	void OnCharacterHighlightChanged(class UMarinerPlayableCharacter* Character);
	void OnPlayerStateReplicated();
	void HandleDifficulty(class UMarinerPlayableCharacter* Character);
	bool HandleInput(EMarinerInputActions InInput);
	void HandleCharacterAbilitiesAndDifficulty(TSoftClassPtr<class UClass> Character);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CharacterSelectMenu_C">();
	}
	static class UCharacterSelectMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterSelectMenu_C>();
	}
};
static_assert(alignof(UCharacterSelectMenu_C) == 0x000008, "Wrong alignment on UCharacterSelectMenu_C");
static_assert(sizeof(UCharacterSelectMenu_C) == 0x000700, "Wrong size on UCharacterSelectMenu_C");
static_assert(offsetof(UCharacterSelectMenu_C, UberGraphFrame) == 0x000608, "Member 'UCharacterSelectMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCharacterSelectMenu_C, ResetAnim) == 0x000610, "Member 'UCharacterSelectMenu_C::ResetAnim' has a wrong offset!");
static_assert(offsetof(UCharacterSelectMenu_C, PlayerUnSelectedCharacter) == 0x000618, "Member 'UCharacterSelectMenu_C::PlayerUnSelectedCharacter' has a wrong offset!");
static_assert(offsetof(UCharacterSelectMenu_C, PlayerSelectedCharacter) == 0x000620, "Member 'UCharacterSelectMenu_C::PlayerSelectedCharacter' has a wrong offset!");
static_assert(offsetof(UCharacterSelectMenu_C, AbilityTabSlideOut) == 0x000628, "Member 'UCharacterSelectMenu_C::AbilityTabSlideOut' has a wrong offset!");
static_assert(offsetof(UCharacterSelectMenu_C, AbilityTabSlideIn) == 0x000630, "Member 'UCharacterSelectMenu_C::AbilityTabSlideIn' has a wrong offset!");
static_assert(offsetof(UCharacterSelectMenu_C, SlideIn) == 0x000638, "Member 'UCharacterSelectMenu_C::SlideIn' has a wrong offset!");
static_assert(offsetof(UCharacterSelectMenu_C, EnteredLockState) == 0x000640, "Member 'UCharacterSelectMenu_C::EnteredLockState' has a wrong offset!");
static_assert(offsetof(UCharacterSelectMenu_C, SlideOut) == 0x000648, "Member 'UCharacterSelectMenu_C::SlideOut' has a wrong offset!");
static_assert(offsetof(UCharacterSelectMenu_C, Bottomglow) == 0x000650, "Member 'UCharacterSelectMenu_C::Bottomglow' has a wrong offset!");
static_assert(offsetof(UCharacterSelectMenu_C, CanvasPanel_SelectCharacter) == 0x000658, "Member 'UCharacterSelectMenu_C::CanvasPanel_SelectCharacter' has a wrong offset!");
static_assert(offsetof(UCharacterSelectMenu_C, CharacterDifficulty) == 0x000660, "Member 'UCharacterSelectMenu_C::CharacterDifficulty' has a wrong offset!");
static_assert(offsetof(UCharacterSelectMenu_C, CharacterSelectAbilities) == 0x000668, "Member 'UCharacterSelectMenu_C::CharacterSelectAbilities' has a wrong offset!");
static_assert(offsetof(UCharacterSelectMenu_C, CharacterSelectAbilitiesOverlay) == 0x000670, "Member 'UCharacterSelectMenu_C::CharacterSelectAbilitiesOverlay' has a wrong offset!");
static_assert(offsetof(UCharacterSelectMenu_C, CharacterSelectFrame) == 0x000678, "Member 'UCharacterSelectMenu_C::CharacterSelectFrame' has a wrong offset!");
static_assert(offsetof(UCharacterSelectMenu_C, DifficultyText) == 0x000680, "Member 'UCharacterSelectMenu_C::DifficultyText' has a wrong offset!");
static_assert(offsetof(UCharacterSelectMenu_C, Flash) == 0x000688, "Member 'UCharacterSelectMenu_C::Flash' has a wrong offset!");
static_assert(offsetof(UCharacterSelectMenu_C, FrameMaterial) == 0x000690, "Member 'UCharacterSelectMenu_C::FrameMaterial' has a wrong offset!");
static_assert(offsetof(UCharacterSelectMenu_C, Glow) == 0x000698, "Member 'UCharacterSelectMenu_C::Glow' has a wrong offset!");
static_assert(offsetof(UCharacterSelectMenu_C, Lightning) == 0x0006A0, "Member 'UCharacterSelectMenu_C::Lightning' has a wrong offset!");
static_assert(offsetof(UCharacterSelectMenu_C, MapDataSmallWidget) == 0x0006A8, "Member 'UCharacterSelectMenu_C::MapDataSmallWidget' has a wrong offset!");
static_assert(offsetof(UCharacterSelectMenu_C, Material) == 0x0006B0, "Member 'UCharacterSelectMenu_C::Material' has a wrong offset!");
static_assert(offsetof(UCharacterSelectMenu_C, OpacityBacker) == 0x0006B8, "Member 'UCharacterSelectMenu_C::OpacityBacker' has a wrong offset!");
static_assert(offsetof(UCharacterSelectMenu_C, PreGameCountDownWidget) == 0x0006C0, "Member 'UCharacterSelectMenu_C::PreGameCountDownWidget' has a wrong offset!");
static_assert(offsetof(UCharacterSelectMenu_C, RootPanel) == 0x0006C8, "Member 'UCharacterSelectMenu_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UCharacterSelectMenu_C, Selected_particles) == 0x0006D0, "Member 'UCharacterSelectMenu_C::Selected_particles' has a wrong offset!");
static_assert(offsetof(UCharacterSelectMenu_C, SelectedText) == 0x0006D8, "Member 'UCharacterSelectMenu_C::SelectedText' has a wrong offset!");
static_assert(offsetof(UCharacterSelectMenu_C, ShowAbilitiesPrompt) == 0x0006E0, "Member 'UCharacterSelectMenu_C::ShowAbilitiesPrompt' has a wrong offset!");
static_assert(offsetof(UCharacterSelectMenu_C, TextREADY) == 0x0006E8, "Member 'UCharacterSelectMenu_C::TextREADY' has a wrong offset!");
static_assert(offsetof(UCharacterSelectMenu_C, Title) == 0x0006F0, "Member 'UCharacterSelectMenu_C::Title' has a wrong offset!");
static_assert(offsetof(UCharacterSelectMenu_C, AbilitiesInfoOpen) == 0x0006F8, "Member 'UCharacterSelectMenu_C::AbilitiesInfoOpen' has a wrong offset!");

}

