#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterFeatureSkinButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CharacterFeatureSkinButton.CharacterFeatureSkinButton_C
// 0x0048 (0x2FC0 - 0x2F78)
class UCharacterFeatureSkinButton_C final : public UMarinerLayeredButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x2F78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoveredAnim;                                       // 0x2F80(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x2F88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Border;                                            // 0x2F90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterSkinButton_C*                 CharacterSkinButton;                               // 0x2F98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                HitArea;                                           // 0x2FA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULoadingSpinner_Simplified_C*           LoadingSpinner_Simplified;                         // 0x2FA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_CharacterFeatureSkinButton_C;                 // 0x2FB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnviewedItemWidget_C*                  UnviewedWidget;                                    // 0x2FB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CharacterFeatureSkinButton(int32 EntryPoint);
	void Construct();
	void SetItemData(class UFrontendSkinUILoadResponse* FrontendUIData, class UMarinerPlayableCharacter* Character);

	struct FMarinerLayeredButtonAssets GetAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CharacterFeatureSkinButton_C">();
	}
	static class UCharacterFeatureSkinButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterFeatureSkinButton_C>();
	}
};
static_assert(alignof(UCharacterFeatureSkinButton_C) == 0x000008, "Wrong alignment on UCharacterFeatureSkinButton_C");
static_assert(sizeof(UCharacterFeatureSkinButton_C) == 0x002FC0, "Wrong size on UCharacterFeatureSkinButton_C");
static_assert(offsetof(UCharacterFeatureSkinButton_C, UberGraphFrame) == 0x002F78, "Member 'UCharacterFeatureSkinButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCharacterFeatureSkinButton_C, HoveredAnim) == 0x002F80, "Member 'UCharacterFeatureSkinButton_C::HoveredAnim' has a wrong offset!");
static_assert(offsetof(UCharacterFeatureSkinButton_C, Background) == 0x002F88, "Member 'UCharacterFeatureSkinButton_C::Background' has a wrong offset!");
static_assert(offsetof(UCharacterFeatureSkinButton_C, Border) == 0x002F90, "Member 'UCharacterFeatureSkinButton_C::Border' has a wrong offset!");
static_assert(offsetof(UCharacterFeatureSkinButton_C, CharacterSkinButton) == 0x002F98, "Member 'UCharacterFeatureSkinButton_C::CharacterSkinButton' has a wrong offset!");
static_assert(offsetof(UCharacterFeatureSkinButton_C, HitArea) == 0x002FA0, "Member 'UCharacterFeatureSkinButton_C::HitArea' has a wrong offset!");
static_assert(offsetof(UCharacterFeatureSkinButton_C, LoadingSpinner_Simplified) == 0x002FA8, "Member 'UCharacterFeatureSkinButton_C::LoadingSpinner_Simplified' has a wrong offset!");
static_assert(offsetof(UCharacterFeatureSkinButton_C, Name_CharacterFeatureSkinButton_C) == 0x002FB0, "Member 'UCharacterFeatureSkinButton_C::Name_CharacterFeatureSkinButton_C' has a wrong offset!");
static_assert(offsetof(UCharacterFeatureSkinButton_C, UnviewedWidget) == 0x002FB8, "Member 'UCharacterFeatureSkinButton_C::UnviewedWidget' has a wrong offset!");

}

