#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterPurchaseMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CharacterPurchaseMenu.CharacterPurchaseMenu_C
// 0x0060 (0x0540 - 0x04E0)
class UCharacterPurchaseMenu_C final : public UMarinerMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMarinerVerticalBox*                    AvailablePanel;                                    // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class CharacterUpsellWidget::UCharacterUpsellWidget_C* BlastPassButton;                                   // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerVerticalBox*                    BlastPassPanel;                                    // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BlastPassUnlockText;                               // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterBundleWidget_C*               CharacterBundleWidget;                             // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOfferPurchaseButton_C*                 PurchaseHard;                                      // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOfferPurchaseButton_C*                 PurchaseSoft;                                      // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerPaneSwitcher*                   RootSwitcher;                                      // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterStoryandAbilities_C*          StoryAndAbilities;                                 // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerPlayableCharacter*              Character;                                         // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CharacterPurchaseMenu(int32 EntryPoint);
	void BndEvt__PromotionButton_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature(class UMarinerLayeredButton* Instance);
	void PopulateCharacter(class UMarinerPlayableCharacter* Character_0);
	void BndEvt__BlastPassButton_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature(class UMarinerLayeredButton* Instance);
	void OnStateChanged(class UMarinerAnimatedWidget* Instance, EWidgetAnimationState NewState);
	void OnStorePurchaseComplete(const bool bWasSuccessful, const class FString& OfferId, const struct FMangoOrderDetails& OrderDetails);
	void BP_OnEntered(bool bFromSubMenu);
	void BP_OnExited(bool bToSubLayer);
	bool HandleInput(EMarinerInputActions InInput);
	void UpdatePrompts();
	void GetCharacterPurchaseOffer(class UMarinerPlayableCharacter* Character_0, struct FMangoPurchaseOffer* PurchaseOffer, bool* IsValid);
	void IsCharacterActiveBlastPassReward(bool* IsReward);
	void PopulateAvailable();
	void PopulateBlastPass();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CharacterPurchaseMenu_C">();
	}
	static class UCharacterPurchaseMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterPurchaseMenu_C>();
	}
};
static_assert(alignof(UCharacterPurchaseMenu_C) == 0x000008, "Wrong alignment on UCharacterPurchaseMenu_C");
static_assert(sizeof(UCharacterPurchaseMenu_C) == 0x000540, "Wrong size on UCharacterPurchaseMenu_C");
static_assert(offsetof(UCharacterPurchaseMenu_C, UberGraphFrame) == 0x0004E0, "Member 'UCharacterPurchaseMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCharacterPurchaseMenu_C, AvailablePanel) == 0x0004E8, "Member 'UCharacterPurchaseMenu_C::AvailablePanel' has a wrong offset!");
static_assert(offsetof(UCharacterPurchaseMenu_C, BlastPassButton) == 0x0004F0, "Member 'UCharacterPurchaseMenu_C::BlastPassButton' has a wrong offset!");
static_assert(offsetof(UCharacterPurchaseMenu_C, BlastPassPanel) == 0x0004F8, "Member 'UCharacterPurchaseMenu_C::BlastPassPanel' has a wrong offset!");
static_assert(offsetof(UCharacterPurchaseMenu_C, BlastPassUnlockText) == 0x000500, "Member 'UCharacterPurchaseMenu_C::BlastPassUnlockText' has a wrong offset!");
static_assert(offsetof(UCharacterPurchaseMenu_C, CharacterBundleWidget) == 0x000508, "Member 'UCharacterPurchaseMenu_C::CharacterBundleWidget' has a wrong offset!");
static_assert(offsetof(UCharacterPurchaseMenu_C, Image_0) == 0x000510, "Member 'UCharacterPurchaseMenu_C::Image_0' has a wrong offset!");
static_assert(offsetof(UCharacterPurchaseMenu_C, PurchaseHard) == 0x000518, "Member 'UCharacterPurchaseMenu_C::PurchaseHard' has a wrong offset!");
static_assert(offsetof(UCharacterPurchaseMenu_C, PurchaseSoft) == 0x000520, "Member 'UCharacterPurchaseMenu_C::PurchaseSoft' has a wrong offset!");
static_assert(offsetof(UCharacterPurchaseMenu_C, RootSwitcher) == 0x000528, "Member 'UCharacterPurchaseMenu_C::RootSwitcher' has a wrong offset!");
static_assert(offsetof(UCharacterPurchaseMenu_C, StoryAndAbilities) == 0x000530, "Member 'UCharacterPurchaseMenu_C::StoryAndAbilities' has a wrong offset!");
static_assert(offsetof(UCharacterPurchaseMenu_C, Character) == 0x000538, "Member 'UCharacterPurchaseMenu_C::Character' has a wrong offset!");

}

