#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterFeatureEmotesButton

#include "Basic.hpp"

#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function CharacterFeatureEmotesButton.CharacterFeatureEmotesButton_C.ExecuteUbergraph_CharacterFeatureEmotesButton
// 0x0018 (0x0018 - 0x0000)
struct CharacterFeatureEmotesButton_C_ExecuteUbergraph_CharacterFeatureEmotesButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2077[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoInventoryManager*                 CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasUnviewedSharedArtifacts_ReturnValue;   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterFeatureEmotesButton_C_ExecuteUbergraph_CharacterFeatureEmotesButton) == 0x000008, "Wrong alignment on CharacterFeatureEmotesButton_C_ExecuteUbergraph_CharacterFeatureEmotesButton");
static_assert(sizeof(CharacterFeatureEmotesButton_C_ExecuteUbergraph_CharacterFeatureEmotesButton) == 0x000018, "Wrong size on CharacterFeatureEmotesButton_C_ExecuteUbergraph_CharacterFeatureEmotesButton");
static_assert(offsetof(CharacterFeatureEmotesButton_C_ExecuteUbergraph_CharacterFeatureEmotesButton, EntryPoint) == 0x000000, "Member 'CharacterFeatureEmotesButton_C_ExecuteUbergraph_CharacterFeatureEmotesButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(CharacterFeatureEmotesButton_C_ExecuteUbergraph_CharacterFeatureEmotesButton, CallFunc_Get_ReturnValue) == 0x000008, "Member 'CharacterFeatureEmotesButton_C_ExecuteUbergraph_CharacterFeatureEmotesButton::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFeatureEmotesButton_C_ExecuteUbergraph_CharacterFeatureEmotesButton, CallFunc_HasUnviewedSharedArtifacts_ReturnValue) == 0x000010, "Member 'CharacterFeatureEmotesButton_C_ExecuteUbergraph_CharacterFeatureEmotesButton::CallFunc_HasUnviewedSharedArtifacts_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFeatureEmotesButton_C_ExecuteUbergraph_CharacterFeatureEmotesButton, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'CharacterFeatureEmotesButton_C_ExecuteUbergraph_CharacterFeatureEmotesButton::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function CharacterFeatureEmotesButton.CharacterFeatureEmotesButton_C.HandleUnviewedEmotes
// 0x0018 (0x0018 - 0x0000)
struct CharacterFeatureEmotesButton_C_HandleUnviewedEmotes final
{
public:
	class UMarinerPlayableCharacter*              Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMangoInventoryManager*                 CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasUnviewedCharacterEmotes_ReturnValue;   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterFeatureEmotesButton_C_HandleUnviewedEmotes) == 0x000008, "Wrong alignment on CharacterFeatureEmotesButton_C_HandleUnviewedEmotes");
static_assert(sizeof(CharacterFeatureEmotesButton_C_HandleUnviewedEmotes) == 0x000018, "Wrong size on CharacterFeatureEmotesButton_C_HandleUnviewedEmotes");
static_assert(offsetof(CharacterFeatureEmotesButton_C_HandleUnviewedEmotes, Character) == 0x000000, "Member 'CharacterFeatureEmotesButton_C_HandleUnviewedEmotes::Character' has a wrong offset!");
static_assert(offsetof(CharacterFeatureEmotesButton_C_HandleUnviewedEmotes, CallFunc_Get_ReturnValue) == 0x000008, "Member 'CharacterFeatureEmotesButton_C_HandleUnviewedEmotes::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFeatureEmotesButton_C_HandleUnviewedEmotes, CallFunc_HasUnviewedCharacterEmotes_ReturnValue) == 0x000010, "Member 'CharacterFeatureEmotesButton_C_HandleUnviewedEmotes::CallFunc_HasUnviewedCharacterEmotes_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFeatureEmotesButton_C_HandleUnviewedEmotes, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'CharacterFeatureEmotesButton_C_HandleUnviewedEmotes::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function CharacterFeatureEmotesButton.CharacterFeatureEmotesButton_C.GetAssets
// 0x00D0 (0x00D0 - 0x0000)
struct CharacterFeatureEmotesButton_C_GetAssets final
{
public:
	struct FMarinerLayeredButtonAssets            ReturnValue;                                       // 0x0000(0x0068)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference)
	struct FMarinerLayeredButtonAssets            K2Node_MakeStruct_MarinerLayeredButtonAssets;      // 0x0068(0x0068)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(CharacterFeatureEmotesButton_C_GetAssets) == 0x000008, "Wrong alignment on CharacterFeatureEmotesButton_C_GetAssets");
static_assert(sizeof(CharacterFeatureEmotesButton_C_GetAssets) == 0x0000D0, "Wrong size on CharacterFeatureEmotesButton_C_GetAssets");
static_assert(offsetof(CharacterFeatureEmotesButton_C_GetAssets, ReturnValue) == 0x000000, "Member 'CharacterFeatureEmotesButton_C_GetAssets::ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFeatureEmotesButton_C_GetAssets, K2Node_MakeStruct_MarinerLayeredButtonAssets) == 0x000068, "Member 'CharacterFeatureEmotesButton_C_GetAssets::K2Node_MakeStruct_MarinerLayeredButtonAssets' has a wrong offset!");

}

