#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterCommonName

#include "Basic.hpp"

#include "Mariner_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CharacterCommonName.CharacterCommonName_C
// 0x0020 (0x0438 - 0x0418)
class UCharacterCommonName_C final : public UMarinerAnimatedWidget
{
public:
	class UArrowWidget_C*                         Arrow;                                             // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NameText;                                          // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlayerNameBacker;                                  // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlayerNameFrame;                                   // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void PopulateTeam(class AMarinerCharacter* Character);
	void PopulateName(class AMarinerCharacter* Character);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CharacterCommonName_C">();
	}
	static class UCharacterCommonName_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterCommonName_C>();
	}
};
static_assert(alignof(UCharacterCommonName_C) == 0x000008, "Wrong alignment on UCharacterCommonName_C");
static_assert(sizeof(UCharacterCommonName_C) == 0x000438, "Wrong size on UCharacterCommonName_C");
static_assert(offsetof(UCharacterCommonName_C, Arrow) == 0x000418, "Member 'UCharacterCommonName_C::Arrow' has a wrong offset!");
static_assert(offsetof(UCharacterCommonName_C, NameText) == 0x000420, "Member 'UCharacterCommonName_C::NameText' has a wrong offset!");
static_assert(offsetof(UCharacterCommonName_C, PlayerNameBacker) == 0x000428, "Member 'UCharacterCommonName_C::PlayerNameBacker' has a wrong offset!");
static_assert(offsetof(UCharacterCommonName_C, PlayerNameFrame) == 0x000430, "Member 'UCharacterCommonName_C::PlayerNameFrame' has a wrong offset!");

}

