#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterSelectAbilities

#include "Basic.hpp"

#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function CharacterSelectAbilities.CharacterSelectAbilities_C.Populate
// 0x0038 (0x0038 - 0x0000)
struct CharacterSelectAbilities_C_Populate final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   NewLocalVar_0;                                     // 0x0008(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterSelectAbilities_C_Populate) == 0x000008, "Wrong alignment on CharacterSelectAbilities_C_Populate");
static_assert(sizeof(CharacterSelectAbilities_C_Populate) == 0x000038, "Wrong size on CharacterSelectAbilities_C_Populate");
static_assert(offsetof(CharacterSelectAbilities_C_Populate, ReturnValue) == 0x000000, "Member 'CharacterSelectAbilities_C_Populate::ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSelectAbilities_C_Populate, NewLocalVar_0) == 0x000008, "Member 'CharacterSelectAbilities_C_Populate::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(CharacterSelectAbilities_C_Populate, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'CharacterSelectAbilities_C_Populate::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CharacterSelectAbilities.CharacterSelectAbilities_C.SetCharacter
// 0x0010 (0x0010 - 0x0000)
struct CharacterSelectAbilities_C_SetCharacter final
{
public:
	class UMarinerPlayableCharacter*              Character_0;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Populate_ReturnValue;                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterSelectAbilities_C_SetCharacter) == 0x000008, "Wrong alignment on CharacterSelectAbilities_C_SetCharacter");
static_assert(sizeof(CharacterSelectAbilities_C_SetCharacter) == 0x000010, "Wrong size on CharacterSelectAbilities_C_SetCharacter");
static_assert(offsetof(CharacterSelectAbilities_C_SetCharacter, Character_0) == 0x000000, "Member 'CharacterSelectAbilities_C_SetCharacter::Character_0' has a wrong offset!");
static_assert(offsetof(CharacterSelectAbilities_C_SetCharacter, CallFunc_Populate_ReturnValue) == 0x000008, "Member 'CharacterSelectAbilities_C_SetCharacter::CallFunc_Populate_ReturnValue' has a wrong offset!");

// Function CharacterSelectAbilities.CharacterSelectAbilities_C.HandleInput
// 0x0002 (0x0002 - 0x0000)
struct CharacterSelectAbilities_C_HandleInput final
{
public:
	EMarinerInputActions                          InInput;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterSelectAbilities_C_HandleInput) == 0x000001, "Wrong alignment on CharacterSelectAbilities_C_HandleInput");
static_assert(sizeof(CharacterSelectAbilities_C_HandleInput) == 0x000002, "Wrong size on CharacterSelectAbilities_C_HandleInput");
static_assert(offsetof(CharacterSelectAbilities_C_HandleInput, InInput) == 0x000000, "Member 'CharacterSelectAbilities_C_HandleInput::InInput' has a wrong offset!");
static_assert(offsetof(CharacterSelectAbilities_C_HandleInput, ReturnValue) == 0x000001, "Member 'CharacterSelectAbilities_C_HandleInput::ReturnValue' has a wrong offset!");

}

