#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterCustomizationPedestalInterior

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CharacterCustomizationPedestalInterior.CharacterCustomizationPedestalInterior_C.ExecuteUbergraph_CharacterCustomizationPedestalInterior
// 0x0030 (0x0030 - 0x0000)
struct CharacterCustomizationPedestalInterior_C_ExecuteUbergraph_CharacterCustomizationPedestalInterior final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMarinerCharacterLite*                  K2Node_CustomEvent_LoadedChar;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterCustomizationPedestalInterior_C_ExecuteUbergraph_CharacterCustomizationPedestalInterior) == 0x000008, "Wrong alignment on CharacterCustomizationPedestalInterior_C_ExecuteUbergraph_CharacterCustomizationPedestalInterior");
static_assert(sizeof(CharacterCustomizationPedestalInterior_C_ExecuteUbergraph_CharacterCustomizationPedestalInterior) == 0x000030, "Wrong size on CharacterCustomizationPedestalInterior_C_ExecuteUbergraph_CharacterCustomizationPedestalInterior");
static_assert(offsetof(CharacterCustomizationPedestalInterior_C_ExecuteUbergraph_CharacterCustomizationPedestalInterior, EntryPoint) == 0x000000, "Member 'CharacterCustomizationPedestalInterior_C_ExecuteUbergraph_CharacterCustomizationPedestalInterior::EntryPoint' has a wrong offset!");
static_assert(offsetof(CharacterCustomizationPedestalInterior_C_ExecuteUbergraph_CharacterCustomizationPedestalInterior, K2Node_CustomEvent_LoadedChar) == 0x000008, "Member 'CharacterCustomizationPedestalInterior_C_ExecuteUbergraph_CharacterCustomizationPedestalInterior::K2Node_CustomEvent_LoadedChar' has a wrong offset!");
static_assert(offsetof(CharacterCustomizationPedestalInterior_C_ExecuteUbergraph_CharacterCustomizationPedestalInterior, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000010, "Member 'CharacterCustomizationPedestalInterior_C_ExecuteUbergraph_CharacterCustomizationPedestalInterior::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCustomizationPedestalInterior_C_ExecuteUbergraph_CharacterCustomizationPedestalInterior, CallFunc_RLerp_ReturnValue) == 0x00001C, "Member 'CharacterCustomizationPedestalInterior_C_ExecuteUbergraph_CharacterCustomizationPedestalInterior::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCustomizationPedestalInterior_C_ExecuteUbergraph_CharacterCustomizationPedestalInterior, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000028, "Member 'CharacterCustomizationPedestalInterior_C_ExecuteUbergraph_CharacterCustomizationPedestalInterior::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");

// Function CharacterCustomizationPedestalInterior.CharacterCustomizationPedestalInterior_C.AttachToTheChar
// 0x0008 (0x0008 - 0x0000)
struct CharacterCustomizationPedestalInterior_C_AttachToTheChar final
{
public:
	class AMarinerCharacterLite*                  LoadedChar_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterCustomizationPedestalInterior_C_AttachToTheChar) == 0x000008, "Wrong alignment on CharacterCustomizationPedestalInterior_C_AttachToTheChar");
static_assert(sizeof(CharacterCustomizationPedestalInterior_C_AttachToTheChar) == 0x000008, "Wrong size on CharacterCustomizationPedestalInterior_C_AttachToTheChar");
static_assert(offsetof(CharacterCustomizationPedestalInterior_C_AttachToTheChar, LoadedChar_0) == 0x000000, "Member 'CharacterCustomizationPedestalInterior_C_AttachToTheChar::LoadedChar_0' has a wrong offset!");

}

