#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterUpsellWidget_0

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CharacterUpsellWidget.CharacterUpsellWidget_C.SetCharacter
// 0x0008 (0x0008 - 0x0000)
struct CharacterUpsellWidget_C_SetCharacter final
{
public:
	class UMarinerPlayableCharacter*              Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterUpsellWidget_C_SetCharacter) == 0x000008, "Wrong alignment on CharacterUpsellWidget_C_SetCharacter");
static_assert(sizeof(CharacterUpsellWidget_C_SetCharacter) == 0x000008, "Wrong size on CharacterUpsellWidget_C_SetCharacter");
static_assert(offsetof(CharacterUpsellWidget_C_SetCharacter, Character) == 0x000000, "Member 'CharacterUpsellWidget_C_SetCharacter::Character' has a wrong offset!");

// Function CharacterUpsellWidget.CharacterUpsellWidget_C.Populate
// 0x0080 (0x0080 - 0x0000)
struct CharacterUpsellWidget_C_Populate final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0060(0x0018)()
	bool                                          CallFunc_Populate_ReturnValue;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterUpsellWidget_C_Populate) == 0x000008, "Wrong alignment on CharacterUpsellWidget_C_Populate");
static_assert(sizeof(CharacterUpsellWidget_C_Populate) == 0x000080, "Wrong size on CharacterUpsellWidget_C_Populate");
static_assert(offsetof(CharacterUpsellWidget_C_Populate, ReturnValue) == 0x000000, "Member 'CharacterUpsellWidget_C_Populate::ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterUpsellWidget_C_Populate, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'CharacterUpsellWidget_C_Populate::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(CharacterUpsellWidget_C_Populate, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'CharacterUpsellWidget_C_Populate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterUpsellWidget_C_Populate, K2Node_MakeArray_Array) == 0x000050, "Member 'CharacterUpsellWidget_C_Populate::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CharacterUpsellWidget_C_Populate, CallFunc_Format_ReturnValue) == 0x000060, "Member 'CharacterUpsellWidget_C_Populate::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterUpsellWidget_C_Populate, CallFunc_Populate_ReturnValue) == 0x000078, "Member 'CharacterUpsellWidget_C_Populate::CallFunc_Populate_ReturnValue' has a wrong offset!");

}

