#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterProgressButton

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CharacterProgressButton.CharacterProgressButton_C
// 0x0048 (0x2FD8 - 0x2F90)
class UCharacterProgressButton_C final : public UMarinerCharacterProgressionButton
{
public:
	class UWidgetAnimation*                       HoveredAnim;                                       // 0x2F90(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             AuxiliaryText;                                     // 0x2F98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x2FA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Border;                                            // 0x2FA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x2FB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Material;                                          // 0x2FB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PrimaryText;                                       // 0x2FC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPromptBanner_C*                 PromptBanner;                                      // 0x2FC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               RootSizeBox;                                       // 0x2FD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FMarinerLayeredButtonAssets GetAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CharacterProgressButton_C">();
	}
	static class UCharacterProgressButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterProgressButton_C>();
	}
};
static_assert(alignof(UCharacterProgressButton_C) == 0x000008, "Wrong alignment on UCharacterProgressButton_C");
static_assert(sizeof(UCharacterProgressButton_C) == 0x002FD8, "Wrong size on UCharacterProgressButton_C");
static_assert(offsetof(UCharacterProgressButton_C, HoveredAnim) == 0x002F90, "Member 'UCharacterProgressButton_C::HoveredAnim' has a wrong offset!");
static_assert(offsetof(UCharacterProgressButton_C, AuxiliaryText) == 0x002F98, "Member 'UCharacterProgressButton_C::AuxiliaryText' has a wrong offset!");
static_assert(offsetof(UCharacterProgressButton_C, Background) == 0x002FA0, "Member 'UCharacterProgressButton_C::Background' has a wrong offset!");
static_assert(offsetof(UCharacterProgressButton_C, Border) == 0x002FA8, "Member 'UCharacterProgressButton_C::Border' has a wrong offset!");
static_assert(offsetof(UCharacterProgressButton_C, Button) == 0x002FB0, "Member 'UCharacterProgressButton_C::Button' has a wrong offset!");
static_assert(offsetof(UCharacterProgressButton_C, Material) == 0x002FB8, "Member 'UCharacterProgressButton_C::Material' has a wrong offset!");
static_assert(offsetof(UCharacterProgressButton_C, PrimaryText) == 0x002FC0, "Member 'UCharacterProgressButton_C::PrimaryText' has a wrong offset!");
static_assert(offsetof(UCharacterProgressButton_C, PromptBanner) == 0x002FC8, "Member 'UCharacterProgressButton_C::PromptBanner' has a wrong offset!");
static_assert(offsetof(UCharacterProgressButton_C, RootSizeBox) == 0x002FD0, "Member 'UCharacterProgressButton_C::RootSizeBox' has a wrong offset!");

}

