#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterBundleWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CharacterBundleWidget.CharacterBundleWidget_C
// 0x0110 (0x3088 - 0x2F78)
class UCharacterBundleWidget_C final : public UMarinerLayeredButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x2F78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       LoopAnim;                                          // 0x2F80(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoveredAnim;                                       // 0x2F88(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x2F90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Border;                                            // 0x2F98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x2FA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flash00;                                           // 0x2FA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flash01;                                           // 0x2FB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flash02;                                           // 0x2FB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flash03;                                           // 0x2FC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flash04;                                           // 0x2FC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flash05;                                           // 0x2FD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x2FD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_216;                                         // 0x2FE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Material;                                          // 0x2FE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PriceFrame;                                        // 0x2FF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               RootSizeBox;                                       // 0x2FF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextDesc;                                          // 0x3000(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextName;                                          // 0x3008(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextPrice;                                         // 0x3010(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerPlayableCharacter*              Character;                                         // 0x3018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMarinerLayeredButtonAssets            NewVar_0;                                          // 0x3020(0x0068)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, ContainsInstancedReference)

public:
	void ExecuteUbergraph_CharacterBundleWidget(int32 EntryPoint);
	void Construct();
	void PopulateCharacter(class UMarinerPlayableCharacter* Param_Character);
	void GetCurrentCharacterPurchaseOffer(struct FMangoNativeOffer* Nativeoffer);
	void OnCharacterPurchase(class UMarinerLayeredButton* ButtonInstance);

	struct FMarinerLayeredButtonAssets GetAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CharacterBundleWidget_C">();
	}
	static class UCharacterBundleWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterBundleWidget_C>();
	}
};
static_assert(alignof(UCharacterBundleWidget_C) == 0x000008, "Wrong alignment on UCharacterBundleWidget_C");
static_assert(sizeof(UCharacterBundleWidget_C) == 0x003088, "Wrong size on UCharacterBundleWidget_C");
static_assert(offsetof(UCharacterBundleWidget_C, UberGraphFrame) == 0x002F78, "Member 'UCharacterBundleWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCharacterBundleWidget_C, LoopAnim) == 0x002F80, "Member 'UCharacterBundleWidget_C::LoopAnim' has a wrong offset!");
static_assert(offsetof(UCharacterBundleWidget_C, HoveredAnim) == 0x002F88, "Member 'UCharacterBundleWidget_C::HoveredAnim' has a wrong offset!");
static_assert(offsetof(UCharacterBundleWidget_C, Background) == 0x002F90, "Member 'UCharacterBundleWidget_C::Background' has a wrong offset!");
static_assert(offsetof(UCharacterBundleWidget_C, Border) == 0x002F98, "Member 'UCharacterBundleWidget_C::Border' has a wrong offset!");
static_assert(offsetof(UCharacterBundleWidget_C, Button) == 0x002FA0, "Member 'UCharacterBundleWidget_C::Button' has a wrong offset!");
static_assert(offsetof(UCharacterBundleWidget_C, Flash00) == 0x002FA8, "Member 'UCharacterBundleWidget_C::Flash00' has a wrong offset!");
static_assert(offsetof(UCharacterBundleWidget_C, Flash01) == 0x002FB0, "Member 'UCharacterBundleWidget_C::Flash01' has a wrong offset!");
static_assert(offsetof(UCharacterBundleWidget_C, Flash02) == 0x002FB8, "Member 'UCharacterBundleWidget_C::Flash02' has a wrong offset!");
static_assert(offsetof(UCharacterBundleWidget_C, Flash03) == 0x002FC0, "Member 'UCharacterBundleWidget_C::Flash03' has a wrong offset!");
static_assert(offsetof(UCharacterBundleWidget_C, Flash04) == 0x002FC8, "Member 'UCharacterBundleWidget_C::Flash04' has a wrong offset!");
static_assert(offsetof(UCharacterBundleWidget_C, Flash05) == 0x002FD0, "Member 'UCharacterBundleWidget_C::Flash05' has a wrong offset!");
static_assert(offsetof(UCharacterBundleWidget_C, Icon) == 0x002FD8, "Member 'UCharacterBundleWidget_C::Icon' has a wrong offset!");
static_assert(offsetof(UCharacterBundleWidget_C, Image_216) == 0x002FE0, "Member 'UCharacterBundleWidget_C::Image_216' has a wrong offset!");
static_assert(offsetof(UCharacterBundleWidget_C, Material) == 0x002FE8, "Member 'UCharacterBundleWidget_C::Material' has a wrong offset!");
static_assert(offsetof(UCharacterBundleWidget_C, PriceFrame) == 0x002FF0, "Member 'UCharacterBundleWidget_C::PriceFrame' has a wrong offset!");
static_assert(offsetof(UCharacterBundleWidget_C, RootSizeBox) == 0x002FF8, "Member 'UCharacterBundleWidget_C::RootSizeBox' has a wrong offset!");
static_assert(offsetof(UCharacterBundleWidget_C, TextDesc) == 0x003000, "Member 'UCharacterBundleWidget_C::TextDesc' has a wrong offset!");
static_assert(offsetof(UCharacterBundleWidget_C, TextName) == 0x003008, "Member 'UCharacterBundleWidget_C::TextName' has a wrong offset!");
static_assert(offsetof(UCharacterBundleWidget_C, TextPrice) == 0x003010, "Member 'UCharacterBundleWidget_C::TextPrice' has a wrong offset!");
static_assert(offsetof(UCharacterBundleWidget_C, Character) == 0x003018, "Member 'UCharacterBundleWidget_C::Character' has a wrong offset!");
static_assert(offsetof(UCharacterBundleWidget_C, NewVar_0) == 0x003020, "Member 'UCharacterBundleWidget_C::NewVar_0' has a wrong offset!");

}

