#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterProgressionMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CharacterProgressionMenu.CharacterProgressionMenu_C
// 0x0028 (0x0508 - 0x04E0)
class UCharacterProgressionMenu_C final : public UMarinerMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UProgressionCharacterWidget_C*          ProgressionWidget;                                 // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterSelectButton_C*               SelectedIcon;                                      // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CharacterGridActive;                               // 0x04F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2074[0x7];                                     // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerPlayableCharacter*              CharacterToUse;                                    // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CharacterProgressionMenu(int32 EntryPoint);
	void SetCharacter(class UMarinerPlayableCharacter* Character);
	void UpdatePrompts();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CharacterProgressionMenu_C">();
	}
	static class UCharacterProgressionMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterProgressionMenu_C>();
	}
};
static_assert(alignof(UCharacterProgressionMenu_C) == 0x000008, "Wrong alignment on UCharacterProgressionMenu_C");
static_assert(sizeof(UCharacterProgressionMenu_C) == 0x000508, "Wrong size on UCharacterProgressionMenu_C");
static_assert(offsetof(UCharacterProgressionMenu_C, UberGraphFrame) == 0x0004E0, "Member 'UCharacterProgressionMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCharacterProgressionMenu_C, ProgressionWidget) == 0x0004E8, "Member 'UCharacterProgressionMenu_C::ProgressionWidget' has a wrong offset!");
static_assert(offsetof(UCharacterProgressionMenu_C, SelectedIcon) == 0x0004F0, "Member 'UCharacterProgressionMenu_C::SelectedIcon' has a wrong offset!");
static_assert(offsetof(UCharacterProgressionMenu_C, CharacterGridActive) == 0x0004F8, "Member 'UCharacterProgressionMenu_C::CharacterGridActive' has a wrong offset!");
static_assert(offsetof(UCharacterProgressionMenu_C, CharacterToUse) == 0x000500, "Member 'UCharacterProgressionMenu_C::CharacterToUse' has a wrong offset!");

}

