#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterBundleWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "MangoClient_structs.hpp"
#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function CharacterBundleWidget.CharacterBundleWidget_C.ExecuteUbergraph_CharacterBundleWidget
// 0x0010 (0x0010 - 0x0000)
struct CharacterBundleWidget_C_ExecuteUbergraph_CharacterBundleWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterBundleWidget_C_ExecuteUbergraph_CharacterBundleWidget) == 0x000008, "Wrong alignment on CharacterBundleWidget_C_ExecuteUbergraph_CharacterBundleWidget");
static_assert(sizeof(CharacterBundleWidget_C_ExecuteUbergraph_CharacterBundleWidget) == 0x000010, "Wrong size on CharacterBundleWidget_C_ExecuteUbergraph_CharacterBundleWidget");
static_assert(offsetof(CharacterBundleWidget_C_ExecuteUbergraph_CharacterBundleWidget, EntryPoint) == 0x000000, "Member 'CharacterBundleWidget_C_ExecuteUbergraph_CharacterBundleWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(CharacterBundleWidget_C_ExecuteUbergraph_CharacterBundleWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'CharacterBundleWidget_C_ExecuteUbergraph_CharacterBundleWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function CharacterBundleWidget.CharacterBundleWidget_C.PopulateCharacter
// 0x01D8 (0x01D8 - 0x0000)
struct CharacterBundleWidget_C_PopulateCharacter final
{
public:
	class UMarinerPlayableCharacter*              Param_Character;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMangoTxnManager*                       CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UMarinerLayeredButton* Instance)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UMarinerFrontEndGlobals*                CallFunc_GetFrontEndGlobals_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMangoNativeOffer                      CallFunc_GetCurrentCharacterPurchaseOffer_NativeOffer; // 0x0028(0x00C0)()
	class UMarinerStoreGlobals*                   CallFunc_GetStoreGlobals_ReturnValue;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDisplayPriceForNativeOfferId_ReturnValue; // 0x00F0(0x0018)()
	struct FSlateBrush                            CallFunc_GetImage_ImageBrushOut;                   // 0x0108(0x0088)()
	bool                                          CallFunc_GetImage_ReturnValue;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1C[0x7];                                     // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ParseSpecialCharacters_Output;            // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01A8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x01C0(0x0018)()
};
static_assert(alignof(CharacterBundleWidget_C_PopulateCharacter) == 0x000008, "Wrong alignment on CharacterBundleWidget_C_PopulateCharacter");
static_assert(sizeof(CharacterBundleWidget_C_PopulateCharacter) == 0x0001D8, "Wrong size on CharacterBundleWidget_C_PopulateCharacter");
static_assert(offsetof(CharacterBundleWidget_C_PopulateCharacter, Param_Character) == 0x000000, "Member 'CharacterBundleWidget_C_PopulateCharacter::Param_Character' has a wrong offset!");
static_assert(offsetof(CharacterBundleWidget_C_PopulateCharacter, CallFunc_Get_ReturnValue) == 0x000008, "Member 'CharacterBundleWidget_C_PopulateCharacter::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterBundleWidget_C_PopulateCharacter, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'CharacterBundleWidget_C_PopulateCharacter::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CharacterBundleWidget_C_PopulateCharacter, CallFunc_GetFrontEndGlobals_ReturnValue) == 0x000020, "Member 'CharacterBundleWidget_C_PopulateCharacter::CallFunc_GetFrontEndGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterBundleWidget_C_PopulateCharacter, CallFunc_GetCurrentCharacterPurchaseOffer_NativeOffer) == 0x000028, "Member 'CharacterBundleWidget_C_PopulateCharacter::CallFunc_GetCurrentCharacterPurchaseOffer_NativeOffer' has a wrong offset!");
static_assert(offsetof(CharacterBundleWidget_C_PopulateCharacter, CallFunc_GetStoreGlobals_ReturnValue) == 0x0000E8, "Member 'CharacterBundleWidget_C_PopulateCharacter::CallFunc_GetStoreGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterBundleWidget_C_PopulateCharacter, CallFunc_GetDisplayPriceForNativeOfferId_ReturnValue) == 0x0000F0, "Member 'CharacterBundleWidget_C_PopulateCharacter::CallFunc_GetDisplayPriceForNativeOfferId_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterBundleWidget_C_PopulateCharacter, CallFunc_GetImage_ImageBrushOut) == 0x000108, "Member 'CharacterBundleWidget_C_PopulateCharacter::CallFunc_GetImage_ImageBrushOut' has a wrong offset!");
static_assert(offsetof(CharacterBundleWidget_C_PopulateCharacter, CallFunc_GetImage_ReturnValue) == 0x000190, "Member 'CharacterBundleWidget_C_PopulateCharacter::CallFunc_GetImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterBundleWidget_C_PopulateCharacter, CallFunc_ParseSpecialCharacters_Output) == 0x000198, "Member 'CharacterBundleWidget_C_PopulateCharacter::CallFunc_ParseSpecialCharacters_Output' has a wrong offset!");
static_assert(offsetof(CharacterBundleWidget_C_PopulateCharacter, CallFunc_Conv_StringToText_ReturnValue) == 0x0001A8, "Member 'CharacterBundleWidget_C_PopulateCharacter::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterBundleWidget_C_PopulateCharacter, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0001C0, "Member 'CharacterBundleWidget_C_PopulateCharacter::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

// Function CharacterBundleWidget.CharacterBundleWidget_C.GetCurrentCharacterPurchaseOffer
// 0x01C0 (0x01C0 - 0x0000)
struct CharacterBundleWidget_C_GetCurrentCharacterPurchaseOffer final
{
public:
	struct FMangoNativeOffer                      Nativeoffer;                                       // 0x0000(0x00C0)(Parm, OutParm)
	class UMangoCMSManager*                       CallFunc_Get_ReturnValue;                          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMangoPurchasableCharacter             CallFunc_GetPurchasableCharacter_OutPurchaseCharacter; // 0x00C8(0x00F0)()
	bool                                          CallFunc_GetPurchasableCharacter_ReturnValue;      // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterBundleWidget_C_GetCurrentCharacterPurchaseOffer) == 0x000008, "Wrong alignment on CharacterBundleWidget_C_GetCurrentCharacterPurchaseOffer");
static_assert(sizeof(CharacterBundleWidget_C_GetCurrentCharacterPurchaseOffer) == 0x0001C0, "Wrong size on CharacterBundleWidget_C_GetCurrentCharacterPurchaseOffer");
static_assert(offsetof(CharacterBundleWidget_C_GetCurrentCharacterPurchaseOffer, Nativeoffer) == 0x000000, "Member 'CharacterBundleWidget_C_GetCurrentCharacterPurchaseOffer::Nativeoffer' has a wrong offset!");
static_assert(offsetof(CharacterBundleWidget_C_GetCurrentCharacterPurchaseOffer, CallFunc_Get_ReturnValue) == 0x0000C0, "Member 'CharacterBundleWidget_C_GetCurrentCharacterPurchaseOffer::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterBundleWidget_C_GetCurrentCharacterPurchaseOffer, CallFunc_GetPurchasableCharacter_OutPurchaseCharacter) == 0x0000C8, "Member 'CharacterBundleWidget_C_GetCurrentCharacterPurchaseOffer::CallFunc_GetPurchasableCharacter_OutPurchaseCharacter' has a wrong offset!");
static_assert(offsetof(CharacterBundleWidget_C_GetCurrentCharacterPurchaseOffer, CallFunc_GetPurchasableCharacter_ReturnValue) == 0x0001B8, "Member 'CharacterBundleWidget_C_GetCurrentCharacterPurchaseOffer::CallFunc_GetPurchasableCharacter_ReturnValue' has a wrong offset!");

// Function CharacterBundleWidget.CharacterBundleWidget_C.OnCharacterPurchase
// 0x00E0 (0x00E0 - 0x0000)
struct CharacterBundleWidget_C_OnCharacterPurchase final
{
public:
	class UMarinerLayeredButton*                  ButtonInstance;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerAsyncUIFlowHandler*             CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMangoNativeOffer                      CallFunc_GetCurrentCharacterPurchaseOffer_NativeOffer; // 0x0010(0x00C0)()
	class UAsyncFlowOffers_C*                     K2Node_DynamicCast_AsAsync_Flow_Offers;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterBundleWidget_C_OnCharacterPurchase) == 0x000008, "Wrong alignment on CharacterBundleWidget_C_OnCharacterPurchase");
static_assert(sizeof(CharacterBundleWidget_C_OnCharacterPurchase) == 0x0000E0, "Wrong size on CharacterBundleWidget_C_OnCharacterPurchase");
static_assert(offsetof(CharacterBundleWidget_C_OnCharacterPurchase, ButtonInstance) == 0x000000, "Member 'CharacterBundleWidget_C_OnCharacterPurchase::ButtonInstance' has a wrong offset!");
static_assert(offsetof(CharacterBundleWidget_C_OnCharacterPurchase, CallFunc_Get_ReturnValue) == 0x000008, "Member 'CharacterBundleWidget_C_OnCharacterPurchase::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterBundleWidget_C_OnCharacterPurchase, CallFunc_GetCurrentCharacterPurchaseOffer_NativeOffer) == 0x000010, "Member 'CharacterBundleWidget_C_OnCharacterPurchase::CallFunc_GetCurrentCharacterPurchaseOffer_NativeOffer' has a wrong offset!");
static_assert(offsetof(CharacterBundleWidget_C_OnCharacterPurchase, K2Node_DynamicCast_AsAsync_Flow_Offers) == 0x0000D0, "Member 'CharacterBundleWidget_C_OnCharacterPurchase::K2Node_DynamicCast_AsAsync_Flow_Offers' has a wrong offset!");
static_assert(offsetof(CharacterBundleWidget_C_OnCharacterPurchase, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'CharacterBundleWidget_C_OnCharacterPurchase::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function CharacterBundleWidget.CharacterBundleWidget_C.GetAssets
// 0x00D0 (0x00D0 - 0x0000)
struct CharacterBundleWidget_C_GetAssets final
{
public:
	struct FMarinerLayeredButtonAssets            ReturnValue;                                       // 0x0000(0x0068)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference)
	struct FMarinerLayeredButtonAssets            K2Node_MakeStruct_MarinerLayeredButtonAssets;      // 0x0068(0x0068)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(CharacterBundleWidget_C_GetAssets) == 0x000008, "Wrong alignment on CharacterBundleWidget_C_GetAssets");
static_assert(sizeof(CharacterBundleWidget_C_GetAssets) == 0x0000D0, "Wrong size on CharacterBundleWidget_C_GetAssets");
static_assert(offsetof(CharacterBundleWidget_C_GetAssets, ReturnValue) == 0x000000, "Member 'CharacterBundleWidget_C_GetAssets::ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterBundleWidget_C_GetAssets, K2Node_MakeStruct_MarinerLayeredButtonAssets) == 0x000068, "Member 'CharacterBundleWidget_C_GetAssets::K2Node_MakeStruct_MarinerLayeredButtonAssets' has a wrong offset!");

}

