#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterFeatureSkinButton

#include "Basic.hpp"

#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function CharacterFeatureSkinButton.CharacterFeatureSkinButton_C.ExecuteUbergraph_CharacterFeatureSkinButton
// 0x0004 (0x0004 - 0x0000)
struct CharacterFeatureSkinButton_C_ExecuteUbergraph_CharacterFeatureSkinButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterFeatureSkinButton_C_ExecuteUbergraph_CharacterFeatureSkinButton) == 0x000004, "Wrong alignment on CharacterFeatureSkinButton_C_ExecuteUbergraph_CharacterFeatureSkinButton");
static_assert(sizeof(CharacterFeatureSkinButton_C_ExecuteUbergraph_CharacterFeatureSkinButton) == 0x000004, "Wrong size on CharacterFeatureSkinButton_C_ExecuteUbergraph_CharacterFeatureSkinButton");
static_assert(offsetof(CharacterFeatureSkinButton_C_ExecuteUbergraph_CharacterFeatureSkinButton, EntryPoint) == 0x000000, "Member 'CharacterFeatureSkinButton_C_ExecuteUbergraph_CharacterFeatureSkinButton::EntryPoint' has a wrong offset!");

// Function CharacterFeatureSkinButton.CharacterFeatureSkinButton_C.SetItemData
// 0x0020 (0x0020 - 0x0000)
struct CharacterFeatureSkinButton_C_SetItemData final
{
public:
	class UFrontendSkinUILoadResponse*            FrontendUIData;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerPlayableCharacter*              Character;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMangoInventoryManager*                 CallFunc_Get_ReturnValue;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasUnviewedCharacterSkins_ReturnValue;    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterFeatureSkinButton_C_SetItemData) == 0x000008, "Wrong alignment on CharacterFeatureSkinButton_C_SetItemData");
static_assert(sizeof(CharacterFeatureSkinButton_C_SetItemData) == 0x000020, "Wrong size on CharacterFeatureSkinButton_C_SetItemData");
static_assert(offsetof(CharacterFeatureSkinButton_C_SetItemData, FrontendUIData) == 0x000000, "Member 'CharacterFeatureSkinButton_C_SetItemData::FrontendUIData' has a wrong offset!");
static_assert(offsetof(CharacterFeatureSkinButton_C_SetItemData, Character) == 0x000008, "Member 'CharacterFeatureSkinButton_C_SetItemData::Character' has a wrong offset!");
static_assert(offsetof(CharacterFeatureSkinButton_C_SetItemData, CallFunc_Get_ReturnValue) == 0x000010, "Member 'CharacterFeatureSkinButton_C_SetItemData::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFeatureSkinButton_C_SetItemData, CallFunc_HasUnviewedCharacterSkins_ReturnValue) == 0x000018, "Member 'CharacterFeatureSkinButton_C_SetItemData::CallFunc_HasUnviewedCharacterSkins_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFeatureSkinButton_C_SetItemData, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'CharacterFeatureSkinButton_C_SetItemData::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function CharacterFeatureSkinButton.CharacterFeatureSkinButton_C.GetAssets
// 0x00D0 (0x00D0 - 0x0000)
struct CharacterFeatureSkinButton_C_GetAssets final
{
public:
	struct FMarinerLayeredButtonAssets            ReturnValue;                                       // 0x0000(0x0068)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference)
	struct FMarinerLayeredButtonAssets            K2Node_MakeStruct_MarinerLayeredButtonAssets;      // 0x0068(0x0068)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(CharacterFeatureSkinButton_C_GetAssets) == 0x000008, "Wrong alignment on CharacterFeatureSkinButton_C_GetAssets");
static_assert(sizeof(CharacterFeatureSkinButton_C_GetAssets) == 0x0000D0, "Wrong size on CharacterFeatureSkinButton_C_GetAssets");
static_assert(offsetof(CharacterFeatureSkinButton_C_GetAssets, ReturnValue) == 0x000000, "Member 'CharacterFeatureSkinButton_C_GetAssets::ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFeatureSkinButton_C_GetAssets, K2Node_MakeStruct_MarinerLayeredButtonAssets) == 0x000068, "Member 'CharacterFeatureSkinButton_C_GetAssets::K2Node_MakeStruct_MarinerLayeredButtonAssets' has a wrong offset!");

}

