#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterSelectMenu

#include "Basic.hpp"

#include "Mariner_structs.hpp"
#include "UMG_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function CharacterSelectMenu.CharacterSelectMenu_C.ExecuteUbergraph_CharacterSelectMenu
// 0x0190 (0x0190 - 0x0000)
struct CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2009[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0010(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0020(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_200A[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_200B[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameGlobals*                    CallFunc_GetGameGlobals_ReturnValue;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerPlayableCharacter*              CallFunc_GetSelectedCharacterDataForPlayer_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0068(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0078(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0088(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class UMarinerPlayableCharacter*              K2Node_Event_Character_1;                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   K2Node_Event_SelectedCharacter;                    // 0x00A0(0x0028)(ConstParm, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMarinerInputInterface> CallFunc_SetActiveInputWidget_InputWidget_CastInput; // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_200C[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMarinerBasePlayerController*           CallFunc_TryAndGetLocalPlayerController_ReturnValue; // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_200D[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterSelectChangeCharacterButton_C* K2Node_DynamicCast_AsCharacter_Select_Change_Character_Button; // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_200E[0x5];                                     // 0x0123(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   K2Node_Event_Character;                            // 0x0128(0x0028)(ConstParm, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_2;                            // 0x0150(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x0160(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue_2;                  // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_200F[0x4];                                     // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_3;                            // 0x0178(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_PostEvent_ReturnValue_3;                  // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu) == 0x000008, "Wrong alignment on CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu");
static_assert(sizeof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu) == 0x000190, "Wrong size on CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, EntryPoint) == 0x000000, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, Temp_struct_Variable) == 0x000010, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, Temp_delegate_Variable) == 0x000020, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, Temp_bool_Variable) == 0x000030, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, CallFunc_PostEvent_ReturnValue) == 0x000034, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, Temp_byte_Variable) == 0x000038, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, Temp_byte_Variable_1) == 0x000039, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, CallFunc_PlayAnimation_ReturnValue) == 0x000040, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, CallFunc_GetGameGlobals_ReturnValue) == 0x000048, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::CallFunc_GetGameGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000050, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, CallFunc_GetSelectedCharacterDataForPlayer_ReturnValue) == 0x000058, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::CallFunc_GetSelectedCharacterDataForPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, CallFunc_PlayAnimation_ReturnValue_1) == 0x000060, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, Temp_delegate_Variable_1) == 0x000068, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, Temp_struct_Variable_1) == 0x000078, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, Temp_delegate_Variable_2) == 0x000088, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, K2Node_Event_Character_1) == 0x000098, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::K2Node_Event_Character_1' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, K2Node_Event_SelectedCharacter) == 0x0000A0, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::K2Node_Event_SelectedCharacter' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000C8, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, CallFunc_PlayAnimation_ReturnValue_3) == 0x0000D0, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, CallFunc_PlayAnimation_ReturnValue_4) == 0x0000D8, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, CallFunc_GetPlayerController_ReturnValue) == 0x0000E0, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, CallFunc_SetActiveInputWidget_InputWidget_CastInput) == 0x0000E8, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::CallFunc_SetActiveInputWidget_InputWidget_CastInput' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, CallFunc_PlayAnimation_ReturnValue_5) == 0x0000F8, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000100, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, CallFunc_TryAndGetLocalPlayerController_ReturnValue) == 0x000108, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::CallFunc_TryAndGetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, CallFunc_PostEvent_ReturnValue_1) == 0x000110, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, K2Node_DynamicCast_AsCharacter_Select_Change_Character_Button) == 0x000118, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::K2Node_DynamicCast_AsCharacter_Select_Change_Character_Button' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, K2Node_DynamicCast_bSuccess) == 0x000120, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, K2Node_Select_Default) == 0x000121, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, K2Node_CustomEvent_InVisibility) == 0x000122, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::K2Node_CustomEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, K2Node_Event_Character) == 0x000128, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::K2Node_Event_Character' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, Temp_struct_Variable_2) == 0x000150, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, Temp_delegate_Variable_3) == 0x000160, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, CallFunc_PostEvent_ReturnValue_2) == 0x000170, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::CallFunc_PostEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, Temp_struct_Variable_3) == 0x000178, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu, CallFunc_PostEvent_ReturnValue_3) == 0x000188, "Member 'CharacterSelectMenu_C_ExecuteUbergraph_CharacterSelectMenu::CallFunc_PostEvent_ReturnValue_3' has a wrong offset!");

// Function CharacterSelectMenu.CharacterSelectMenu_C.OnInitialRandomCharacterSet
// 0x0028 (0x0028 - 0x0000)
struct CharacterSelectMenu_C_OnInitialRandomCharacterSet final
{
public:
	TSoftClassPtr<class UClass>                   Character;                                         // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(CharacterSelectMenu_C_OnInitialRandomCharacterSet) == 0x000008, "Wrong alignment on CharacterSelectMenu_C_OnInitialRandomCharacterSet");
static_assert(sizeof(CharacterSelectMenu_C_OnInitialRandomCharacterSet) == 0x000028, "Wrong size on CharacterSelectMenu_C_OnInitialRandomCharacterSet");
static_assert(offsetof(CharacterSelectMenu_C_OnInitialRandomCharacterSet, Character) == 0x000000, "Member 'CharacterSelectMenu_C_OnInitialRandomCharacterSet::Character' has a wrong offset!");

// Function CharacterSelectMenu.CharacterSelectMenu_C.CanvasPanel_SelectCharacter_ToggleVisibility 
// 0x0001 (0x0001 - 0x0000)
struct CharacterSelectMenu_C_CanvasPanel_SelectCharacter_ToggleVisibility_ final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterSelectMenu_C_CanvasPanel_SelectCharacter_ToggleVisibility_) == 0x000001, "Wrong alignment on CharacterSelectMenu_C_CanvasPanel_SelectCharacter_ToggleVisibility_");
static_assert(sizeof(CharacterSelectMenu_C_CanvasPanel_SelectCharacter_ToggleVisibility_) == 0x000001, "Wrong size on CharacterSelectMenu_C_CanvasPanel_SelectCharacter_ToggleVisibility_");
static_assert(offsetof(CharacterSelectMenu_C_CanvasPanel_SelectCharacter_ToggleVisibility_, InVisibility) == 0x000000, "Member 'CharacterSelectMenu_C_CanvasPanel_SelectCharacter_ToggleVisibility_::InVisibility' has a wrong offset!");

// Function CharacterSelectMenu.CharacterSelectMenu_C.OnSoftSelectionChanged
// 0x0028 (0x0028 - 0x0000)
struct CharacterSelectMenu_C_OnSoftSelectionChanged final
{
public:
	TSoftClassPtr<class UClass>                   SelectedCharacter;                                 // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(CharacterSelectMenu_C_OnSoftSelectionChanged) == 0x000008, "Wrong alignment on CharacterSelectMenu_C_OnSoftSelectionChanged");
static_assert(sizeof(CharacterSelectMenu_C_OnSoftSelectionChanged) == 0x000028, "Wrong size on CharacterSelectMenu_C_OnSoftSelectionChanged");
static_assert(offsetof(CharacterSelectMenu_C_OnSoftSelectionChanged, SelectedCharacter) == 0x000000, "Member 'CharacterSelectMenu_C_OnSoftSelectionChanged::SelectedCharacter' has a wrong offset!");

// Function CharacterSelectMenu.CharacterSelectMenu_C.OnCharacterHighlightChanged
// 0x0008 (0x0008 - 0x0000)
struct CharacterSelectMenu_C_OnCharacterHighlightChanged final
{
public:
	class UMarinerPlayableCharacter*              Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterSelectMenu_C_OnCharacterHighlightChanged) == 0x000008, "Wrong alignment on CharacterSelectMenu_C_OnCharacterHighlightChanged");
static_assert(sizeof(CharacterSelectMenu_C_OnCharacterHighlightChanged) == 0x000008, "Wrong size on CharacterSelectMenu_C_OnCharacterHighlightChanged");
static_assert(offsetof(CharacterSelectMenu_C_OnCharacterHighlightChanged, Character) == 0x000000, "Member 'CharacterSelectMenu_C_OnCharacterHighlightChanged::Character' has a wrong offset!");

// Function CharacterSelectMenu.CharacterSelectMenu_C.HandleDifficulty
// 0x0008 (0x0008 - 0x0000)
struct CharacterSelectMenu_C_HandleDifficulty final
{
public:
	class UMarinerPlayableCharacter*              Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterSelectMenu_C_HandleDifficulty) == 0x000008, "Wrong alignment on CharacterSelectMenu_C_HandleDifficulty");
static_assert(sizeof(CharacterSelectMenu_C_HandleDifficulty) == 0x000008, "Wrong size on CharacterSelectMenu_C_HandleDifficulty");
static_assert(offsetof(CharacterSelectMenu_C_HandleDifficulty, Character) == 0x000000, "Member 'CharacterSelectMenu_C_HandleDifficulty::Character' has a wrong offset!");

// Function CharacterSelectMenu.CharacterSelectMenu_C.HandleInput
// 0x0018 (0x0018 - 0x0000)
struct CharacterSelectMenu_C_HandleInput final
{
public:
	EMarinerInputActions                          InInput;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HandleInput_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2010[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterSelectMenu_C_HandleInput) == 0x000008, "Wrong alignment on CharacterSelectMenu_C_HandleInput");
static_assert(sizeof(CharacterSelectMenu_C_HandleInput) == 0x000018, "Wrong size on CharacterSelectMenu_C_HandleInput");
static_assert(offsetof(CharacterSelectMenu_C_HandleInput, InInput) == 0x000000, "Member 'CharacterSelectMenu_C_HandleInput::InInput' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_HandleInput, ReturnValue) == 0x000001, "Member 'CharacterSelectMenu_C_HandleInput::ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_HandleInput, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'CharacterSelectMenu_C_HandleInput::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_HandleInput, CallFunc_HandleInput_ReturnValue) == 0x000003, "Member 'CharacterSelectMenu_C_HandleInput::CallFunc_HandleInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_HandleInput, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'CharacterSelectMenu_C_HandleInput::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_HandleInput, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'CharacterSelectMenu_C_HandleInput::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function CharacterSelectMenu.CharacterSelectMenu_C.HandleCharacterAbilitiesAndDifficulty
// 0x0038 (0x0038 - 0x0000)
struct CharacterSelectMenu_C_HandleCharacterAbilitiesAndDifficulty final
{
public:
	TSoftClassPtr<class UClass>                   Character;                                         // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UMarinerGameGlobals*                    CallFunc_GetGameGlobals_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerPlayableCharacter*              CallFunc_GetCharacterDataBySoftClass_ReturnValue;  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterSelectMenu_C_HandleCharacterAbilitiesAndDifficulty) == 0x000008, "Wrong alignment on CharacterSelectMenu_C_HandleCharacterAbilitiesAndDifficulty");
static_assert(sizeof(CharacterSelectMenu_C_HandleCharacterAbilitiesAndDifficulty) == 0x000038, "Wrong size on CharacterSelectMenu_C_HandleCharacterAbilitiesAndDifficulty");
static_assert(offsetof(CharacterSelectMenu_C_HandleCharacterAbilitiesAndDifficulty, Character) == 0x000000, "Member 'CharacterSelectMenu_C_HandleCharacterAbilitiesAndDifficulty::Character' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_HandleCharacterAbilitiesAndDifficulty, CallFunc_GetGameGlobals_ReturnValue) == 0x000028, "Member 'CharacterSelectMenu_C_HandleCharacterAbilitiesAndDifficulty::CallFunc_GetGameGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSelectMenu_C_HandleCharacterAbilitiesAndDifficulty, CallFunc_GetCharacterDataBySoftClass_ReturnValue) == 0x000030, "Member 'CharacterSelectMenu_C_HandleCharacterAbilitiesAndDifficulty::CallFunc_GetCharacterDataBySoftClass_ReturnValue' has a wrong offset!");

}

