#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterCustomization_Artifacts

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CharacterCustomization_Artifacts.CharacterCustomization_Artifacts_C
// 0x0018 (0x12F8 - 0x12E0)
class UCharacterCustomization_Artifacts_C final : public UMarinerInventoryBaseMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x12E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArtifactHighlight_C*                   ArtifactHighlight;                                 // 0x12E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MainPanel;                                         // 0x12F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CharacterCustomization_Artifacts(int32 EntryPoint);
	void OnProfileItemEquipped(class UMarinerCMSItemDataAsset* Item);
	void PopulateUnlockPreview(class UItemLoadResponse* LoadResponse, class UMarinerCMSItemDataAsset* DataAsset, class UMarinerPlayableCharacter* Character);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CharacterCustomization_Artifacts_C">();
	}
	static class UCharacterCustomization_Artifacts_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterCustomization_Artifacts_C>();
	}
};
static_assert(alignof(UCharacterCustomization_Artifacts_C) == 0x000008, "Wrong alignment on UCharacterCustomization_Artifacts_C");
static_assert(sizeof(UCharacterCustomization_Artifacts_C) == 0x0012F8, "Wrong size on UCharacterCustomization_Artifacts_C");
static_assert(offsetof(UCharacterCustomization_Artifacts_C, UberGraphFrame) == 0x0012E0, "Member 'UCharacterCustomization_Artifacts_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCharacterCustomization_Artifacts_C, ArtifactHighlight) == 0x0012E8, "Member 'UCharacterCustomization_Artifacts_C::ArtifactHighlight' has a wrong offset!");
static_assert(offsetof(UCharacterCustomization_Artifacts_C, MainPanel) == 0x0012F0, "Member 'UCharacterCustomization_Artifacts_C::MainPanel' has a wrong offset!");

}

