#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterCustomization_Artifacts

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function CharacterCustomization_Artifacts.CharacterCustomization_Artifacts_C.ExecuteUbergraph_CharacterCustomization_Artifacts
// 0x0068 (0x0068 - 0x0000)
struct CharacterCustomization_Artifacts_C_ExecuteUbergraph_CharacterCustomization_Artifacts final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_2023[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemLoadResponse*                      K2Node_Event_LoadResponse;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerCMSItemDataAsset*               K2Node_Event_DataAsset;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerPlayableCharacter*              K2Node_Event_Character;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0030(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2024[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerArtifactDataAsset*              K2Node_DynamicCast_AsMariner_Artifact_Data_Asset;  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2025[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerCMSItemDataAsset*               K2Node_Event_Item;                                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerStackHeader*                    CallFunc_GetHostStackHeader_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterCustomization_Artifacts_C_ExecuteUbergraph_CharacterCustomization_Artifacts) == 0x000008, "Wrong alignment on CharacterCustomization_Artifacts_C_ExecuteUbergraph_CharacterCustomization_Artifacts");
static_assert(sizeof(CharacterCustomization_Artifacts_C_ExecuteUbergraph_CharacterCustomization_Artifacts) == 0x000068, "Wrong size on CharacterCustomization_Artifacts_C_ExecuteUbergraph_CharacterCustomization_Artifacts");
static_assert(offsetof(CharacterCustomization_Artifacts_C_ExecuteUbergraph_CharacterCustomization_Artifacts, EntryPoint) == 0x000000, "Member 'CharacterCustomization_Artifacts_C_ExecuteUbergraph_CharacterCustomization_Artifacts::EntryPoint' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_Artifacts_C_ExecuteUbergraph_CharacterCustomization_Artifacts, Temp_delegate_Variable) == 0x000004, "Member 'CharacterCustomization_Artifacts_C_ExecuteUbergraph_CharacterCustomization_Artifacts::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_Artifacts_C_ExecuteUbergraph_CharacterCustomization_Artifacts, K2Node_Event_LoadResponse) == 0x000018, "Member 'CharacterCustomization_Artifacts_C_ExecuteUbergraph_CharacterCustomization_Artifacts::K2Node_Event_LoadResponse' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_Artifacts_C_ExecuteUbergraph_CharacterCustomization_Artifacts, K2Node_Event_DataAsset) == 0x000020, "Member 'CharacterCustomization_Artifacts_C_ExecuteUbergraph_CharacterCustomization_Artifacts::K2Node_Event_DataAsset' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_Artifacts_C_ExecuteUbergraph_CharacterCustomization_Artifacts, K2Node_Event_Character) == 0x000028, "Member 'CharacterCustomization_Artifacts_C_ExecuteUbergraph_CharacterCustomization_Artifacts::K2Node_Event_Character' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_Artifacts_C_ExecuteUbergraph_CharacterCustomization_Artifacts, Temp_struct_Variable) == 0x000030, "Member 'CharacterCustomization_Artifacts_C_ExecuteUbergraph_CharacterCustomization_Artifacts::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_Artifacts_C_ExecuteUbergraph_CharacterCustomization_Artifacts, CallFunc_PostEvent_ReturnValue) == 0x000040, "Member 'CharacterCustomization_Artifacts_C_ExecuteUbergraph_CharacterCustomization_Artifacts::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_Artifacts_C_ExecuteUbergraph_CharacterCustomization_Artifacts, K2Node_DynamicCast_AsMariner_Artifact_Data_Asset) == 0x000048, "Member 'CharacterCustomization_Artifacts_C_ExecuteUbergraph_CharacterCustomization_Artifacts::K2Node_DynamicCast_AsMariner_Artifact_Data_Asset' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_Artifacts_C_ExecuteUbergraph_CharacterCustomization_Artifacts, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'CharacterCustomization_Artifacts_C_ExecuteUbergraph_CharacterCustomization_Artifacts::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_Artifacts_C_ExecuteUbergraph_CharacterCustomization_Artifacts, K2Node_Event_Item) == 0x000058, "Member 'CharacterCustomization_Artifacts_C_ExecuteUbergraph_CharacterCustomization_Artifacts::K2Node_Event_Item' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_Artifacts_C_ExecuteUbergraph_CharacterCustomization_Artifacts, CallFunc_GetHostStackHeader_ReturnValue) == 0x000060, "Member 'CharacterCustomization_Artifacts_C_ExecuteUbergraph_CharacterCustomization_Artifacts::CallFunc_GetHostStackHeader_ReturnValue' has a wrong offset!");

// Function CharacterCustomization_Artifacts.CharacterCustomization_Artifacts_C.OnProfileItemEquipped
// 0x0008 (0x0008 - 0x0000)
struct CharacterCustomization_Artifacts_C_OnProfileItemEquipped final
{
public:
	class UMarinerCMSItemDataAsset*               Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterCustomization_Artifacts_C_OnProfileItemEquipped) == 0x000008, "Wrong alignment on CharacterCustomization_Artifacts_C_OnProfileItemEquipped");
static_assert(sizeof(CharacterCustomization_Artifacts_C_OnProfileItemEquipped) == 0x000008, "Wrong size on CharacterCustomization_Artifacts_C_OnProfileItemEquipped");
static_assert(offsetof(CharacterCustomization_Artifacts_C_OnProfileItemEquipped, Item) == 0x000000, "Member 'CharacterCustomization_Artifacts_C_OnProfileItemEquipped::Item' has a wrong offset!");

// Function CharacterCustomization_Artifacts.CharacterCustomization_Artifacts_C.PopulateUnlockPreview
// 0x0018 (0x0018 - 0x0000)
struct CharacterCustomization_Artifacts_C_PopulateUnlockPreview final
{
public:
	class UItemLoadResponse*                      LoadResponse;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerCMSItemDataAsset*               DataAsset;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerPlayableCharacter*              Character;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterCustomization_Artifacts_C_PopulateUnlockPreview) == 0x000008, "Wrong alignment on CharacterCustomization_Artifacts_C_PopulateUnlockPreview");
static_assert(sizeof(CharacterCustomization_Artifacts_C_PopulateUnlockPreview) == 0x000018, "Wrong size on CharacterCustomization_Artifacts_C_PopulateUnlockPreview");
static_assert(offsetof(CharacterCustomization_Artifacts_C_PopulateUnlockPreview, LoadResponse) == 0x000000, "Member 'CharacterCustomization_Artifacts_C_PopulateUnlockPreview::LoadResponse' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_Artifacts_C_PopulateUnlockPreview, DataAsset) == 0x000008, "Member 'CharacterCustomization_Artifacts_C_PopulateUnlockPreview::DataAsset' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_Artifacts_C_PopulateUnlockPreview, Character) == 0x000010, "Member 'CharacterCustomization_Artifacts_C_PopulateUnlockPreview::Character' has a wrong offset!");

}

