#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterCustomizationSpawner

#include "Basic.hpp"


namespace SDK::Params
{

// Function CharacterCustomizationSpawner.CharacterCustomizationSpawner_C.ExecuteUbergraph_CharacterCustomizationSpawner
// 0x0060 (0x0060 - 0x0000)
struct CharacterCustomizationSpawner_C_ExecuteUbergraph_CharacterCustomizationSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors;            // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       K2Node_DynamicCast_AsStatic_Mesh_Actor;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseCharacterLite_C*                   K2Node_DynamicCast_AsBase_Character_Lite;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterCustomizationSpawner_C_ExecuteUbergraph_CharacterCustomizationSpawner) == 0x000008, "Wrong alignment on CharacterCustomizationSpawner_C_ExecuteUbergraph_CharacterCustomizationSpawner");
static_assert(sizeof(CharacterCustomizationSpawner_C_ExecuteUbergraph_CharacterCustomizationSpawner) == 0x000060, "Wrong size on CharacterCustomizationSpawner_C_ExecuteUbergraph_CharacterCustomizationSpawner");
static_assert(offsetof(CharacterCustomizationSpawner_C_ExecuteUbergraph_CharacterCustomizationSpawner, EntryPoint) == 0x000000, "Member 'CharacterCustomizationSpawner_C_ExecuteUbergraph_CharacterCustomizationSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(CharacterCustomizationSpawner_C_ExecuteUbergraph_CharacterCustomizationSpawner, Temp_int_Array_Index_Variable) == 0x000004, "Member 'CharacterCustomizationSpawner_C_ExecuteUbergraph_CharacterCustomizationSpawner::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CharacterCustomizationSpawner_C_ExecuteUbergraph_CharacterCustomizationSpawner, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'CharacterCustomizationSpawner_C_ExecuteUbergraph_CharacterCustomizationSpawner::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CharacterCustomizationSpawner_C_ExecuteUbergraph_CharacterCustomizationSpawner, CallFunc_GetAllActorsWithTag_OutActors) == 0x000010, "Member 'CharacterCustomizationSpawner_C_ExecuteUbergraph_CharacterCustomizationSpawner::CallFunc_GetAllActorsWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(CharacterCustomizationSpawner_C_ExecuteUbergraph_CharacterCustomizationSpawner, CallFunc_Array_Get_Item) == 0x000020, "Member 'CharacterCustomizationSpawner_C_ExecuteUbergraph_CharacterCustomizationSpawner::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CharacterCustomizationSpawner_C_ExecuteUbergraph_CharacterCustomizationSpawner, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'CharacterCustomizationSpawner_C_ExecuteUbergraph_CharacterCustomizationSpawner::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCustomizationSpawner_C_ExecuteUbergraph_CharacterCustomizationSpawner, K2Node_DynamicCast_AsStatic_Mesh_Actor) == 0x000030, "Member 'CharacterCustomizationSpawner_C_ExecuteUbergraph_CharacterCustomizationSpawner::K2Node_DynamicCast_AsStatic_Mesh_Actor' has a wrong offset!");
static_assert(offsetof(CharacterCustomizationSpawner_C_ExecuteUbergraph_CharacterCustomizationSpawner, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'CharacterCustomizationSpawner_C_ExecuteUbergraph_CharacterCustomizationSpawner::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CharacterCustomizationSpawner_C_ExecuteUbergraph_CharacterCustomizationSpawner, CallFunc_Less_IntInt_ReturnValue) == 0x000039, "Member 'CharacterCustomizationSpawner_C_ExecuteUbergraph_CharacterCustomizationSpawner::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCustomizationSpawner_C_ExecuteUbergraph_CharacterCustomizationSpawner, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000040, "Member 'CharacterCustomizationSpawner_C_ExecuteUbergraph_CharacterCustomizationSpawner::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCustomizationSpawner_C_ExecuteUbergraph_CharacterCustomizationSpawner, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'CharacterCustomizationSpawner_C_ExecuteUbergraph_CharacterCustomizationSpawner::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCustomizationSpawner_C_ExecuteUbergraph_CharacterCustomizationSpawner, K2Node_DynamicCast_AsBase_Character_Lite) == 0x000050, "Member 'CharacterCustomizationSpawner_C_ExecuteUbergraph_CharacterCustomizationSpawner::K2Node_DynamicCast_AsBase_Character_Lite' has a wrong offset!");
static_assert(offsetof(CharacterCustomizationSpawner_C_ExecuteUbergraph_CharacterCustomizationSpawner, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'CharacterCustomizationSpawner_C_ExecuteUbergraph_CharacterCustomizationSpawner::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

