#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterSkinButton

#include "Basic.hpp"

#include "Mariner_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CharacterSkinButton.CharacterSkinButton_C.ExecuteUbergraph_CharacterSkinButton
// 0x0088 (0x0088 - 0x0000)
struct CharacterSkinButton_C_ExecuteUbergraph_CharacterSkinButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_206C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemLoadResponse*                      K2Node_Event_LoadResponse;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerCMSItemDataAsset*               K2Node_Event_CMSItem;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFrontendSkinUILoadResponse*            K2Node_DynamicCast_AsFrontend_Skin_UILoad_Response; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_206D[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoPlayerManager*                    CallFunc_Get_ReturnValue;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerSkinCollectionDataAsset*        CallFunc_GetSkinCollection_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FLinearColor>                   CallFunc_GetPaletteColors_ReturnValue;             // 0x0038(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TSoftObjectPtr<class UMarinerSkinCollectionDataAsset> CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0048(0x0028)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetCMSNameForSkinCollection_ReturnValue;  // 0x0070(0x0018)(ConstParm)
};
static_assert(alignof(CharacterSkinButton_C_ExecuteUbergraph_CharacterSkinButton) == 0x000008, "Wrong alignment on CharacterSkinButton_C_ExecuteUbergraph_CharacterSkinButton");
static_assert(sizeof(CharacterSkinButton_C_ExecuteUbergraph_CharacterSkinButton) == 0x000088, "Wrong size on CharacterSkinButton_C_ExecuteUbergraph_CharacterSkinButton");
static_assert(offsetof(CharacterSkinButton_C_ExecuteUbergraph_CharacterSkinButton, EntryPoint) == 0x000000, "Member 'CharacterSkinButton_C_ExecuteUbergraph_CharacterSkinButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_ExecuteUbergraph_CharacterSkinButton, K2Node_Event_LoadResponse) == 0x000008, "Member 'CharacterSkinButton_C_ExecuteUbergraph_CharacterSkinButton::K2Node_Event_LoadResponse' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_ExecuteUbergraph_CharacterSkinButton, K2Node_Event_CMSItem) == 0x000010, "Member 'CharacterSkinButton_C_ExecuteUbergraph_CharacterSkinButton::K2Node_Event_CMSItem' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_ExecuteUbergraph_CharacterSkinButton, K2Node_DynamicCast_AsFrontend_Skin_UILoad_Response) == 0x000018, "Member 'CharacterSkinButton_C_ExecuteUbergraph_CharacterSkinButton::K2Node_DynamicCast_AsFrontend_Skin_UILoad_Response' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_ExecuteUbergraph_CharacterSkinButton, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'CharacterSkinButton_C_ExecuteUbergraph_CharacterSkinButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_ExecuteUbergraph_CharacterSkinButton, CallFunc_Get_ReturnValue) == 0x000028, "Member 'CharacterSkinButton_C_ExecuteUbergraph_CharacterSkinButton::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_ExecuteUbergraph_CharacterSkinButton, CallFunc_GetSkinCollection_ReturnValue) == 0x000030, "Member 'CharacterSkinButton_C_ExecuteUbergraph_CharacterSkinButton::CallFunc_GetSkinCollection_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_ExecuteUbergraph_CharacterSkinButton, CallFunc_GetPaletteColors_ReturnValue) == 0x000038, "Member 'CharacterSkinButton_C_ExecuteUbergraph_CharacterSkinButton::CallFunc_GetPaletteColors_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_ExecuteUbergraph_CharacterSkinButton, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000048, "Member 'CharacterSkinButton_C_ExecuteUbergraph_CharacterSkinButton::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_ExecuteUbergraph_CharacterSkinButton, CallFunc_GetCMSNameForSkinCollection_ReturnValue) == 0x000070, "Member 'CharacterSkinButton_C_ExecuteUbergraph_CharacterSkinButton::CallFunc_GetCMSNameForSkinCollection_ReturnValue' has a wrong offset!");

// Function CharacterSkinButton.CharacterSkinButton_C.OnPopulate
// 0x0010 (0x0010 - 0x0000)
struct CharacterSkinButton_C_OnPopulate final
{
public:
	class UItemLoadResponse*                      LoadResponse;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerCMSItemDataAsset*               CMSItem;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterSkinButton_C_OnPopulate) == 0x000008, "Wrong alignment on CharacterSkinButton_C_OnPopulate");
static_assert(sizeof(CharacterSkinButton_C_OnPopulate) == 0x000010, "Wrong size on CharacterSkinButton_C_OnPopulate");
static_assert(offsetof(CharacterSkinButton_C_OnPopulate, LoadResponse) == 0x000000, "Member 'CharacterSkinButton_C_OnPopulate::LoadResponse' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_OnPopulate, CMSItem) == 0x000008, "Member 'CharacterSkinButton_C_OnPopulate::CMSItem' has a wrong offset!");

// Function CharacterSkinButton.CharacterSkinButton_C.SetPalette
// 0x00B8 (0x00B8 - 0x0000)
struct CharacterSkinButton_C_SetPalette final
{
public:
	TArray<struct FLinearColor>                   InColors;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	int32                                         LastIndex;                                         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_206E[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Array_Get_Item;                           // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Array_Get_Item_1;                         // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Array_Get_Item_2;                         // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_206F[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2070[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_Array_Get_Item_3;                         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CallFunc_Array_Get_Item_4;                         // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2071[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CallFunc_Array_Get_Item_5;                         // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterSkinButton_C_SetPalette) == 0x000008, "Wrong alignment on CharacterSkinButton_C_SetPalette");
static_assert(sizeof(CharacterSkinButton_C_SetPalette) == 0x0000B8, "Wrong size on CharacterSkinButton_C_SetPalette");
static_assert(offsetof(CharacterSkinButton_C_SetPalette, InColors) == 0x000000, "Member 'CharacterSkinButton_C_SetPalette::InColors' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_SetPalette, LastIndex) == 0x000010, "Member 'CharacterSkinButton_C_SetPalette::LastIndex' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_SetPalette, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'CharacterSkinButton_C_SetPalette::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_SetPalette, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'CharacterSkinButton_C_SetPalette::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_SetPalette, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'CharacterSkinButton_C_SetPalette::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_SetPalette, CallFunc_Array_Length_ReturnValue_1) == 0x000020, "Member 'CharacterSkinButton_C_SetPalette::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_SetPalette, CallFunc_Array_Length_ReturnValue_2) == 0x000024, "Member 'CharacterSkinButton_C_SetPalette::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_SetPalette, Temp_int_Loop_Counter_Variable_1) == 0x000028, "Member 'CharacterSkinButton_C_SetPalette::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_SetPalette, CallFunc_Greater_IntInt_ReturnValue) == 0x00002C, "Member 'CharacterSkinButton_C_SetPalette::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_SetPalette, CallFunc_Less_IntInt_ReturnValue) == 0x00002D, "Member 'CharacterSkinButton_C_SetPalette::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_SetPalette, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'CharacterSkinButton_C_SetPalette::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_SetPalette, Temp_int_Array_Index_Variable) == 0x000034, "Member 'CharacterSkinButton_C_SetPalette::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_SetPalette, CallFunc_Array_Get_Item) == 0x000038, "Member 'CharacterSkinButton_C_SetPalette::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_SetPalette, Temp_int_Array_Index_Variable_1) == 0x000048, "Member 'CharacterSkinButton_C_SetPalette::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_SetPalette, CallFunc_Array_Add_ReturnValue) == 0x00004C, "Member 'CharacterSkinButton_C_SetPalette::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_SetPalette, CallFunc_Array_Add_ReturnValue_1) == 0x000050, "Member 'CharacterSkinButton_C_SetPalette::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_SetPalette, CallFunc_Array_Add_ReturnValue_2) == 0x000054, "Member 'CharacterSkinButton_C_SetPalette::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_SetPalette, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'CharacterSkinButton_C_SetPalette::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_SetPalette, CallFunc_Array_Get_Item_2) == 0x000068, "Member 'CharacterSkinButton_C_SetPalette::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_SetPalette, CallFunc_Array_Length_ReturnValue_3) == 0x000078, "Member 'CharacterSkinButton_C_SetPalette::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_SetPalette, CallFunc_Less_IntInt_ReturnValue_1) == 0x00007C, "Member 'CharacterSkinButton_C_SetPalette::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_SetPalette, CallFunc_Array_Length_ReturnValue_4) == 0x000080, "Member 'CharacterSkinButton_C_SetPalette::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_SetPalette, CallFunc_Subtract_IntInt_ReturnValue) == 0x000084, "Member 'CharacterSkinButton_C_SetPalette::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_SetPalette, Temp_int_Variable) == 0x000088, "Member 'CharacterSkinButton_C_SetPalette::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_SetPalette, CallFunc_Array_Get_Item_3) == 0x000090, "Member 'CharacterSkinButton_C_SetPalette::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_SetPalette, CallFunc_Array_Get_Item_4) == 0x000098, "Member 'CharacterSkinButton_C_SetPalette::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_SetPalette, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000A0, "Member 'CharacterSkinButton_C_SetPalette::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_SetPalette, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000A4, "Member 'CharacterSkinButton_C_SetPalette::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_SetPalette, CallFunc_Array_Get_Item_5) == 0x0000A8, "Member 'CharacterSkinButton_C_SetPalette::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_SetPalette, CallFunc_Array_Length_ReturnValue_5) == 0x0000B0, "Member 'CharacterSkinButton_C_SetPalette::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_SetPalette, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000B4, "Member 'CharacterSkinButton_C_SetPalette::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

// Function CharacterSkinButton.CharacterSkinButton_C.GetAssets
// 0x00D0 (0x00D0 - 0x0000)
struct CharacterSkinButton_C_GetAssets final
{
public:
	struct FMarinerLayeredButtonAssets            ReturnValue;                                       // 0x0000(0x0068)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference)
	struct FMarinerLayeredButtonAssets            K2Node_MakeStruct_MarinerLayeredButtonAssets;      // 0x0068(0x0068)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(CharacterSkinButton_C_GetAssets) == 0x000008, "Wrong alignment on CharacterSkinButton_C_GetAssets");
static_assert(sizeof(CharacterSkinButton_C_GetAssets) == 0x0000D0, "Wrong size on CharacterSkinButton_C_GetAssets");
static_assert(offsetof(CharacterSkinButton_C_GetAssets, ReturnValue) == 0x000000, "Member 'CharacterSkinButton_C_GetAssets::ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_GetAssets, K2Node_MakeStruct_MarinerLayeredButtonAssets) == 0x000068, "Member 'CharacterSkinButton_C_GetAssets::K2Node_MakeStruct_MarinerLayeredButtonAssets' has a wrong offset!");

// Function CharacterSkinButton.CharacterSkinButton_C.GetIconBrush
// 0x0140 (0x0140 - 0x0000)
struct CharacterSkinButton_C_GetIconBrush final
{
public:
	class UItemLoadResponse*                      LoadResponse;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerCMSItemDataAsset*               CMSItem;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            ReturnValue;                                       // 0x0010(0x0088)(Parm, OutParm, ReturnParm)
	class UFrontendSkinUILoadResponse*            K2Node_DynamicCast_AsFrontend_Skin_UILoad_Response; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2072[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2073[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x00B8(0x0088)()
};
static_assert(alignof(CharacterSkinButton_C_GetIconBrush) == 0x000008, "Wrong alignment on CharacterSkinButton_C_GetIconBrush");
static_assert(sizeof(CharacterSkinButton_C_GetIconBrush) == 0x000140, "Wrong size on CharacterSkinButton_C_GetIconBrush");
static_assert(offsetof(CharacterSkinButton_C_GetIconBrush, LoadResponse) == 0x000000, "Member 'CharacterSkinButton_C_GetIconBrush::LoadResponse' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_GetIconBrush, CMSItem) == 0x000008, "Member 'CharacterSkinButton_C_GetIconBrush::CMSItem' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_GetIconBrush, ReturnValue) == 0x000010, "Member 'CharacterSkinButton_C_GetIconBrush::ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_GetIconBrush, K2Node_DynamicCast_AsFrontend_Skin_UILoad_Response) == 0x000098, "Member 'CharacterSkinButton_C_GetIconBrush::K2Node_DynamicCast_AsFrontend_Skin_UILoad_Response' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_GetIconBrush, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'CharacterSkinButton_C_GetIconBrush::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_GetIconBrush, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000A8, "Member 'CharacterSkinButton_C_GetIconBrush::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_GetIconBrush, CallFunc_IsValid_ReturnValue) == 0x0000B0, "Member 'CharacterSkinButton_C_GetIconBrush::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_GetIconBrush, K2Node_MakeStruct_SlateBrush) == 0x0000B8, "Member 'CharacterSkinButton_C_GetIconBrush::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

// Function CharacterSkinButton.CharacterSkinButton_C.GetItemLoadResponseAssets
// 0x0010 (0x0010 - 0x0000)
struct CharacterSkinButton_C_GetItemLoadResponseAssets final
{
public:
	struct FMarinerItemLoadResponseAssets         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FMarinerItemLoadResponseAssets         K2Node_MakeStruct_MarinerItemLoadResponseAssets;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(CharacterSkinButton_C_GetItemLoadResponseAssets) == 0x000008, "Wrong alignment on CharacterSkinButton_C_GetItemLoadResponseAssets");
static_assert(sizeof(CharacterSkinButton_C_GetItemLoadResponseAssets) == 0x000010, "Wrong size on CharacterSkinButton_C_GetItemLoadResponseAssets");
static_assert(offsetof(CharacterSkinButton_C_GetItemLoadResponseAssets, ReturnValue) == 0x000000, "Member 'CharacterSkinButton_C_GetItemLoadResponseAssets::ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSkinButton_C_GetItemLoadResponseAssets, K2Node_MakeStruct_MarinerItemLoadResponseAssets) == 0x000008, "Member 'CharacterSkinButton_C_GetItemLoadResponseAssets::K2Node_MakeStruct_MarinerItemLoadResponseAssets' has a wrong offset!");

}

