#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterFunctionLibrary

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ECardinalDirection_structs.hpp"


namespace SDK::Params
{

// Function CharacterFunctionLibrary.CharacterFunctionLibrary_C.SetAimPitchYaw
// 0x0030 (0x0030 - 0x0000)
struct CharacterFunctionLibrary_C_SetAimPitchYaw final
{
public:
	class AMarinerCharacter*                      MarinerCharacter;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AimPitch;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AimYaw;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetAimOffsets_ReturnValue;                // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterFunctionLibrary_C_SetAimPitchYaw) == 0x000008, "Wrong alignment on CharacterFunctionLibrary_C_SetAimPitchYaw");
static_assert(sizeof(CharacterFunctionLibrary_C_SetAimPitchYaw) == 0x000030, "Wrong size on CharacterFunctionLibrary_C_SetAimPitchYaw");
static_assert(offsetof(CharacterFunctionLibrary_C_SetAimPitchYaw, MarinerCharacter) == 0x000000, "Member 'CharacterFunctionLibrary_C_SetAimPitchYaw::MarinerCharacter' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_SetAimPitchYaw, AimPitch) == 0x000008, "Member 'CharacterFunctionLibrary_C_SetAimPitchYaw::AimPitch' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_SetAimPitchYaw, AimYaw) == 0x00000C, "Member 'CharacterFunctionLibrary_C_SetAimPitchYaw::AimYaw' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_SetAimPitchYaw, __WorldContext) == 0x000010, "Member 'CharacterFunctionLibrary_C_SetAimPitchYaw::__WorldContext' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_SetAimPitchYaw, CallFunc_GetAimOffsets_ReturnValue) == 0x000018, "Member 'CharacterFunctionLibrary_C_SetAimPitchYaw::CallFunc_GetAimOffsets_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_SetAimPitchYaw, CallFunc_BreakRotator_Roll) == 0x000024, "Member 'CharacterFunctionLibrary_C_SetAimPitchYaw::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_SetAimPitchYaw, CallFunc_BreakRotator_Pitch) == 0x000028, "Member 'CharacterFunctionLibrary_C_SetAimPitchYaw::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_SetAimPitchYaw, CallFunc_BreakRotator_Yaw) == 0x00002C, "Member 'CharacterFunctionLibrary_C_SetAimPitchYaw::CallFunc_BreakRotator_Yaw' has a wrong offset!");

// Function CharacterFunctionLibrary.CharacterFunctionLibrary_C.SetFalling
// 0x0028 (0x0028 - 0x0000)
struct CharacterFunctionLibrary_C_SetFalling final
{
public:
	class APawn*                                  MarinerCharacter;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFalling;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterFunctionLibrary_C_SetFalling) == 0x000008, "Wrong alignment on CharacterFunctionLibrary_C_SetFalling");
static_assert(sizeof(CharacterFunctionLibrary_C_SetFalling) == 0x000028, "Wrong size on CharacterFunctionLibrary_C_SetFalling");
static_assert(offsetof(CharacterFunctionLibrary_C_SetFalling, MarinerCharacter) == 0x000000, "Member 'CharacterFunctionLibrary_C_SetFalling::MarinerCharacter' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_SetFalling, IsFalling) == 0x000008, "Member 'CharacterFunctionLibrary_C_SetFalling::IsFalling' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_SetFalling, __WorldContext) == 0x000010, "Member 'CharacterFunctionLibrary_C_SetFalling::__WorldContext' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_SetFalling, CallFunc_GetMovementComponent_ReturnValue) == 0x000018, "Member 'CharacterFunctionLibrary_C_SetFalling::CallFunc_GetMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_SetFalling, CallFunc_IsFalling_ReturnValue) == 0x000020, "Member 'CharacterFunctionLibrary_C_SetFalling::CallFunc_IsFalling_ReturnValue' has a wrong offset!");

// Function CharacterFunctionLibrary.CharacterFunctionLibrary_C.Calculate2DRelativeSpeed
// 0x0110 (0x0110 - 0x0000)
struct CharacterFunctionLibrary_C_Calculate2DRelativeSpeed final
{
public:
	class APawn*                                  Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RelativeXSpeed;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RelativeYSpeed;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SceneComponent;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             LocalTransform;                                    // 0x0020(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0xF];                                       // 0x0051(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_InverseTransformDirection_ReturnValue;    // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize2D_ReturnValue;                      // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxSpeed_ReturnValue;                  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterFunctionLibrary_C_Calculate2DRelativeSpeed) == 0x000010, "Wrong alignment on CharacterFunctionLibrary_C_Calculate2DRelativeSpeed");
static_assert(sizeof(CharacterFunctionLibrary_C_Calculate2DRelativeSpeed) == 0x000110, "Wrong size on CharacterFunctionLibrary_C_Calculate2DRelativeSpeed");
static_assert(offsetof(CharacterFunctionLibrary_C_Calculate2DRelativeSpeed, Pawn) == 0x000000, "Member 'CharacterFunctionLibrary_C_Calculate2DRelativeSpeed::Pawn' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_Calculate2DRelativeSpeed, RelativeXSpeed) == 0x000008, "Member 'CharacterFunctionLibrary_C_Calculate2DRelativeSpeed::RelativeXSpeed' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_Calculate2DRelativeSpeed, RelativeYSpeed) == 0x00000C, "Member 'CharacterFunctionLibrary_C_Calculate2DRelativeSpeed::RelativeYSpeed' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_Calculate2DRelativeSpeed, SceneComponent) == 0x000010, "Member 'CharacterFunctionLibrary_C_Calculate2DRelativeSpeed::SceneComponent' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_Calculate2DRelativeSpeed, __WorldContext) == 0x000018, "Member 'CharacterFunctionLibrary_C_Calculate2DRelativeSpeed::__WorldContext' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_Calculate2DRelativeSpeed, LocalTransform) == 0x000020, "Member 'CharacterFunctionLibrary_C_Calculate2DRelativeSpeed::LocalTransform' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_Calculate2DRelativeSpeed, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'CharacterFunctionLibrary_C_Calculate2DRelativeSpeed::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_Calculate2DRelativeSpeed, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000060, "Member 'CharacterFunctionLibrary_C_Calculate2DRelativeSpeed::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_Calculate2DRelativeSpeed, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000090, "Member 'CharacterFunctionLibrary_C_Calculate2DRelativeSpeed::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_Calculate2DRelativeSpeed, CallFunc_GetMovementComponent_ReturnValue) == 0x000098, "Member 'CharacterFunctionLibrary_C_Calculate2DRelativeSpeed::CallFunc_GetMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_Calculate2DRelativeSpeed, CallFunc_K2_GetComponentToWorld_ReturnValue_1) == 0x0000A0, "Member 'CharacterFunctionLibrary_C_Calculate2DRelativeSpeed::CallFunc_K2_GetComponentToWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_Calculate2DRelativeSpeed, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x0000D0, "Member 'CharacterFunctionLibrary_C_Calculate2DRelativeSpeed::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_Calculate2DRelativeSpeed, CallFunc_InverseTransformDirection_ReturnValue) == 0x0000D8, "Member 'CharacterFunctionLibrary_C_Calculate2DRelativeSpeed::CallFunc_InverseTransformDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_Calculate2DRelativeSpeed, CallFunc_VSize2D_ReturnValue) == 0x0000E4, "Member 'CharacterFunctionLibrary_C_Calculate2DRelativeSpeed::CallFunc_VSize2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_Calculate2DRelativeSpeed, CallFunc_GetMaxSpeed_ReturnValue) == 0x0000E8, "Member 'CharacterFunctionLibrary_C_Calculate2DRelativeSpeed::CallFunc_GetMaxSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_Calculate2DRelativeSpeed, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000EC, "Member 'CharacterFunctionLibrary_C_Calculate2DRelativeSpeed::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_Calculate2DRelativeSpeed, CallFunc_Divide_VectorFloat_ReturnValue) == 0x0000F0, "Member 'CharacterFunctionLibrary_C_Calculate2DRelativeSpeed::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_Calculate2DRelativeSpeed, CallFunc_BreakVector_X) == 0x0000FC, "Member 'CharacterFunctionLibrary_C_Calculate2DRelativeSpeed::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_Calculate2DRelativeSpeed, CallFunc_BreakVector_Y) == 0x000100, "Member 'CharacterFunctionLibrary_C_Calculate2DRelativeSpeed::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_Calculate2DRelativeSpeed, CallFunc_BreakVector_Z) == 0x000104, "Member 'CharacterFunctionLibrary_C_Calculate2DRelativeSpeed::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_Calculate2DRelativeSpeed, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000108, "Member 'CharacterFunctionLibrary_C_Calculate2DRelativeSpeed::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function CharacterFunctionLibrary.CharacterFunctionLibrary_C.GetCardinalDirection
// 0x00E8 (0x00E8 - 0x0000)
struct CharacterFunctionLibrary_C_GetCardinalDirection final
{
public:
	struct FRotator                               FacingDirection;                                   // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Velocity;                                          // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECardinalDirection                            Cardinal;                                          // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Direction;                                         // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NorthRotation;                                     // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SouthRotation;                                     // 0x002C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EastRotation;                                      // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WestRotation;                                      // 0x0034(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxNorth;                                          // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalizedVector;                                  // 0x003C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RightDot;                                          // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ForwardDot;                                        // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECardinalDirection                            LocalCardinal;                                     // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AngleFromVectors;                                  // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue;       // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue_1;         // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue_2;         // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B[0x1];                                       // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSizeSquared_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_7;        // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_8;        // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAngleFromVectors_Angle;                // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterFunctionLibrary_C_GetCardinalDirection) == 0x000008, "Wrong alignment on CharacterFunctionLibrary_C_GetCardinalDirection");
static_assert(sizeof(CharacterFunctionLibrary_C_GetCardinalDirection) == 0x0000E8, "Wrong size on CharacterFunctionLibrary_C_GetCardinalDirection");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, FacingDirection) == 0x000000, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::FacingDirection' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, Velocity) == 0x00000C, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::Velocity' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, __WorldContext) == 0x000018, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::__WorldContext' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, Cardinal) == 0x000020, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::Cardinal' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, Direction) == 0x000024, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::Direction' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, NorthRotation) == 0x000028, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::NorthRotation' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, SouthRotation) == 0x00002C, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::SouthRotation' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, EastRotation) == 0x000030, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::EastRotation' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, WestRotation) == 0x000034, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::WestRotation' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, MaxNorth) == 0x000038, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::MaxNorth' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, NormalizedVector) == 0x00003C, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::NormalizedVector' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, RightDot) == 0x000048, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::RightDot' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, ForwardDot) == 0x00004C, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::ForwardDot' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, LocalCardinal) == 0x000050, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::LocalCardinal' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, AngleFromVectors) == 0x000054, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::AngleFromVectors' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000058, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, CallFunc_NormalizedDeltaRotator_ReturnValue) == 0x000064, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::CallFunc_NormalizedDeltaRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, CallFunc_Add_FloatFloat_ReturnValue) == 0x000070, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, CallFunc_BreakRotator_Roll) == 0x000074, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, CallFunc_BreakRotator_Pitch) == 0x000078, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, CallFunc_BreakRotator_Yaw) == 0x00007C, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, CallFunc_Abs_ReturnValue) == 0x000080, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000084, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000088, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, CallFunc_InRange_FloatFloat_ReturnValue_1) == 0x000089, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::CallFunc_InRange_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, CallFunc_InRange_FloatFloat_ReturnValue_2) == 0x00008A, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::CallFunc_InRange_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, CallFunc_GetRightVector_ReturnValue) == 0x00008C, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, CallFunc_VSizeSquared_ReturnValue) == 0x000098, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::CallFunc_VSizeSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, CallFunc_Dot_VectorVector_ReturnValue) == 0x00009C, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000A0, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, CallFunc_GetForwardVector_ReturnValue) == 0x0000A4, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, CallFunc_Dot_VectorVector_ReturnValue_1) == 0x0000B0, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::CallFunc_Dot_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, CallFunc_Normal_ReturnValue) == 0x0000B4, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000C0, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0000C4, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x0000C8, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x0000CC, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x0000D0, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, CallFunc_Multiply_FloatFloat_ReturnValue_6) == 0x0000D4, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::CallFunc_Multiply_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, CallFunc_Multiply_FloatFloat_ReturnValue_7) == 0x0000D8, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::CallFunc_Multiply_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, CallFunc_Multiply_FloatFloat_ReturnValue_8) == 0x0000DC, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::CallFunc_Multiply_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetCardinalDirection, CallFunc_GetAngleFromVectors_Angle) == 0x0000E0, "Member 'CharacterFunctionLibrary_C_GetCardinalDirection::CallFunc_GetAngleFromVectors_Angle' has a wrong offset!");

// Function CharacterFunctionLibrary.CharacterFunctionLibrary_C.GetWeaponSocketLocation
// 0x0070 (0x0070 - 0x0000)
struct CharacterFunctionLibrary_C_GetWeaponSocketLocation final
{
public:
	class AMarinerCharacter*                      MarinerCharacter;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Socket;                                            // 0x001C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AMarinerWeapon*                         CallFunc_GetWeapon_ReturnValue;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetWeaponMesh_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterFunctionLibrary_C_GetWeaponSocketLocation) == 0x000008, "Wrong alignment on CharacterFunctionLibrary_C_GetWeaponSocketLocation");
static_assert(sizeof(CharacterFunctionLibrary_C_GetWeaponSocketLocation) == 0x000070, "Wrong size on CharacterFunctionLibrary_C_GetWeaponSocketLocation");
static_assert(offsetof(CharacterFunctionLibrary_C_GetWeaponSocketLocation, MarinerCharacter) == 0x000000, "Member 'CharacterFunctionLibrary_C_GetWeaponSocketLocation::MarinerCharacter' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetWeaponSocketLocation, SkeletalMesh) == 0x000008, "Member 'CharacterFunctionLibrary_C_GetWeaponSocketLocation::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetWeaponSocketLocation, Location) == 0x000010, "Member 'CharacterFunctionLibrary_C_GetWeaponSocketLocation::Location' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetWeaponSocketLocation, Socket) == 0x00001C, "Member 'CharacterFunctionLibrary_C_GetWeaponSocketLocation::Socket' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetWeaponSocketLocation, __WorldContext) == 0x000028, "Member 'CharacterFunctionLibrary_C_GetWeaponSocketLocation::__WorldContext' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetWeaponSocketLocation, Temp_bool_Variable) == 0x000030, "Member 'CharacterFunctionLibrary_C_GetWeaponSocketLocation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetWeaponSocketLocation, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000031, "Member 'CharacterFunctionLibrary_C_GetWeaponSocketLocation::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetWeaponSocketLocation, CallFunc_IsValid_ReturnValue) == 0x000032, "Member 'CharacterFunctionLibrary_C_GetWeaponSocketLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetWeaponSocketLocation, CallFunc_GetWeapon_ReturnValue) == 0x000038, "Member 'CharacterFunctionLibrary_C_GetWeaponSocketLocation::CallFunc_GetWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetWeaponSocketLocation, Temp_name_Variable) == 0x000040, "Member 'CharacterFunctionLibrary_C_GetWeaponSocketLocation::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetWeaponSocketLocation, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'CharacterFunctionLibrary_C_GetWeaponSocketLocation::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetWeaponSocketLocation, K2Node_Select_Default) == 0x00004C, "Member 'CharacterFunctionLibrary_C_GetWeaponSocketLocation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetWeaponSocketLocation, CallFunc_GetWeaponMesh_ReturnValue) == 0x000058, "Member 'CharacterFunctionLibrary_C_GetWeaponSocketLocation::CallFunc_GetWeaponMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetWeaponSocketLocation, CallFunc_GetSocketLocation_ReturnValue) == 0x000060, "Member 'CharacterFunctionLibrary_C_GetWeaponSocketLocation::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_GetWeaponSocketLocation, CallFunc_IsValid_ReturnValue_2) == 0x00006C, "Member 'CharacterFunctionLibrary_C_GetWeaponSocketLocation::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function CharacterFunctionLibrary.CharacterFunctionLibrary_C.CalculateRootOffset
// 0x0088 (0x0088 - 0x0000)
struct CharacterFunctionLibrary_C_CalculateRootOffset final
{
public:
	float                                         MaxRootOffset;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RootOffsetRef;                                     // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Right_Foot_Alpha_Ref;                              // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Left_Foot_Alpha_Ref;                               // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Root_Interp_Speed;                                 // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Delta;                                             // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Left_Foot_Offset;                                  // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Right_Foot_Offset;                                 // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            MaxOffsetWeightCurve;                              // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterFunctionLibrary_C_CalculateRootOffset) == 0x000008, "Wrong alignment on CharacterFunctionLibrary_C_CalculateRootOffset");
static_assert(sizeof(CharacterFunctionLibrary_C_CalculateRootOffset) == 0x000088, "Wrong size on CharacterFunctionLibrary_C_CalculateRootOffset");
static_assert(offsetof(CharacterFunctionLibrary_C_CalculateRootOffset, MaxRootOffset) == 0x000000, "Member 'CharacterFunctionLibrary_C_CalculateRootOffset::MaxRootOffset' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_CalculateRootOffset, RootOffsetRef) == 0x000004, "Member 'CharacterFunctionLibrary_C_CalculateRootOffset::RootOffsetRef' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_CalculateRootOffset, Right_Foot_Alpha_Ref) == 0x000010, "Member 'CharacterFunctionLibrary_C_CalculateRootOffset::Right_Foot_Alpha_Ref' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_CalculateRootOffset, Left_Foot_Alpha_Ref) == 0x000014, "Member 'CharacterFunctionLibrary_C_CalculateRootOffset::Left_Foot_Alpha_Ref' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_CalculateRootOffset, Root_Interp_Speed) == 0x000018, "Member 'CharacterFunctionLibrary_C_CalculateRootOffset::Root_Interp_Speed' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_CalculateRootOffset, Delta) == 0x00001C, "Member 'CharacterFunctionLibrary_C_CalculateRootOffset::Delta' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_CalculateRootOffset, Left_Foot_Offset) == 0x000020, "Member 'CharacterFunctionLibrary_C_CalculateRootOffset::Left_Foot_Offset' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_CalculateRootOffset, Right_Foot_Offset) == 0x000024, "Member 'CharacterFunctionLibrary_C_CalculateRootOffset::Right_Foot_Offset' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_CalculateRootOffset, __WorldContext) == 0x000028, "Member 'CharacterFunctionLibrary_C_CalculateRootOffset::__WorldContext' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_CalculateRootOffset, MaxOffsetWeightCurve) == 0x000030, "Member 'CharacterFunctionLibrary_C_CalculateRootOffset::MaxOffsetWeightCurve' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_CalculateRootOffset, CallFunc_FMin_ReturnValue) == 0x000038, "Member 'CharacterFunctionLibrary_C_CalculateRootOffset::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_CalculateRootOffset, CallFunc_Abs_ReturnValue) == 0x00003C, "Member 'CharacterFunctionLibrary_C_CalculateRootOffset::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_CalculateRootOffset, CallFunc_MakeVector_ReturnValue) == 0x000040, "Member 'CharacterFunctionLibrary_C_CalculateRootOffset::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_CalculateRootOffset, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00004C, "Member 'CharacterFunctionLibrary_C_CalculateRootOffset::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_CalculateRootOffset, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000058, "Member 'CharacterFunctionLibrary_C_CalculateRootOffset::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_CalculateRootOffset, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00005C, "Member 'CharacterFunctionLibrary_C_CalculateRootOffset::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_CalculateRootOffset, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000060, "Member 'CharacterFunctionLibrary_C_CalculateRootOffset::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_CalculateRootOffset, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000064, "Member 'CharacterFunctionLibrary_C_CalculateRootOffset::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_CalculateRootOffset, CallFunc_GetFloatValue_ReturnValue) == 0x000068, "Member 'CharacterFunctionLibrary_C_CalculateRootOffset::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_CalculateRootOffset, CallFunc_VLerp_ReturnValue) == 0x00006C, "Member 'CharacterFunctionLibrary_C_CalculateRootOffset::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFunctionLibrary_C_CalculateRootOffset, CallFunc_VInterpTo_ReturnValue) == 0x000078, "Member 'CharacterFunctionLibrary_C_CalculateRootOffset::CallFunc_VInterpTo_ReturnValue' has a wrong offset!");

// Function CharacterFunctionLibrary.CharacterFunctionLibrary_C.MarinerBaseAnimation
// 0x0140 (0x0140 - 0x0000)
struct CharacterFunctionLibrary_C_MarinerBaseAnimation final
{
public:
	class AMarinerCharacter*                      MarinerCharacter;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMoving;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
	bool                                          IsReturningToArena;                                // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
	bool                                          IsStunned;                                         // 0x000A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
	bool                                          IsFalling;                                         // 0x000B(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
	float                                         RelativeXSpeed;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RelativeYSpeed;                                    // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        SkeletalMesh;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AimPitch;                                          // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AimYaw;                                            // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Velocity;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               SkeletalRotation;                                  // 0x0034(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
	float                                         DeltaTimeX;                                        // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECardinalDirection                            CardinalDirection;                                 // 0x0044(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Direction;                                         // 0x0048(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableTurnInPlace;                                 // 0x004C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         North;                                             // 0x0050(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         South;                                             // 0x0054(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         East;                                              // 0x0058(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         West;                                              // 0x005C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x0060(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         YawOffset;                                         // 0x0064(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0068(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               TargetRotation;                                    // 0x0070(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerCharacterMovement*              MarinerMovementComponent;                          // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsReturningToArena_ReturnValue;           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
