#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterSelectAbilities

#include "Basic.hpp"

#include "Mariner_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CharacterSelectAbilities.CharacterSelectAbilities_C
// 0x0038 (0x02E8 - 0x02B0)
class UCharacterSelectAbilities_C final : public UMarinerUserWidget
{
public:
	class UDefaultPrompt_C*                       DefaultPrompt;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UIBackgroundVignette;                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterAbility_C*                    WeaponPrimary;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterAbility_C*                    WeaponSecondary;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterAbility_C*                    WeaponSpecial;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          InputHeld;                                         // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerPlayableCharacter*              Character;                                         // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool Populate();
	void SetCharacter(class UMarinerPlayableCharacter* Character_0);
	bool HandleInput(EMarinerInputActions InInput);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CharacterSelectAbilities_C">();
	}
	static class UCharacterSelectAbilities_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterSelectAbilities_C>();
	}
};
static_assert(alignof(UCharacterSelectAbilities_C) == 0x000008, "Wrong alignment on UCharacterSelectAbilities_C");
static_assert(sizeof(UCharacterSelectAbilities_C) == 0x0002E8, "Wrong size on UCharacterSelectAbilities_C");
static_assert(offsetof(UCharacterSelectAbilities_C, DefaultPrompt) == 0x0002B0, "Member 'UCharacterSelectAbilities_C::DefaultPrompt' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAbilities_C, UIBackgroundVignette) == 0x0002B8, "Member 'UCharacterSelectAbilities_C::UIBackgroundVignette' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAbilities_C, WeaponPrimary) == 0x0002C0, "Member 'UCharacterSelectAbilities_C::WeaponPrimary' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAbilities_C, WeaponSecondary) == 0x0002C8, "Member 'UCharacterSelectAbilities_C::WeaponSecondary' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAbilities_C, WeaponSpecial) == 0x0002D0, "Member 'UCharacterSelectAbilities_C::WeaponSpecial' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAbilities_C, InputHeld) == 0x0002D8, "Member 'UCharacterSelectAbilities_C::InputHeld' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAbilities_C, Character) == 0x0002E0, "Member 'UCharacterSelectAbilities_C::Character' has a wrong offset!");

}

