#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterUpsellWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CharacterUpsellWidget.CharacterUpsellWidget_C
// 0x0120 (0x3098 - 0x2F78)
class CharacterUpsellWidget::UCharacterUpsellWidget_C final : public UMarinerLayeredButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x2F78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       LoopAnim;                                          // 0x2F80(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoveredAnim;                                       // 0x2F88(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x2F90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Border;                                            // 0x2F98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x2FA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CornerIcon;                                        // 0x2FA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flash00;                                           // 0x2FB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flash01;                                           // 0x2FB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flash02;                                           // 0x2FC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flash03;                                           // 0x2FC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flash04;                                           // 0x2FD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flash05;                                           // 0x2FD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x2FE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_216;                                         // 0x2FE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Material;                                          // 0x2FF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               RootSizeBox;                                       // 0x2FF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextName;                                          // 0x3000(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerPlayableCharacter*              Character;                                         // 0x3008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CornerIconBrush;                                   // 0x3010(0x0088)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_CharacterUpsellWidget(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void PopulateCharacter(class UMarinerPlayableCharacter* Character_0, const class FText& DescFmt);
	void GetPurchaseOffer(struct FMangoNativeOffer* Nativeoffer);

	struct FMarinerLayeredButtonAssets GetAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WidgetBlueprintGeneratedClass CharacterUpsellWidget.CharacterUpsellWidget_C", true, "CharacterUpsellWidget_C">();
	}
	static class CharacterUpsellWidget::UCharacterUpsellWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<CharacterUpsellWidget::UCharacterUpsellWidget_C>();
	}
};
static_assert(alignof(CharacterUpsellWidget::UCharacterUpsellWidget_C) == 0x000008, "Wrong alignment on CharacterUpsellWidget::UCharacterUpsellWidget_C");
static_assert(sizeof(CharacterUpsellWidget::UCharacterUpsellWidget_C) == 0x003098, "Wrong size on CharacterUpsellWidget::UCharacterUpsellWidget_C");
static_assert(offsetof(CharacterUpsellWidget::UCharacterUpsellWidget_C, UberGraphFrame) == 0x002F78, "Member 'CharacterUpsellWidget::UCharacterUpsellWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(CharacterUpsellWidget::UCharacterUpsellWidget_C, LoopAnim) == 0x002F80, "Member 'CharacterUpsellWidget::UCharacterUpsellWidget_C::LoopAnim' has a wrong offset!");
static_assert(offsetof(CharacterUpsellWidget::UCharacterUpsellWidget_C, HoveredAnim) == 0x002F88, "Member 'CharacterUpsellWidget::UCharacterUpsellWidget_C::HoveredAnim' has a wrong offset!");
static_assert(offsetof(CharacterUpsellWidget::UCharacterUpsellWidget_C, Background) == 0x002F90, "Member 'CharacterUpsellWidget::UCharacterUpsellWidget_C::Background' has a wrong offset!");
static_assert(offsetof(CharacterUpsellWidget::UCharacterUpsellWidget_C, Border) == 0x002F98, "Member 'CharacterUpsellWidget::UCharacterUpsellWidget_C::Border' has a wrong offset!");
static_assert(offsetof(CharacterUpsellWidget::UCharacterUpsellWidget_C, Button) == 0x002FA0, "Member 'CharacterUpsellWidget::UCharacterUpsellWidget_C::Button' has a wrong offset!");
static_assert(offsetof(CharacterUpsellWidget::UCharacterUpsellWidget_C, CornerIcon) == 0x002FA8, "Member 'CharacterUpsellWidget::UCharacterUpsellWidget_C::CornerIcon' has a wrong offset!");
static_assert(offsetof(CharacterUpsellWidget::UCharacterUpsellWidget_C, Flash00) == 0x002FB0, "Member 'CharacterUpsellWidget::UCharacterUpsellWidget_C::Flash00' has a wrong offset!");
static_assert(offsetof(CharacterUpsellWidget::UCharacterUpsellWidget_C, Flash01) == 0x002FB8, "Member 'CharacterUpsellWidget::UCharacterUpsellWidget_C::Flash01' has a wrong offset!");
static_assert(offsetof(CharacterUpsellWidget::UCharacterUpsellWidget_C, Flash02) == 0x002FC0, "Member 'CharacterUpsellWidget::UCharacterUpsellWidget_C::Flash02' has a wrong offset!");
static_assert(offsetof(CharacterUpsellWidget::UCharacterUpsellWidget_C, Flash03) == 0x002FC8, "Member 'CharacterUpsellWidget::UCharacterUpsellWidget_C::Flash03' has a wrong offset!");
static_assert(offsetof(CharacterUpsellWidget::UCharacterUpsellWidget_C, Flash04) == 0x002FD0, "Member 'CharacterUpsellWidget::UCharacterUpsellWidget_C::Flash04' has a wrong offset!");
static_assert(offsetof(CharacterUpsellWidget::UCharacterUpsellWidget_C, Flash05) == 0x002FD8, "Member 'CharacterUpsellWidget::UCharacterUpsellWidget_C::Flash05' has a wrong offset!");
static_assert(offsetof(CharacterUpsellWidget::UCharacterUpsellWidget_C, Icon) == 0x002FE0, "Member 'CharacterUpsellWidget::UCharacterUpsellWidget_C::Icon' has a wrong offset!");
static_assert(offsetof(CharacterUpsellWidget::UCharacterUpsellWidget_C, Image_216) == 0x002FE8, "Member 'CharacterUpsellWidget::UCharacterUpsellWidget_C::Image_216' has a wrong offset!");
static_assert(offsetof(CharacterUpsellWidget::UCharacterUpsellWidget_C, Material) == 0x002FF0, "Member 'CharacterUpsellWidget::UCharacterUpsellWidget_C::Material' has a wrong offset!");
static_assert(offsetof(CharacterUpsellWidget::UCharacterUpsellWidget_C, RootSizeBox) == 0x002FF8, "Member 'CharacterUpsellWidget::UCharacterUpsellWidget_C::RootSizeBox' has a wrong offset!");
static_assert(offsetof(CharacterUpsellWidget::UCharacterUpsellWidget_C, TextName) == 0x003000, "Member 'CharacterUpsellWidget::UCharacterUpsellWidget_C::TextName' has a wrong offset!");
static_assert(offsetof(CharacterUpsellWidget::UCharacterUpsellWidget_C, Character) == 0x003008, "Member 'CharacterUpsellWidget::UCharacterUpsellWidget_C::Character' has a wrong offset!");
static_assert(offsetof(CharacterUpsellWidget::UCharacterUpsellWidget_C, CornerIconBrush) == 0x003010, "Member 'CharacterUpsellWidget::UCharacterUpsellWidget_C::CornerIconBrush' has a wrong offset!");

}

