#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterCustomization_MegaBlasts

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function CharacterCustomization_MegaBlasts.CharacterCustomization_MegaBlasts_C.EmitterSet__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CharacterCustomization_MegaBlasts_C_EmitterSet__DelegateSignature final
{
public:
	class UParticleSystem*                        ParticleSystem;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterCustomization_MegaBlasts_C_EmitterSet__DelegateSignature) == 0x000008, "Wrong alignment on CharacterCustomization_MegaBlasts_C_EmitterSet__DelegateSignature");
static_assert(sizeof(CharacterCustomization_MegaBlasts_C_EmitterSet__DelegateSignature) == 0x000008, "Wrong size on CharacterCustomization_MegaBlasts_C_EmitterSet__DelegateSignature");
static_assert(offsetof(CharacterCustomization_MegaBlasts_C_EmitterSet__DelegateSignature, ParticleSystem) == 0x000000, "Member 'CharacterCustomization_MegaBlasts_C_EmitterSet__DelegateSignature::ParticleSystem' has a wrong offset!");

// Function CharacterCustomization_MegaBlasts.CharacterCustomization_MegaBlasts_C.ExecuteUbergraph_CharacterCustomization_MegaBlasts
// 0x0088 (0x0088 - 0x0000)
struct CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_234D[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0038(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0048(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234E[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerItemLoadResponseButton*         K2Node_Event_ButtonInstance;                       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerCMSItemDataAsset*               CallFunc_GetLoadedCMSItemDataAsset_ReturnValue;    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMegaBlastDataAsset*             K2Node_DynamicCast_AsMariner_Mega_Blast_Data_Asset; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts) == 0x000008, "Wrong alignment on CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts");
static_assert(sizeof(CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts) == 0x000088, "Wrong size on CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts");
static_assert(offsetof(CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts, EntryPoint) == 0x000000, "Member 'CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts::EntryPoint' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts, Temp_object_Variable) == 0x000020, "Member 'CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts, K2Node_DynamicCast_AsParticle_System) == 0x000028, "Member 'CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts::K2Node_DynamicCast_AsParticle_System' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts, Temp_struct_Variable) == 0x000038, "Member 'CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts, Temp_delegate_Variable) == 0x000048, "Member 'CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts, CallFunc_GetOwningPlayer_ReturnValue) == 0x000058, "Member 'CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts, CallFunc_PostEvent_ReturnValue) == 0x000060, "Member 'CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts, K2Node_Event_ButtonInstance) == 0x000068, "Member 'CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts::K2Node_Event_ButtonInstance' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts, CallFunc_GetLoadedCMSItemDataAsset_ReturnValue) == 0x000070, "Member 'CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts::CallFunc_GetLoadedCMSItemDataAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts, K2Node_DynamicCast_AsMariner_Mega_Blast_Data_Asset) == 0x000078, "Member 'CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts::K2Node_DynamicCast_AsMariner_Mega_Blast_Data_Asset' has a wrong offset!");
static_assert(offsetof(CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'CharacterCustomization_MegaBlasts_C_ExecuteUbergraph_CharacterCustomization_MegaBlasts::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function CharacterCustomization_MegaBlasts.CharacterCustomization_MegaBlasts_C.OnLoaded_A1EB50DD40C2FA6DBFE243BBAEBF3D7C
// 0x0008 (0x0008 - 0x0000)
struct CharacterCustomization_MegaBlasts_C_OnLoaded_A1EB50DD40C2FA6DBFE243BBAEBF3D7C final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterCustomization_MegaBlasts_C_OnLoaded_A1EB50DD40C2FA6DBFE243BBAEBF3D7C) == 0x000008, "Wrong alignment on CharacterCustomization_MegaBlasts_C_OnLoaded_A1EB50DD40C2FA6DBFE243BBAEBF3D7C");
static_assert(sizeof(CharacterCustomization_MegaBlasts_C_OnLoaded_A1EB50DD40C2FA6DBFE243BBAEBF3D7C) == 0x000008, "Wrong size on CharacterCustomization_MegaBlasts_C_OnLoaded_A1EB50DD40C2FA6DBFE243BBAEBF3D7C");
static_assert(offsetof(CharacterCustomization_MegaBlasts_C_OnLoaded_A1EB50DD40C2FA6DBFE243BBAEBF3D7C, Loaded) == 0x000000, "Member 'CharacterCustomization_MegaBlasts_C_OnLoaded_A1EB50DD40C2FA6DBFE243BBAEBF3D7C::Loaded' has a wrong offset!");

// Function CharacterCustomization_MegaBlasts.CharacterCustomization_MegaBlasts_C.VisualizeSelectedButton
// 0x0008 (0x0008 - 0x0000)
struct CharacterCustomization_MegaBlasts_C_VisualizeSelectedButton final
{
public:
	class UMarinerItemLoadResponseButton*         ButtonInstance;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterCustomization_MegaBlasts_C_VisualizeSelectedButton) == 0x000008, "Wrong alignment on CharacterCustomization_MegaBlasts_C_VisualizeSelectedButton");
static_assert(sizeof(CharacterCustomization_MegaBlasts_C_VisualizeSelectedButton) == 0x000008, "Wrong size on CharacterCustomization_MegaBlasts_C_VisualizeSelectedButton");
static_assert(offsetof(CharacterCustomization_MegaBlasts_C_VisualizeSelectedButton, ButtonInstance) == 0x000000, "Member 'CharacterCustomization_MegaBlasts_C_VisualizeSelectedButton::ButtonInstance' has a wrong offset!");

}

