#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterAbility

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CharacterAbility.CharacterAbility_C
// 0x0020 (0x0300 - 0x02E0)
class UCharacterAbility_C final : public UMarinerCharacterAbilityWidget
{
public:
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dots;                                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_68;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Namebacker;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Populate(TSoftClassPtr<class UClass> CharacterClass);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CharacterAbility_C">();
	}
	static class UCharacterAbility_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterAbility_C>();
	}
};
static_assert(alignof(UCharacterAbility_C) == 0x000008, "Wrong alignment on UCharacterAbility_C");
static_assert(sizeof(UCharacterAbility_C) == 0x000300, "Wrong size on UCharacterAbility_C");
static_assert(offsetof(UCharacterAbility_C, CanvasPanel_0) == 0x0002E0, "Member 'UCharacterAbility_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UCharacterAbility_C, Dots) == 0x0002E8, "Member 'UCharacterAbility_C::Dots' has a wrong offset!");
static_assert(offsetof(UCharacterAbility_C, Image_68) == 0x0002F0, "Member 'UCharacterAbility_C::Image_68' has a wrong offset!");
static_assert(offsetof(UCharacterAbility_C, Namebacker) == 0x0002F8, "Member 'UCharacterAbility_C::Namebacker' has a wrong offset!");

}

