#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterFeatureCMSItemButton

#include "Basic.hpp"

#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function CharacterFeatureCMSItemButton.CharacterFeatureCMSItemButton_C.ExecuteUbergraph_CharacterFeatureCMSItemButton
// 0x0018 (0x0018 - 0x0000)
struct CharacterFeatureCMSItemButton_C_ExecuteUbergraph_CharacterFeatureCMSItemButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoInventoryManager*                 CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasUnviewedItems_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterFeatureCMSItemButton_C_ExecuteUbergraph_CharacterFeatureCMSItemButton) == 0x000008, "Wrong alignment on CharacterFeatureCMSItemButton_C_ExecuteUbergraph_CharacterFeatureCMSItemButton");
static_assert(sizeof(CharacterFeatureCMSItemButton_C_ExecuteUbergraph_CharacterFeatureCMSItemButton) == 0x000018, "Wrong size on CharacterFeatureCMSItemButton_C_ExecuteUbergraph_CharacterFeatureCMSItemButton");
static_assert(offsetof(CharacterFeatureCMSItemButton_C_ExecuteUbergraph_CharacterFeatureCMSItemButton, EntryPoint) == 0x000000, "Member 'CharacterFeatureCMSItemButton_C_ExecuteUbergraph_CharacterFeatureCMSItemButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(CharacterFeatureCMSItemButton_C_ExecuteUbergraph_CharacterFeatureCMSItemButton, CallFunc_Get_ReturnValue) == 0x000008, "Member 'CharacterFeatureCMSItemButton_C_ExecuteUbergraph_CharacterFeatureCMSItemButton::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFeatureCMSItemButton_C_ExecuteUbergraph_CharacterFeatureCMSItemButton, CallFunc_HasUnviewedItems_ReturnValue) == 0x000010, "Member 'CharacterFeatureCMSItemButton_C_ExecuteUbergraph_CharacterFeatureCMSItemButton::CallFunc_HasUnviewedItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFeatureCMSItemButton_C_ExecuteUbergraph_CharacterFeatureCMSItemButton, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'CharacterFeatureCMSItemButton_C_ExecuteUbergraph_CharacterFeatureCMSItemButton::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function CharacterFeatureCMSItemButton.CharacterFeatureCMSItemButton_C.SetItemData
// 0x0008 (0x0008 - 0x0000)
struct CharacterFeatureCMSItemButton_C_SetItemData final
{
public:
	class UItemLoadResponse*                      ItemData;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterFeatureCMSItemButton_C_SetItemData) == 0x000008, "Wrong alignment on CharacterFeatureCMSItemButton_C_SetItemData");
static_assert(sizeof(CharacterFeatureCMSItemButton_C_SetItemData) == 0x000008, "Wrong size on CharacterFeatureCMSItemButton_C_SetItemData");
static_assert(offsetof(CharacterFeatureCMSItemButton_C_SetItemData, ItemData) == 0x000000, "Member 'CharacterFeatureCMSItemButton_C_SetItemData::ItemData' has a wrong offset!");

// Function CharacterFeatureCMSItemButton.CharacterFeatureCMSItemButton_C.GetAssets
// 0x00D0 (0x00D0 - 0x0000)
struct CharacterFeatureCMSItemButton_C_GetAssets final
{
public:
	struct FMarinerLayeredButtonAssets            ReturnValue;                                       // 0x0000(0x0068)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference)
	struct FMarinerLayeredButtonAssets            K2Node_MakeStruct_MarinerLayeredButtonAssets;      // 0x0068(0x0068)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(CharacterFeatureCMSItemButton_C_GetAssets) == 0x000008, "Wrong alignment on CharacterFeatureCMSItemButton_C_GetAssets");
static_assert(sizeof(CharacterFeatureCMSItemButton_C_GetAssets) == 0x0000D0, "Wrong size on CharacterFeatureCMSItemButton_C_GetAssets");
static_assert(offsetof(CharacterFeatureCMSItemButton_C_GetAssets, ReturnValue) == 0x000000, "Member 'CharacterFeatureCMSItemButton_C_GetAssets::ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterFeatureCMSItemButton_C_GetAssets, K2Node_MakeStruct_MarinerLayeredButtonAssets) == 0x000068, "Member 'CharacterFeatureCMSItemButton_C_GetAssets::K2Node_MakeStruct_MarinerLayeredButtonAssets' has a wrong offset!");

}

