#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChatWheelKeyboardPrompt

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChatWheelKeyboardPrompt.ChatWheelKeyboardPrompt_C
// 0x0048 (0x0430 - 0x03E8)
class UChatWheelKeyboardPrompt_C final : public UMarinerKeyboardPrompt
{
public:
	class UImage*                                 IconImage;                                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlusText;                                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PrimaryIcon;                                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PrimaryKeySize;                                    // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PrimaryKeyText;                                    // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PromptText;                                        // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SecondaryIcon;                                     // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SecondaryKeySize;                                  // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SecondaryKeyText;                                  // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FMarinerKeyboardPromptAssets GetPromptAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChatWheelKeyboardPrompt_C">();
	}
	static class UChatWheelKeyboardPrompt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatWheelKeyboardPrompt_C>();
	}
};
static_assert(alignof(UChatWheelKeyboardPrompt_C) == 0x000008, "Wrong alignment on UChatWheelKeyboardPrompt_C");
static_assert(sizeof(UChatWheelKeyboardPrompt_C) == 0x000430, "Wrong size on UChatWheelKeyboardPrompt_C");
static_assert(offsetof(UChatWheelKeyboardPrompt_C, IconImage) == 0x0003E8, "Member 'UChatWheelKeyboardPrompt_C::IconImage' has a wrong offset!");
static_assert(offsetof(UChatWheelKeyboardPrompt_C, PlusText) == 0x0003F0, "Member 'UChatWheelKeyboardPrompt_C::PlusText' has a wrong offset!");
static_assert(offsetof(UChatWheelKeyboardPrompt_C, PrimaryIcon) == 0x0003F8, "Member 'UChatWheelKeyboardPrompt_C::PrimaryIcon' has a wrong offset!");
static_assert(offsetof(UChatWheelKeyboardPrompt_C, PrimaryKeySize) == 0x000400, "Member 'UChatWheelKeyboardPrompt_C::PrimaryKeySize' has a wrong offset!");
static_assert(offsetof(UChatWheelKeyboardPrompt_C, PrimaryKeyText) == 0x000408, "Member 'UChatWheelKeyboardPrompt_C::PrimaryKeyText' has a wrong offset!");
static_assert(offsetof(UChatWheelKeyboardPrompt_C, PromptText) == 0x000410, "Member 'UChatWheelKeyboardPrompt_C::PromptText' has a wrong offset!");
static_assert(offsetof(UChatWheelKeyboardPrompt_C, SecondaryIcon) == 0x000418, "Member 'UChatWheelKeyboardPrompt_C::SecondaryIcon' has a wrong offset!");
static_assert(offsetof(UChatWheelKeyboardPrompt_C, SecondaryKeySize) == 0x000420, "Member 'UChatWheelKeyboardPrompt_C::SecondaryKeySize' has a wrong offset!");
static_assert(offsetof(UChatWheelKeyboardPrompt_C, SecondaryKeyText) == 0x000428, "Member 'UChatWheelKeyboardPrompt_C::SecondaryKeyText' has a wrong offset!");

}

