#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CheckBoxSetting

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CheckBoxSetting.CheckBoxSetting_C
// 0x0040 (0x0838 - 0x07F8)
class UCheckBoxSetting_C final : public UMarinerSettingCheckBox
{
public:
	class UWidgetAnimation*                       HoveredAnim;                                       // 0x07F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x0800(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerCheckBox*                       CheckBox;                                          // 0x0808(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CheckStateText;                                    // 0x0810(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerButton*                         ClickableArea;                                     // 0x0818(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Highlight;                                         // 0x0820(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LabelText;                                         // 0x0828(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Material;                                          // 0x0830(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FMarinerSettingCheckBoxAssets GetAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CheckBoxSetting_C">();
	}
	static class UCheckBoxSetting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCheckBoxSetting_C>();
	}
};
static_assert(alignof(UCheckBoxSetting_C) == 0x000008, "Wrong alignment on UCheckBoxSetting_C");
static_assert(sizeof(UCheckBoxSetting_C) == 0x000838, "Wrong size on UCheckBoxSetting_C");
static_assert(offsetof(UCheckBoxSetting_C, HoveredAnim) == 0x0007F8, "Member 'UCheckBoxSetting_C::HoveredAnim' has a wrong offset!");
static_assert(offsetof(UCheckBoxSetting_C, Background) == 0x000800, "Member 'UCheckBoxSetting_C::Background' has a wrong offset!");
static_assert(offsetof(UCheckBoxSetting_C, CheckBox) == 0x000808, "Member 'UCheckBoxSetting_C::CheckBox' has a wrong offset!");
static_assert(offsetof(UCheckBoxSetting_C, CheckStateText) == 0x000810, "Member 'UCheckBoxSetting_C::CheckStateText' has a wrong offset!");
static_assert(offsetof(UCheckBoxSetting_C, ClickableArea) == 0x000818, "Member 'UCheckBoxSetting_C::ClickableArea' has a wrong offset!");
static_assert(offsetof(UCheckBoxSetting_C, Highlight) == 0x000820, "Member 'UCheckBoxSetting_C::Highlight' has a wrong offset!");
static_assert(offsetof(UCheckBoxSetting_C, LabelText) == 0x000828, "Member 'UCheckBoxSetting_C::LabelText' has a wrong offset!");
static_assert(offsetof(UCheckBoxSetting_C, Material) == 0x000830, "Member 'UCheckBoxSetting_C::Material' has a wrong offset!");

}

