#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CMSItemButton

#include "Basic.hpp"

#include "Mariner_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function CMSItemButton.CMSItemButton_C.GetAssets
// 0x00D0 (0x00D0 - 0x0000)
struct CMSItemButton_C_GetAssets final
{
public:
	struct FMarinerLayeredButtonAssets            ReturnValue;                                       // 0x0000(0x0068)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference)
	struct FMarinerLayeredButtonAssets            K2Node_MakeStruct_MarinerLayeredButtonAssets;      // 0x0068(0x0068)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(CMSItemButton_C_GetAssets) == 0x000008, "Wrong alignment on CMSItemButton_C_GetAssets");
static_assert(sizeof(CMSItemButton_C_GetAssets) == 0x0000D0, "Wrong size on CMSItemButton_C_GetAssets");
static_assert(offsetof(CMSItemButton_C_GetAssets, ReturnValue) == 0x000000, "Member 'CMSItemButton_C_GetAssets::ReturnValue' has a wrong offset!");
static_assert(offsetof(CMSItemButton_C_GetAssets, K2Node_MakeStruct_MarinerLayeredButtonAssets) == 0x000068, "Member 'CMSItemButton_C_GetAssets::K2Node_MakeStruct_MarinerLayeredButtonAssets' has a wrong offset!");

// Function CMSItemButton.CMSItemButton_C.GetIconBrush
// 0x0130 (0x0130 - 0x0000)
struct CMSItemButton_C_GetIconBrush final
{
public:
	class UItemLoadResponse*                      LoadResponse;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerCMSItemDataAsset*               CMSItem;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            ReturnValue;                                       // 0x0010(0x0088)(Parm, OutParm, ReturnParm)
	class UMarinerCMSItemWithIcon*                K2Node_DynamicCast_AsMariner_CMSItem_with_Icon;    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2388[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_GetBrushFromCMSItem_ReturnValue;          // 0x00A8(0x0088)(ConstParm)
};
static_assert(alignof(CMSItemButton_C_GetIconBrush) == 0x000008, "Wrong alignment on CMSItemButton_C_GetIconBrush");
static_assert(sizeof(CMSItemButton_C_GetIconBrush) == 0x000130, "Wrong size on CMSItemButton_C_GetIconBrush");
static_assert(offsetof(CMSItemButton_C_GetIconBrush, LoadResponse) == 0x000000, "Member 'CMSItemButton_C_GetIconBrush::LoadResponse' has a wrong offset!");
static_assert(offsetof(CMSItemButton_C_GetIconBrush, CMSItem) == 0x000008, "Member 'CMSItemButton_C_GetIconBrush::CMSItem' has a wrong offset!");
static_assert(offsetof(CMSItemButton_C_GetIconBrush, ReturnValue) == 0x000010, "Member 'CMSItemButton_C_GetIconBrush::ReturnValue' has a wrong offset!");
static_assert(offsetof(CMSItemButton_C_GetIconBrush, K2Node_DynamicCast_AsMariner_CMSItem_with_Icon) == 0x000098, "Member 'CMSItemButton_C_GetIconBrush::K2Node_DynamicCast_AsMariner_CMSItem_with_Icon' has a wrong offset!");
static_assert(offsetof(CMSItemButton_C_GetIconBrush, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'CMSItemButton_C_GetIconBrush::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CMSItemButton_C_GetIconBrush, CallFunc_GetBrushFromCMSItem_ReturnValue) == 0x0000A8, "Member 'CMSItemButton_C_GetIconBrush::CallFunc_GetBrushFromCMSItem_ReturnValue' has a wrong offset!");

// Function CMSItemButton.CMSItemButton_C.OnPopulate
// 0x0058 (0x0058 - 0x0000)
struct CMSItemButton_C_OnPopulate final
{
public:
	class UItemLoadResponse*                      LoadResponse;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerCMSItemDataAsset*               CMSItem;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameGlobals*                    CallFunc_GetGameGlobals_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerArtifactDataAsset*              K2Node_DynamicCast_AsMariner_Artifact_Data_Asset;  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2389[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerPlayableCharacter*              CallFunc_GetCharacterDataBySoftClass_ReturnValue;  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0030(0x0028)()
};
static_assert(alignof(CMSItemButton_C_OnPopulate) == 0x000008, "Wrong alignment on CMSItemButton_C_OnPopulate");
static_assert(sizeof(CMSItemButton_C_OnPopulate) == 0x000058, "Wrong size on CMSItemButton_C_OnPopulate");
static_assert(offsetof(CMSItemButton_C_OnPopulate, LoadResponse) == 0x000000, "Member 'CMSItemButton_C_OnPopulate::LoadResponse' has a wrong offset!");
static_assert(offsetof(CMSItemButton_C_OnPopulate, CMSItem) == 0x000008, "Member 'CMSItemButton_C_OnPopulate::CMSItem' has a wrong offset!");
static_assert(offsetof(CMSItemButton_C_OnPopulate, CallFunc_GetGameGlobals_ReturnValue) == 0x000010, "Member 'CMSItemButton_C_OnPopulate::CallFunc_GetGameGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(CMSItemButton_C_OnPopulate, K2Node_DynamicCast_AsMariner_Artifact_Data_Asset) == 0x000018, "Member 'CMSItemButton_C_OnPopulate::K2Node_DynamicCast_AsMariner_Artifact_Data_Asset' has a wrong offset!");
static_assert(offsetof(CMSItemButton_C_OnPopulate, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'CMSItemButton_C_OnPopulate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CMSItemButton_C_OnPopulate, CallFunc_GetCharacterDataBySoftClass_ReturnValue) == 0x000028, "Member 'CMSItemButton_C_OnPopulate::CallFunc_GetCharacterDataBySoftClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CMSItemButton_C_OnPopulate, K2Node_MakeStruct_SlateColor) == 0x000030, "Member 'CMSItemButton_C_OnPopulate::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function CMSItemButton.CMSItemButton_C.GetItemLoadResponseAssets
// 0x0010 (0x0010 - 0x0000)
struct CMSItemButton_C_GetItemLoadResponseAssets final
{
public:
	struct FMarinerItemLoadResponseAssets         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FMarinerItemLoadResponseAssets         K2Node_MakeStruct_MarinerItemLoadResponseAssets;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(CMSItemButton_C_GetItemLoadResponseAssets) == 0x000008, "Wrong alignment on CMSItemButton_C_GetItemLoadResponseAssets");
static_assert(sizeof(CMSItemButton_C_GetItemLoadResponseAssets) == 0x000010, "Wrong size on CMSItemButton_C_GetItemLoadResponseAssets");
static_assert(offsetof(CMSItemButton_C_GetItemLoadResponseAssets, ReturnValue) == 0x000000, "Member 'CMSItemButton_C_GetItemLoadResponseAssets::ReturnValue' has a wrong offset!");
static_assert(offsetof(CMSItemButton_C_GetItemLoadResponseAssets, K2Node_MakeStruct_MarinerItemLoadResponseAssets) == 0x000008, "Member 'CMSItemButton_C_GetItemLoadResponseAssets::K2Node_MakeStruct_MarinerItemLoadResponseAssets' has a wrong offset!");

}

