#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CMSItemButton

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CMSItemButton.CMSItemButton_C
// 0x0060 (0x3318 - 0x32B8)
class UCMSItemButton_C final : public UMarinerItemLoadResponseButton
{
public:
	class UWidgetAnimation*                       HoveredAnim;                                       // 0x32B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ArtifactColorBackground;                           // 0x32C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Backer;                                            // 0x32C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Border;                                            // 0x32D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ContentStateIcon;                                  // 0x32D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                HitArea;                                           // 0x32E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              IconPanel;                                         // 0x32E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Material;                                          // 0x32F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PartIcon;                                          // 0x32F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RarityIcon;                                        // 0x3300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               RootSizeBox;                                       // 0x3308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnviewedItemWidget_C*                  UnviewedWidget;                                    // 0x3310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FMarinerLayeredButtonAssets GetAssets() const;
	struct FSlateBrush GetIconBrush(class UItemLoadResponse* LoadResponse, class UMarinerCMSItemDataAsset* CMSItem) const;
	void OnPopulate(class UItemLoadResponse* LoadResponse, class UMarinerCMSItemDataAsset* CMSItem) const;
	struct FMarinerItemLoadResponseAssets GetItemLoadResponseAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CMSItemButton_C">();
	}
	static class UCMSItemButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCMSItemButton_C>();
	}
};
static_assert(alignof(UCMSItemButton_C) == 0x000008, "Wrong alignment on UCMSItemButton_C");
static_assert(sizeof(UCMSItemButton_C) == 0x003318, "Wrong size on UCMSItemButton_C");
static_assert(offsetof(UCMSItemButton_C, HoveredAnim) == 0x0032B8, "Member 'UCMSItemButton_C::HoveredAnim' has a wrong offset!");
static_assert(offsetof(UCMSItemButton_C, ArtifactColorBackground) == 0x0032C0, "Member 'UCMSItemButton_C::ArtifactColorBackground' has a wrong offset!");
static_assert(offsetof(UCMSItemButton_C, Backer) == 0x0032C8, "Member 'UCMSItemButton_C::Backer' has a wrong offset!");
static_assert(offsetof(UCMSItemButton_C, Border) == 0x0032D0, "Member 'UCMSItemButton_C::Border' has a wrong offset!");
static_assert(offsetof(UCMSItemButton_C, ContentStateIcon) == 0x0032D8, "Member 'UCMSItemButton_C::ContentStateIcon' has a wrong offset!");
static_assert(offsetof(UCMSItemButton_C, HitArea) == 0x0032E0, "Member 'UCMSItemButton_C::HitArea' has a wrong offset!");
static_assert(offsetof(UCMSItemButton_C, IconPanel) == 0x0032E8, "Member 'UCMSItemButton_C::IconPanel' has a wrong offset!");
static_assert(offsetof(UCMSItemButton_C, Material) == 0x0032F0, "Member 'UCMSItemButton_C::Material' has a wrong offset!");
static_assert(offsetof(UCMSItemButton_C, PartIcon) == 0x0032F8, "Member 'UCMSItemButton_C::PartIcon' has a wrong offset!");
static_assert(offsetof(UCMSItemButton_C, RarityIcon) == 0x003300, "Member 'UCMSItemButton_C::RarityIcon' has a wrong offset!");
static_assert(offsetof(UCMSItemButton_C, RootSizeBox) == 0x003308, "Member 'UCMSItemButton_C::RootSizeBox' has a wrong offset!");
static_assert(offsetof(UCMSItemButton_C, UnviewedWidget) == 0x003310, "Member 'UCMSItemButton_C::UnviewedWidget' has a wrong offset!");

}

