#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ComboBoxSetting

#include "Basic.hpp"

#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function ComboBoxSetting.ComboBoxSetting_C.On_ComboBox_GenerateWidget_0
// 0x0020 (0x0020 - 0x0000)
struct ComboBoxSetting_C_On_ComboBox_GenerateWidget_0 final
{
public:
	class FString                                 Item;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UWidget*                                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UComboboxText_C*                        CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ComboBoxSetting_C_On_ComboBox_GenerateWidget_0) == 0x000008, "Wrong alignment on ComboBoxSetting_C_On_ComboBox_GenerateWidget_0");
static_assert(sizeof(ComboBoxSetting_C_On_ComboBox_GenerateWidget_0) == 0x000020, "Wrong size on ComboBoxSetting_C_On_ComboBox_GenerateWidget_0");
static_assert(offsetof(ComboBoxSetting_C_On_ComboBox_GenerateWidget_0, Item) == 0x000000, "Member 'ComboBoxSetting_C_On_ComboBox_GenerateWidget_0::Item' has a wrong offset!");
static_assert(offsetof(ComboBoxSetting_C_On_ComboBox_GenerateWidget_0, ReturnValue) == 0x000010, "Member 'ComboBoxSetting_C_On_ComboBox_GenerateWidget_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(ComboBoxSetting_C_On_ComboBox_GenerateWidget_0, CallFunc_Create_ReturnValue) == 0x000018, "Member 'ComboBoxSetting_C_On_ComboBox_GenerateWidget_0::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function ComboBoxSetting.ComboBoxSetting_C.GetAssets
// 0x0080 (0x0080 - 0x0000)
struct ComboBoxSetting_C_GetAssets final
{
public:
	struct FMarinerSettingComboBoxAssets          ReturnValue;                                       // 0x0000(0x0040)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference)
	struct FMarinerSettingComboBoxAssets          K2Node_MakeStruct_MarinerSettingComboBoxAssets;    // 0x0040(0x0040)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(ComboBoxSetting_C_GetAssets) == 0x000008, "Wrong alignment on ComboBoxSetting_C_GetAssets");
static_assert(sizeof(ComboBoxSetting_C_GetAssets) == 0x000080, "Wrong size on ComboBoxSetting_C_GetAssets");
static_assert(offsetof(ComboBoxSetting_C_GetAssets, ReturnValue) == 0x000000, "Member 'ComboBoxSetting_C_GetAssets::ReturnValue' has a wrong offset!");
static_assert(offsetof(ComboBoxSetting_C_GetAssets, K2Node_MakeStruct_MarinerSettingComboBoxAssets) == 0x000040, "Member 'ComboBoxSetting_C_GetAssets::K2Node_MakeStruct_MarinerSettingComboBoxAssets' has a wrong offset!");

}

