#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CompactStoreButton

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CompactStoreButton.CompactStoreButton_C
// 0x00A0 (0x3280 - 0x31E0)
class UCompactStoreButton_C final : public UMarinerOfferButton
{
public:
	class UWidgetAnimation*                       UnhoveredAnim;                                     // 0x31E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoveredAnim;                                       // 0x31E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x31F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Border;                                            // 0x31F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bound_BannerBG_2;                                  // 0x3200(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Bound_BannerGroup_sale;                            // 0x3208(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Bound_BannerText_2;                                // 0x3210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x3218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EmoteFrame;                                        // 0x3220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HardCurrencyIcon;                                  // 0x3228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_129;                                         // 0x3230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_143;                                         // 0x3238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_186;                                         // 0x3240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageBacker;                                       // 0x3248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Material;                                          // 0x3250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PriceFrame;                                        // 0x3258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PrimaryText;                                       // 0x3260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPromptBanner_C*                 PromptBanner;                                      // 0x3268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               RootSizeBox;                                       // 0x3270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SoftCurrencyIcon;                                  // 0x3278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FMarinerLayeredButtonAssets GetAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CompactStoreButton_C">();
	}
	static class UCompactStoreButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCompactStoreButton_C>();
	}
};
static_assert(alignof(UCompactStoreButton_C) == 0x000008, "Wrong alignment on UCompactStoreButton_C");
static_assert(sizeof(UCompactStoreButton_C) == 0x003280, "Wrong size on UCompactStoreButton_C");
static_assert(offsetof(UCompactStoreButton_C, UnhoveredAnim) == 0x0031E0, "Member 'UCompactStoreButton_C::UnhoveredAnim' has a wrong offset!");
static_assert(offsetof(UCompactStoreButton_C, HoveredAnim) == 0x0031E8, "Member 'UCompactStoreButton_C::HoveredAnim' has a wrong offset!");
static_assert(offsetof(UCompactStoreButton_C, Background) == 0x0031F0, "Member 'UCompactStoreButton_C::Background' has a wrong offset!");
static_assert(offsetof(UCompactStoreButton_C, Border) == 0x0031F8, "Member 'UCompactStoreButton_C::Border' has a wrong offset!");
static_assert(offsetof(UCompactStoreButton_C, Bound_BannerBG_2) == 0x003200, "Member 'UCompactStoreButton_C::Bound_BannerBG_2' has a wrong offset!");
static_assert(offsetof(UCompactStoreButton_C, Bound_BannerGroup_sale) == 0x003208, "Member 'UCompactStoreButton_C::Bound_BannerGroup_sale' has a wrong offset!");
static_assert(offsetof(UCompactStoreButton_C, Bound_BannerText_2) == 0x003210, "Member 'UCompactStoreButton_C::Bound_BannerText_2' has a wrong offset!");
static_assert(offsetof(UCompactStoreButton_C, Button) == 0x003218, "Member 'UCompactStoreButton_C::Button' has a wrong offset!");
static_assert(offsetof(UCompactStoreButton_C, EmoteFrame) == 0x003220, "Member 'UCompactStoreButton_C::EmoteFrame' has a wrong offset!");
static_assert(offsetof(UCompactStoreButton_C, HardCurrencyIcon) == 0x003228, "Member 'UCompactStoreButton_C::HardCurrencyIcon' has a wrong offset!");
static_assert(offsetof(UCompactStoreButton_C, Image_129) == 0x003230, "Member 'UCompactStoreButton_C::Image_129' has a wrong offset!");
static_assert(offsetof(UCompactStoreButton_C, Image_143) == 0x003238, "Member 'UCompactStoreButton_C::Image_143' has a wrong offset!");
static_assert(offsetof(UCompactStoreButton_C, Image_186) == 0x003240, "Member 'UCompactStoreButton_C::Image_186' has a wrong offset!");
static_assert(offsetof(UCompactStoreButton_C, ImageBacker) == 0x003248, "Member 'UCompactStoreButton_C::ImageBacker' has a wrong offset!");
static_assert(offsetof(UCompactStoreButton_C, Material) == 0x003250, "Member 'UCompactStoreButton_C::Material' has a wrong offset!");
static_assert(offsetof(UCompactStoreButton_C, PriceFrame) == 0x003258, "Member 'UCompactStoreButton_C::PriceFrame' has a wrong offset!");
static_assert(offsetof(UCompactStoreButton_C, PrimaryText) == 0x003260, "Member 'UCompactStoreButton_C::PrimaryText' has a wrong offset!");
static_assert(offsetof(UCompactStoreButton_C, PromptBanner) == 0x003268, "Member 'UCompactStoreButton_C::PromptBanner' has a wrong offset!");
static_assert(offsetof(UCompactStoreButton_C, RootSizeBox) == 0x003270, "Member 'UCompactStoreButton_C::RootSizeBox' has a wrong offset!");
static_assert(offsetof(UCompactStoreButton_C, SoftCurrencyIcon) == 0x003278, "Member 'UCompactStoreButton_C::SoftCurrencyIcon' has a wrong offset!");

}

