#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ControllerFunctionLibrary

#include "Basic.hpp"

#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function ControllerFunctionLibrary.ControllerFunctionLibrary_C.SetupControllerConfigurationFromIndex
// 0x0128 (0x0128 - 0x0000)
struct ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex final
{
public:
	int32                                         ControllerModeIndex;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ConfigurationIndex;                                // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             ModeChoice;                                        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMarinerBasePlayerController*           CallFunc_TryAndGetLocalPlayerController_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameInstance*                   K2Node_DynamicCast_AsMariner_Game_Instance;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerInputOverlay*                   CallFunc_GetInputOverlay_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMarinerCharacter*                      K2Node_DynamicCast_AsMariner_Character;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMarinerControllerConfiguration        CallFunc_GetDataTableRowFromName_OutRow;           // 0x0080(0x0020)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMarinerGlobals_IsValid;                // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGlobals*                        CallFunc_GetMarinerGlobals_ReturnValue;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerInputGlobals*                   CallFunc_GetInputGlobals_ReturnValue;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             CallFunc_GetActiveKeySet_ReturnValue;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMarinerGlobals_IsValid_1;              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGlobals*                        CallFunc_GetMarinerGlobals_ReturnValue_1;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerInputGlobals*                   CallFunc_GetInputGlobals_ReturnValue_1;            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames_1;       // 0x00E8(0x0010)(ZeroConstructor, ReferenceParm)
	struct FMarinerControllerConfigurationLocalization CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x00F8(0x0028)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex) == 0x000008, "Wrong alignment on ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex");
static_assert(sizeof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex) == 0x000128, "Wrong size on ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex, ControllerModeIndex) == 0x000000, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex::ControllerModeIndex' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex, __WorldContext) == 0x000008, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex::__WorldContext' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex, ConfigurationIndex) == 0x000010, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex::ConfigurationIndex' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex, ModeChoice) == 0x000018, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex::ModeChoice' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex, CallFunc_GetGameInstance_ReturnValue) == 0x000020, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex, CallFunc_TryAndGetLocalPlayerController_ReturnValue) == 0x000028, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex::CallFunc_TryAndGetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex, K2Node_DynamicCast_AsMariner_Game_Instance) == 0x000030, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex::K2Node_DynamicCast_AsMariner_Game_Instance' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex, CallFunc_K2_GetPawn_ReturnValue) == 0x000040, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex, CallFunc_GetInputOverlay_ReturnValue) == 0x000048, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex::CallFunc_GetInputOverlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex, K2Node_DynamicCast_AsMariner_Character) == 0x000050, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex::K2Node_DynamicCast_AsMariner_Character' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex, Temp_int_Array_Index_Variable) == 0x00005C, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000060, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex, Temp_int_Loop_Counter_Variable) == 0x000070, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex, CallFunc_Array_Get_Item) == 0x000074, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex, CallFunc_GetDataTableRowFromName_OutRow) == 0x000080, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000A0, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex, CallFunc_Add_IntInt_ReturnValue) == 0x0000A4, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex, CallFunc_Array_Length_ReturnValue) == 0x0000A8, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex, CallFunc_GetMarinerGlobals_IsValid) == 0x0000AC, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex::CallFunc_GetMarinerGlobals_IsValid' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex, CallFunc_GetMarinerGlobals_ReturnValue) == 0x0000B0, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex::CallFunc_GetMarinerGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex, CallFunc_Less_IntInt_ReturnValue) == 0x0000B8, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex, CallFunc_GetInputGlobals_ReturnValue) == 0x0000C0, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex::CallFunc_GetInputGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex, CallFunc_GetActiveKeySet_ReturnValue) == 0x0000C8, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex::CallFunc_GetActiveKeySet_ReturnValue' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex, CallFunc_GetMarinerGlobals_IsValid_1) == 0x0000D0, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex::CallFunc_GetMarinerGlobals_IsValid_1' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex, CallFunc_GetMarinerGlobals_ReturnValue_1) == 0x0000D8, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex::CallFunc_GetMarinerGlobals_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex, CallFunc_GetInputGlobals_ReturnValue_1) == 0x0000E0, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex::CallFunc_GetInputGlobals_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex, CallFunc_GetDataTableRowNames_OutRowNames_1) == 0x0000E8, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex::CallFunc_GetDataTableRowNames_OutRowNames_1' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0000F8, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000120, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromIndex::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");

// Function ControllerFunctionLibrary.ControllerFunctionLibrary_C.SetupControllerConfigurationFromStoredSettings
// 0x0030 (0x0030 - 0x0000)
struct ControllerFunctionLibrary_C_SetupControllerConfigurationFromStoredSettings final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameInstance*                   K2Node_DynamicCast_AsMariner_Game_Instance;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetControllerConfiguration_ReturnValue;   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromStoredSettings) == 0x000008, "Wrong alignment on ControllerFunctionLibrary_C_SetupControllerConfigurationFromStoredSettings");
static_assert(sizeof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromStoredSettings) == 0x000030, "Wrong size on ControllerFunctionLibrary_C_SetupControllerConfigurationFromStoredSettings");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromStoredSettings, __WorldContext) == 0x000000, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromStoredSettings::__WorldContext' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromStoredSettings, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromStoredSettings::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromStoredSettings, K2Node_DynamicCast_AsMariner_Game_Instance) == 0x000010, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromStoredSettings::K2Node_DynamicCast_AsMariner_Game_Instance' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromStoredSettings, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromStoredSettings::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromStoredSettings, CallFunc_GetUserSettings_ReturnValue) == 0x000020, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromStoredSettings::CallFunc_GetUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(ControllerFunctionLibrary_C_SetupControllerConfigurationFromStoredSettings, CallFunc_GetControllerConfiguration_ReturnValue) == 0x000028, "Member 'ControllerFunctionLibrary_C_SetupControllerConfigurationFromStoredSettings::CallFunc_GetControllerConfiguration_ReturnValue' has a wrong offset!");

}

