#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreateGame

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Mariner_structs.hpp"
#include "Mariner_classes.hpp"
#include "UMG_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CreateGame.CreateGame_C
// 0x00C8 (0x05A8 - 0x04E0)
class UCreateGame_C final : public UMarinerMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CreateGameBackOut;                                 // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CreateGameOut;                                     // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CreateGameIn;                                      // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDefaultPrompt_C*                       BackPrompt;                                        // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BotDifficultyText;                                 // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerComboBoxString*                 BotsDifficulty;                                    // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerComboBoxString*                 BotsSelection;                                     // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CharacterSelectBackgroundGradient;                 // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerUniformGridPanel*               GameOptionsPanel;                                  // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPrompt_C*                       LaunchPrompt;                                      // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MapImage;                                          // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerComboBoxString*                 MapSelection;                                      // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerComboBoxString*                 ModeSelection;                                     // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NumBotsTextBox;                                    // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerName_C*                          PlayerName0;                                       // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerName_C*                          PlayerName1;                                       // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerName_C*                          PlayerName2;                                       // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerName_C*                          PlayerName3;                                       // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerName_C*                          PlayerName4;                                       // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerName_C*                          PlayerName5;                                       // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerUniformGridPanel*               PlayerNamePanel;                                   // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          HaveInitializedSelections;                         // 0x0590(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FDC[0x7];                                     // 0x0591(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastInlineDelegateProperty_             ActivateMenuBack;                                  // 0x0598(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ActivateMenuBack__DelegateSignature();
	void ExecuteUbergraph_CreateGame(int32 EntryPoint);
	void Dummy_Event(const struct FKey& KeyPressed);
	void MainMenuCancel(const struct FKey& KeyPressed);
	void MainMenuConfirm(const struct FKey& KeyPressed);
	void BndEvt__BotsDifficulty_K2Node_ComponentBoundEvent_2229_OnSelectionIndexChangedEvent__DelegateSignature(int32 SelectedIndex, ESelectInfo SelectionType);
	void BndEvt__BotsDifficulty_K2Node_ComponentBoundEvent_2112_OnOpeningEvent__DelegateSignature();
	void BackButtonDialogEvent();
	void BP_OnExited(bool bToSubLayer);
	void BP_OnEntered(bool bFromSubMenu);
	void BndEvt__BotsSelection_K2Node_ComponentBoundEvent_87_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void BndEvt__BotsSelection_K2Node_ComponentBoundEvent_454_OnOpeningEvent__DelegateSignature();
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void BndEvt__MapSelection_K2Node_ComponentBoundEvent_68_OnOpeningEvent__DelegateSignature();
	void BndEvt__ModeSelection_K2Node_ComponentBoundEvent_61_OnOpeningEvent__DelegateSignature();
	void BndEvt__ModeSelection_K2Node_ComponentBoundEvent_26_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void BndEvt__MarinerBackButton_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__MapSelection_K2Node_ComponentBoundEvent_48_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	bool IsVerticalSliceButtonEnabled();
	void PlayClickSound();
	void InitiateReturnToMainMenu();
	void InitiateOutSequence();
	void OutSequencePostAnimation();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void FillGameModesSelection();
	void UpdateKnockoutBotsSelection();
	void Handle_Map_Settings_Menu_Changed(const class FString& Desired_Map_Name, const class FString& Desired_Mode_Name, int32 Desired_Bots_Selection, int32 DesiredBotsDifficulty);
	bool HandleInput(EMarinerInputActions InInput);
	void ChangeBotOptionVisibility(ESlateVisibility Param_Visibility);
	void MapLoadNameToMapName(const class FString& MapLoadName, class FString* MapName, bool* bValid);
	void UpdateSelectionsFromGameState();
	void Fill_Map_Selection();
	void Handle_Mode_Selection_Changed(const class FString& Mode_Selected);
	void UpdateRocketBotAttackBotsSelection();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CreateGame_C">();
	}
	static class UCreateGame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreateGame_C>();
	}
};
static_assert(alignof(UCreateGame_C) == 0x000008, "Wrong alignment on UCreateGame_C");
static_assert(sizeof(UCreateGame_C) == 0x0005A8, "Wrong size on UCreateGame_C");
static_assert(offsetof(UCreateGame_C, UberGraphFrame) == 0x0004E0, "Member 'UCreateGame_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCreateGame_C, CreateGameBackOut) == 0x0004E8, "Member 'UCreateGame_C::CreateGameBackOut' has a wrong offset!");
static_assert(offsetof(UCreateGame_C, CreateGameOut) == 0x0004F0, "Member 'UCreateGame_C::CreateGameOut' has a wrong offset!");
static_assert(offsetof(UCreateGame_C, CreateGameIn) == 0x0004F8, "Member 'UCreateGame_C::CreateGameIn' has a wrong offset!");
static_assert(offsetof(UCreateGame_C, BackPrompt) == 0x000500, "Member 'UCreateGame_C::BackPrompt' has a wrong offset!");
static_assert(offsetof(UCreateGame_C, BotDifficultyText) == 0x000508, "Member 'UCreateGame_C::BotDifficultyText' has a wrong offset!");
static_assert(offsetof(UCreateGame_C, BotsDifficulty) == 0x000510, "Member 'UCreateGame_C::BotsDifficulty' has a wrong offset!");
static_assert(offsetof(UCreateGame_C, BotsSelection) == 0x000518, "Member 'UCreateGame_C::BotsSelection' has a wrong offset!");
static_assert(offsetof(UCreateGame_C, CharacterSelectBackgroundGradient) == 0x000520, "Member 'UCreateGame_C::CharacterSelectBackgroundGradient' has a wrong offset!");
static_assert(offsetof(UCreateGame_C, GameOptionsPanel) == 0x000528, "Member 'UCreateGame_C::GameOptionsPanel' has a wrong offset!");
static_assert(offsetof(UCreateGame_C, LaunchPrompt) == 0x000530, "Member 'UCreateGame_C::LaunchPrompt' has a wrong offset!");
static_assert(offsetof(UCreateGame_C, MapImage) == 0x000538, "Member 'UCreateGame_C::MapImage' has a wrong offset!");
static_assert(offsetof(UCreateGame_C, MapSelection) == 0x000540, "Member 'UCreateGame_C::MapSelection' has a wrong offset!");
static_assert(offsetof(UCreateGame_C, ModeSelection) == 0x000548, "Member 'UCreateGame_C::ModeSelection' has a wrong offset!");
static_assert(offsetof(UCreateGame_C, NumBotsTextBox) == 0x000550, "Member 'UCreateGame_C::NumBotsTextBox' has a wrong offset!");
static_assert(offsetof(UCreateGame_C, PlayerName0) == 0x000558, "Member 'UCreateGame_C::PlayerName0' has a wrong offset!");
static_assert(offsetof(UCreateGame_C, PlayerName1) == 0x000560, "Member 'UCreateGame_C::PlayerName1' has a wrong offset!");
static_assert(offsetof(UCreateGame_C, PlayerName2) == 0x000568, "Member 'UCreateGame_C::PlayerName2' has a wrong offset!");
static_assert(offsetof(UCreateGame_C, PlayerName3) == 0x000570, "Member 'UCreateGame_C::PlayerName3' has a wrong offset!");
static_assert(offsetof(UCreateGame_C, PlayerName4) == 0x000578, "Member 'UCreateGame_C::PlayerName4' has a wrong offset!");
static_assert(offsetof(UCreateGame_C, PlayerName5) == 0x000580, "Member 'UCreateGame_C::PlayerName5' has a wrong offset!");
static_assert(offsetof(UCreateGame_C, PlayerNamePanel) == 0x000588, "Member 'UCreateGame_C::PlayerNamePanel' has a wrong offset!");
static_assert(offsetof(UCreateGame_C, HaveInitializedSelections) == 0x000590, "Member 'UCreateGame_C::HaveInitializedSelections' has a wrong offset!");
static_assert(offsetof(UCreateGame_C, ActivateMenuBack) == 0x000598, "Member 'UCreateGame_C::ActivateMenuBack' has a wrong offset!");

}

