#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreditsMember

#include "Basic.hpp"

#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function CreditsMember.CreditsMember_C.SetMember
// 0x0050 (0x0050 - 0x0000)
struct CreditsMember_C_SetMember final
{
public:
	struct FMarinerCreditMember                   Member;                                            // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20C9[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CreditsMember_C_SetMember) == 0x000008, "Wrong alignment on CreditsMember_C_SetMember");
static_assert(sizeof(CreditsMember_C_SetMember) == 0x000050, "Wrong size on CreditsMember_C_SetMember");
static_assert(offsetof(CreditsMember_C_SetMember, Member) == 0x000000, "Member 'CreditsMember_C_SetMember::Member' has a wrong offset!");
static_assert(offsetof(CreditsMember_C_SetMember, CallFunc_TextIsEmpty_ReturnValue) == 0x000028, "Member 'CreditsMember_C_SetMember::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreditsMember_C_SetMember, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'CreditsMember_C_SetMember::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreditsMember_C_SetMember, CallFunc_Not_PreBool_ReturnValue) == 0x000048, "Member 'CreditsMember_C_SetMember::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreditsMember_C_SetMember, CallFunc_TextIsEmpty_ReturnValue_1) == 0x000049, "Member 'CreditsMember_C_SetMember::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreditsMember_C_SetMember, CallFunc_Not_PreBool_ReturnValue_1) == 0x00004A, "Member 'CreditsMember_C_SetMember::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreditsMember_C_SetMember, CallFunc_BooleanAND_ReturnValue) == 0x00004B, "Member 'CreditsMember_C_SetMember::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

