#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreditsMember

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CreditsMember.CreditsMember_C
// 0x0018 (0x0248 - 0x0230)
class UCreditsMember_C final : public UUserWidget
{
public:
	class UTextBlock*                             Name_CreditsMember_C;                              // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer;                                            // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Title;                                             // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetMember(const struct FMarinerCreditMember& Member);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CreditsMember_C">();
	}
	static class UCreditsMember_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreditsMember_C>();
	}
};
static_assert(alignof(UCreditsMember_C) == 0x000008, "Wrong alignment on UCreditsMember_C");
static_assert(sizeof(UCreditsMember_C) == 0x000248, "Wrong size on UCreditsMember_C");
static_assert(offsetof(UCreditsMember_C, Name_CreditsMember_C) == 0x000230, "Member 'UCreditsMember_C::Name_CreditsMember_C' has a wrong offset!");
static_assert(offsetof(UCreditsMember_C, Spacer) == 0x000238, "Member 'UCreditsMember_C::Spacer' has a wrong offset!");
static_assert(offsetof(UCreditsMember_C, Title) == 0x000240, "Member 'UCreditsMember_C::Title' has a wrong offset!");

}

