#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DailyRewardWidget

#include "Basic.hpp"

#include "MangoClient_structs.hpp"
#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DailyRewardWidget.DailyRewardWidget_C
// 0x0128 (0x03D8 - 0x02B0)
class UDailyRewardWidget_C final : public UMarinerUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_2;                                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LineLeft;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LineRight;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultRewardButton_C*                 RewardButton;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RewardCost;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SelectedText;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastInlineDelegateProperty_             OnButtonSelected;                                  // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FMangoLoginReward                      LoginReward;                                       // 0x0300(0x00D8)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void OnButtonSelected__DelegateSignature(class UDailyRewardWidget_C* Widget);
	void ExecuteUbergraph_DailyRewardWidget(int32 EntryPoint);
	void Construct();
	void PopulateReward(const struct FMangoLoginReward& LoginReward_0, bool* IsActiveReward);
	void SetAsActiveReward(bool IsActive);
	void OnSelected(class UMarinerLayeredButton* Button);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DailyRewardWidget_C">();
	}
	static class UDailyRewardWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDailyRewardWidget_C>();
	}
};
static_assert(alignof(UDailyRewardWidget_C) == 0x000008, "Wrong alignment on UDailyRewardWidget_C");
static_assert(sizeof(UDailyRewardWidget_C) == 0x0003D8, "Wrong size on UDailyRewardWidget_C");
static_assert(offsetof(UDailyRewardWidget_C, UberGraphFrame) == 0x0002B0, "Member 'UDailyRewardWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDailyRewardWidget_C, Image_2) == 0x0002B8, "Member 'UDailyRewardWidget_C::Image_2' has a wrong offset!");
static_assert(offsetof(UDailyRewardWidget_C, Image_3) == 0x0002C0, "Member 'UDailyRewardWidget_C::Image_3' has a wrong offset!");
static_assert(offsetof(UDailyRewardWidget_C, LineLeft) == 0x0002C8, "Member 'UDailyRewardWidget_C::LineLeft' has a wrong offset!");
static_assert(offsetof(UDailyRewardWidget_C, LineRight) == 0x0002D0, "Member 'UDailyRewardWidget_C::LineRight' has a wrong offset!");
static_assert(offsetof(UDailyRewardWidget_C, RewardButton) == 0x0002D8, "Member 'UDailyRewardWidget_C::RewardButton' has a wrong offset!");
static_assert(offsetof(UDailyRewardWidget_C, RewardCost) == 0x0002E0, "Member 'UDailyRewardWidget_C::RewardCost' has a wrong offset!");
static_assert(offsetof(UDailyRewardWidget_C, SelectedText) == 0x0002E8, "Member 'UDailyRewardWidget_C::SelectedText' has a wrong offset!");
static_assert(offsetof(UDailyRewardWidget_C, OnButtonSelected) == 0x0002F0, "Member 'UDailyRewardWidget_C::OnButtonSelected' has a wrong offset!");
static_assert(offsetof(UDailyRewardWidget_C, LoginReward) == 0x000300, "Member 'UDailyRewardWidget_C::LoginReward' has a wrong offset!");

}

