#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DailyLoginMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DailyLoginMenu.DailyLoginMenu_C
// 0x0058 (0x0538 - 0x04E0)
class UDailyLoginMenu_C final : public UMarinerMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             AvailablePoints;                                   // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerHorizontalBox*                  ContentPanel;                                      // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTimerWidget_C*                         NextPointTimer;                                    // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDailyRewardWidget_C*                   ActiveRewardWidget;                                // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDailyRewardWidget_C*                   TempRewardWidget;                                  // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowingBlockingMessageBox;                         // 0x0530(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211D[0x3];                                     // 0x0531(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ClaimRewardID;                                     // 0x0534(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DailyLoginMenu(int32 EntryPoint);
	void Callback(const struct FKey& KeyPressed);
	void BP_OnEntered(bool bFromSubMenu);
	void SetRewardCompleted(bool bWasSuccessful, const struct FMangoQuestDescription& NewQuest, const class FName& GrantedRewardId);
	void BuildContent();
	void SetRewardGoal(class UDailyRewardWidget_C* Widget);
	void ConfirmSetReward(struct FKey& KeyPressed);
	void CancelSetReward(struct FKey& KeyPressed);
	void CommitRewardGoal(class UDailyRewardWidget_C* RewardWidget, bool BlockDuringLoad);
	void DummyCallback(struct FKey& KeyPressed);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DailyLoginMenu_C">();
	}
	static class UDailyLoginMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDailyLoginMenu_C>();
	}
};
static_assert(alignof(UDailyLoginMenu_C) == 0x000008, "Wrong alignment on UDailyLoginMenu_C");
static_assert(sizeof(UDailyLoginMenu_C) == 0x000538, "Wrong size on UDailyLoginMenu_C");
static_assert(offsetof(UDailyLoginMenu_C, UberGraphFrame) == 0x0004E0, "Member 'UDailyLoginMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDailyLoginMenu_C, AvailablePoints) == 0x0004E8, "Member 'UDailyLoginMenu_C::AvailablePoints' has a wrong offset!");
static_assert(offsetof(UDailyLoginMenu_C, ContentPanel) == 0x0004F0, "Member 'UDailyLoginMenu_C::ContentPanel' has a wrong offset!");
static_assert(offsetof(UDailyLoginMenu_C, Image_0) == 0x0004F8, "Member 'UDailyLoginMenu_C::Image_0' has a wrong offset!");
static_assert(offsetof(UDailyLoginMenu_C, Image_1) == 0x000500, "Member 'UDailyLoginMenu_C::Image_1' has a wrong offset!");
static_assert(offsetof(UDailyLoginMenu_C, Image_2) == 0x000508, "Member 'UDailyLoginMenu_C::Image_2' has a wrong offset!");
static_assert(offsetof(UDailyLoginMenu_C, NextPointTimer) == 0x000510, "Member 'UDailyLoginMenu_C::NextPointTimer' has a wrong offset!");
static_assert(offsetof(UDailyLoginMenu_C, TextBlock_0) == 0x000518, "Member 'UDailyLoginMenu_C::TextBlock_0' has a wrong offset!");
static_assert(offsetof(UDailyLoginMenu_C, ActiveRewardWidget) == 0x000520, "Member 'UDailyLoginMenu_C::ActiveRewardWidget' has a wrong offset!");
static_assert(offsetof(UDailyLoginMenu_C, TempRewardWidget) == 0x000528, "Member 'UDailyLoginMenu_C::TempRewardWidget' has a wrong offset!");
static_assert(offsetof(UDailyLoginMenu_C, ShowingBlockingMessageBox) == 0x000530, "Member 'UDailyLoginMenu_C::ShowingBlockingMessageBox' has a wrong offset!");
static_assert(offsetof(UDailyLoginMenu_C, ClaimRewardID) == 0x000534, "Member 'UDailyLoginMenu_C::ClaimRewardID' has a wrong offset!");

}

