#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DamageDebugRecordEntry

#include "Basic.hpp"


namespace SDK::Params
{

// Function DamageDebugRecordEntry.DamageDebugRecordEntry_C.OnSelectDebugDamageRecord__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DamageDebugRecordEntry_C_OnSelectDebugDamageRecord__DelegateSignature final
{
public:
	class UDamageDebugRecordEntry_C*              SelectedDamageRecordIndex;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DamageDebugRecordEntry_C_OnSelectDebugDamageRecord__DelegateSignature) == 0x000008, "Wrong alignment on DamageDebugRecordEntry_C_OnSelectDebugDamageRecord__DelegateSignature");
static_assert(sizeof(DamageDebugRecordEntry_C_OnSelectDebugDamageRecord__DelegateSignature) == 0x000008, "Wrong size on DamageDebugRecordEntry_C_OnSelectDebugDamageRecord__DelegateSignature");
static_assert(offsetof(DamageDebugRecordEntry_C_OnSelectDebugDamageRecord__DelegateSignature, SelectedDamageRecordIndex) == 0x000000, "Member 'DamageDebugRecordEntry_C_OnSelectDebugDamageRecord__DelegateSignature::SelectedDamageRecordIndex' has a wrong offset!");

// Function DamageDebugRecordEntry.DamageDebugRecordEntry_C.ExecuteUbergraph_DamageDebugRecordEntry
// 0x0004 (0x0004 - 0x0000)
struct DamageDebugRecordEntry_C_ExecuteUbergraph_DamageDebugRecordEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DamageDebugRecordEntry_C_ExecuteUbergraph_DamageDebugRecordEntry) == 0x000004, "Wrong alignment on DamageDebugRecordEntry_C_ExecuteUbergraph_DamageDebugRecordEntry");
static_assert(sizeof(DamageDebugRecordEntry_C_ExecuteUbergraph_DamageDebugRecordEntry) == 0x000004, "Wrong size on DamageDebugRecordEntry_C_ExecuteUbergraph_DamageDebugRecordEntry");
static_assert(offsetof(DamageDebugRecordEntry_C_ExecuteUbergraph_DamageDebugRecordEntry, EntryPoint) == 0x000000, "Member 'DamageDebugRecordEntry_C_ExecuteUbergraph_DamageDebugRecordEntry::EntryPoint' has a wrong offset!");

}

