#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DamageDebugMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DamageDebugMenu.DamageDebugMenu_C
// 0x0070 (0x0550 - 0x04E0)
class UDamageDebugMenu_C final : public UMarinerMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           DamageDebugMenu;                                   // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             DamageDebugRecordsScrollBox;                       // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ExitDamageDebugMenu;                               // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             LegendGrid;                                        // 0x0500(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           SelectedDamageDebugRecordDisplayCanvas;            // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_1144;                                    // 0x0510(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_1145;                                    // 0x0518(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UMarinerDamageDebugRecord*>      DamageDebugArchive;                                // 0x0520(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         SelectedDamageDebugRecordIndex;                    // 0x0530(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_534[0x4];                                      // 0x0534(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastInlineDelegateProperty_             OnDamageDebugRecordEntryClicked;                   // 0x0538(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UUserWidget*                            SelectedDamageDebugRecordInfo;                     // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnDamageDebugRecordEntryClicked__DelegateSignature(class UDamageDebugRecordEntry_C* EntryClicked);
	void ExecuteUbergraph_DamageDebugMenu(int32 EntryPoint);
	void BP_OnExited(bool bToSubLayer);
	void BP_OnEntered(bool bFromSubMenu);
	void BndEvt__Button_127_K2Node_ComponentBoundEvent_125_OnButtonClickedEvent__DelegateSignature();
	void Destruct();
	void OnDamageDebugArchiveCleared();
	void OnDamageDebugRecordAdded(const class UMarinerDamageDebugRecord* AddedRecord);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void AddDamageDebugRecord(class UMarinerDamageDebugRecord* DamageRecord);
	void SelectDamageDebugRecord(class UDamageDebugRecordEntry_C* DamageDebugRecordEntry);
	void ReconstructDamageDebugRecordList();
	void CreateDamageDebugRecordEntry(class UMarinerDamageDebugRecord*& DamageRecord, int32 DamageRecordIndex);
	ESlateVisibility GetLegendGridVisibility();
	ESlateVisibility GetAOEOnlyLegendFieldVisibility();
	void SetSelectedDamageDebugRecordInfoWidget(class UUserWidget* SelectedDamageDebugRecordInfo_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DamageDebugMenu_C">();
	}
	static class UDamageDebugMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDamageDebugMenu_C>();
	}
};
static_assert(alignof(UDamageDebugMenu_C) == 0x000008, "Wrong alignment on UDamageDebugMenu_C");
static_assert(sizeof(UDamageDebugMenu_C) == 0x000550, "Wrong size on UDamageDebugMenu_C");
static_assert(offsetof(UDamageDebugMenu_C, UberGraphFrame) == 0x0004E0, "Member 'UDamageDebugMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDamageDebugMenu_C, DamageDebugMenu) == 0x0004E8, "Member 'UDamageDebugMenu_C::DamageDebugMenu' has a wrong offset!");
static_assert(offsetof(UDamageDebugMenu_C, DamageDebugRecordsScrollBox) == 0x0004F0, "Member 'UDamageDebugMenu_C::DamageDebugRecordsScrollBox' has a wrong offset!");
static_assert(offsetof(UDamageDebugMenu_C, ExitDamageDebugMenu) == 0x0004F8, "Member 'UDamageDebugMenu_C::ExitDamageDebugMenu' has a wrong offset!");
static_assert(offsetof(UDamageDebugMenu_C, LegendGrid) == 0x000500, "Member 'UDamageDebugMenu_C::LegendGrid' has a wrong offset!");
static_assert(offsetof(UDamageDebugMenu_C, SelectedDamageDebugRecordDisplayCanvas) == 0x000508, "Member 'UDamageDebugMenu_C::SelectedDamageDebugRecordDisplayCanvas' has a wrong offset!");
static_assert(offsetof(UDamageDebugMenu_C, TextBlock_1144) == 0x000510, "Member 'UDamageDebugMenu_C::TextBlock_1144' has a wrong offset!");
static_assert(offsetof(UDamageDebugMenu_C, TextBlock_1145) == 0x000518, "Member 'UDamageDebugMenu_C::TextBlock_1145' has a wrong offset!");
static_assert(offsetof(UDamageDebugMenu_C, DamageDebugArchive) == 0x000520, "Member 'UDamageDebugMenu_C::DamageDebugArchive' has a wrong offset!");
static_assert(offsetof(UDamageDebugMenu_C, SelectedDamageDebugRecordIndex) == 0x000530, "Member 'UDamageDebugMenu_C::SelectedDamageDebugRecordIndex' has a wrong offset!");
static_assert(offsetof(UDamageDebugMenu_C, OnDamageDebugRecordEntryClicked) == 0x000538, "Member 'UDamageDebugMenu_C::OnDamageDebugRecordEntryClicked' has a wrong offset!");
static_assert(offsetof(UDamageDebugMenu_C, SelectedDamageDebugRecordInfo) == 0x000548, "Member 'UDamageDebugMenu_C::SelectedDamageDebugRecordInfo' has a wrong offset!");

}

