#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DamageDebugRecordEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DamageDebugRecordEntry.DamageDebugRecordEntry_C
// 0x0030 (0x0260 - 0x0230)
class UDamageDebugRecordEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             DamageRecordName;                                  // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                SelectDamageRecordButton;                          // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         DamageRecordIndex;                                 // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastInlineDelegateProperty_             OnSelectDebugDamageRecord;                         // 0x0250(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnSelectDebugDamageRecord__DelegateSignature(class UDamageDebugRecordEntry_C* SelectedDamageRecordIndex);
	void ExecuteUbergraph_DamageDebugRecordEntry(int32 EntryPoint);
	void BndEvt__SelectDamageRecordButton_K2Node_ComponentBoundEvent_99_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DamageDebugRecordEntry_C">();
	}
	static class UDamageDebugRecordEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDamageDebugRecordEntry_C>();
	}
};
static_assert(alignof(UDamageDebugRecordEntry_C) == 0x000008, "Wrong alignment on UDamageDebugRecordEntry_C");
static_assert(sizeof(UDamageDebugRecordEntry_C) == 0x000260, "Wrong size on UDamageDebugRecordEntry_C");
static_assert(offsetof(UDamageDebugRecordEntry_C, UberGraphFrame) == 0x000230, "Member 'UDamageDebugRecordEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDamageDebugRecordEntry_C, DamageRecordName) == 0x000238, "Member 'UDamageDebugRecordEntry_C::DamageRecordName' has a wrong offset!");
static_assert(offsetof(UDamageDebugRecordEntry_C, SelectDamageRecordButton) == 0x000240, "Member 'UDamageDebugRecordEntry_C::SelectDamageRecordButton' has a wrong offset!");
static_assert(offsetof(UDamageDebugRecordEntry_C, DamageRecordIndex) == 0x000248, "Member 'UDamageDebugRecordEntry_C::DamageRecordIndex' has a wrong offset!");
static_assert(offsetof(UDamageDebugRecordEntry_C, OnSelectDebugDamageRecord) == 0x000250, "Member 'UDamageDebugRecordEntry_C::OnSelectDebugDamageRecord' has a wrong offset!");

}

