#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DebugInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DebugInfo.DebugInfo_C
// 0x0018 (0x0258 - 0x0240)
class UDebugInfo_C final : public UMarinerDebugInfoWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             DynamicInfo;                                       // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             StaticInfo;                                        // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DebugInfo(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DebugInfo_C">();
	}
	static class UDebugInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDebugInfo_C>();
	}
};
static_assert(alignof(UDebugInfo_C) == 0x000008, "Wrong alignment on UDebugInfo_C");
static_assert(sizeof(UDebugInfo_C) == 0x000258, "Wrong size on UDebugInfo_C");
static_assert(offsetof(UDebugInfo_C, UberGraphFrame) == 0x000240, "Member 'UDebugInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDebugInfo_C, DynamicInfo) == 0x000248, "Member 'UDebugInfo_C::DynamicInfo' has a wrong offset!");
static_assert(offsetof(UDebugInfo_C, StaticInfo) == 0x000250, "Member 'UDebugInfo_C::StaticInfo' has a wrong offset!");

}

