#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DefaultOnboardingButton

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DefaultOnboardingButton.DefaultOnboardingButton_C
// 0x0058 (0x3008 - 0x2FB0)
class UDefaultOnboardingButton_C : public UMarinerOnboardingButton
{
public:
	class UWidgetAnimation*                       UnhoveredAnim;                                     // 0x2FB0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoveredAnim;                                       // 0x2FB8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             AuxiliaryText;                                     // 0x2FC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x2FC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Border;                                            // 0x2FD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x2FD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x2FE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Material;                                          // 0x2FE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PrimaryText;                                       // 0x2FF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPromptBanner_C*                 PromptBanner;                                      // 0x2FF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               RootSizeBox;                                       // 0x3000(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FMarinerLayeredButtonAssets GetAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DefaultOnboardingButton_C">();
	}
	static class UDefaultOnboardingButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultOnboardingButton_C>();
	}
};
static_assert(alignof(UDefaultOnboardingButton_C) == 0x000008, "Wrong alignment on UDefaultOnboardingButton_C");
static_assert(sizeof(UDefaultOnboardingButton_C) == 0x003008, "Wrong size on UDefaultOnboardingButton_C");
static_assert(offsetof(UDefaultOnboardingButton_C, UnhoveredAnim) == 0x002FB0, "Member 'UDefaultOnboardingButton_C::UnhoveredAnim' has a wrong offset!");
static_assert(offsetof(UDefaultOnboardingButton_C, HoveredAnim) == 0x002FB8, "Member 'UDefaultOnboardingButton_C::HoveredAnim' has a wrong offset!");
static_assert(offsetof(UDefaultOnboardingButton_C, AuxiliaryText) == 0x002FC0, "Member 'UDefaultOnboardingButton_C::AuxiliaryText' has a wrong offset!");
static_assert(offsetof(UDefaultOnboardingButton_C, Background) == 0x002FC8, "Member 'UDefaultOnboardingButton_C::Background' has a wrong offset!");
static_assert(offsetof(UDefaultOnboardingButton_C, Border) == 0x002FD0, "Member 'UDefaultOnboardingButton_C::Border' has a wrong offset!");
static_assert(offsetof(UDefaultOnboardingButton_C, Button) == 0x002FD8, "Member 'UDefaultOnboardingButton_C::Button' has a wrong offset!");
static_assert(offsetof(UDefaultOnboardingButton_C, Icon) == 0x002FE0, "Member 'UDefaultOnboardingButton_C::Icon' has a wrong offset!");
static_assert(offsetof(UDefaultOnboardingButton_C, Material) == 0x002FE8, "Member 'UDefaultOnboardingButton_C::Material' has a wrong offset!");
static_assert(offsetof(UDefaultOnboardingButton_C, PrimaryText) == 0x002FF0, "Member 'UDefaultOnboardingButton_C::PrimaryText' has a wrong offset!");
static_assert(offsetof(UDefaultOnboardingButton_C, PromptBanner) == 0x002FF8, "Member 'UDefaultOnboardingButton_C::PromptBanner' has a wrong offset!");
static_assert(offsetof(UDefaultOnboardingButton_C, RootSizeBox) == 0x003000, "Member 'UDefaultOnboardingButton_C::RootSizeBox' has a wrong offset!");

}

