#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DefaultStoreNativeOfferButton

#include "Basic.hpp"

#include "MangoClient_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DefaultStoreNativeOfferButton.DefaultStoreNativeOfferButton_C
// 0x0150 (0x30C8 - 0x2F78)
class UDefaultStoreNativeOfferButton_C final : public UMarinerLayeredButton
{
public:
	class UWidgetAnimation*                       UnhoveredAnim;                                     // 0x2F78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoveredAnim;                                       // 0x2F80(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x2F88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Border;                                            // 0x2F90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x2F98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x2FA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageBacker;                                       // 0x2FA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Material;                                          // 0x2FB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PriceFrame;                                        // 0x2FB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        PriceSwitcher;                                     // 0x2FC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PrimaryText;                                       // 0x2FC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPromptBanner_C*                 PromptBanner;                                      // 0x2FD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RF_icon;                                           // 0x2FD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               RootSizeBox;                                       // 0x2FE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SalePriceNew;                                      // 0x2FE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SalePriceOld;                                      // 0x2FF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SalePricePanel;                                    // 0x2FF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             StandardPrice;                                     // 0x3000(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FMangoNativeOffer                      Nativeoffer;                                       // 0x3008(0x00C0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void SetNativeOffer(const struct FMangoNativeOffer& Nativeoffer_0);
	void Refresh();

	struct FMarinerLayeredButtonAssets GetAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DefaultStoreNativeOfferButton_C">();
	}
	static class UDefaultStoreNativeOfferButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultStoreNativeOfferButton_C>();
	}
};
static_assert(alignof(UDefaultStoreNativeOfferButton_C) == 0x000008, "Wrong alignment on UDefaultStoreNativeOfferButton_C");
static_assert(sizeof(UDefaultStoreNativeOfferButton_C) == 0x0030C8, "Wrong size on UDefaultStoreNativeOfferButton_C");
static_assert(offsetof(UDefaultStoreNativeOfferButton_C, UnhoveredAnim) == 0x002F78, "Member 'UDefaultStoreNativeOfferButton_C::UnhoveredAnim' has a wrong offset!");
static_assert(offsetof(UDefaultStoreNativeOfferButton_C, HoveredAnim) == 0x002F80, "Member 'UDefaultStoreNativeOfferButton_C::HoveredAnim' has a wrong offset!");
static_assert(offsetof(UDefaultStoreNativeOfferButton_C, Background) == 0x002F88, "Member 'UDefaultStoreNativeOfferButton_C::Background' has a wrong offset!");
static_assert(offsetof(UDefaultStoreNativeOfferButton_C, Border) == 0x002F90, "Member 'UDefaultStoreNativeOfferButton_C::Border' has a wrong offset!");
static_assert(offsetof(UDefaultStoreNativeOfferButton_C, Button) == 0x002F98, "Member 'UDefaultStoreNativeOfferButton_C::Button' has a wrong offset!");
static_assert(offsetof(UDefaultStoreNativeOfferButton_C, Icon) == 0x002FA0, "Member 'UDefaultStoreNativeOfferButton_C::Icon' has a wrong offset!");
static_assert(offsetof(UDefaultStoreNativeOfferButton_C, ImageBacker) == 0x002FA8, "Member 'UDefaultStoreNativeOfferButton_C::ImageBacker' has a wrong offset!");
static_assert(offsetof(UDefaultStoreNativeOfferButton_C, Material) == 0x002FB0, "Member 'UDefaultStoreNativeOfferButton_C::Material' has a wrong offset!");
static_assert(offsetof(UDefaultStoreNativeOfferButton_C, PriceFrame) == 0x002FB8, "Member 'UDefaultStoreNativeOfferButton_C::PriceFrame' has a wrong offset!");
static_assert(offsetof(UDefaultStoreNativeOfferButton_C, PriceSwitcher) == 0x002FC0, "Member 'UDefaultStoreNativeOfferButton_C::PriceSwitcher' has a wrong offset!");
static_assert(offsetof(UDefaultStoreNativeOfferButton_C, PrimaryText) == 0x002FC8, "Member 'UDefaultStoreNativeOfferButton_C::PrimaryText' has a wrong offset!");
static_assert(offsetof(UDefaultStoreNativeOfferButton_C, PromptBanner) == 0x002FD0, "Member 'UDefaultStoreNativeOfferButton_C::PromptBanner' has a wrong offset!");
static_assert(offsetof(UDefaultStoreNativeOfferButton_C, RF_icon) == 0x002FD8, "Member 'UDefaultStoreNativeOfferButton_C::RF_icon' has a wrong offset!");
static_assert(offsetof(UDefaultStoreNativeOfferButton_C, RootSizeBox) == 0x002FE0, "Member 'UDefaultStoreNativeOfferButton_C::RootSizeBox' has a wrong offset!");
static_assert(offsetof(UDefaultStoreNativeOfferButton_C, SalePriceNew) == 0x002FE8, "Member 'UDefaultStoreNativeOfferButton_C::SalePriceNew' has a wrong offset!");
static_assert(offsetof(UDefaultStoreNativeOfferButton_C, SalePriceOld) == 0x002FF0, "Member 'UDefaultStoreNativeOfferButton_C::SalePriceOld' has a wrong offset!");
static_assert(offsetof(UDefaultStoreNativeOfferButton_C, SalePricePanel) == 0x002FF8, "Member 'UDefaultStoreNativeOfferButton_C::SalePricePanel' has a wrong offset!");
static_assert(offsetof(UDefaultStoreNativeOfferButton_C, StandardPrice) == 0x003000, "Member 'UDefaultStoreNativeOfferButton_C::StandardPrice' has a wrong offset!");
static_assert(offsetof(UDefaultStoreNativeOfferButton_C, Nativeoffer) == 0x003008, "Member 'UDefaultStoreNativeOfferButton_C::Nativeoffer' has a wrong offset!");

}

