#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DefaultStoreNativeOfferButton

#include "Basic.hpp"

#include "MangoClient_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function DefaultStoreNativeOfferButton.DefaultStoreNativeOfferButton_C.SetNativeOffer
// 0x00C0 (0x00C0 - 0x0000)
struct DefaultStoreNativeOfferButton_C_SetNativeOffer final
{
public:
	struct FMangoNativeOffer                      Nativeoffer_0;                                     // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(DefaultStoreNativeOfferButton_C_SetNativeOffer) == 0x000008, "Wrong alignment on DefaultStoreNativeOfferButton_C_SetNativeOffer");
static_assert(sizeof(DefaultStoreNativeOfferButton_C_SetNativeOffer) == 0x0000C0, "Wrong size on DefaultStoreNativeOfferButton_C_SetNativeOffer");
static_assert(offsetof(DefaultStoreNativeOfferButton_C_SetNativeOffer, Nativeoffer_0) == 0x000000, "Member 'DefaultStoreNativeOfferButton_C_SetNativeOffer::Nativeoffer_0' has a wrong offset!");

// Function DefaultStoreNativeOfferButton.DefaultStoreNativeOfferButton_C.Refresh
// 0x0118 (0x0118 - 0x0000)
struct DefaultStoreNativeOfferButton_C_Refresh final
{
public:
	class UMarinerFrontEndGlobals*                CallFunc_GetFrontEndGlobals_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMangoTxnManager*                       CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerStoreGlobals*                   CallFunc_GetStoreGlobals_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMangoTxnManager*                       CallFunc_Get_ReturnValue_1;                        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetPricingInformationForNativeOfferId_OutDisplayPrice; // 0x0020(0x0018)()
	class FText                                   CallFunc_GetPricingInformationForNativeOfferId_OutRegularPrice; // 0x0038(0x0018)()
	bool                                          CallFunc_GetPricingInformationForNativeOfferId_OutIsOnSale; // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetPricingInformationForNativeOfferId_ReturnValue; // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_GetImage_ImageBrushOut;                   // 0x0058(0x0088)()
	bool                                          CallFunc_GetImage_ReturnValue;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00E8(0x0018)()
	class FText                                   CallFunc_GetDisplayPriceForNativeOfferId_ReturnValue; // 0x0100(0x0018)()
};
static_assert(alignof(DefaultStoreNativeOfferButton_C_Refresh) == 0x000008, "Wrong alignment on DefaultStoreNativeOfferButton_C_Refresh");
static_assert(sizeof(DefaultStoreNativeOfferButton_C_Refresh) == 0x000118, "Wrong size on DefaultStoreNativeOfferButton_C_Refresh");
static_assert(offsetof(DefaultStoreNativeOfferButton_C_Refresh, CallFunc_GetFrontEndGlobals_ReturnValue) == 0x000000, "Member 'DefaultStoreNativeOfferButton_C_Refresh::CallFunc_GetFrontEndGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultStoreNativeOfferButton_C_Refresh, CallFunc_Get_ReturnValue) == 0x000008, "Member 'DefaultStoreNativeOfferButton_C_Refresh::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultStoreNativeOfferButton_C_Refresh, CallFunc_GetStoreGlobals_ReturnValue) == 0x000010, "Member 'DefaultStoreNativeOfferButton_C_Refresh::CallFunc_GetStoreGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultStoreNativeOfferButton_C_Refresh, CallFunc_Get_ReturnValue_1) == 0x000018, "Member 'DefaultStoreNativeOfferButton_C_Refresh::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DefaultStoreNativeOfferButton_C_Refresh, CallFunc_GetPricingInformationForNativeOfferId_OutDisplayPrice) == 0x000020, "Member 'DefaultStoreNativeOfferButton_C_Refresh::CallFunc_GetPricingInformationForNativeOfferId_OutDisplayPrice' has a wrong offset!");
static_assert(offsetof(DefaultStoreNativeOfferButton_C_Refresh, CallFunc_GetPricingInformationForNativeOfferId_OutRegularPrice) == 0x000038, "Member 'DefaultStoreNativeOfferButton_C_Refresh::CallFunc_GetPricingInformationForNativeOfferId_OutRegularPrice' has a wrong offset!");
static_assert(offsetof(DefaultStoreNativeOfferButton_C_Refresh, CallFunc_GetPricingInformationForNativeOfferId_OutIsOnSale) == 0x000050, "Member 'DefaultStoreNativeOfferButton_C_Refresh::CallFunc_GetPricingInformationForNativeOfferId_OutIsOnSale' has a wrong offset!");
static_assert(offsetof(DefaultStoreNativeOfferButton_C_Refresh, CallFunc_GetPricingInformationForNativeOfferId_ReturnValue) == 0x000051, "Member 'DefaultStoreNativeOfferButton_C_Refresh::CallFunc_GetPricingInformationForNativeOfferId_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultStoreNativeOfferButton_C_Refresh, CallFunc_GetImage_ImageBrushOut) == 0x000058, "Member 'DefaultStoreNativeOfferButton_C_Refresh::CallFunc_GetImage_ImageBrushOut' has a wrong offset!");
static_assert(offsetof(DefaultStoreNativeOfferButton_C_Refresh, CallFunc_GetImage_ReturnValue) == 0x0000E0, "Member 'DefaultStoreNativeOfferButton_C_Refresh::CallFunc_GetImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultStoreNativeOfferButton_C_Refresh, CallFunc_Conv_StringToText_ReturnValue) == 0x0000E8, "Member 'DefaultStoreNativeOfferButton_C_Refresh::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultStoreNativeOfferButton_C_Refresh, CallFunc_GetDisplayPriceForNativeOfferId_ReturnValue) == 0x000100, "Member 'DefaultStoreNativeOfferButton_C_Refresh::CallFunc_GetDisplayPriceForNativeOfferId_ReturnValue' has a wrong offset!");

// Function DefaultStoreNativeOfferButton.DefaultStoreNativeOfferButton_C.GetAssets
// 0x00D0 (0x00D0 - 0x0000)
struct DefaultStoreNativeOfferButton_C_GetAssets final
{
public:
	struct FMarinerLayeredButtonAssets            ReturnValue;                                       // 0x0000(0x0068)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference)
	struct FMarinerLayeredButtonAssets            K2Node_MakeStruct_MarinerLayeredButtonAssets;      // 0x0068(0x0068)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(DefaultStoreNativeOfferButton_C_GetAssets) == 0x000008, "Wrong alignment on DefaultStoreNativeOfferButton_C_GetAssets");
static_assert(sizeof(DefaultStoreNativeOfferButton_C_GetAssets) == 0x0000D0, "Wrong size on DefaultStoreNativeOfferButton_C_GetAssets");
static_assert(offsetof(DefaultStoreNativeOfferButton_C_GetAssets, ReturnValue) == 0x000000, "Member 'DefaultStoreNativeOfferButton_C_GetAssets::ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultStoreNativeOfferButton_C_GetAssets, K2Node_MakeStruct_MarinerLayeredButtonAssets) == 0x000068, "Member 'DefaultStoreNativeOfferButton_C_GetAssets::K2Node_MakeStruct_MarinerLayeredButtonAssets' has a wrong offset!");

}

