#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DirectDamageDebugRecordDisplay

#include "Basic.hpp"


namespace SDK::Params
{

// Function DirectDamageDebugRecordDisplay.DirectDamageDebugRecordDisplay_C.PopulateFromDirectDamageDebugRecord
// 0x0128 (0x0128 - 0x0000)
struct DirectDamageDebugRecordDisplay_C_PopulateFromDirectDamageDebugRecord final
{
public:
	class UMarinerDirectDamageDebugRecord*        DamageRecord;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0008(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_1;           // 0x0020(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_2;           // 0x0038(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_3;           // 0x0050(0x0018)()
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0068(0x0018)()
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x0080(0x0018)()
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_2;            // 0x0098(0x0018)()
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_3;            // 0x00B0(0x0018)()
	class FText                                   CallFunc_GetShortDescription_ReturnValue;          // 0x00C8(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_4;           // 0x00E0(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_5;           // 0x00F8(0x0018)()
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_4;            // 0x0110(0x0018)()
};
static_assert(alignof(DirectDamageDebugRecordDisplay_C_PopulateFromDirectDamageDebugRecord) == 0x000008, "Wrong alignment on DirectDamageDebugRecordDisplay_C_PopulateFromDirectDamageDebugRecord");
static_assert(sizeof(DirectDamageDebugRecordDisplay_C_PopulateFromDirectDamageDebugRecord) == 0x000128, "Wrong size on DirectDamageDebugRecordDisplay_C_PopulateFromDirectDamageDebugRecord");
static_assert(offsetof(DirectDamageDebugRecordDisplay_C_PopulateFromDirectDamageDebugRecord, DamageRecord) == 0x000000, "Member 'DirectDamageDebugRecordDisplay_C_PopulateFromDirectDamageDebugRecord::DamageRecord' has a wrong offset!");
static_assert(offsetof(DirectDamageDebugRecordDisplay_C_PopulateFromDirectDamageDebugRecord, CallFunc_Conv_FloatToText_ReturnValue) == 0x000008, "Member 'DirectDamageDebugRecordDisplay_C_PopulateFromDirectDamageDebugRecord::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(DirectDamageDebugRecordDisplay_C_PopulateFromDirectDamageDebugRecord, CallFunc_Conv_FloatToText_ReturnValue_1) == 0x000020, "Member 'DirectDamageDebugRecordDisplay_C_PopulateFromDirectDamageDebugRecord::CallFunc_Conv_FloatToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DirectDamageDebugRecordDisplay_C_PopulateFromDirectDamageDebugRecord, CallFunc_Conv_FloatToText_ReturnValue_2) == 0x000038, "Member 'DirectDamageDebugRecordDisplay_C_PopulateFromDirectDamageDebugRecord::CallFunc_Conv_FloatToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DirectDamageDebugRecordDisplay_C_PopulateFromDirectDamageDebugRecord, CallFunc_Conv_FloatToText_ReturnValue_3) == 0x000050, "Member 'DirectDamageDebugRecordDisplay_C_PopulateFromDirectDamageDebugRecord::CallFunc_Conv_FloatToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DirectDamageDebugRecordDisplay_C_PopulateFromDirectDamageDebugRecord, CallFunc_Conv_NameToText_ReturnValue) == 0x000068, "Member 'DirectDamageDebugRecordDisplay_C_PopulateFromDirectDamageDebugRecord::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(DirectDamageDebugRecordDisplay_C_PopulateFromDirectDamageDebugRecord, CallFunc_Conv_NameToText_ReturnValue_1) == 0x000080, "Member 'DirectDamageDebugRecordDisplay_C_PopulateFromDirectDamageDebugRecord::CallFunc_Conv_NameToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DirectDamageDebugRecordDisplay_C_PopulateFromDirectDamageDebugRecord, CallFunc_Conv_NameToText_ReturnValue_2) == 0x000098, "Member 'DirectDamageDebugRecordDisplay_C_PopulateFromDirectDamageDebugRecord::CallFunc_Conv_NameToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DirectDamageDebugRecordDisplay_C_PopulateFromDirectDamageDebugRecord, CallFunc_Conv_NameToText_ReturnValue_3) == 0x0000B0, "Member 'DirectDamageDebugRecordDisplay_C_PopulateFromDirectDamageDebugRecord::CallFunc_Conv_NameToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DirectDamageDebugRecordDisplay_C_PopulateFromDirectDamageDebugRecord, CallFunc_GetShortDescription_ReturnValue) == 0x0000C8, "Member 'DirectDamageDebugRecordDisplay_C_PopulateFromDirectDamageDebugRecord::CallFunc_GetShortDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(DirectDamageDebugRecordDisplay_C_PopulateFromDirectDamageDebugRecord, CallFunc_Conv_FloatToText_ReturnValue_4) == 0x0000E0, "Member 'DirectDamageDebugRecordDisplay_C_PopulateFromDirectDamageDebugRecord::CallFunc_Conv_FloatToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(DirectDamageDebugRecordDisplay_C_PopulateFromDirectDamageDebugRecord, CallFunc_Conv_FloatToText_ReturnValue_5) == 0x0000F8, "Member 'DirectDamageDebugRecordDisplay_C_PopulateFromDirectDamageDebugRecord::CallFunc_Conv_FloatToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(DirectDamageDebugRecordDisplay_C_PopulateFromDirectDamageDebugRecord, CallFunc_Conv_NameToText_ReturnValue_4) == 0x000110, "Member 'DirectDamageDebugRecordDisplay_C_PopulateFromDirectDamageDebugRecord::CallFunc_Conv_NameToText_ReturnValue_4' has a wrong offset!");

// Function DirectDamageDebugRecordDisplay.DirectDamageDebugRecordDisplay_C.CreateNewDamageDebugRecordField
// 0x0048 (0x0048 - 0x0000)
struct DirectDamageDebugRecordDisplay_C_CreateNewDamageDebugRecordField final
{
public:
	class FText                                   FieldName;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   FieldValue;                                        // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageDebugRecordField_C*              CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DirectDamageDebugRecordDisplay_C_CreateNewDamageDebugRecordField) == 0x000008, "Wrong alignment on DirectDamageDebugRecordDisplay_C_CreateNewDamageDebugRecordField");
static_assert(sizeof(DirectDamageDebugRecordDisplay_C_CreateNewDamageDebugRecordField) == 0x000048, "Wrong size on DirectDamageDebugRecordDisplay_C_CreateNewDamageDebugRecordField");
static_assert(offsetof(DirectDamageDebugRecordDisplay_C_CreateNewDamageDebugRecordField, FieldName) == 0x000000, "Member 'DirectDamageDebugRecordDisplay_C_CreateNewDamageDebugRecordField::FieldName' has a wrong offset!");
static_assert(offsetof(DirectDamageDebugRecordDisplay_C_CreateNewDamageDebugRecordField, FieldValue) == 0x000018, "Member 'DirectDamageDebugRecordDisplay_C_CreateNewDamageDebugRecordField::FieldValue' has a wrong offset!");
static_assert(offsetof(DirectDamageDebugRecordDisplay_C_CreateNewDamageDebugRecordField, CallFunc_GetOwningPlayer_ReturnValue) == 0x000030, "Member 'DirectDamageDebugRecordDisplay_C_CreateNewDamageDebugRecordField::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(DirectDamageDebugRecordDisplay_C_CreateNewDamageDebugRecordField, CallFunc_Create_ReturnValue) == 0x000038, "Member 'DirectDamageDebugRecordDisplay_C_CreateNewDamageDebugRecordField::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(DirectDamageDebugRecordDisplay_C_CreateNewDamageDebugRecordField, CallFunc_AddChild_ReturnValue) == 0x000040, "Member 'DirectDamageDebugRecordDisplay_C_CreateNewDamageDebugRecordField::CallFunc_AddChild_ReturnValue' has a wrong offset!");

}

