#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DodgeData

#include "Basic.hpp"

#include "DodgeDirections_structs.hpp"


namespace SDK
{

// UserDefinedStruct DodgeData.DodgeData
// 0x000C (0x000C - 0x0000)
struct FDodgeData final
{
public:
	EDodgeDirections                              DodgeDirection_2_E55B6DEE436430078C00638DDCD45DE2; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2316[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DodgeDuration_5_875A03394914A2068F35EEB6239E8194;  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnsureReplicationTrigger_13_9B8E3DF64C5F691A4BFA0D9B4E129D21; // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FDodgeData) == 0x000004, "Wrong alignment on FDodgeData");
static_assert(sizeof(FDodgeData) == 0x00000C, "Wrong size on FDodgeData");
static_assert(offsetof(FDodgeData, DodgeDirection_2_E55B6DEE436430078C00638DDCD45DE2) == 0x000000, "Member 'FDodgeData::DodgeDirection_2_E55B6DEE436430078C00638DDCD45DE2' has a wrong offset!");
static_assert(offsetof(FDodgeData, DodgeDuration_5_875A03394914A2068F35EEB6239E8194) == 0x000004, "Member 'FDodgeData::DodgeDuration_5_875A03394914A2068F35EEB6239E8194' has a wrong offset!");
static_assert(offsetof(FDodgeData, EnsureReplicationTrigger_13_9B8E3DF64C5F691A4BFA0D9B4E129D21) == 0x000008, "Member 'FDodgeData::EnsureReplicationTrigger_13_9B8E3DF64C5F691A4BFA0D9B4E129D21' has a wrong offset!");

}

