#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DodgeAbility

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Mariner_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function DodgeAbility.DodgeAbility_C.UpdateRocketsDodged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct DodgeAbility_C_UpdateRocketsDodged__DelegateSignature final
{
public:
	int32                                         RocketsDodged;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DodgeAbility_C_UpdateRocketsDodged__DelegateSignature) == 0x000004, "Wrong alignment on DodgeAbility_C_UpdateRocketsDodged__DelegateSignature");
static_assert(sizeof(DodgeAbility_C_UpdateRocketsDodged__DelegateSignature) == 0x000004, "Wrong size on DodgeAbility_C_UpdateRocketsDodged__DelegateSignature");
static_assert(offsetof(DodgeAbility_C_UpdateRocketsDodged__DelegateSignature, RocketsDodged) == 0x000000, "Member 'DodgeAbility_C_UpdateRocketsDodged__DelegateSignature::RocketsDodged' has a wrong offset!");

// Function DodgeAbility.DodgeAbility_C.ExecuteUbergraph_DodgeAbility
// 0x02A0 (0x02A0 - 0x0000)
struct DodgeAbility_C_ExecuteUbergraph_DodgeAbility final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24FB[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0028(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_HasAuthority_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_HasAuthority_ReturnValue_1;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24FC[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AMarinerCharacter*                      CallFunc_GetOwningCharacterFromActorInfo_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDodgeLaunchVelocity_ReturnValue;       // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24FD[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItem_NinjaHeadband_ItemAbility_C*      CallFunc_GetNinjaHeadbandAbility_NinjaHeadbandAbility; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNinjaHeadbandAbility_CastSuccess;      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24FE[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, float>                      K2Node_Event_Map;                                  // 0x0060(0x0050)(ConstParm, ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Map_Find_Value;                           // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24FF[0x3];                                     // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMarinerCharacter*                      CallFunc_GetOwningCharacterFromActorInfo_ReturnValue_1; // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	class UMarinerAbilitySystemComponent*         CallFunc_GetOwningAbilitySystemComponent_ReturnValue; // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UClass*                           CallFunc_GetCooldownGameplayEffectType_ReturnValue; // 0x0100(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2500[0x2];                                     // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AMarinerFastArenaBounds*>        CallFunc_GetAllActorsOfClass_OutActors;            // 0x0110(0x0010)(ZeroConstructor, ReferenceParm)
	class AMarinerFastArenaBounds*                CallFunc_Array_Get_Item;                           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2501[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMarinerCharacter*                      CallFunc_GetOwningCharacterFromActorInfo_ReturnValue_2; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityActorInfo              K2Node_Event_ActorInfo_1;                          // 0x0138(0x0040)(ContainsInstancedReference)
	bool                                          K2Node_Event_WasCancelled;                         // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2502[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterAbilityInterface_C> K2Node_DynamicCast_AsCharacter_Ability_Interface;  // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2503[0x7];                                     // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0198(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UMarinerDamageableComponent* RelevantDamageableComponent, class AMarinerPlayerState* MegablastInstigator, bool bEnteredState)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x01A0(0x0010)(ZeroConstructor, NoDestructor)
	class AMarinerCharacter*                      CallFunc_GetAvatarCharacterFromActorInfo_ReturnValue; // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMarinerCharacter*                      CallFunc_GetOwningCharacterFromActorInfo_ReturnValue_3; // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerDamageableComponent*            CallFunc_BP_GetDamageableComponent_ReturnValue;    // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UMarinerDamageableComponent*      K2Node_CustomEvent_RelevantDamageableComponent;    // 0x01C8(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AMarinerPlayerState*              K2Node_CustomEvent_MegablastInstigator;            // 0x01D0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bEnteredState;                  // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2504[0x7];                                     // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              K2Node_Event_ActorInfo;                            // 0x01E0(0x0040)(ContainsInstancedReference)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2505[0x7];                                     // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerCharacterMovement*              CallFunc_GetOwningMovementComponent_ReturnValue;   // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0230(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerCharacterMovement*              CallFunc_GetOwningMovementComponent_ReturnValue_1; // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Map_Find_Value_1;                         // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMarinerInputActions                          K2Node_Event_InputType;                            // 0x0245(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputEvent                                   K2Node_Event_EventType;                            // 0x0246(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2506[0x1];                                     // 0x0247(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_2;                              // 0x0248(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2507[0x2];                                     // 0x0252(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Map_Find_Value_2;                         // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x025A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x025B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2508[0x3];                                     // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBuildShipping_ReturnValue;              // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2509[0x3];                                     // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0284(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_250A[0x4];                                     // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0298(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility) == 0x000008, "Wrong alignment on DodgeAbility_C_ExecuteUbergraph_DodgeAbility");
static_assert(sizeof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility) == 0x0002A0, "Wrong size on DodgeAbility_C_ExecuteUbergraph_DodgeAbility");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, EntryPoint) == 0x000000, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::EntryPoint' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, Temp_string_Variable) == 0x000008, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, Temp_name_Variable) == 0x000028, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_BP_HasAuthority_ReturnValue) == 0x000030, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_BP_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_BP_HasAuthority_ReturnValue_1) == 0x000031, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_BP_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_GetOwningCharacterFromActorInfo_ReturnValue) == 0x000038, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_GetOwningCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_GetDodgeLaunchVelocity_ReturnValue) == 0x000040, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_GetDodgeLaunchVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_GetNinjaHeadbandAbility_NinjaHeadbandAbility) == 0x000050, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_GetNinjaHeadbandAbility_NinjaHeadbandAbility' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_GetNinjaHeadbandAbility_CastSuccess) == 0x000058, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_GetNinjaHeadbandAbility_CastSuccess' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, K2Node_Event_Map) == 0x000060, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::K2Node_Event_Map' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000B0, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_Map_Find_Value) == 0x0000C0, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_Map_Find_ReturnValue) == 0x0000C4, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000C8, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, Temp_string_Variable_1) == 0x0000D0, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_GetOwningCharacterFromActorInfo_ReturnValue_1) == 0x0000E0, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_GetOwningCharacterFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000E8, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_GetOwningAbilitySystemComponent_ReturnValue) == 0x0000F8, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_GetOwningAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_GetCooldownGameplayEffectType_ReturnValue) == 0x000100, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_GetCooldownGameplayEffectType_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000108, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_Not_PreBool_ReturnValue) == 0x00010C, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_BooleanAND_ReturnValue) == 0x00010D, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_GetAllActorsOfClass_OutActors) == 0x000110, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_Array_Get_Item) == 0x000120, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, Temp_bool_Variable) == 0x000128, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_GetOwningCharacterFromActorInfo_ReturnValue_2) == 0x000130, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_GetOwningCharacterFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, K2Node_Event_ActorInfo_1) == 0x000138, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::K2Node_Event_ActorInfo_1' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, K2Node_Event_WasCancelled) == 0x000178, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::K2Node_Event_WasCancelled' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, K2Node_DynamicCast_AsCharacter_Ability_Interface) == 0x000180, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::K2Node_DynamicCast_AsCharacter_Ability_Interface' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, K2Node_DynamicCast_bSuccess) == 0x000190, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000198, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001A0, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_GetAvatarCharacterFromActorInfo_ReturnValue) == 0x0001B0, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_GetAvatarCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_GetOwningCharacterFromActorInfo_ReturnValue_3) == 0x0001B8, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_GetOwningCharacterFromActorInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_BP_GetDamageableComponent_ReturnValue) == 0x0001C0, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_BP_GetDamageableComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, K2Node_CustomEvent_RelevantDamageableComponent) == 0x0001C8, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::K2Node_CustomEvent_RelevantDamageableComponent' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, K2Node_CustomEvent_MegablastInstigator) == 0x0001D0, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::K2Node_CustomEvent_MegablastInstigator' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, K2Node_CustomEvent_bEnteredState) == 0x0001D8, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::K2Node_CustomEvent_bEnteredState' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, K2Node_Event_ActorInfo) == 0x0001E0, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::K2Node_Event_ActorInfo' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_IsActive_ReturnValue) == 0x000220, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_GetOwningMovementComponent_ReturnValue) == 0x000228, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_GetOwningMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, Temp_name_Variable_1) == 0x000230, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_GetOwningMovementComponent_ReturnValue_1) == 0x000238, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_GetOwningMovementComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_Map_Find_Value_1) == 0x000240, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_Map_Find_ReturnValue_1) == 0x000244, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, K2Node_Event_InputType) == 0x000245, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::K2Node_Event_InputType' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, K2Node_Event_EventType) == 0x000246, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::K2Node_Event_EventType' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, Temp_name_Variable_2) == 0x000248, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000250, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000251, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_Map_Find_Value_2) == 0x000254, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_Map_Find_ReturnValue_2) == 0x000258, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_BooleanAND_ReturnValue_1) == 0x000259, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_Not_PreBool_ReturnValue_1) == 0x00025A, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_HasAuthority_ReturnValue) == 0x00025B, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_Not_PreBool_ReturnValue_2) == 0x00025C, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, K2Node_Select_Default) == 0x000260, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_Concat_StrStr_ReturnValue) == 0x000270, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_IsBuildShipping_ReturnValue) == 0x000280, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_IsBuildShipping_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, K2Node_CreateDelegate_OutputDelegate_4) == 0x000284, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_ExecuteUbergraph_DodgeAbility, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x000298, "Member 'DodgeAbility_C_ExecuteUbergraph_DodgeAbility::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");

// Function DodgeAbility.DodgeAbility_C.BP_OnAnyInputReceived
// 0x0002 (0x0002 - 0x0000)
struct DodgeAbility_C_BP_OnAnyInputReceived final
{
public:
	EMarinerInputActions                          InputType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputEvent                                   EventType;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DodgeAbility_C_BP_OnAnyInputReceived) == 0x000001, "Wrong alignment on DodgeAbility_C_BP_OnAnyInputReceived");
static_assert(sizeof(DodgeAbility_C_BP_OnAnyInputReceived) == 0x000002, "Wrong size on DodgeAbility_C_BP_OnAnyInputReceived");
static_assert(offsetof(DodgeAbility_C_BP_OnAnyInputReceived, InputType) == 0x000000, "Member 'DodgeAbility_C_BP_OnAnyInputReceived::InputType' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_BP_OnAnyInputReceived, EventType) == 0x000001, "Member 'DodgeAbility_C_BP_OnAnyInputReceived::EventType' has a wrong offset!");

// Function DodgeAbility.DodgeAbility_C.BP_OnAbilityActivated
// 0x0040 (0x0040 - 0x0000)
struct DodgeAbility_C_BP_OnAbilityActivated final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(DodgeAbility_C_BP_OnAbilityActivated) == 0x000008, "Wrong alignment on DodgeAbility_C_BP_OnAbilityActivated");
static_assert(sizeof(DodgeAbility_C_BP_OnAbilityActivated) == 0x000040, "Wrong size on DodgeAbility_C_BP_OnAbilityActivated");
static_assert(offsetof(DodgeAbility_C_BP_OnAbilityActivated, ActorInfo) == 0x000000, "Member 'DodgeAbility_C_BP_OnAbilityActivated::ActorInfo' has a wrong offset!");

// Function DodgeAbility.DodgeAbility_C.OnMegablastStateChangedOwner
// 0x0018 (0x0018 - 0x0000)
struct DodgeAbility_C_OnMegablastStateChangedOwner final
{
public:
	const class UMarinerDamageableComponent*      RelevantDamageableComponent;                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AMarinerPlayerState*              MegablastInstigator;                               // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnteredState;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DodgeAbility_C_OnMegablastStateChangedOwner) == 0x000008, "Wrong alignment on DodgeAbility_C_OnMegablastStateChangedOwner");
static_assert(sizeof(DodgeAbility_C_OnMegablastStateChangedOwner) == 0x000018, "Wrong size on DodgeAbility_C_OnMegablastStateChangedOwner");
static_assert(offsetof(DodgeAbility_C_OnMegablastStateChangedOwner, RelevantDamageableComponent) == 0x000000, "Member 'DodgeAbility_C_OnMegablastStateChangedOwner::RelevantDamageableComponent' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_OnMegablastStateChangedOwner, MegablastInstigator) == 0x000008, "Member 'DodgeAbility_C_OnMegablastStateChangedOwner::MegablastInstigator' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_OnMegablastStateChangedOwner, bEnteredState) == 0x000010, "Member 'DodgeAbility_C_OnMegablastStateChangedOwner::bEnteredState' has a wrong offset!");

// Function DodgeAbility.DodgeAbility_C.BP_OnAbilityEnded
// 0x0048 (0x0048 - 0x0000)
struct DodgeAbility_C_BP_OnAbilityEnded final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	bool                                          WasCancelled;                                      // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DodgeAbility_C_BP_OnAbilityEnded) == 0x000008, "Wrong alignment on DodgeAbility_C_BP_OnAbilityEnded");
static_assert(sizeof(DodgeAbility_C_BP_OnAbilityEnded) == 0x000048, "Wrong size on DodgeAbility_C_BP_OnAbilityEnded");
static_assert(offsetof(DodgeAbility_C_BP_OnAbilityEnded, ActorInfo) == 0x000000, "Member 'DodgeAbility_C_BP_OnAbilityEnded::ActorInfo' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_BP_OnAbilityEnded, WasCancelled) == 0x000040, "Member 'DodgeAbility_C_BP_OnAbilityEnded::WasCancelled' has a wrong offset!");

// Function DodgeAbility.DodgeAbility_C.ProcessArtifactData
// 0x0050 (0x0050 - 0x0000)
struct DodgeAbility_C_ProcessArtifactData final
{
public:
	TMap<class FName, float>                      Map;                                               // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(DodgeAbility_C_ProcessArtifactData) == 0x000008, "Wrong alignment on DodgeAbility_C_ProcessArtifactData");
static_assert(sizeof(DodgeAbility_C_ProcessArtifactData) == 0x000050, "Wrong size on DodgeAbility_C_ProcessArtifactData");
static_assert(offsetof(DodgeAbility_C_ProcessArtifactData, Map) == 0x000000, "Member 'DodgeAbility_C_ProcessArtifactData::Map' has a wrong offset!");

// Function DodgeAbility.DodgeAbility_C.GetOwningController
// 0x0040 (0x0040 - 0x0000)
struct DodgeAbility_C_GetOwningController final
{
public:
	class AMarinerPlayerController*               OwningControlller;                                 // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_250B[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMarinerCharacter*                      K2Node_DynamicCast_AsMariner_Character;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_250C[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMarinerPlayerController*               K2Node_DynamicCast_AsMariner_Player_Controller;    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DodgeAbility_C_GetOwningController) == 0x000008, "Wrong alignment on DodgeAbility_C_GetOwningController");
static_assert(sizeof(DodgeAbility_C_GetOwningController) == 0x000040, "Wrong size on DodgeAbility_C_GetOwningController");
static_assert(offsetof(DodgeAbility_C_GetOwningController, OwningControlller) == 0x000000, "Member 'DodgeAbility_C_GetOwningController::OwningControlller' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetOwningController, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'DodgeAbility_C_GetOwningController::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetOwningController, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000010, "Member 'DodgeAbility_C_GetOwningController::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetOwningController, K2Node_DynamicCast_AsMariner_Character) == 0x000018, "Member 'DodgeAbility_C_GetOwningController::K2Node_DynamicCast_AsMariner_Character' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetOwningController, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'DodgeAbility_C_GetOwningController::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetOwningController, CallFunc_GetController_ReturnValue) == 0x000028, "Member 'DodgeAbility_C_GetOwningController::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetOwningController, K2Node_DynamicCast_AsMariner_Player_Controller) == 0x000030, "Member 'DodgeAbility_C_GetOwningController::K2Node_DynamicCast_AsMariner_Player_Controller' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetOwningController, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'DodgeAbility_C_GetOwningController::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function DodgeAbility.DodgeAbility_C.GetNormalizedAcceleration
// 0x0030 (0x0030 - 0x0000)
struct DodgeAbility_C_GetNormalizedAcceleration final
{
public:
	struct FVector                                Acceleration;                                      // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_250D[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMarinerCharacter*                      CallFunc_GetOwningCharacterFromActorInfo_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCurrentAcceleration_ReturnValue;       // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DodgeAbility_C_GetNormalizedAcceleration) == 0x000008, "Wrong alignment on DodgeAbility_C_GetNormalizedAcceleration");
static_assert(sizeof(DodgeAbility_C_GetNormalizedAcceleration) == 0x000030, "Wrong size on DodgeAbility_C_GetNormalizedAcceleration");
static_assert(offsetof(DodgeAbility_C_GetNormalizedAcceleration, Acceleration) == 0x000000, "Member 'DodgeAbility_C_GetNormalizedAcceleration::Acceleration' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetNormalizedAcceleration, CallFunc_GetOwningCharacterFromActorInfo_ReturnValue) == 0x000010, "Member 'DodgeAbility_C_GetNormalizedAcceleration::CallFunc_GetOwningCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetNormalizedAcceleration, CallFunc_GetCurrentAcceleration_ReturnValue) == 0x000018, "Member 'DodgeAbility_C_GetNormalizedAcceleration::CallFunc_GetCurrentAcceleration_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetNormalizedAcceleration, CallFunc_Normal_ReturnValue) == 0x000024, "Member 'DodgeAbility_C_GetNormalizedAcceleration::CallFunc_Normal_ReturnValue' has a wrong offset!");

// Function DodgeAbility.DodgeAbility_C.GetDodgeStrength
// 0x0028 (0x0028 - 0x0000)
struct DodgeAbility_C_GetDodgeStrength final
{
public:
	float                                         Param_DodgeStrength;                               // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TempStrength;                                      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_250E[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItem_NinjaHeadband_ItemAbility_C*      CallFunc_GetNinjaHeadbandAbility_NinjaHeadbandAbility; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNinjaHeadbandAbility_CastSuccess;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_250F[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DodgeAbility_C_GetDodgeStrength) == 0x000008, "Wrong alignment on DodgeAbility_C_GetDodgeStrength");
static_assert(sizeof(DodgeAbility_C_GetDodgeStrength) == 0x000028, "Wrong size on DodgeAbility_C_GetDodgeStrength");
static_assert(offsetof(DodgeAbility_C_GetDodgeStrength, Param_DodgeStrength) == 0x000000, "Member 'DodgeAbility_C_GetDodgeStrength::Param_DodgeStrength' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeStrength, TempStrength) == 0x000004, "Member 'DodgeAbility_C_GetDodgeStrength::TempStrength' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeStrength, Temp_bool_Variable) == 0x000008, "Member 'DodgeAbility_C_GetDodgeStrength::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeStrength, CallFunc_GetNinjaHeadbandAbility_NinjaHeadbandAbility) == 0x000010, "Member 'DodgeAbility_C_GetDodgeStrength::CallFunc_GetNinjaHeadbandAbility_NinjaHeadbandAbility' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeStrength, CallFunc_GetNinjaHeadbandAbility_CastSuccess) == 0x000018, "Member 'DodgeAbility_C_GetDodgeStrength::CallFunc_GetNinjaHeadbandAbility_CastSuccess' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeStrength, K2Node_Select_Default) == 0x00001C, "Member 'DodgeAbility_C_GetDodgeStrength::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeStrength, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000020, "Member 'DodgeAbility_C_GetDodgeStrength::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function DodgeAbility.DodgeAbility_C.GetDodgeLaunchVelocity
// 0x0138 (0x0138 - 0x0000)
struct DodgeAbility_C_GetDodgeLaunchVelocity final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ChanceForBotToDodgeInPlace;                        // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDodgeInPlaceStrength_DodgeInPlaceDir;  // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetInputVector_InputVector;               // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_AntiSelfKOLaunchModifier_AdjustedDodge;   // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2510[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_CalculateDirectionalLaunchVector_LaunchVector; // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDodgeInPlaceStrength_DodgeInPlaceDir_1; // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMarinerGameplayAbilityTargetData_Aim  CallFunc_GetAimData_ReturnValue;                   // 0x0050(0x0050)(ConstParm)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_AntiSelfKOLaunchModifier_AdjustedDodge_1; // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue_1;    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2511[0x3];                                     // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x00BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2512[0x3];                                     // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Normal2D_ReturnValue;                     // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue;        // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDodgeMinLaunchAngle_MinLaunchAngle;    // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDodgeStrength_DodgeStrength;           // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2513[0x4];                                     // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMarinerCharacter*                      CallFunc_GetOwningCharacterFromActorInfo_ReturnValue; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_AntiSelfKOLaunchModifier_AdjustedDodge_2; // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DodgeAbility_C_GetDodgeLaunchVelocity) == 0x000008, "Wrong alignment on DodgeAbility_C_GetDodgeLaunchVelocity");
static_assert(sizeof(DodgeAbility_C_GetDodgeLaunchVelocity) == 0x000138, "Wrong size on DodgeAbility_C_GetDodgeLaunchVelocity");
static_assert(offsetof(DodgeAbility_C_GetDodgeLaunchVelocity, ReturnValue) == 0x000000, "Member 'DodgeAbility_C_GetDodgeLaunchVelocity::ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeLaunchVelocity, ChanceForBotToDodgeInPlace) == 0x00000C, "Member 'DodgeAbility_C_GetDodgeLaunchVelocity::ChanceForBotToDodgeInPlace' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeLaunchVelocity, CallFunc_GetDodgeInPlaceStrength_DodgeInPlaceDir) == 0x000010, "Member 'DodgeAbility_C_GetDodgeLaunchVelocity::CallFunc_GetDodgeInPlaceStrength_DodgeInPlaceDir' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeLaunchVelocity, CallFunc_GetInputVector_InputVector) == 0x00001C, "Member 'DodgeAbility_C_GetDodgeLaunchVelocity::CallFunc_GetInputVector_InputVector' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeLaunchVelocity, CallFunc_AntiSelfKOLaunchModifier_AdjustedDodge) == 0x000028, "Member 'DodgeAbility_C_GetDodgeLaunchVelocity::CallFunc_AntiSelfKOLaunchModifier_AdjustedDodge' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeLaunchVelocity, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x000034, "Member 'DodgeAbility_C_GetDodgeLaunchVelocity::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeLaunchVelocity, CallFunc_CalculateDirectionalLaunchVector_LaunchVector) == 0x000038, "Member 'DodgeAbility_C_GetDodgeLaunchVelocity::CallFunc_CalculateDirectionalLaunchVector_LaunchVector' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeLaunchVelocity, CallFunc_GetDodgeInPlaceStrength_DodgeInPlaceDir_1) == 0x000044, "Member 'DodgeAbility_C_GetDodgeLaunchVelocity::CallFunc_GetDodgeInPlaceStrength_DodgeInPlaceDir_1' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeLaunchVelocity, CallFunc_GetAimData_ReturnValue) == 0x000050, "Member 'DodgeAbility_C_GetDodgeLaunchVelocity::CallFunc_GetAimData_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeLaunchVelocity, CallFunc_Normal_ReturnValue) == 0x0000A0, "Member 'DodgeAbility_C_GetDodgeLaunchVelocity::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeLaunchVelocity, CallFunc_AntiSelfKOLaunchModifier_AdjustedDodge_1) == 0x0000AC, "Member 'DodgeAbility_C_GetDodgeLaunchVelocity::CallFunc_AntiSelfKOLaunchModifier_AdjustedDodge_1' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeLaunchVelocity, CallFunc_EqualEqual_VectorVector_ReturnValue_1) == 0x0000B8, "Member 'DodgeAbility_C_GetDodgeLaunchVelocity::CallFunc_EqualEqual_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeLaunchVelocity, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x0000BC, "Member 'DodgeAbility_C_GetDodgeLaunchVelocity::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeLaunchVelocity, Temp_bool_Variable) == 0x0000C4, "Member 'DodgeAbility_C_GetDodgeLaunchVelocity::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeLaunchVelocity, CallFunc_Normal2D_ReturnValue) == 0x0000C8, "Member 'DodgeAbility_C_GetDodgeLaunchVelocity::CallFunc_Normal2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeLaunchVelocity, CallFunc_Conv_Vector2DToVector_ReturnValue) == 0x0000D0, "Member 'DodgeAbility_C_GetDodgeLaunchVelocity::CallFunc_Conv_Vector2DToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeLaunchVelocity, CallFunc_GetDodgeMinLaunchAngle_MinLaunchAngle) == 0x0000DC, "Member 'DodgeAbility_C_GetDodgeLaunchVelocity::CallFunc_GetDodgeMinLaunchAngle_MinLaunchAngle' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeLaunchVelocity, CallFunc_GetDodgeStrength_DodgeStrength) == 0x0000E0, "Member 'DodgeAbility_C_GetDodgeLaunchVelocity::CallFunc_GetDodgeStrength_DodgeStrength' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeLaunchVelocity, CallFunc_GetOwningCharacterFromActorInfo_ReturnValue) == 0x0000E8, "Member 'DodgeAbility_C_GetDodgeLaunchVelocity::CallFunc_GetOwningCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeLaunchVelocity, CallFunc_GetActorUpVector_ReturnValue) == 0x0000F0, "Member 'DodgeAbility_C_GetDodgeLaunchVelocity::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeLaunchVelocity, CallFunc_Cross_VectorVector_ReturnValue) == 0x0000FC, "Member 'DodgeAbility_C_GetDodgeLaunchVelocity::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeLaunchVelocity, CallFunc_RotateAngleAxis_ReturnValue) == 0x000108, "Member 'DodgeAbility_C_GetDodgeLaunchVelocity::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeLaunchVelocity, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000114, "Member 'DodgeAbility_C_GetDodgeLaunchVelocity::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeLaunchVelocity, K2Node_Select_Default) == 0x000120, "Member 'DodgeAbility_C_GetDodgeLaunchVelocity::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeLaunchVelocity, CallFunc_AntiSelfKOLaunchModifier_AdjustedDodge_2) == 0x00012C, "Member 'DodgeAbility_C_GetDodgeLaunchVelocity::CallFunc_AntiSelfKOLaunchModifier_AdjustedDodge_2' has a wrong offset!");

// Function DodgeAbility.DodgeAbility_C.GetDodgeMinLaunchAngle
// 0x0028 (0x0028 - 0x0000)
struct DodgeAbility_C_GetDodgeMinLaunchAngle final
{
public:
	float                                         MinLaunchAngle;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2514[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2515[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItem_NinjaHeadband_ItemAbility_C*      CallFunc_GetNinjaHeadbandAbility_NinjaHeadbandAbility; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNinjaHeadbandAbility_CastSuccess;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2516[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DodgeAbility_C_GetDodgeMinLaunchAngle) == 0x000008, "Wrong alignment on DodgeAbility_C_GetDodgeMinLaunchAngle");
static_assert(sizeof(DodgeAbility_C_GetDodgeMinLaunchAngle) == 0x000028, "Wrong size on DodgeAbility_C_GetDodgeMinLaunchAngle");
static_assert(offsetof(DodgeAbility_C_GetDodgeMinLaunchAngle, MinLaunchAngle) == 0x000000, "Member 'DodgeAbility_C_GetDodgeMinLaunchAngle::MinLaunchAngle' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeMinLaunchAngle, Temp_bool_Variable) == 0x000004, "Member 'DodgeAbility_C_GetDodgeMinLaunchAngle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeMinLaunchAngle, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'DodgeAbility_C_GetDodgeMinLaunchAngle::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeMinLaunchAngle, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'DodgeAbility_C_GetDodgeMinLaunchAngle::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeMinLaunchAngle, CallFunc_GetNinjaHeadbandAbility_NinjaHeadbandAbility) == 0x000010, "Member 'DodgeAbility_C_GetDodgeMinLaunchAngle::CallFunc_GetNinjaHeadbandAbility_NinjaHeadbandAbility' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeMinLaunchAngle, CallFunc_GetNinjaHeadbandAbility_CastSuccess) == 0x000018, "Member 'DodgeAbility_C_GetDodgeMinLaunchAngle::CallFunc_GetNinjaHeadbandAbility_CastSuccess' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeMinLaunchAngle, K2Node_Select_Default) == 0x00001C, "Member 'DodgeAbility_C_GetDodgeMinLaunchAngle::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(DodgeAbility_C_GetDodgeMinLaunchAngle, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000020, "Member 'DodgeAbility_C_GetDodgeMinLaunchAngle::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function DodgeAbility.DodgeAbility_C.ApplyActiveEffects_MoveAffecting
