#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FireworkFX

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FireworkFX.FireworkFX_C
// 0x0060 (0x0290 - 0x0230)
class UFireworkFX_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PurchaseCompleteFireworks;                         // 0x0238(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Flash;                                             // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Particles1;                                        // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Particles2;                                        // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Radialraysvfx;                                     // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shock;                                             // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SingleParticle1;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SingleParticle2;                                   // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SingleParticle3;                                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOrderDetailsMessageBox_C*              OrderDetailsMessageBoxRef;                         // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          NewVar_0;                                          // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_FireworkFX(int32 EntryPoint);
	void Construct();
	void PlayAnim_();
	void WidgetAnimationEvt_PurchaseCompleteFireworks_K2Node_WidgetAnimationEvent_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FireworkFX_C">();
	}
	static class UFireworkFX_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFireworkFX_C>();
	}
};
static_assert(alignof(UFireworkFX_C) == 0x000008, "Wrong alignment on UFireworkFX_C");
static_assert(sizeof(UFireworkFX_C) == 0x000290, "Wrong size on UFireworkFX_C");
static_assert(offsetof(UFireworkFX_C, UberGraphFrame) == 0x000230, "Member 'UFireworkFX_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFireworkFX_C, PurchaseCompleteFireworks) == 0x000238, "Member 'UFireworkFX_C::PurchaseCompleteFireworks' has a wrong offset!");
static_assert(offsetof(UFireworkFX_C, Flash) == 0x000240, "Member 'UFireworkFX_C::Flash' has a wrong offset!");
static_assert(offsetof(UFireworkFX_C, Particles1) == 0x000248, "Member 'UFireworkFX_C::Particles1' has a wrong offset!");
static_assert(offsetof(UFireworkFX_C, Particles2) == 0x000250, "Member 'UFireworkFX_C::Particles2' has a wrong offset!");
static_assert(offsetof(UFireworkFX_C, Radialraysvfx) == 0x000258, "Member 'UFireworkFX_C::Radialraysvfx' has a wrong offset!");
static_assert(offsetof(UFireworkFX_C, Shock) == 0x000260, "Member 'UFireworkFX_C::Shock' has a wrong offset!");
static_assert(offsetof(UFireworkFX_C, SingleParticle1) == 0x000268, "Member 'UFireworkFX_C::SingleParticle1' has a wrong offset!");
static_assert(offsetof(UFireworkFX_C, SingleParticle2) == 0x000270, "Member 'UFireworkFX_C::SingleParticle2' has a wrong offset!");
static_assert(offsetof(UFireworkFX_C, SingleParticle3) == 0x000278, "Member 'UFireworkFX_C::SingleParticle3' has a wrong offset!");
static_assert(offsetof(UFireworkFX_C, OrderDetailsMessageBoxRef) == 0x000280, "Member 'UFireworkFX_C::OrderDetailsMessageBoxRef' has a wrong offset!");
static_assert(offsetof(UFireworkFX_C, NewVar_0) == 0x000288, "Member 'UFireworkFX_C::NewVar_0' has a wrong offset!");

}

