#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FLite

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "AkAudio_classes.hpp"


namespace SDK
{

// Class FLite.FLiteAudioActor
// 0x0008 (0x0220 - 0x0218)
class AFLiteAudioActor final : public AActor
{
public:
	class URawAudioComponent*                     AudioComponent;                                    // 0x0218(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FLiteAudioActor">();
	}
	static class AFLiteAudioActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFLiteAudioActor>();
	}
};
static_assert(alignof(AFLiteAudioActor) == 0x000008, "Wrong alignment on AFLiteAudioActor");
static_assert(sizeof(AFLiteAudioActor) == 0x000220, "Wrong size on AFLiteAudioActor");
static_assert(offsetof(AFLiteAudioActor, AudioComponent) == 0x000218, "Member 'AFLiteAudioActor::AudioComponent' has a wrong offset!");

// Class FLite.RawAudioComponent
// 0x0040 (0x0420 - 0x03E0)
class URawAudioComponent final : public UAkAudioInputComponent
{
public:
	uint8                                         Pad_3E0[0x40];                                     // 0x03E0(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RawAudioComponent">();
	}
	static class URawAudioComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<URawAudioComponent>();
	}
};
static_assert(alignof(URawAudioComponent) == 0x000010, "Wrong alignment on URawAudioComponent");
static_assert(sizeof(URawAudioComponent) == 0x000420, "Wrong size on URawAudioComponent");

}

