#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FriendWidget

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FriendWidget.FriendWidget_C
// 0x0038 (0x3720 - 0x36E8)
class UFriendWidget_C final : public UMarinerSocialWidget
{
public:
	class UWidgetAnimation*                       HoverAnim;                                         // 0x36E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x36F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Border;                                            // 0x36F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bound_GroupInviteImage;                            // 0x3700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerButton*                         ClickableArea;                                     // 0x3708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Material;                                          // 0x3710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x3718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FMarinerLayeredButtonAssets GetAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FriendWidget_C">();
	}
	static class UFriendWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFriendWidget_C>();
	}
};
static_assert(alignof(UFriendWidget_C) == 0x000008, "Wrong alignment on UFriendWidget_C");
static_assert(sizeof(UFriendWidget_C) == 0x003720, "Wrong size on UFriendWidget_C");
static_assert(offsetof(UFriendWidget_C, HoverAnim) == 0x0036E8, "Member 'UFriendWidget_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UFriendWidget_C, BG) == 0x0036F0, "Member 'UFriendWidget_C::BG' has a wrong offset!");
static_assert(offsetof(UFriendWidget_C, Border) == 0x0036F8, "Member 'UFriendWidget_C::Border' has a wrong offset!");
static_assert(offsetof(UFriendWidget_C, Bound_GroupInviteImage) == 0x003700, "Member 'UFriendWidget_C::Bound_GroupInviteImage' has a wrong offset!");
static_assert(offsetof(UFriendWidget_C, ClickableArea) == 0x003708, "Member 'UFriendWidget_C::ClickableArea' has a wrong offset!");
static_assert(offsetof(UFriendWidget_C, Material) == 0x003710, "Member 'UFriendWidget_C::Material' has a wrong offset!");
static_assert(offsetof(UFriendWidget_C, SizeBox_0) == 0x003718, "Member 'UFriendWidget_C::SizeBox_0' has a wrong offset!");

}

