#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FriendsPagedVerticalBox

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FriendsPagedVerticalBox.FriendsPagedVerticalBox_C
// 0x0020 (0x0408 - 0x03E8)
class UFriendsPagedVerticalBox_C final : public UMarinerFriendsPagedVerticalBox
{
public:
	class UFriendWidget_C*                        FriendWidget;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFriendWidget_C*                        FriendWidget_C_1;                                  // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFriendWidget_C*                        FriendWidget_C_2;                                  // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFriendWidget_C*                        FriendWidget_C_3;                                  // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FriendsPagedVerticalBox_C">();
	}
	static class UFriendsPagedVerticalBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFriendsPagedVerticalBox_C>();
	}
};
static_assert(alignof(UFriendsPagedVerticalBox_C) == 0x000008, "Wrong alignment on UFriendsPagedVerticalBox_C");
static_assert(sizeof(UFriendsPagedVerticalBox_C) == 0x000408, "Wrong size on UFriendsPagedVerticalBox_C");
static_assert(offsetof(UFriendsPagedVerticalBox_C, FriendWidget) == 0x0003E8, "Member 'UFriendsPagedVerticalBox_C::FriendWidget' has a wrong offset!");
static_assert(offsetof(UFriendsPagedVerticalBox_C, FriendWidget_C_1) == 0x0003F0, "Member 'UFriendsPagedVerticalBox_C::FriendWidget_C_1' has a wrong offset!");
static_assert(offsetof(UFriendsPagedVerticalBox_C, FriendWidget_C_2) == 0x0003F8, "Member 'UFriendsPagedVerticalBox_C::FriendWidget_C_2' has a wrong offset!");
static_assert(offsetof(UFriendsPagedVerticalBox_C, FriendWidget_C_3) == 0x000400, "Member 'UFriendsPagedVerticalBox_C::FriendWidget_C_3' has a wrong offset!");

}

