#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FrontEndMenuStack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MangoClient_structs.hpp"
#include "AkAudio_structs.hpp"
#include "InputCore_structs.hpp"
#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function FrontEndMenuStack.FrontEndMenuStack_C.ExecuteUbergraph_FrontEndMenuStack
// 0x04C8 (0x04C8 - 0x0000)
struct FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_242D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerAsyncUIFlowHandler*             CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsyncFlowItemPopups_C*                 K2Node_DynamicCast_AsAsync_Flow_Item_Popups;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_242E[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_242F[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0030(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(int32 NumUnviewedTotem, int32 NumUnviewedCharacter)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0050(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0060(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(struct FMangoBlastPassDefinition& Definition)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0080(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	EPlayerInputType                              Temp_byte_Variable;                                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2430[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          Temp_object_Variable;                              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable_1;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable_2;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable_3;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable_4;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UMarinerMenuStackButton*          K2Node_CustomEvent_ButtonInstance_3;               // 0x00C0(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_StackIndex_3;                   // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2431[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UMarinerMenuStackButton*          K2Node_CustomEvent_ButtonInstance_2;               // 0x00D0(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_StackIndex_2;                   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2432[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UMarinerMenuStackButton*          K2Node_CustomEvent_ButtonInstance_1;               // 0x00E0(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_StackIndex_1;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2433[0x4];                                     // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UMarinerMenuStackButton*          K2Node_CustomEvent_ButtonInstance;                 // 0x00F0(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_StackIndex;                     // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00FC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x010C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2434[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoPrivateMatchManager*              CallFunc_Get_ReturnValue_1;                        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMangoPrivateMatchManager*              CallFunc_Get_ReturnValue_2;                        // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0140(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0150(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UMarinerMenuStackButton* ButtonInstance, int32 StackIndex)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0160(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UMarinerMenuStackButton* ButtonInstance, int32 StackIndex)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0170(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UMarinerMenuStackButton* ButtonInstance, int32 StackIndex)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x0180(0x0010)(ZeroConstructor, NoDestructor)
	class UMangoInventoryManager*                 CallFunc_Get_ReturnValue_3;                        // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NumUnviewedTotem;               // 0x0198(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NumUnviewedCharacter;           // 0x019C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2435[0x6];                                     // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoInventoryManager*                 CallFunc_Get_ReturnValue_4;                        // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumOfUnviewedTotemItems_ReturnValue;   // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumOfUnviewedCharacterItems_ReturnValue; // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2436[0x6];                                     // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerAsyncUIFlowHandler*             CallFunc_Get_ReturnValue_5;                        // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMangoMatchmakingManager*               CallFunc_Get_ReturnValue_6;                        // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsyncFlowOnboarding_C*                 K2Node_DynamicCast_AsAsync_Flow_Onboarding;        // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2437[0x7];                                     // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerAsyncUIFlowHandler*             CallFunc_Get_ReturnValue_7;                        // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsyncFlowBlastPassSplash_C*            K2Node_DynamicCast_AsAsync_Flow_Blast_Pass_Splash; // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2438[0x3];                                     // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerAsyncUIFlowHandler*             CallFunc_Get_ReturnValue_8;                        // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMarinerMenuStackManagerSetup          K2Node_MakeStruct_MarinerMenuStackManagerSetup;    // 0x0208(0x0028)(NoDestructor, ContainsInstancedReference)
	class UAsyncFlowNewsSplash_C*                 K2Node_DynamicCast_AsAsync_Flow_News_Splash;       // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bToSubLayer;                          // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2439[0x6];                                     // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoMatchmakingManager*               CallFunc_Get_ReturnValue_9;                        // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFromSubMenu;                         // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bActive;                        // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_243A[0x6];                                     // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoBlastPassManager*                 CallFunc_Get_ReturnValue_10;                       // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMangoBlastPassDefinition              K2Node_CustomEvent_Definition;                     // 0x0258(0x0068)(ConstParm)
	class UMangoBlastPassManager*                 CallFunc_Get_ReturnValue_11;                       // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue;              // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerInputType                              CallFunc_GetActiveInputType_ReturnValue;           // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNarrationEnabled_ReturnValue;          // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_243B[0x6];                                     // 0x02D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          K2Node_Select_Default;                             // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerAsyncUIFlowHandler*             CallFunc_Get_ReturnValue_12;                       // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_243C[0x4];                                     // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncFlowAlerts_C*                     K2Node_DynamicCast_AsAsync_Flow_Alerts;            // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_243D[0x7];                                     // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoMatchmakingManager*               CallFunc_Get_ReturnValue_13;                       // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAbandonmentPenaltyWarningLevel_ReturnValue; // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAbandonmentPenaltyActive_ReturnValue;   // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_243E[0x3];                                     // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetAbandonmentWarningLevelText_Text;      // 0x0318(0x0018)()
	class UMarinerGameInstance*                   CallFunc_GetMarinerGameInstance_ReturnValue;       // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UMarinerMenuStackButton* ButtonInstance, int32 StackIndex)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x0338(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(struct FKey& KeyPressed)>      K2Node_CreateDelegate_OutputDelegate_12;           // 0x0348(0x0010)(ZeroConstructor, NoDestructor)
	struct FMarinerMessageBoxData                 K2Node_MakeStruct_MarinerMessageBoxData;           // 0x0358(0x0170)(ContainsInstancedReference)
};
static_assert(alignof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack) == 0x000008, "Wrong alignment on FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack");
static_assert(sizeof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack) == 0x0004C8, "Wrong size on FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, EntryPoint) == 0x000000, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::EntryPoint' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, CallFunc_Get_ReturnValue) == 0x000008, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_DynamicCast_AsAsync_Flow_Item_Popups) == 0x000010, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_DynamicCast_AsAsync_Flow_Item_Popups' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, Temp_struct_Variable) == 0x000030, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, Temp_delegate_Variable) == 0x000050, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, Temp_struct_Variable_1) == 0x000060, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_CreateDelegate_OutputDelegate_2) == 0x000070, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, Temp_delegate_Variable_1) == 0x000080, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, Temp_byte_Variable) == 0x000090, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, Temp_object_Variable) == 0x000098, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, Temp_object_Variable_1) == 0x0000A0, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, Temp_object_Variable_2) == 0x0000A8, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, Temp_object_Variable_3) == 0x0000B0, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, Temp_object_Variable_4) == 0x0000B8, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_CustomEvent_ButtonInstance_3) == 0x0000C0, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_CustomEvent_ButtonInstance_3' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_CustomEvent_StackIndex_3) == 0x0000C8, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_CustomEvent_StackIndex_3' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_CustomEvent_ButtonInstance_2) == 0x0000D0, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_CustomEvent_ButtonInstance_2' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_CustomEvent_StackIndex_2) == 0x0000D8, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_CustomEvent_StackIndex_2' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_CustomEvent_ButtonInstance_1) == 0x0000E0, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_CustomEvent_ButtonInstance_1' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_CustomEvent_StackIndex_1) == 0x0000E8, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_CustomEvent_StackIndex_1' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_CustomEvent_ButtonInstance) == 0x0000F0, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_CustomEvent_ButtonInstance' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_CustomEvent_StackIndex) == 0x0000F8, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_CustomEvent_StackIndex' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000FC, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_CreateDelegate_OutputDelegate_4) == 0x00010C, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, CallFunc_Get_ReturnValue_1) == 0x000120, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, CallFunc_Get_ReturnValue_2) == 0x000128, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::CallFunc_Get_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_CreateDelegate_OutputDelegate_5) == 0x000130, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_CreateDelegate_OutputDelegate_6) == 0x000140, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_CreateDelegate_OutputDelegate_7) == 0x000150, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_CreateDelegate_OutputDelegate_8) == 0x000160, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_CreateDelegate_OutputDelegate_9) == 0x000170, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_CreateDelegate_OutputDelegate_10) == 0x000180, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, CallFunc_Get_ReturnValue_3) == 0x000190, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::CallFunc_Get_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_CustomEvent_NumUnviewedTotem) == 0x000198, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_CustomEvent_NumUnviewedTotem' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_CustomEvent_NumUnviewedCharacter) == 0x00019C, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_CustomEvent_NumUnviewedCharacter' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, CallFunc_Greater_IntInt_ReturnValue) == 0x0001A0, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0001A1, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, CallFunc_Get_ReturnValue_4) == 0x0001A8, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::CallFunc_Get_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, CallFunc_GetNumOfUnviewedTotemItems_ReturnValue) == 0x0001B0, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::CallFunc_GetNumOfUnviewedTotemItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, CallFunc_GetNumOfUnviewedCharacterItems_ReturnValue) == 0x0001B4, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::CallFunc_GetNumOfUnviewedCharacterItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, CallFunc_Greater_IntInt_ReturnValue_2) == 0x0001B8, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, CallFunc_Greater_IntInt_ReturnValue_3) == 0x0001B9, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::CallFunc_Greater_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, CallFunc_Get_ReturnValue_5) == 0x0001C0, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::CallFunc_Get_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, CallFunc_Get_ReturnValue_6) == 0x0001C8, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::CallFunc_Get_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_DynamicCast_AsAsync_Flow_Onboarding) == 0x0001D0, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_DynamicCast_AsAsync_Flow_Onboarding' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_DynamicCast_bSuccess_1) == 0x0001D8, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, CallFunc_Get_ReturnValue_7) == 0x0001E0, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::CallFunc_Get_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, CallFunc_GetOwningPlayer_ReturnValue) == 0x0001E8, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_DynamicCast_AsAsync_Flow_Blast_Pass_Splash) == 0x0001F0, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_DynamicCast_AsAsync_Flow_Blast_Pass_Splash' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_DynamicCast_bSuccess_2) == 0x0001F8, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, CallFunc_PostEvent_ReturnValue) == 0x0001FC, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, CallFunc_Get_ReturnValue_8) == 0x000200, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::CallFunc_Get_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_MakeStruct_MarinerMenuStackManagerSetup) == 0x000208, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_MakeStruct_MarinerMenuStackManagerSetup' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_DynamicCast_AsAsync_Flow_News_Splash) == 0x000230, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_DynamicCast_AsAsync_Flow_News_Splash' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_DynamicCast_bSuccess_3) == 0x000238, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_Event_bToSubLayer) == 0x000239, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_Event_bToSubLayer' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, CallFunc_Get_ReturnValue_9) == 0x000240, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::CallFunc_Get_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_Event_bFromSubMenu) == 0x000248, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_Event_bFromSubMenu' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_CustomEvent_bActive) == 0x000249, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_CustomEvent_bActive' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, CallFunc_Get_ReturnValue_10) == 0x000250, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::CallFunc_Get_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_CustomEvent_Definition) == 0x000258, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_CustomEvent_Definition' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, CallFunc_Get_ReturnValue_11) == 0x0002C0, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::CallFunc_Get_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, CallFunc_GetUserSettings_ReturnValue) == 0x0002C8, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::CallFunc_GetUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, CallFunc_GetActiveInputType_ReturnValue) == 0x0002D0, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::CallFunc_GetActiveInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, CallFunc_GetNarrationEnabled_ReturnValue) == 0x0002D1, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::CallFunc_GetNarrationEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_Select_Default) == 0x0002D8, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x0002E0, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, CallFunc_Get_ReturnValue_12) == 0x0002E8, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::CallFunc_Get_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, CallFunc_PostEvent_ReturnValue_1) == 0x0002F0, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_DynamicCast_AsAsync_Flow_Alerts) == 0x0002F8, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_DynamicCast_AsAsync_Flow_Alerts' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_DynamicCast_bSuccess_4) == 0x000300, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, CallFunc_Get_ReturnValue_13) == 0x000308, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::CallFunc_Get_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, CallFunc_GetAbandonmentPenaltyWarningLevel_ReturnValue) == 0x000310, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::CallFunc_GetAbandonmentPenaltyWarningLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, CallFunc_IsAbandonmentPenaltyActive_ReturnValue) == 0x000314, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::CallFunc_IsAbandonmentPenaltyActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, CallFunc_GetAbandonmentWarningLevelText_Text) == 0x000318, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::CallFunc_GetAbandonmentWarningLevelText_Text' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, CallFunc_GetMarinerGameInstance_ReturnValue) == 0x000330, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::CallFunc_GetMarinerGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_CreateDelegate_OutputDelegate_11) == 0x000338, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_CreateDelegate_OutputDelegate_12) == 0x000348, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack, K2Node_MakeStruct_MarinerMessageBoxData) == 0x000358, "Member 'FrontEndMenuStack_C_ExecuteUbergraph_FrontEndMenuStack::K2Node_MakeStruct_MarinerMessageBoxData' has a wrong offset!");

// Function FrontEndMenuStack.FrontEndMenuStack_C.OnSeasonUpdate
// 0x0068 (0x0068 - 0x0000)
struct FrontEndMenuStack_C_OnSeasonUpdate final
{
public:
	struct FMangoBlastPassDefinition              Definition;                                        // 0x0000(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(FrontEndMenuStack_C_OnSeasonUpdate) == 0x000008, "Wrong alignment on FrontEndMenuStack_C_OnSeasonUpdate");
static_assert(sizeof(FrontEndMenuStack_C_OnSeasonUpdate) == 0x000068, "Wrong size on FrontEndMenuStack_C_OnSeasonUpdate");
static_assert(offsetof(FrontEndMenuStack_C_OnSeasonUpdate, Definition) == 0x000000, "Member 'FrontEndMenuStack_C_OnSeasonUpdate::Definition' has a wrong offset!");

// Function FrontEndMenuStack.FrontEndMenuStack_C.OnOnboardingActiveStateChanged
// 0x0001 (0x0001 - 0x0000)
struct FrontEndMenuStack_C_OnOnboardingActiveStateChanged final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FrontEndMenuStack_C_OnOnboardingActiveStateChanged) == 0x000001, "Wrong alignment on FrontEndMenuStack_C_OnOnboardingActiveStateChanged");
static_assert(sizeof(FrontEndMenuStack_C_OnOnboardingActiveStateChanged) == 0x000001, "Wrong size on FrontEndMenuStack_C_OnOnboardingActiveStateChanged");
static_assert(offsetof(FrontEndMenuStack_C_OnOnboardingActiveStateChanged, bActive) == 0x000000, "Member 'FrontEndMenuStack_C_OnOnboardingActiveStateChanged::bActive' has a wrong offset!");

// Function FrontEndMenuStack.FrontEndMenuStack_C.BP_OnEntered
// 0x0001 (0x0001 - 0x0000)
struct FrontEndMenuStack_C_BP_OnEntered final
{
public:
	bool                                          bFromSubMenu;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FrontEndMenuStack_C_BP_OnEntered) == 0x000001, "Wrong alignment on FrontEndMenuStack_C_BP_OnEntered");
static_assert(sizeof(FrontEndMenuStack_C_BP_OnEntered) == 0x000001, "Wrong size on FrontEndMenuStack_C_BP_OnEntered");
static_assert(offsetof(FrontEndMenuStack_C_BP_OnEntered, bFromSubMenu) == 0x000000, "Member 'FrontEndMenuStack_C_BP_OnEntered::bFromSubMenu' has a wrong offset!");

// Function FrontEndMenuStack.FrontEndMenuStack_C.BP_OnExited
// 0x0001 (0x0001 - 0x0000)
struct FrontEndMenuStack_C_BP_OnExited final
{
public:
	bool                                          bToSubLayer;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FrontEndMenuStack_C_BP_OnExited) == 0x000001, "Wrong alignment on FrontEndMenuStack_C_BP_OnExited");
static_assert(sizeof(FrontEndMenuStack_C_BP_OnExited) == 0x000001, "Wrong size on FrontEndMenuStack_C_BP_OnExited");
static_assert(offsetof(FrontEndMenuStack_C_BP_OnExited, bToSubLayer) == 0x000000, "Member 'FrontEndMenuStack_C_BP_OnExited::bToSubLayer' has a wrong offset!");

// Function FrontEndMenuStack.FrontEndMenuStack_C.OnUnviewedItemsCalculated
// 0x0008 (0x0008 - 0x0000)
struct FrontEndMenuStack_C_OnUnviewedItemsCalculated final
{
public:
	int32                                         NumUnviewedTotem;                                  // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumUnviewedCharacter;                              // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontEndMenuStack_C_OnUnviewedItemsCalculated) == 0x000004, "Wrong alignment on FrontEndMenuStack_C_OnUnviewedItemsCalculated");
static_assert(sizeof(FrontEndMenuStack_C_OnUnviewedItemsCalculated) == 0x000008, "Wrong size on FrontEndMenuStack_C_OnUnviewedItemsCalculated");
static_assert(offsetof(FrontEndMenuStack_C_OnUnviewedItemsCalculated, NumUnviewedTotem) == 0x000000, "Member 'FrontEndMenuStack_C_OnUnviewedItemsCalculated::NumUnviewedTotem' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_OnUnviewedItemsCalculated, NumUnviewedCharacter) == 0x000004, "Member 'FrontEndMenuStack_C_OnUnviewedItemsCalculated::NumUnviewedCharacter' has a wrong offset!");

// Function FrontEndMenuStack.FrontEndMenuStack_C.StackSwitchedFrom
// 0x0010 (0x0010 - 0x0000)
struct FrontEndMenuStack_C_StackSwitchedFrom final
{
public:
	const class UMarinerMenuStackButton*          ButtonInstance;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StackIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontEndMenuStack_C_StackSwitchedFrom) == 0x000008, "Wrong alignment on FrontEndMenuStack_C_StackSwitchedFrom");
static_assert(sizeof(FrontEndMenuStack_C_StackSwitchedFrom) == 0x000010, "Wrong size on FrontEndMenuStack_C_StackSwitchedFrom");
static_assert(offsetof(FrontEndMenuStack_C_StackSwitchedFrom, ButtonInstance) == 0x000000, "Member 'FrontEndMenuStack_C_StackSwitchedFrom::ButtonInstance' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_StackSwitchedFrom, StackIndex) == 0x000008, "Member 'FrontEndMenuStack_C_StackSwitchedFrom::StackIndex' has a wrong offset!");

// Function FrontEndMenuStack.FrontEndMenuStack_C.StackSwitchedTo
// 0x0010 (0x0010 - 0x0000)
struct FrontEndMenuStack_C_StackSwitchedTo final
{
public:
	const class UMarinerMenuStackButton*          ButtonInstance;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StackIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontEndMenuStack_C_StackSwitchedTo) == 0x000008, "Wrong alignment on FrontEndMenuStack_C_StackSwitchedTo");
static_assert(sizeof(FrontEndMenuStack_C_StackSwitchedTo) == 0x000010, "Wrong size on FrontEndMenuStack_C_StackSwitchedTo");
static_assert(offsetof(FrontEndMenuStack_C_StackSwitchedTo, ButtonInstance) == 0x000000, "Member 'FrontEndMenuStack_C_StackSwitchedTo::ButtonInstance' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_StackSwitchedTo, StackIndex) == 0x000008, "Member 'FrontEndMenuStack_C_StackSwitchedTo::StackIndex' has a wrong offset!");

// Function FrontEndMenuStack.FrontEndMenuStack_C.StackHidden
// 0x0010 (0x0010 - 0x0000)
struct FrontEndMenuStack_C_StackHidden final
{
public:
	const class UMarinerMenuStackButton*          ButtonInstance;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StackIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontEndMenuStack_C_StackHidden) == 0x000008, "Wrong alignment on FrontEndMenuStack_C_StackHidden");
static_assert(sizeof(FrontEndMenuStack_C_StackHidden) == 0x000010, "Wrong size on FrontEndMenuStack_C_StackHidden");
static_assert(offsetof(FrontEndMenuStack_C_StackHidden, ButtonInstance) == 0x000000, "Member 'FrontEndMenuStack_C_StackHidden::ButtonInstance' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_StackHidden, StackIndex) == 0x000008, "Member 'FrontEndMenuStack_C_StackHidden::StackIndex' has a wrong offset!");

// Function FrontEndMenuStack.FrontEndMenuStack_C.StackDisplayed
// 0x0010 (0x0010 - 0x0000)
struct FrontEndMenuStack_C_StackDisplayed final
{
public:
	const class UMarinerMenuStackButton*          ButtonInstance;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StackIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontEndMenuStack_C_StackDisplayed) == 0x000008, "Wrong alignment on FrontEndMenuStack_C_StackDisplayed");
static_assert(sizeof(FrontEndMenuStack_C_StackDisplayed) == 0x000010, "Wrong size on FrontEndMenuStack_C_StackDisplayed");
static_assert(offsetof(FrontEndMenuStack_C_StackDisplayed, ButtonInstance) == 0x000000, "Member 'FrontEndMenuStack_C_StackDisplayed::ButtonInstance' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_StackDisplayed, StackIndex) == 0x000008, "Member 'FrontEndMenuStack_C_StackDisplayed::StackIndex' has a wrong offset!");

// Function FrontEndMenuStack.FrontEndMenuStack_C.UpdateGameTabs
// 0x0048 (0x0048 - 0x0000)
struct FrontEndMenuStack_C_UpdateGameTabs final
{
public:
	bool                                          TabWasActive;                                      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActiveStackFromInstance_ReturnValue;    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActiveStackFromInstance_ReturnValue_1;  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisibleFromInstance_ReturnValue;        // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisibleFromInstance_ReturnValue_1;      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActiveStackFromInstance_ReturnValue_2;  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActiveStackFromInstance_ReturnValue_3;  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActiveStackFromInstance_ReturnValue_4;  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_243F[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoPrivateMatchManager*              CallFunc_Get_ReturnValue;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPrivateMatchSession_ReturnValue;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisibleFromInstance_ReturnValue_2;      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActiveStackFromInstance_ReturnValue_5;  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActiveStackFromInstance_ReturnValue_6;  // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActiveStackFromInstance_ReturnValue_7;  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActiveStackFromInstance_ReturnValue_8;  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActiveStackFromInstance_ReturnValue_9;  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2440[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoMatchmakingManager*               CallFunc_Get_ReturnValue_1;                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsIntermissionActive_ReturnValue;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActiveStackFromInstance_ReturnValue_10; // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActiveStackFromInstance_ReturnValue_11; // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2441[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoMatchmakingManager*               CallFunc_Get_ReturnValue_2;                        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisibleFromInstance_ReturnValue_3;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLastEndedReasonFoundMatch_ReturnValue;  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSearching_ReturnValue;                  // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActiveStackFromInstance_ReturnValue_12; // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_8;                  // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_9;                  // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FrontEndMenuStack_C_UpdateGameTabs) == 0x000008, "Wrong alignment on FrontEndMenuStack_C_UpdateGameTabs");
static_assert(sizeof(FrontEndMenuStack_C_UpdateGameTabs) == 0x000048, "Wrong size on FrontEndMenuStack_C_UpdateGameTabs");
static_assert(offsetof(FrontEndMenuStack_C_UpdateGameTabs, TabWasActive) == 0x000000, "Member 'FrontEndMenuStack_C_UpdateGameTabs::TabWasActive' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_UpdateGameTabs, CallFunc_IsActiveStackFromInstance_ReturnValue) == 0x000001, "Member 'FrontEndMenuStack_C_UpdateGameTabs::CallFunc_IsActiveStackFromInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_UpdateGameTabs, CallFunc_IsActiveStackFromInstance_ReturnValue_1) == 0x000002, "Member 'FrontEndMenuStack_C_UpdateGameTabs::CallFunc_IsActiveStackFromInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_UpdateGameTabs, CallFunc_IsVisibleFromInstance_ReturnValue) == 0x000003, "Member 'FrontEndMenuStack_C_UpdateGameTabs::CallFunc_IsVisibleFromInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_UpdateGameTabs, CallFunc_IsVisibleFromInstance_ReturnValue_1) == 0x000004, "Member 'FrontEndMenuStack_C_UpdateGameTabs::CallFunc_IsVisibleFromInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_UpdateGameTabs, CallFunc_IsActiveStackFromInstance_ReturnValue_2) == 0x000005, "Member 'FrontEndMenuStack_C_UpdateGameTabs::CallFunc_IsActiveStackFromInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_UpdateGameTabs, CallFunc_IsActiveStackFromInstance_ReturnValue_3) == 0x000006, "Member 'FrontEndMenuStack_C_UpdateGameTabs::CallFunc_IsActiveStackFromInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_UpdateGameTabs, CallFunc_BooleanOR_ReturnValue) == 0x000007, "Member 'FrontEndMenuStack_C_UpdateGameTabs::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_UpdateGameTabs, CallFunc_IsActiveStackFromInstance_ReturnValue_4) == 0x000008, "Member 'FrontEndMenuStack_C_UpdateGameTabs::CallFunc_IsActiveStackFromInstance_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_UpdateGameTabs, CallFunc_Get_ReturnValue) == 0x000010, "Member 'FrontEndMenuStack_C_UpdateGameTabs::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_UpdateGameTabs, CallFunc_IsPrivateMatchSession_ReturnValue) == 0x000018, "Member 'FrontEndMenuStack_C_UpdateGameTabs::CallFunc_IsPrivateMatchSession_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_UpdateGameTabs, CallFunc_IsVisibleFromInstance_ReturnValue_2) == 0x000019, "Member 'FrontEndMenuStack_C_UpdateGameTabs::CallFunc_IsVisibleFromInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_UpdateGameTabs, CallFunc_IsActiveStackFromInstance_ReturnValue_5) == 0x00001A, "Member 'FrontEndMenuStack_C_UpdateGameTabs::CallFunc_IsActiveStackFromInstance_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_UpdateGameTabs, CallFunc_IsActiveStackFromInstance_ReturnValue_6) == 0x00001B, "Member 'FrontEndMenuStack_C_UpdateGameTabs::CallFunc_IsActiveStackFromInstance_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_UpdateGameTabs, CallFunc_IsActiveStackFromInstance_ReturnValue_7) == 0x00001C, "Member 'FrontEndMenuStack_C_UpdateGameTabs::CallFunc_IsActiveStackFromInstance_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_UpdateGameTabs, CallFunc_IsActiveStackFromInstance_ReturnValue_8) == 0x00001D, "Member 'FrontEndMenuStack_C_UpdateGameTabs::CallFunc_IsActiveStackFromInstance_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_UpdateGameTabs, CallFunc_BooleanOR_ReturnValue_1) == 0x00001E, "Member 'FrontEndMenuStack_C_UpdateGameTabs::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_UpdateGameTabs, CallFunc_BooleanOR_ReturnValue_2) == 0x00001F, "Member 'FrontEndMenuStack_C_UpdateGameTabs::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_UpdateGameTabs, CallFunc_BooleanOR_ReturnValue_3) == 0x000020, "Member 'FrontEndMenuStack_C_UpdateGameTabs::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_UpdateGameTabs, CallFunc_IsActiveStackFromInstance_ReturnValue_9) == 0x000021, "Member 'FrontEndMenuStack_C_UpdateGameTabs::CallFunc_IsActiveStackFromInstance_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_UpdateGameTabs, CallFunc_Get_ReturnValue_1) == 0x000028, "Member 'FrontEndMenuStack_C_UpdateGameTabs::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_UpdateGameTabs, CallFunc_IsIntermissionActive_ReturnValue) == 0x000030, "Member 'FrontEndMenuStack_C_UpdateGameTabs::CallFunc_IsIntermissionActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndMenuStack_C_UpdateGameTabs, CallFunc_IsActiveStackFromInstance_ReturnValue_10) == 0x000031, "Member 'FrontEndMenuStack_C_UpdateGameTabs::CallFunc_IsActiveStackFromInstance_ReturnValue_10' has a wrong offset!");
