#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FrontEndDefaultStackBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FrontEndDefaultStackBase.FrontEndDefaultStackBase_C
// 0x0018 (0x0370 - 0x0358)
class UFrontEndDefaultStackBase_C final : public UMarinerMenuStackBaseWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStackManagerContentWidget_C*           MenuContent;                                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPromptBanner_C*                 NavPrompts;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_FrontEndDefaultStackBase(int32 EntryPoint);
	void BndEvt__BackButton_K2Node_ComponentBoundEvent_15_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_32_OnButtonClickedEvent__DelegateSignature();

	struct FMarinerMenuStackBaseWidgetSetup GetWidgetSetup() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FrontEndDefaultStackBase_C">();
	}
	static class UFrontEndDefaultStackBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFrontEndDefaultStackBase_C>();
	}
};
static_assert(alignof(UFrontEndDefaultStackBase_C) == 0x000008, "Wrong alignment on UFrontEndDefaultStackBase_C");
static_assert(sizeof(UFrontEndDefaultStackBase_C) == 0x000370, "Wrong size on UFrontEndDefaultStackBase_C");
static_assert(offsetof(UFrontEndDefaultStackBase_C, UberGraphFrame) == 0x000358, "Member 'UFrontEndDefaultStackBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFrontEndDefaultStackBase_C, MenuContent) == 0x000360, "Member 'UFrontEndDefaultStackBase_C::MenuContent' has a wrong offset!");
static_assert(offsetof(UFrontEndDefaultStackBase_C, NavPrompts) == 0x000368, "Member 'UFrontEndDefaultStackBase_C::NavPrompts' has a wrong offset!");

}

