#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FrontEndMenuStack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_structs.hpp"
#include "Mariner_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FrontEndMenuStack.FrontEndMenuStack_C
// 0x00A8 (0x0740 - 0x0698)
class UFrontEndMenuStack_C final : public UMarinerMenuStackManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0698(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPrimaryStackButtonWidget_C*            blastpass;                                         // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPrimaryStackButtonWidget_C*            Characters;                                        // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFrontEndDefaultStackBase_C*            DefaultStackBase;                                  // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPrimaryStackButtonWidget_C*            Home;                                              // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPrimaryStackButtonWidget_C*            Intermission;                                      // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPrompt_C*                       LTPrompt;                                          // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPrimaryStackButtonWidget_C*            Matchmaking;                                       // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerGridPanel*                      NavRibbon;                                         // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnviewedItemWidget_C*                  NewItemNotification;                               // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnviewedItemWidget_C*                  NewItemNotification_1;                             // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnviewedItemWidget_C*                  OnboardingNotification;                            // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPrimaryStackButtonWidget_C*            Play;                                              // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPrimaryStackButtonWidget_C*            PrivateMatch;                                      // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPrompt_C*                       RTPrompt;                                          // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPrimaryStackButtonWidget_C*            Store;                                             // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTabBackground_C*                       TabBackground;                                     // 0x0718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuTooltipBase_C*                     ToolTip;                                           // 0x0720(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPrimaryStackButtonWidget_C*            Totems;                                            // 0x0728(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           QuestRefreshTimer;                                 // 0x0730(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          FirstLaunchSFX;                                    // 0x0738(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_FrontEndMenuStack(int32 EntryPoint);
	void OnSeasonUpdate(const struct FMangoBlastPassDefinition& Definition);
	void OnOnboardingActiveStateChanged(bool bActive);
	void Construct();
	void BP_OnEntered(bool bFromSubMenu);
	void BP_OnExited(bool bToSubLayer);
	void BP_OnInit();
	void BP_OnFirstLaunch();
	void OnUnviewedItemsCalculated(const int32 NumUnviewedTotem, const int32 NumUnviewedCharacter);
	void OnIntermissionEnded();
	void OnIntermissionStarted();
	void OnPrivateMatchStopped();
	void OnMatchmakingStopped();
	void OnPrivateMatchStarted();
	void OnMatchmakingStarted();
	void StackSwitchedFrom(const class UMarinerMenuStackButton* ButtonInstance, int32 StackIndex);
	void StackSwitchedTo(const class UMarinerMenuStackButton* ButtonInstance, int32 StackIndex);
	void StackHidden(const class UMarinerMenuStackButton* ButtonInstance, int32 StackIndex);
	void StackDisplayed(const class UMarinerMenuStackButton* ButtonInstance, int32 StackIndex);
	void UpdateGameTabs();
	void UpdateMatchmakingTab();
	void EnableQuestRefresh(bool Enabled);
	void RefreshQuests();
	void DummyCallback(struct FKey& KeyPressed);
	void UpdatePlayerHeaderIsOnGameTabs();
	void UpdateBlastPassTab();
	void GetAbandonmentWarningLevelText(int32 WarningLevel, class FText* Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FrontEndMenuStack_C">();
	}
	static class UFrontEndMenuStack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFrontEndMenuStack_C>();
	}
};
static_assert(alignof(UFrontEndMenuStack_C) == 0x000008, "Wrong alignment on UFrontEndMenuStack_C");
static_assert(sizeof(UFrontEndMenuStack_C) == 0x000740, "Wrong size on UFrontEndMenuStack_C");
static_assert(offsetof(UFrontEndMenuStack_C, UberGraphFrame) == 0x000698, "Member 'UFrontEndMenuStack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFrontEndMenuStack_C, blastpass) == 0x0006A0, "Member 'UFrontEndMenuStack_C::blastpass' has a wrong offset!");
static_assert(offsetof(UFrontEndMenuStack_C, Characters) == 0x0006A8, "Member 'UFrontEndMenuStack_C::Characters' has a wrong offset!");
static_assert(offsetof(UFrontEndMenuStack_C, DefaultStackBase) == 0x0006B0, "Member 'UFrontEndMenuStack_C::DefaultStackBase' has a wrong offset!");
static_assert(offsetof(UFrontEndMenuStack_C, Home) == 0x0006B8, "Member 'UFrontEndMenuStack_C::Home' has a wrong offset!");
static_assert(offsetof(UFrontEndMenuStack_C, Intermission) == 0x0006C0, "Member 'UFrontEndMenuStack_C::Intermission' has a wrong offset!");
static_assert(offsetof(UFrontEndMenuStack_C, LTPrompt) == 0x0006C8, "Member 'UFrontEndMenuStack_C::LTPrompt' has a wrong offset!");
static_assert(offsetof(UFrontEndMenuStack_C, Matchmaking) == 0x0006D0, "Member 'UFrontEndMenuStack_C::Matchmaking' has a wrong offset!");
static_assert(offsetof(UFrontEndMenuStack_C, NavRibbon) == 0x0006D8, "Member 'UFrontEndMenuStack_C::NavRibbon' has a wrong offset!");
static_assert(offsetof(UFrontEndMenuStack_C, NewItemNotification) == 0x0006E0, "Member 'UFrontEndMenuStack_C::NewItemNotification' has a wrong offset!");
static_assert(offsetof(UFrontEndMenuStack_C, NewItemNotification_1) == 0x0006E8, "Member 'UFrontEndMenuStack_C::NewItemNotification_1' has a wrong offset!");
static_assert(offsetof(UFrontEndMenuStack_C, OnboardingNotification) == 0x0006F0, "Member 'UFrontEndMenuStack_C::OnboardingNotification' has a wrong offset!");
static_assert(offsetof(UFrontEndMenuStack_C, Play) == 0x0006F8, "Member 'UFrontEndMenuStack_C::Play' has a wrong offset!");
static_assert(offsetof(UFrontEndMenuStack_C, PrivateMatch) == 0x000700, "Member 'UFrontEndMenuStack_C::PrivateMatch' has a wrong offset!");
static_assert(offsetof(UFrontEndMenuStack_C, RTPrompt) == 0x000708, "Member 'UFrontEndMenuStack_C::RTPrompt' has a wrong offset!");
static_assert(offsetof(UFrontEndMenuStack_C, Store) == 0x000710, "Member 'UFrontEndMenuStack_C::Store' has a wrong offset!");
static_assert(offsetof(UFrontEndMenuStack_C, TabBackground) == 0x000718, "Member 'UFrontEndMenuStack_C::TabBackground' has a wrong offset!");
static_assert(offsetof(UFrontEndMenuStack_C, ToolTip) == 0x000720, "Member 'UFrontEndMenuStack_C::ToolTip' has a wrong offset!");
static_assert(offsetof(UFrontEndMenuStack_C, Totems) == 0x000728, "Member 'UFrontEndMenuStack_C::Totems' has a wrong offset!");
static_assert(offsetof(UFrontEndMenuStack_C, QuestRefreshTimer) == 0x000730, "Member 'UFrontEndMenuStack_C::QuestRefreshTimer' has a wrong offset!");
static_assert(offsetof(UFrontEndMenuStack_C, FirstLaunchSFX) == 0x000738, "Member 'UFrontEndMenuStack_C::FirstLaunchSFX' has a wrong offset!");

}

