#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Gant_00_PostAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Gant_00_PostAnimBP.Gant_00_PostAnimBP_C
// 0x0B00 (0x0D70 - 0x0270)
class UGant_00_PostAnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_E3CCFC944849F7A34F14AC8022823994; // 0x0278(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_F37173514B0FA809B4DA6B87ACC9FC5A; // 0x0298(0x0020)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_65ECB589406BB9DAA1BD15AC05727C77; // 0x02B8(0x00F0)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_9F3F2FE3425AA7B634F6619C12F4C048; // 0x03A8(0x00F0)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_CBE232CC4F0EF2C13488A088EBAE1B4C; // 0x0498(0x00F0)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_576949E64BF664E857B7809CDC4D1745; // 0x0588(0x00F0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput_A3619B0C4F3135F95182BCADDA3FE828; // 0x0678(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root_D00E03C94C6CB9C47480CCAC751D75CE; // 0x06E8(0x0030)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_AFFE3B384B32005013A6B78D9354B685; // 0x0718(0x0118)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_ED5CC90547943620FB2B8FBE3E745D99; // 0x0830(0x0118)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_558364EE4B8A32C5311894BFB34FDDC9; // 0x0948(0x0118)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_84E45A924041EC7E90E21680548C92C2; // 0x0A60(0x0118)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_30A7C64442A096BA0D65D7AC71F16943; // 0x0B78(0x00F0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7387D95643C74725D099ED87AAE5FEA5; // 0x0C68(0x0108)()

public:
	void ExecuteUbergraph_Gant_00_PostAnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Gant_00_PostAnimBP_C">();
	}
	static class UGant_00_PostAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGant_00_PostAnimBP_C>();
	}
};
static_assert(alignof(UGant_00_PostAnimBP_C) == 0x000010, "Wrong alignment on UGant_00_PostAnimBP_C");
static_assert(sizeof(UGant_00_PostAnimBP_C) == 0x000D70, "Wrong size on UGant_00_PostAnimBP_C");
static_assert(offsetof(UGant_00_PostAnimBP_C, UberGraphFrame) == 0x000270, "Member 'UGant_00_PostAnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGant_00_PostAnimBP_C, AnimGraphNode_ComponentToLocalSpace_E3CCFC944849F7A34F14AC8022823994) == 0x000278, "Member 'UGant_00_PostAnimBP_C::AnimGraphNode_ComponentToLocalSpace_E3CCFC944849F7A34F14AC8022823994' has a wrong offset!");
static_assert(offsetof(UGant_00_PostAnimBP_C, AnimGraphNode_LocalToComponentSpace_F37173514B0FA809B4DA6B87ACC9FC5A) == 0x000298, "Member 'UGant_00_PostAnimBP_C::AnimGraphNode_LocalToComponentSpace_F37173514B0FA809B4DA6B87ACC9FC5A' has a wrong offset!");
static_assert(offsetof(UGant_00_PostAnimBP_C, AnimGraphNode_RotationMultiplier_65ECB589406BB9DAA1BD15AC05727C77) == 0x0002B8, "Member 'UGant_00_PostAnimBP_C::AnimGraphNode_RotationMultiplier_65ECB589406BB9DAA1BD15AC05727C77' has a wrong offset!");
static_assert(offsetof(UGant_00_PostAnimBP_C, AnimGraphNode_RotationMultiplier_9F3F2FE3425AA7B634F6619C12F4C048) == 0x0003A8, "Member 'UGant_00_PostAnimBP_C::AnimGraphNode_RotationMultiplier_9F3F2FE3425AA7B634F6619C12F4C048' has a wrong offset!");
static_assert(offsetof(UGant_00_PostAnimBP_C, AnimGraphNode_RotationMultiplier_CBE232CC4F0EF2C13488A088EBAE1B4C) == 0x000498, "Member 'UGant_00_PostAnimBP_C::AnimGraphNode_RotationMultiplier_CBE232CC4F0EF2C13488A088EBAE1B4C' has a wrong offset!");
static_assert(offsetof(UGant_00_PostAnimBP_C, AnimGraphNode_RotationMultiplier_576949E64BF664E857B7809CDC4D1745) == 0x000588, "Member 'UGant_00_PostAnimBP_C::AnimGraphNode_RotationMultiplier_576949E64BF664E857B7809CDC4D1745' has a wrong offset!");
static_assert(offsetof(UGant_00_PostAnimBP_C, AnimGraphNode_SubInput_A3619B0C4F3135F95182BCADDA3FE828) == 0x000678, "Member 'UGant_00_PostAnimBP_C::AnimGraphNode_SubInput_A3619B0C4F3135F95182BCADDA3FE828' has a wrong offset!");
static_assert(offsetof(UGant_00_PostAnimBP_C, AnimGraphNode_Root_D00E03C94C6CB9C47480CCAC751D75CE) == 0x0006E8, "Member 'UGant_00_PostAnimBP_C::AnimGraphNode_Root_D00E03C94C6CB9C47480CCAC751D75CE' has a wrong offset!");
static_assert(offsetof(UGant_00_PostAnimBP_C, AnimGraphNode_BoneDrivenController_AFFE3B384B32005013A6B78D9354B685) == 0x000718, "Member 'UGant_00_PostAnimBP_C::AnimGraphNode_BoneDrivenController_AFFE3B384B32005013A6B78D9354B685' has a wrong offset!");
static_assert(offsetof(UGant_00_PostAnimBP_C, AnimGraphNode_BoneDrivenController_ED5CC90547943620FB2B8FBE3E745D99) == 0x000830, "Member 'UGant_00_PostAnimBP_C::AnimGraphNode_BoneDrivenController_ED5CC90547943620FB2B8FBE3E745D99' has a wrong offset!");
static_assert(offsetof(UGant_00_PostAnimBP_C, AnimGraphNode_BoneDrivenController_558364EE4B8A32C5311894BFB34FDDC9) == 0x000948, "Member 'UGant_00_PostAnimBP_C::AnimGraphNode_BoneDrivenController_558364EE4B8A32C5311894BFB34FDDC9' has a wrong offset!");
static_assert(offsetof(UGant_00_PostAnimBP_C, AnimGraphNode_BoneDrivenController_84E45A924041EC7E90E21680548C92C2) == 0x000A60, "Member 'UGant_00_PostAnimBP_C::AnimGraphNode_BoneDrivenController_84E45A924041EC7E90E21680548C92C2' has a wrong offset!");
static_assert(offsetof(UGant_00_PostAnimBP_C, AnimGraphNode_CopyBone_30A7C64442A096BA0D65D7AC71F16943) == 0x000B78, "Member 'UGant_00_PostAnimBP_C::AnimGraphNode_CopyBone_30A7C64442A096BA0D65D7AC71F16943' has a wrong offset!");
static_assert(offsetof(UGant_00_PostAnimBP_C, AnimGraphNode_ModifyBone_7387D95643C74725D099ED87AAE5FEA5) == 0x000C68, "Member 'UGant_00_PostAnimBP_C::AnimGraphNode_ModifyBone_7387D95643C74725D099ED87AAE5FEA5' has a wrong offset!");

}

