#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Characters_Landed

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Characters_Landed.GC_Characters_Landed_C
// 0x00B0 (0x0100 - 0x0050)
class UGC_Characters_Landed_C final : public UGameplayCueNotify_Static
{
public:
	class UParticleSystem*                        Landed_VFX_Default;                                // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Landed_SFX_Default;                                // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EPhysicalSurface, class UParticleSystem*> Landed_VFX;                                        // 0x0060(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMap<EPhysicalSurface, class UAkAudioEvent*>  Landed_SFX;                                        // 0x00B0(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Characters_Landed_C">();
	}
	static class UGC_Characters_Landed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGC_Characters_Landed_C>();
	}
};
static_assert(alignof(UGC_Characters_Landed_C) == 0x000008, "Wrong alignment on UGC_Characters_Landed_C");
static_assert(sizeof(UGC_Characters_Landed_C) == 0x000100, "Wrong size on UGC_Characters_Landed_C");
static_assert(offsetof(UGC_Characters_Landed_C, Landed_VFX_Default) == 0x000050, "Member 'UGC_Characters_Landed_C::Landed_VFX_Default' has a wrong offset!");
static_assert(offsetof(UGC_Characters_Landed_C, Landed_SFX_Default) == 0x000058, "Member 'UGC_Characters_Landed_C::Landed_SFX_Default' has a wrong offset!");
static_assert(offsetof(UGC_Characters_Landed_C, Landed_VFX) == 0x000060, "Member 'UGC_Characters_Landed_C::Landed_VFX' has a wrong offset!");
static_assert(offsetof(UGC_Characters_Landed_C, Landed_SFX) == 0x0000B0, "Member 'UGC_Characters_Landed_C::Landed_SFX' has a wrong offset!");

}

