#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Characters_Shielded_Sequence

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_Characters_Shielded_Sequence.GC_Characters_Shielded_Sequence_C.ExecuteUbergraph_GC_Characters_Shielded_Sequence
// 0x0030 (0x0030 - 0x0000)
struct GC_Characters_Shielded_Sequence_C_ExecuteUbergraph_GC_Characters_Shielded_Sequence final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F51[0x3];                                      // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F52[0x4];                                      // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMarinerCharacter*                      CallFunc_GetTargetCharacter_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F53[0x3];                                      // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Characters_Shielded_Sequence_C_ExecuteUbergraph_GC_Characters_Shielded_Sequence) == 0x000008, "Wrong alignment on GC_Characters_Shielded_Sequence_C_ExecuteUbergraph_GC_Characters_Shielded_Sequence");
static_assert(sizeof(GC_Characters_Shielded_Sequence_C_ExecuteUbergraph_GC_Characters_Shielded_Sequence) == 0x000030, "Wrong size on GC_Characters_Shielded_Sequence_C_ExecuteUbergraph_GC_Characters_Shielded_Sequence");
static_assert(offsetof(GC_Characters_Shielded_Sequence_C_ExecuteUbergraph_GC_Characters_Shielded_Sequence, EntryPoint) == 0x000000, "Member 'GC_Characters_Shielded_Sequence_C_ExecuteUbergraph_GC_Characters_Shielded_Sequence::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Characters_Shielded_Sequence_C_ExecuteUbergraph_GC_Characters_Shielded_Sequence, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'GC_Characters_Shielded_Sequence_C_ExecuteUbergraph_GC_Characters_Shielded_Sequence::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Characters_Shielded_Sequence_C_ExecuteUbergraph_GC_Characters_Shielded_Sequence, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'GC_Characters_Shielded_Sequence_C_ExecuteUbergraph_GC_Characters_Shielded_Sequence::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GC_Characters_Shielded_Sequence_C_ExecuteUbergraph_GC_Characters_Shielded_Sequence, CallFunc_GetTargetCharacter_ReturnValue) == 0x000010, "Member 'GC_Characters_Shielded_Sequence_C_ExecuteUbergraph_GC_Characters_Shielded_Sequence::CallFunc_GetTargetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Characters_Shielded_Sequence_C_ExecuteUbergraph_GC_Characters_Shielded_Sequence, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000018, "Member 'GC_Characters_Shielded_Sequence_C_ExecuteUbergraph_GC_Characters_Shielded_Sequence::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Characters_Shielded_Sequence_C_ExecuteUbergraph_GC_Characters_Shielded_Sequence, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute) == 0x000020, "Member 'GC_Characters_Shielded_Sequence_C_ExecuteUbergraph_GC_Characters_Shielded_Sequence::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GC_Characters_Shielded_Sequence_C_ExecuteUbergraph_GC_Characters_Shielded_Sequence, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue) == 0x000024, "Member 'GC_Characters_Shielded_Sequence_C_ExecuteUbergraph_GC_Characters_Shielded_Sequence::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Characters_Shielded_Sequence_C_ExecuteUbergraph_GC_Characters_Shielded_Sequence, CallFunc_FTrunc_ReturnValue) == 0x000028, "Member 'GC_Characters_Shielded_Sequence_C_ExecuteUbergraph_GC_Characters_Shielded_Sequence::CallFunc_FTrunc_ReturnValue' has a wrong offset!");

// Function GC_Characters_Shielded_Sequence.GC_Characters_Shielded_Sequence_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GC_Characters_Shielded_Sequence_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Characters_Shielded_Sequence_C_ReceiveTick) == 0x000004, "Wrong alignment on GC_Characters_Shielded_Sequence_C_ReceiveTick");
static_assert(sizeof(GC_Characters_Shielded_Sequence_C_ReceiveTick) == 0x000004, "Wrong size on GC_Characters_Shielded_Sequence_C_ReceiveTick");
static_assert(offsetof(GC_Characters_Shielded_Sequence_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GC_Characters_Shielded_Sequence_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function GC_Characters_Shielded_Sequence.GC_Characters_Shielded_Sequence_C.OnActive
// 0x00E0 (0x00E0 - 0x0000)
struct GC_Characters_Shielded_Sequence_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnActive_ReturnValue;                     // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F54[0x6];                                      // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AEmitterCameraLensEffectBase*           CallFunc_GetSpawnedCameraEffect_ReturnValue;       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AShielded_CameraEffect_C*               K2Node_DynamicCast_AsShielded_Camera_Effect;       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GC_Characters_Shielded_Sequence_C_OnActive) == 0x000008, "Wrong alignment on GC_Characters_Shielded_Sequence_C_OnActive");
static_assert(sizeof(GC_Characters_Shielded_Sequence_C_OnActive) == 0x0000E0, "Wrong size on GC_Characters_Shielded_Sequence_C_OnActive");
static_assert(offsetof(GC_Characters_Shielded_Sequence_C_OnActive, MyTarget) == 0x000000, "Member 'GC_Characters_Shielded_Sequence_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Characters_Shielded_Sequence_C_OnActive, Parameters) == 0x000008, "Member 'GC_Characters_Shielded_Sequence_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Characters_Shielded_Sequence_C_OnActive, ReturnValue) == 0x0000C0, "Member 'GC_Characters_Shielded_Sequence_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Characters_Shielded_Sequence_C_OnActive, CallFunc_OnActive_ReturnValue) == 0x0000C1, "Member 'GC_Characters_Shielded_Sequence_C_OnActive::CallFunc_OnActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Characters_Shielded_Sequence_C_OnActive, CallFunc_GetSpawnedCameraEffect_ReturnValue) == 0x0000C8, "Member 'GC_Characters_Shielded_Sequence_C_OnActive::CallFunc_GetSpawnedCameraEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Characters_Shielded_Sequence_C_OnActive, K2Node_DynamicCast_AsShielded_Camera_Effect) == 0x0000D0, "Member 'GC_Characters_Shielded_Sequence_C_OnActive::K2Node_DynamicCast_AsShielded_Camera_Effect' has a wrong offset!");
static_assert(offsetof(GC_Characters_Shielded_Sequence_C_OnActive, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'GC_Characters_Shielded_Sequence_C_OnActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GC_Characters_Shielded_Sequence.GC_Characters_Shielded_Sequence_C.OnRemove
// 0x00C8 (0x00C8 - 0x0000)
struct GC_Characters_Shielded_Sequence_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnRemove_ReturnValue;                     // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GC_Characters_Shielded_Sequence_C_OnRemove) == 0x000008, "Wrong alignment on GC_Characters_Shielded_Sequence_C_OnRemove");
static_assert(sizeof(GC_Characters_Shielded_Sequence_C_OnRemove) == 0x0000C8, "Wrong size on GC_Characters_Shielded_Sequence_C_OnRemove");
static_assert(offsetof(GC_Characters_Shielded_Sequence_C_OnRemove, MyTarget) == 0x000000, "Member 'GC_Characters_Shielded_Sequence_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Characters_Shielded_Sequence_C_OnRemove, Parameters) == 0x000008, "Member 'GC_Characters_Shielded_Sequence_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Characters_Shielded_Sequence_C_OnRemove, ReturnValue) == 0x0000C0, "Member 'GC_Characters_Shielded_Sequence_C_OnRemove::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Characters_Shielded_Sequence_C_OnRemove, CallFunc_OnRemove_ReturnValue) == 0x0000C1, "Member 'GC_Characters_Shielded_Sequence_C_OnRemove::CallFunc_OnRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Characters_Shielded_Sequence_C_OnRemove, CallFunc_IsValid_ReturnValue) == 0x0000C2, "Member 'GC_Characters_Shielded_Sequence_C_OnRemove::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

