#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Characters_Landed_RUDI

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_Characters_Landed_RUDI.GC_Characters_Landed_RUDI_C.OnExecute
// 0x0128 (0x0128 - 0x0000)
struct GC_Characters_Landed_RUDI_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMarinerCharacter*                      Character;                                         // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x00D0(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_OnExecute_ReturnValue;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMarinerCharacter*                      K2Node_DynamicCast_AsMariner_Character;            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x00F4(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_122[0x2];                                      // 0x0122(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Characters_Landed_RUDI_C_OnExecute) == 0x000008, "Wrong alignment on GC_Characters_Landed_RUDI_C_OnExecute");
static_assert(sizeof(GC_Characters_Landed_RUDI_C_OnExecute) == 0x000128, "Wrong size on GC_Characters_Landed_RUDI_C_OnExecute");
static_assert(offsetof(GC_Characters_Landed_RUDI_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_Characters_Landed_RUDI_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Characters_Landed_RUDI_C_OnExecute, Parameters) == 0x000008, "Member 'GC_Characters_Landed_RUDI_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Characters_Landed_RUDI_C_OnExecute, ReturnValue) == 0x0000C0, "Member 'GC_Characters_Landed_RUDI_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Characters_Landed_RUDI_C_OnExecute, Character) == 0x0000C8, "Member 'GC_Characters_Landed_RUDI_C_OnExecute::Character' has a wrong offset!");
static_assert(offsetof(GC_Characters_Landed_RUDI_C_OnExecute, Temp_struct_Variable) == 0x0000D0, "Member 'GC_Characters_Landed_RUDI_C_OnExecute::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GC_Characters_Landed_RUDI_C_OnExecute, CallFunc_OnExecute_ReturnValue) == 0x0000E0, "Member 'GC_Characters_Landed_RUDI_C_OnExecute::CallFunc_OnExecute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Characters_Landed_RUDI_C_OnExecute, K2Node_DynamicCast_AsMariner_Character) == 0x0000E8, "Member 'GC_Characters_Landed_RUDI_C_OnExecute::K2Node_DynamicCast_AsMariner_Character' has a wrong offset!");
static_assert(offsetof(GC_Characters_Landed_RUDI_C_OnExecute, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'GC_Characters_Landed_RUDI_C_OnExecute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Characters_Landed_RUDI_C_OnExecute, Temp_delegate_Variable) == 0x0000F4, "Member 'GC_Characters_Landed_RUDI_C_OnExecute::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GC_Characters_Landed_RUDI_C_OnExecute, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000108, "Member 'GC_Characters_Landed_RUDI_C_OnExecute::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Characters_Landed_RUDI_C_OnExecute, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000110, "Member 'GC_Characters_Landed_RUDI_C_OnExecute::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GC_Characters_Landed_RUDI_C_OnExecute, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000120, "Member 'GC_Characters_Landed_RUDI_C_OnExecute::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Characters_Landed_RUDI_C_OnExecute, CallFunc_Not_PreBool_ReturnValue) == 0x000121, "Member 'GC_Characters_Landed_RUDI_C_OnExecute::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Characters_Landed_RUDI_C_OnExecute, CallFunc_PostAkEvent_ReturnValue) == 0x000124, "Member 'GC_Characters_Landed_RUDI_C_OnExecute::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

}

