#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Diver_Primary_Fire

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GC_Diver_Primary_Fire.GC_Diver_Primary_Fire_C.OnExecute
// 0x01F0 (0x01F0 - 0x0000)
struct GC_Diver_Primary_Fire_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25D2[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x00C8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x00E0(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x00F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0100(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0108(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0128(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnExecute_ReturnValue;                    // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25D3[0x3];                                     // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMarinerCharacter*                      K2Node_DynamicCast_AsMariner_Character;            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25D4[0x3];                                     // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x01A4(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25D5[0x4];                                     // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default;                             // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Diver_Primary_Fire_C_OnExecute) == 0x000008, "Wrong alignment on GC_Diver_Primary_Fire_C_OnExecute");
static_assert(sizeof(GC_Diver_Primary_Fire_C_OnExecute) == 0x0001F0, "Wrong size on GC_Diver_Primary_Fire_C_OnExecute");
static_assert(offsetof(GC_Diver_Primary_Fire_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_Diver_Primary_Fire_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Diver_Primary_Fire_C_OnExecute, Parameters) == 0x000008, "Member 'GC_Diver_Primary_Fire_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Diver_Primary_Fire_C_OnExecute, ReturnValue) == 0x0000C0, "Member 'GC_Diver_Primary_Fire_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Diver_Primary_Fire_C_OnExecute, Temp_struct_Variable) == 0x0000C8, "Member 'GC_Diver_Primary_Fire_C_OnExecute::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GC_Diver_Primary_Fire_C_OnExecute, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0000D8, "Member 'GC_Diver_Primary_Fire_C_OnExecute::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Diver_Primary_Fire_C_OnExecute, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x0000DC, "Member 'GC_Diver_Primary_Fire_C_OnExecute::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Diver_Primary_Fire_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x0000E0, "Member 'GC_Diver_Primary_Fire_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_Diver_Primary_Fire_C_OnExecute, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x0000F8, "Member 'GC_Diver_Primary_Fire_C_OnExecute::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_Diver_Primary_Fire_C_OnExecute, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000100, "Member 'GC_Diver_Primary_Fire_C_OnExecute::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_Diver_Primary_Fire_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000108, "Member 'GC_Diver_Primary_Fire_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_Diver_Primary_Fire_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000128, "Member 'GC_Diver_Primary_Fire_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_Diver_Primary_Fire_C_OnExecute, CallFunc_BreakGameplayCueParameters_Location) == 0x000148, "Member 'GC_Diver_Primary_Fire_C_OnExecute::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_Diver_Primary_Fire_C_OnExecute, CallFunc_BreakGameplayCueParameters_Normal) == 0x000154, "Member 'GC_Diver_Primary_Fire_C_OnExecute::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_Diver_Primary_Fire_C_OnExecute, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000160, "Member 'GC_Diver_Primary_Fire_C_OnExecute::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_Diver_Primary_Fire_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000168, "Member 'GC_Diver_Primary_Fire_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_Diver_Primary_Fire_C_OnExecute, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000170, "Member 'GC_Diver_Primary_Fire_C_OnExecute::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_Diver_Primary_Fire_C_OnExecute, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x000178, "Member 'GC_Diver_Primary_Fire_C_OnExecute::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_Diver_Primary_Fire_C_OnExecute, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x000180, "Member 'GC_Diver_Primary_Fire_C_OnExecute::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_Diver_Primary_Fire_C_OnExecute, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x000184, "Member 'GC_Diver_Primary_Fire_C_OnExecute::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_Diver_Primary_Fire_C_OnExecute, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000188, "Member 'GC_Diver_Primary_Fire_C_OnExecute::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_Diver_Primary_Fire_C_OnExecute, CallFunc_OnExecute_ReturnValue) == 0x000190, "Member 'GC_Diver_Primary_Fire_C_OnExecute::CallFunc_OnExecute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Diver_Primary_Fire_C_OnExecute, CallFunc_FTrunc_ReturnValue) == 0x000194, "Member 'GC_Diver_Primary_Fire_C_OnExecute::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Diver_Primary_Fire_C_OnExecute, K2Node_DynamicCast_AsMariner_Character) == 0x000198, "Member 'GC_Diver_Primary_Fire_C_OnExecute::K2Node_DynamicCast_AsMariner_Character' has a wrong offset!");
static_assert(offsetof(GC_Diver_Primary_Fire_C_OnExecute, K2Node_DynamicCast_bSuccess) == 0x0001A0, "Member 'GC_Diver_Primary_Fire_C_OnExecute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Diver_Primary_Fire_C_OnExecute, Temp_delegate_Variable) == 0x0001A4, "Member 'GC_Diver_Primary_Fire_C_OnExecute::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GC_Diver_Primary_Fire_C_OnExecute, Temp_int_Variable) == 0x0001B4, "Member 'GC_Diver_Primary_Fire_C_OnExecute::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GC_Diver_Primary_Fire_C_OnExecute, CallFunc_PostAkEvent_ReturnValue) == 0x0001B8, "Member 'GC_Diver_Primary_Fire_C_OnExecute::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Diver_Primary_Fire_C_OnExecute, Temp_string_Variable) == 0x0001C0, "Member 'GC_Diver_Primary_Fire_C_OnExecute::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(GC_Diver_Primary_Fire_C_OnExecute, Temp_string_Variable_1) == 0x0001D0, "Member 'GC_Diver_Primary_Fire_C_OnExecute::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_Diver_Primary_Fire_C_OnExecute, K2Node_Select_Default) == 0x0001E0, "Member 'GC_Diver_Primary_Fire_C_OnExecute::K2Node_Select_Default' has a wrong offset!");

}

