#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GenericPurchaseButton

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GenericPurchaseButton.GenericPurchaseButton_C
// 0x0068 (0x2FE0 - 0x2F78)
class UGenericPurchaseButton_C final : public UMarinerLayeredButton
{
public:
	class UWidgetAnimation*                       UnhoveredAnim;                                     // 0x2F78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoveredAnim;                                       // 0x2F80(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             AuxiliaryText;                                     // 0x2F88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x2F90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Border;                                            // 0x2F98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x2FA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x2FA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x2FB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_84;                                          // 0x2FB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_161;                                         // 0x2FC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Material;                                          // 0x2FC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PrimaryText;                                       // 0x2FD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               RootSizeBox;                                       // 0x2FD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FMarinerLayeredButtonAssets GetAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GenericPurchaseButton_C">();
	}
	static class UGenericPurchaseButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGenericPurchaseButton_C>();
	}
};
static_assert(alignof(UGenericPurchaseButton_C) == 0x000008, "Wrong alignment on UGenericPurchaseButton_C");
static_assert(sizeof(UGenericPurchaseButton_C) == 0x002FE0, "Wrong size on UGenericPurchaseButton_C");
static_assert(offsetof(UGenericPurchaseButton_C, UnhoveredAnim) == 0x002F78, "Member 'UGenericPurchaseButton_C::UnhoveredAnim' has a wrong offset!");
static_assert(offsetof(UGenericPurchaseButton_C, HoveredAnim) == 0x002F80, "Member 'UGenericPurchaseButton_C::HoveredAnim' has a wrong offset!");
static_assert(offsetof(UGenericPurchaseButton_C, AuxiliaryText) == 0x002F88, "Member 'UGenericPurchaseButton_C::AuxiliaryText' has a wrong offset!");
static_assert(offsetof(UGenericPurchaseButton_C, Background) == 0x002F90, "Member 'UGenericPurchaseButton_C::Background' has a wrong offset!");
static_assert(offsetof(UGenericPurchaseButton_C, Border) == 0x002F98, "Member 'UGenericPurchaseButton_C::Border' has a wrong offset!");
static_assert(offsetof(UGenericPurchaseButton_C, Button) == 0x002FA0, "Member 'UGenericPurchaseButton_C::Button' has a wrong offset!");
static_assert(offsetof(UGenericPurchaseButton_C, Icon) == 0x002FA8, "Member 'UGenericPurchaseButton_C::Icon' has a wrong offset!");
static_assert(offsetof(UGenericPurchaseButton_C, Image_2) == 0x002FB0, "Member 'UGenericPurchaseButton_C::Image_2' has a wrong offset!");
static_assert(offsetof(UGenericPurchaseButton_C, Image_84) == 0x002FB8, "Member 'UGenericPurchaseButton_C::Image_84' has a wrong offset!");
static_assert(offsetof(UGenericPurchaseButton_C, Image_161) == 0x002FC0, "Member 'UGenericPurchaseButton_C::Image_161' has a wrong offset!");
static_assert(offsetof(UGenericPurchaseButton_C, Material) == 0x002FC8, "Member 'UGenericPurchaseButton_C::Material' has a wrong offset!");
static_assert(offsetof(UGenericPurchaseButton_C, PrimaryText) == 0x002FD0, "Member 'UGenericPurchaseButton_C::PrimaryText' has a wrong offset!");
static_assert(offsetof(UGenericPurchaseButton_C, RootSizeBox) == 0x002FD8, "Member 'UGenericPurchaseButton_C::RootSizeBox' has a wrong offset!");

}

