#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GlobalPostProcess

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GlobalPostProcess.GlobalPostProcess_C
// 0x00C0 (0x02E0 - 0x0220)
class AGlobalPostProcess_C final : public AMarinerGlobalPostProcess
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess;                                       // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Foreground_Lighting_Distance;                      // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Foreground_Lighting_Fade_Width;                    // 0x0234(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Foreground_Lighting_Brightness_Multiplier;         // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Background_Lighting_Distance;                      // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Background_Lighting_Fade_Width;                    // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Background_Lighting_Brightness_Multiplier;         // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Global_Lighting_Brightness_Multiplier;             // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Rim_Light;                                         // 0x024C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Key_Light;                                         // 0x025C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Rim_Angle;                                         // 0x026C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Key_Angle;                                         // 0x027C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           OutlineColor1;                                     // 0x028C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           OutlineColor2;                                     // 0x029C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           OutlineColor3;                                     // 0x02AC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           OutlineColor4;                                     // 0x02BC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MatcapLightColor;                                  // 0x02CC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisablePT;                                         // 0x02DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GlobalPostProcess(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void SetLightingParameterCollectionValues();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GlobalPostProcess_C">();
	}
	static class AGlobalPostProcess_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGlobalPostProcess_C>();
	}
};
static_assert(alignof(AGlobalPostProcess_C) == 0x000008, "Wrong alignment on AGlobalPostProcess_C");
static_assert(sizeof(AGlobalPostProcess_C) == 0x0002E0, "Wrong size on AGlobalPostProcess_C");
static_assert(offsetof(AGlobalPostProcess_C, UberGraphFrame) == 0x000220, "Member 'AGlobalPostProcess_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGlobalPostProcess_C, PostProcess) == 0x000228, "Member 'AGlobalPostProcess_C::PostProcess' has a wrong offset!");
static_assert(offsetof(AGlobalPostProcess_C, Foreground_Lighting_Distance) == 0x000230, "Member 'AGlobalPostProcess_C::Foreground_Lighting_Distance' has a wrong offset!");
static_assert(offsetof(AGlobalPostProcess_C, Foreground_Lighting_Fade_Width) == 0x000234, "Member 'AGlobalPostProcess_C::Foreground_Lighting_Fade_Width' has a wrong offset!");
static_assert(offsetof(AGlobalPostProcess_C, Foreground_Lighting_Brightness_Multiplier) == 0x000238, "Member 'AGlobalPostProcess_C::Foreground_Lighting_Brightness_Multiplier' has a wrong offset!");
static_assert(offsetof(AGlobalPostProcess_C, Background_Lighting_Distance) == 0x00023C, "Member 'AGlobalPostProcess_C::Background_Lighting_Distance' has a wrong offset!");
static_assert(offsetof(AGlobalPostProcess_C, Background_Lighting_Fade_Width) == 0x000240, "Member 'AGlobalPostProcess_C::Background_Lighting_Fade_Width' has a wrong offset!");
static_assert(offsetof(AGlobalPostProcess_C, Background_Lighting_Brightness_Multiplier) == 0x000244, "Member 'AGlobalPostProcess_C::Background_Lighting_Brightness_Multiplier' has a wrong offset!");
static_assert(offsetof(AGlobalPostProcess_C, Global_Lighting_Brightness_Multiplier) == 0x000248, "Member 'AGlobalPostProcess_C::Global_Lighting_Brightness_Multiplier' has a wrong offset!");
static_assert(offsetof(AGlobalPostProcess_C, Rim_Light) == 0x00024C, "Member 'AGlobalPostProcess_C::Rim_Light' has a wrong offset!");
static_assert(offsetof(AGlobalPostProcess_C, Key_Light) == 0x00025C, "Member 'AGlobalPostProcess_C::Key_Light' has a wrong offset!");
static_assert(offsetof(AGlobalPostProcess_C, Rim_Angle) == 0x00026C, "Member 'AGlobalPostProcess_C::Rim_Angle' has a wrong offset!");
static_assert(offsetof(AGlobalPostProcess_C, Key_Angle) == 0x00027C, "Member 'AGlobalPostProcess_C::Key_Angle' has a wrong offset!");
static_assert(offsetof(AGlobalPostProcess_C, OutlineColor1) == 0x00028C, "Member 'AGlobalPostProcess_C::OutlineColor1' has a wrong offset!");
static_assert(offsetof(AGlobalPostProcess_C, OutlineColor2) == 0x00029C, "Member 'AGlobalPostProcess_C::OutlineColor2' has a wrong offset!");
static_assert(offsetof(AGlobalPostProcess_C, OutlineColor3) == 0x0002AC, "Member 'AGlobalPostProcess_C::OutlineColor3' has a wrong offset!");
static_assert(offsetof(AGlobalPostProcess_C, OutlineColor4) == 0x0002BC, "Member 'AGlobalPostProcess_C::OutlineColor4' has a wrong offset!");
static_assert(offsetof(AGlobalPostProcess_C, MatcapLightColor) == 0x0002CC, "Member 'AGlobalPostProcess_C::MatcapLightColor' has a wrong offset!");
static_assert(offsetof(AGlobalPostProcess_C, DisablePT) == 0x0002DC, "Member 'AGlobalPostProcess_C::DisablePT' has a wrong offset!");

}

