#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GlobalPostProcess

#include "Basic.hpp"


namespace SDK::Params
{

// Function GlobalPostProcess.GlobalPostProcess_C.ExecuteUbergraph_GlobalPostProcess
// 0x0008 (0x0008 - 0x0000)
struct GlobalPostProcess_C_ExecuteUbergraph_GlobalPostProcess final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GlobalPostProcess_C_ExecuteUbergraph_GlobalPostProcess) == 0x000004, "Wrong alignment on GlobalPostProcess_C_ExecuteUbergraph_GlobalPostProcess");
static_assert(sizeof(GlobalPostProcess_C_ExecuteUbergraph_GlobalPostProcess) == 0x000008, "Wrong size on GlobalPostProcess_C_ExecuteUbergraph_GlobalPostProcess");
static_assert(offsetof(GlobalPostProcess_C_ExecuteUbergraph_GlobalPostProcess, EntryPoint) == 0x000000, "Member 'GlobalPostProcess_C_ExecuteUbergraph_GlobalPostProcess::EntryPoint' has a wrong offset!");
static_assert(offsetof(GlobalPostProcess_C_ExecuteUbergraph_GlobalPostProcess, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000004, "Member 'GlobalPostProcess_C_ExecuteUbergraph_GlobalPostProcess::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");

// Function GlobalPostProcess.GlobalPostProcess_C.SetLightingParameterCollectionValues
// 0x0008 (0x0008 - 0x0000)
struct GlobalPostProcess_C_SetLightingParameterCollectionValues final
{
public:
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GlobalPostProcess_C_SetLightingParameterCollectionValues) == 0x000004, "Wrong alignment on GlobalPostProcess_C_SetLightingParameterCollectionValues");
static_assert(sizeof(GlobalPostProcess_C_SetLightingParameterCollectionValues) == 0x000008, "Wrong size on GlobalPostProcess_C_SetLightingParameterCollectionValues");
static_assert(offsetof(GlobalPostProcess_C_SetLightingParameterCollectionValues, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000000, "Member 'GlobalPostProcess_C_SetLightingParameterCollectionValues::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalPostProcess_C_SetLightingParameterCollectionValues, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000004, "Member 'GlobalPostProcess_C_SetLightingParameterCollectionValues::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");

}

