#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HardCurrency01

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function HardCurrency01.HardCurrency01_C.ExecuteUbergraph_HardCurrency01
// 0x0058 (0x0058 - 0x0000)
struct HardCurrency01_C_ExecuteUbergraph_HardCurrency01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20B5[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0010(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0020(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20B6[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_SwitchToStackManagerStackAndPush_ReturnValue; // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HardCurrency01_C_ExecuteUbergraph_HardCurrency01) == 0x000008, "Wrong alignment on HardCurrency01_C_ExecuteUbergraph_HardCurrency01");
static_assert(sizeof(HardCurrency01_C_ExecuteUbergraph_HardCurrency01) == 0x000058, "Wrong size on HardCurrency01_C_ExecuteUbergraph_HardCurrency01");
static_assert(offsetof(HardCurrency01_C_ExecuteUbergraph_HardCurrency01, EntryPoint) == 0x000000, "Member 'HardCurrency01_C_ExecuteUbergraph_HardCurrency01::EntryPoint' has a wrong offset!");
static_assert(offsetof(HardCurrency01_C_ExecuteUbergraph_HardCurrency01, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'HardCurrency01_C_ExecuteUbergraph_HardCurrency01::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(HardCurrency01_C_ExecuteUbergraph_HardCurrency01, Temp_struct_Variable) == 0x000010, "Member 'HardCurrency01_C_ExecuteUbergraph_HardCurrency01::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(HardCurrency01_C_ExecuteUbergraph_HardCurrency01, Temp_delegate_Variable) == 0x000020, "Member 'HardCurrency01_C_ExecuteUbergraph_HardCurrency01::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(HardCurrency01_C_ExecuteUbergraph_HardCurrency01, CallFunc_PostEvent_ReturnValue) == 0x000030, "Member 'HardCurrency01_C_ExecuteUbergraph_HardCurrency01::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(HardCurrency01_C_ExecuteUbergraph_HardCurrency01, CallFunc_GetMenuManager_ReturnValue) == 0x000038, "Member 'HardCurrency01_C_ExecuteUbergraph_HardCurrency01::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(HardCurrency01_C_ExecuteUbergraph_HardCurrency01, K2Node_MakeArray_Array) == 0x000040, "Member 'HardCurrency01_C_ExecuteUbergraph_HardCurrency01::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(HardCurrency01_C_ExecuteUbergraph_HardCurrency01, CallFunc_SwitchToStackManagerStackAndPush_ReturnValue) == 0x000050, "Member 'HardCurrency01_C_ExecuteUbergraph_HardCurrency01::CallFunc_SwitchToStackManagerStackAndPush_ReturnValue' has a wrong offset!");

// Function HardCurrency01.HardCurrency01_C.SetCurrency
// 0x0028 (0x0028 - 0x0000)
struct HardCurrency01_C_SetCurrency final
{
public:
	int32                                         Amount;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Animate;                                           // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20B7[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
};
static_assert(alignof(HardCurrency01_C_SetCurrency) == 0x000008, "Wrong alignment on HardCurrency01_C_SetCurrency");
static_assert(sizeof(HardCurrency01_C_SetCurrency) == 0x000028, "Wrong size on HardCurrency01_C_SetCurrency");
static_assert(offsetof(HardCurrency01_C_SetCurrency, Amount) == 0x000000, "Member 'HardCurrency01_C_SetCurrency::Amount' has a wrong offset!");
static_assert(offsetof(HardCurrency01_C_SetCurrency, Animate) == 0x000004, "Member 'HardCurrency01_C_SetCurrency::Animate' has a wrong offset!");
static_assert(offsetof(HardCurrency01_C_SetCurrency, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'HardCurrency01_C_SetCurrency::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(HardCurrency01_C_SetCurrency, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'HardCurrency01_C_SetCurrency::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function HardCurrency01.HardCurrency01_C.UpdateHighlight
// 0x0018 (0x0018 - 0x0000)
struct HardCurrency01_C_UpdateHighlight final
{
public:
	bool                                          IsHighlighted;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20B8[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HardCurrency01_C_UpdateHighlight) == 0x000008, "Wrong alignment on HardCurrency01_C_UpdateHighlight");
static_assert(sizeof(HardCurrency01_C_UpdateHighlight) == 0x000018, "Wrong size on HardCurrency01_C_UpdateHighlight");
static_assert(offsetof(HardCurrency01_C_UpdateHighlight, IsHighlighted) == 0x000000, "Member 'HardCurrency01_C_UpdateHighlight::IsHighlighted' has a wrong offset!");
static_assert(offsetof(HardCurrency01_C_UpdateHighlight, Temp_byte_Variable) == 0x000001, "Member 'HardCurrency01_C_UpdateHighlight::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HardCurrency01_C_UpdateHighlight, Temp_byte_Variable_1) == 0x000002, "Member 'HardCurrency01_C_UpdateHighlight::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(HardCurrency01_C_UpdateHighlight, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'HardCurrency01_C_UpdateHighlight::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(HardCurrency01_C_UpdateHighlight, Temp_bool_Variable) == 0x000010, "Member 'HardCurrency01_C_UpdateHighlight::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HardCurrency01_C_UpdateHighlight, K2Node_Select_Default) == 0x000011, "Member 'HardCurrency01_C_UpdateHighlight::K2Node_Select_Default' has a wrong offset!");

}

