#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HardCurrencyButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HardCurrencyButton.HardCurrencyButton_C
// 0x0040 (0x04F8 - 0x04B8)
class UHardCurrencyButton_C final : public UMarinerSettingButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoveredAnim;                                       // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Highlight;                                         // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LabelText;                                         // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Material;                                          // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerButton*                         OverlayButton;                                     // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HardCurrencyButton(int32 EntryPoint);
	void BndEvt__OverlayButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();

	struct FMarinerSettingButtonAssets GetAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HardCurrencyButton_C">();
	}
	static class UHardCurrencyButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHardCurrencyButton_C>();
	}
};
static_assert(alignof(UHardCurrencyButton_C) == 0x000008, "Wrong alignment on UHardCurrencyButton_C");
static_assert(sizeof(UHardCurrencyButton_C) == 0x0004F8, "Wrong size on UHardCurrencyButton_C");
static_assert(offsetof(UHardCurrencyButton_C, UberGraphFrame) == 0x0004B8, "Member 'UHardCurrencyButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHardCurrencyButton_C, HoveredAnim) == 0x0004C0, "Member 'UHardCurrencyButton_C::HoveredAnim' has a wrong offset!");
static_assert(offsetof(UHardCurrencyButton_C, Background) == 0x0004C8, "Member 'UHardCurrencyButton_C::Background' has a wrong offset!");
static_assert(offsetof(UHardCurrencyButton_C, Highlight) == 0x0004D0, "Member 'UHardCurrencyButton_C::Highlight' has a wrong offset!");
static_assert(offsetof(UHardCurrencyButton_C, Image_0) == 0x0004D8, "Member 'UHardCurrencyButton_C::Image_0' has a wrong offset!");
static_assert(offsetof(UHardCurrencyButton_C, LabelText) == 0x0004E0, "Member 'UHardCurrencyButton_C::LabelText' has a wrong offset!");
static_assert(offsetof(UHardCurrencyButton_C, Material) == 0x0004E8, "Member 'UHardCurrencyButton_C::Material' has a wrong offset!");
static_assert(offsetof(UHardCurrencyButton_C, OverlayButton) == 0x0004F0, "Member 'UHardCurrencyButton_C::OverlayButton' has a wrong offset!");

}

