#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HighlightedMapWidget

#include "Basic.hpp"

#include "MangoClient_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function HighlightedMapWidget.HighlightedMapWidget_C.SetMap
// 0x0010 (0x0010 - 0x0000)
struct HighlightedMapWidget_C_SetMap final
{
public:
	struct FGuid                                  MapId;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HighlightedMapWidget_C_SetMap) == 0x000004, "Wrong alignment on HighlightedMapWidget_C_SetMap");
static_assert(sizeof(HighlightedMapWidget_C_SetMap) == 0x000010, "Wrong size on HighlightedMapWidget_C_SetMap");
static_assert(offsetof(HighlightedMapWidget_C_SetMap, MapId) == 0x000000, "Member 'HighlightedMapWidget_C_SetMap::MapId' has a wrong offset!");

// Function HighlightedMapWidget.HighlightedMapWidget_C.Populate
// 0x0140 (0x0140 - 0x0000)
struct HighlightedMapWidget_C_Populate final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	EMapRecommendedNumberOfPlayers                Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231B[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	class UMarinerMapGlobals*                     CallFunc_GetMapGlobals_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMangoCMSManager*                       CallFunc_Get_ReturnValue;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGuid, struct FMangoMap>          CallFunc_GetMaps_ReturnValue;                      // 0x0048(0x0050)(ConstParm, ZeroConstructor)
	struct FMangoMap                              CallFunc_Map_Find_Value;                           // 0x0098(0x0060)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_Guid_ReturnValue;                 // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231C[0x6];                                     // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetSoftImage_ReturnValue;                 // 0x0100(0x0028)(ConstParm, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0128(0x0018)()
};
static_assert(alignof(HighlightedMapWidget_C_Populate) == 0x000008, "Wrong alignment on HighlightedMapWidget_C_Populate");
static_assert(sizeof(HighlightedMapWidget_C_Populate) == 0x000140, "Wrong size on HighlightedMapWidget_C_Populate");
static_assert(offsetof(HighlightedMapWidget_C_Populate, ReturnValue) == 0x000000, "Member 'HighlightedMapWidget_C_Populate::ReturnValue' has a wrong offset!");
static_assert(offsetof(HighlightedMapWidget_C_Populate, Temp_byte_Variable) == 0x000001, "Member 'HighlightedMapWidget_C_Populate::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HighlightedMapWidget_C_Populate, Temp_text_Variable) == 0x000008, "Member 'HighlightedMapWidget_C_Populate::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(HighlightedMapWidget_C_Populate, Temp_text_Variable_1) == 0x000020, "Member 'HighlightedMapWidget_C_Populate::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(HighlightedMapWidget_C_Populate, CallFunc_GetMapGlobals_ReturnValue) == 0x000038, "Member 'HighlightedMapWidget_C_Populate::CallFunc_GetMapGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(HighlightedMapWidget_C_Populate, CallFunc_Get_ReturnValue) == 0x000040, "Member 'HighlightedMapWidget_C_Populate::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(HighlightedMapWidget_C_Populate, CallFunc_GetMaps_ReturnValue) == 0x000048, "Member 'HighlightedMapWidget_C_Populate::CallFunc_GetMaps_ReturnValue' has a wrong offset!");
static_assert(offsetof(HighlightedMapWidget_C_Populate, CallFunc_Map_Find_Value) == 0x000098, "Member 'HighlightedMapWidget_C_Populate::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(HighlightedMapWidget_C_Populate, CallFunc_Map_Find_ReturnValue) == 0x0000F8, "Member 'HighlightedMapWidget_C_Populate::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(HighlightedMapWidget_C_Populate, CallFunc_IsValid_Guid_ReturnValue) == 0x0000F9, "Member 'HighlightedMapWidget_C_Populate::CallFunc_IsValid_Guid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HighlightedMapWidget_C_Populate, CallFunc_GetSoftImage_ReturnValue) == 0x000100, "Member 'HighlightedMapWidget_C_Populate::CallFunc_GetSoftImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(HighlightedMapWidget_C_Populate, K2Node_Select_Default) == 0x000128, "Member 'HighlightedMapWidget_C_Populate::K2Node_Select_Default' has a wrong offset!");

}

