#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HomeBlastPassButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "MangoClient_structs.hpp"
#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function HomeBlastPassButton.HomeBlastPassButton_C.ExecuteUbergraph_HomeBlastPassButton
// 0x0090 (0x0090 - 0x0000)
struct HomeBlastPassButton_C_ExecuteUbergraph_HomeBlastPassButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2116[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoBlastPassManager*                 CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMangoBlastPassDefinition              K2Node_CustomEvent_Definition;                     // 0x0010(0x0068)(ConstParm)
	class UMangoBlastPassManager*                 CallFunc_Get_ReturnValue_1;                        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FMangoBlastPassDefinition& Definition)> K2Node_CreateDelegate_OutputDelegate;              // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(HomeBlastPassButton_C_ExecuteUbergraph_HomeBlastPassButton) == 0x000008, "Wrong alignment on HomeBlastPassButton_C_ExecuteUbergraph_HomeBlastPassButton");
static_assert(sizeof(HomeBlastPassButton_C_ExecuteUbergraph_HomeBlastPassButton) == 0x000090, "Wrong size on HomeBlastPassButton_C_ExecuteUbergraph_HomeBlastPassButton");
static_assert(offsetof(HomeBlastPassButton_C_ExecuteUbergraph_HomeBlastPassButton, EntryPoint) == 0x000000, "Member 'HomeBlastPassButton_C_ExecuteUbergraph_HomeBlastPassButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(HomeBlastPassButton_C_ExecuteUbergraph_HomeBlastPassButton, CallFunc_Get_ReturnValue) == 0x000008, "Member 'HomeBlastPassButton_C_ExecuteUbergraph_HomeBlastPassButton::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeBlastPassButton_C_ExecuteUbergraph_HomeBlastPassButton, K2Node_CustomEvent_Definition) == 0x000010, "Member 'HomeBlastPassButton_C_ExecuteUbergraph_HomeBlastPassButton::K2Node_CustomEvent_Definition' has a wrong offset!");
static_assert(offsetof(HomeBlastPassButton_C_ExecuteUbergraph_HomeBlastPassButton, CallFunc_Get_ReturnValue_1) == 0x000078, "Member 'HomeBlastPassButton_C_ExecuteUbergraph_HomeBlastPassButton::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HomeBlastPassButton_C_ExecuteUbergraph_HomeBlastPassButton, K2Node_CreateDelegate_OutputDelegate) == 0x000080, "Member 'HomeBlastPassButton_C_ExecuteUbergraph_HomeBlastPassButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function HomeBlastPassButton.HomeBlastPassButton_C.OnSeasonChanged
// 0x0068 (0x0068 - 0x0000)
struct HomeBlastPassButton_C_OnSeasonChanged final
{
public:
	struct FMangoBlastPassDefinition              Definition;                                        // 0x0000(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(HomeBlastPassButton_C_OnSeasonChanged) == 0x000008, "Wrong alignment on HomeBlastPassButton_C_OnSeasonChanged");
static_assert(sizeof(HomeBlastPassButton_C_OnSeasonChanged) == 0x000068, "Wrong size on HomeBlastPassButton_C_OnSeasonChanged");
static_assert(offsetof(HomeBlastPassButton_C_OnSeasonChanged, Definition) == 0x000000, "Member 'HomeBlastPassButton_C_OnSeasonChanged::Definition' has a wrong offset!");

// Function HomeBlastPassButton.HomeBlastPassButton_C.Refresh
// 0x0138 (0x0138 - 0x0000)
struct HomeBlastPassButton_C_Refresh final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2117[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoPlayerManager*                    CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2118[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMangoBlastPassProgression             CallFunc_GetActiveBlastPassProgression_OutProgression; // 0x0018(0x0028)()
	bool                                          CallFunc_GetActiveBlastPassProgression_ReturnValue; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2119[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoInventoryManager*                 CallFunc_Get_ReturnValue_1;                        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActiveBlastPassSeasonOwned_ReturnValue; // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211A[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoCMSManager*                       CallFunc_Get_ReturnValue_2;                        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMangoBlastPassDefinition              CallFunc_TryGetActiveBlastPassDefinition_OutDefinition; // 0x0060(0x0068)()
	bool                                          CallFunc_TryGetActiveBlastPassDefinition_ReturnValue; // 0x00C8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211B[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00D0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0110(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0120(0x0018)()
};
static_assert(alignof(HomeBlastPassButton_C_Refresh) == 0x000008, "Wrong alignment on HomeBlastPassButton_C_Refresh");
static_assert(sizeof(HomeBlastPassButton_C_Refresh) == 0x000138, "Wrong size on HomeBlastPassButton_C_Refresh");
static_assert(offsetof(HomeBlastPassButton_C_Refresh, Temp_byte_Variable) == 0x000000, "Member 'HomeBlastPassButton_C_Refresh::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HomeBlastPassButton_C_Refresh, Temp_byte_Variable_1) == 0x000001, "Member 'HomeBlastPassButton_C_Refresh::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(HomeBlastPassButton_C_Refresh, CallFunc_Get_ReturnValue) == 0x000008, "Member 'HomeBlastPassButton_C_Refresh::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeBlastPassButton_C_Refresh, Temp_bool_Variable) == 0x000010, "Member 'HomeBlastPassButton_C_Refresh::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HomeBlastPassButton_C_Refresh, CallFunc_GetActiveBlastPassProgression_OutProgression) == 0x000018, "Member 'HomeBlastPassButton_C_Refresh::CallFunc_GetActiveBlastPassProgression_OutProgression' has a wrong offset!");
static_assert(offsetof(HomeBlastPassButton_C_Refresh, CallFunc_GetActiveBlastPassProgression_ReturnValue) == 0x000040, "Member 'HomeBlastPassButton_C_Refresh::CallFunc_GetActiveBlastPassProgression_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeBlastPassButton_C_Refresh, CallFunc_Get_ReturnValue_1) == 0x000048, "Member 'HomeBlastPassButton_C_Refresh::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HomeBlastPassButton_C_Refresh, CallFunc_IsActiveBlastPassSeasonOwned_ReturnValue) == 0x000050, "Member 'HomeBlastPassButton_C_Refresh::CallFunc_IsActiveBlastPassSeasonOwned_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeBlastPassButton_C_Refresh, K2Node_Select_Default) == 0x000051, "Member 'HomeBlastPassButton_C_Refresh::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HomeBlastPassButton_C_Refresh, CallFunc_Get_ReturnValue_2) == 0x000058, "Member 'HomeBlastPassButton_C_Refresh::CallFunc_Get_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HomeBlastPassButton_C_Refresh, CallFunc_TryGetActiveBlastPassDefinition_OutDefinition) == 0x000060, "Member 'HomeBlastPassButton_C_Refresh::CallFunc_TryGetActiveBlastPassDefinition_OutDefinition' has a wrong offset!");
static_assert(offsetof(HomeBlastPassButton_C_Refresh, CallFunc_TryGetActiveBlastPassDefinition_ReturnValue) == 0x0000C8, "Member 'HomeBlastPassButton_C_Refresh::CallFunc_TryGetActiveBlastPassDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeBlastPassButton_C_Refresh, K2Node_MakeStruct_FormatArgumentData) == 0x0000D0, "Member 'HomeBlastPassButton_C_Refresh::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(HomeBlastPassButton_C_Refresh, K2Node_MakeArray_Array) == 0x000110, "Member 'HomeBlastPassButton_C_Refresh::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(HomeBlastPassButton_C_Refresh, CallFunc_Format_ReturnValue) == 0x000120, "Member 'HomeBlastPassButton_C_Refresh::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function HomeBlastPassButton.HomeBlastPassButton_C.GetAssets
// 0x00D0 (0x00D0 - 0x0000)
struct HomeBlastPassButton_C_GetAssets final
{
public:
	struct FMarinerLayeredButtonAssets            ReturnValue;                                       // 0x0000(0x0068)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference)
	struct FMarinerLayeredButtonAssets            K2Node_MakeStruct_MarinerLayeredButtonAssets;      // 0x0068(0x0068)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(HomeBlastPassButton_C_GetAssets) == 0x000008, "Wrong alignment on HomeBlastPassButton_C_GetAssets");
static_assert(sizeof(HomeBlastPassButton_C_GetAssets) == 0x0000D0, "Wrong size on HomeBlastPassButton_C_GetAssets");
static_assert(offsetof(HomeBlastPassButton_C_GetAssets, ReturnValue) == 0x000000, "Member 'HomeBlastPassButton_C_GetAssets::ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeBlastPassButton_C_GetAssets, K2Node_MakeStruct_MarinerLayeredButtonAssets) == 0x000068, "Member 'HomeBlastPassButton_C_GetAssets::K2Node_MakeStruct_MarinerLayeredButtonAssets' has a wrong offset!");

}

