#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HomeMenu

#include "Basic.hpp"

#include "Mariner_structs.hpp"
#include "MangoClient_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function HomeMenu.HomeMenu_C.ExecuteUbergraph_HomeMenu
// 0x03D8 (0x03D8 - 0x0000)
struct HomeMenu_C_ExecuteUbergraph_HomeMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23B0[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EMangoPartyBusyState State)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23B1[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EMarinerGameVersion NewVersion)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_23B2[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerSettingBase*                    K2Node_ComponentBoundEvent_Instance_6;             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasQuickPlay_IsValid;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23B3[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMangoPlaylist                         CallFunc_HasQuickPlay_Playlist;                    // 0x0040(0x00F8)()
	class FText                                   CallFunc_HasQuickPlay_ButtonText;                  // 0x0138(0x0018)()
	bool                                          CallFunc_HasQuickPlay_CanInteract;                 // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23B4[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoMatchmakingManager*               CallFunc_Get_ReturnValue;                          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerSettingBase*                    K2Node_ComponentBoundEvent_Instance_5;             // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue;               // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerSettingBase*                    K2Node_ComponentBoundEvent_Instance_4;             // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuStackLayer*                 CallFunc_PushLayerToActiveStack_ReturnValue;       // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23B5[0x4];                                     // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AMarinerMainMenuVignettesManager*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x0190(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          K2Node_Event_bToSubLayer;                          // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23B6[0x7];                                     // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMarinerMainMenuVignettesManager*       CallFunc_Array_Get_Item;                           // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23B7[0x4];                                     // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue_1;             // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuStackLayer*                 CallFunc_PushLayerToActiveStack_ReturnValue_1;     // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23B8[0x7];                                     // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoQuestManager*                     CallFunc_Get_ReturnValue_1;                        // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMangoQuestDescription                 CallFunc_GetQuestDescriptionBySlotId_ReturnValue;  // 0x01D8(0x0118)()
	bool                                          Temp_bool_Variable;                                // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23B9[0x7];                                     // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoQuestManager*                     CallFunc_Get_ReturnValue_2;                        // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23BA[0x7];                                     // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerLayeredButton*                  K2Node_ComponentBoundEvent_Instance_3;             // 0x0308(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerLayeredButton*                  K2Node_ComponentBoundEvent_Instance_2;             // 0x0310(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue_2;             // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerLayeredButton*                  K2Node_ComponentBoundEvent_Instance_1;             // 0x0320(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SwitchToStackManagerStack_ReturnValue;    // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23BB[0x7];                                     // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue_3;             // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFromSubMenu;                         // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23BC[0x7];                                     // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerMenuStackLayer*                 CallFunc_PushLayerToActiveStack_ReturnValue_2;     // 0x0340(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMangoPartyManager*                     CallFunc_Get_ReturnValue_3;                        // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMarinerInputInterface> CallFunc_SetActiveInputWidget_InputWidget_CastInput; // 0x0350(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMangoPartyBusyState                          K2Node_CustomEvent_State;                          // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23BD[0x7];                                     // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoMatchmakingManager*               CallFunc_Get_ReturnValue_4;                        // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlatformX1_ReturnValue;                 // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0372(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23BE[0x1];                                     // 0x0373(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0374(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_23BF[0x4];                                     // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMusicManager_C*                        CallFunc_GetMusicManager_MusicManager;             // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurrentlyInGameplayMap_ReturnValue;     // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23C0[0x6];                                     // 0x039A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoConnectionManager*                CallFunc_Get_ReturnValue_5;                        // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMarinerGameVersion                           K2Node_CustomEvent_NewVersion;                     // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C1[0x7];                                     // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerLayeredButton*                  K2Node_ComponentBoundEvent_Instance;               // 0x03B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C2[0x4];                                     // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerUIGlobals*                      CallFunc_GetUIGlobals_ReturnValue;                 // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerCollectionDataAsset*            CallFunc_GetMythicEditionCollection_ReturnValue;   // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23C3[0x3];                                     // 0x03D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HomeMenu_C_ExecuteUbergraph_HomeMenu) == 0x000008, "Wrong alignment on HomeMenu_C_ExecuteUbergraph_HomeMenu");
static_assert(sizeof(HomeMenu_C_ExecuteUbergraph_HomeMenu) == 0x0003D8, "Wrong size on HomeMenu_C_ExecuteUbergraph_HomeMenu");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, EntryPoint) == 0x000000, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, Temp_byte_Variable) == 0x000004, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, Temp_byte_Variable_1) == 0x000018, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, K2Node_ComponentBoundEvent_Instance_6) == 0x000030, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::K2Node_ComponentBoundEvent_Instance_6' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_HasQuickPlay_IsValid) == 0x000038, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_HasQuickPlay_IsValid' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_HasQuickPlay_Playlist) == 0x000040, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_HasQuickPlay_Playlist' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_HasQuickPlay_ButtonText) == 0x000138, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_HasQuickPlay_ButtonText' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_HasQuickPlay_CanInteract) == 0x000150, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_HasQuickPlay_CanInteract' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_Get_ReturnValue) == 0x000158, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, K2Node_ComponentBoundEvent_Instance_5) == 0x000160, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::K2Node_ComponentBoundEvent_Instance_5' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_GetMenuManager_ReturnValue) == 0x000168, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, K2Node_ComponentBoundEvent_Instance_4) == 0x000170, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::K2Node_ComponentBoundEvent_Instance_4' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_PushLayerToActiveStack_ReturnValue) == 0x000178, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_PushLayerToActiveStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, Temp_int_Array_Index_Variable) == 0x000180, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_GetOwningPlayer_ReturnValue) == 0x000188, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_GetAllActorsOfClass_OutActors) == 0x000190, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, K2Node_Event_bToSubLayer) == 0x0001A0, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::K2Node_Event_bToSubLayer' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_Array_Get_Item) == 0x0001A8, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_Array_Length_ReturnValue) == 0x0001B0, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_GetMenuManager_ReturnValue_1) == 0x0001B8, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_GetMenuManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_PushLayerToActiveStack_ReturnValue_1) == 0x0001C0, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_PushLayerToActiveStack_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_IsValid_ReturnValue) == 0x0001C8, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_Get_ReturnValue_1) == 0x0001D0, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_GetQuestDescriptionBySlotId_ReturnValue) == 0x0001D8, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_GetQuestDescriptionBySlotId_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, Temp_bool_Variable) == 0x0002F0, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_Get_ReturnValue_2) == 0x0002F8, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_Get_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000300, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, K2Node_ComponentBoundEvent_Instance_3) == 0x000308, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::K2Node_ComponentBoundEvent_Instance_3' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, K2Node_ComponentBoundEvent_Instance_2) == 0x000310, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::K2Node_ComponentBoundEvent_Instance_2' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_GetMenuManager_ReturnValue_2) == 0x000318, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_GetMenuManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, K2Node_ComponentBoundEvent_Instance_1) == 0x000320, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::K2Node_ComponentBoundEvent_Instance_1' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_SwitchToStackManagerStack_ReturnValue) == 0x000328, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_SwitchToStackManagerStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_GetMenuManager_ReturnValue_3) == 0x000330, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_GetMenuManager_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, K2Node_Event_bFromSubMenu) == 0x000338, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::K2Node_Event_bFromSubMenu' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_PushLayerToActiveStack_ReturnValue_2) == 0x000340, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_PushLayerToActiveStack_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_Get_ReturnValue_3) == 0x000348, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_Get_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_SetActiveInputWidget_InputWidget_CastInput) == 0x000350, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_SetActiveInputWidget_InputWidget_CastInput' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, K2Node_CustomEvent_State) == 0x000360, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::K2Node_CustomEvent_State' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_Get_ReturnValue_4) == 0x000368, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_Get_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_IsValid_ReturnValue_1) == 0x000370, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_IsPlatformX1_ReturnValue) == 0x000371, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_IsPlatformX1_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, K2Node_Select_Default) == 0x000372, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x000374, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_GetGameInstance_ReturnValue) == 0x000388, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_GetMusicManager_MusicManager) == 0x000390, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_GetMusicManager_MusicManager' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_IsCurrentlyInGameplayMap_ReturnValue) == 0x000398, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_IsCurrentlyInGameplayMap_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_Not_PreBool_ReturnValue) == 0x000399, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_Get_ReturnValue_5) == 0x0003A0, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_Get_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, K2Node_CustomEvent_NewVersion) == 0x0003A8, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::K2Node_CustomEvent_NewVersion' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, K2Node_ComponentBoundEvent_Instance) == 0x0003B0, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::K2Node_ComponentBoundEvent_Instance' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, Temp_int_Loop_Counter_Variable) == 0x0003B8, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_GetUIGlobals_ReturnValue) == 0x0003C0, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_GetUIGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_GetMythicEditionCollection_ReturnValue) == 0x0003C8, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_GetMythicEditionCollection_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_Less_IntInt_ReturnValue) == 0x0003D0, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_ExecuteUbergraph_HomeMenu, CallFunc_Add_IntInt_ReturnValue) == 0x0003D4, "Member 'HomeMenu_C_ExecuteUbergraph_HomeMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function HomeMenu.HomeMenu_C.BndEvt__StandardVersionUpsell_K2Node_ComponentBoundEvent_7_OnLayeredButtonEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct HomeMenu_C_BndEvt__StandardVersionUpsell_K2Node_ComponentBoundEvent_7_OnLayeredButtonEvent__DelegateSignature final
{
public:
	class UMarinerLayeredButton*                  Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HomeMenu_C_BndEvt__StandardVersionUpsell_K2Node_ComponentBoundEvent_7_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on HomeMenu_C_BndEvt__StandardVersionUpsell_K2Node_ComponentBoundEvent_7_OnLayeredButtonEvent__DelegateSignature");
static_assert(sizeof(HomeMenu_C_BndEvt__StandardVersionUpsell_K2Node_ComponentBoundEvent_7_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong size on HomeMenu_C_BndEvt__StandardVersionUpsell_K2Node_ComponentBoundEvent_7_OnLayeredButtonEvent__DelegateSignature");
static_assert(offsetof(HomeMenu_C_BndEvt__StandardVersionUpsell_K2Node_ComponentBoundEvent_7_OnLayeredButtonEvent__DelegateSignature, Instance) == 0x000000, "Member 'HomeMenu_C_BndEvt__StandardVersionUpsell_K2Node_ComponentBoundEvent_7_OnLayeredButtonEvent__DelegateSignature::Instance' has a wrong offset!");

// Function HomeMenu.HomeMenu_C.OnGameVersionChanged
// 0x0001 (0x0001 - 0x0000)
struct HomeMenu_C_OnGameVersionChanged final
{
public:
	EMarinerGameVersion                           NewVersion;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HomeMenu_C_OnGameVersionChanged) == 0x000001, "Wrong alignment on HomeMenu_C_OnGameVersionChanged");
static_assert(sizeof(HomeMenu_C_OnGameVersionChanged) == 0x000001, "Wrong size on HomeMenu_C_OnGameVersionChanged");
static_assert(offsetof(HomeMenu_C_OnGameVersionChanged, NewVersion) == 0x000000, "Member 'HomeMenu_C_OnGameVersionChanged::NewVersion' has a wrong offset!");

// Function HomeMenu.HomeMenu_C.PartyBusyState
// 0x0001 (0x0001 - 0x0000)
struct HomeMenu_C_PartyBusyState final
{
public:
	EMangoPartyBusyState                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HomeMenu_C_PartyBusyState) == 0x000001, "Wrong alignment on HomeMenu_C_PartyBusyState");
static_assert(sizeof(HomeMenu_C_PartyBusyState) == 0x000001, "Wrong size on HomeMenu_C_PartyBusyState");
static_assert(offsetof(HomeMenu_C_PartyBusyState, State) == 0x000000, "Member 'HomeMenu_C_PartyBusyState::State' has a wrong offset!");

// Function HomeMenu.HomeMenu_C.BP_OnEntered
// 0x0001 (0x0001 - 0x0000)
struct HomeMenu_C_BP_OnEntered final
{
public:
	bool                                          bFromSubMenu;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HomeMenu_C_BP_OnEntered) == 0x000001, "Wrong alignment on HomeMenu_C_BP_OnEntered");
static_assert(sizeof(HomeMenu_C_BP_OnEntered) == 0x000001, "Wrong size on HomeMenu_C_BP_OnEntered");
static_assert(offsetof(HomeMenu_C_BP_OnEntered, bFromSubMenu) == 0x000000, "Member 'HomeMenu_C_BP_OnEntered::bFromSubMenu' has a wrong offset!");

// Function HomeMenu.HomeMenu_C.BndEvt__Quests_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct HomeMenu_C_BndEvt__Quests_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature final
{
public:
	class UMarinerLayeredButton*                  Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HomeMenu_C_BndEvt__Quests_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on HomeMenu_C_BndEvt__Quests_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature");
static_assert(sizeof(HomeMenu_C_BndEvt__Quests_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong size on HomeMenu_C_BndEvt__Quests_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature");
static_assert(offsetof(HomeMenu_C_BndEvt__Quests_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature, Instance) == 0x000000, "Member 'HomeMenu_C_BndEvt__Quests_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature::Instance' has a wrong offset!");

// Function HomeMenu.HomeMenu_C.BndEvt__BlastPass_K2Node_ComponentBoundEvent_5_OnLayeredButtonEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct HomeMenu_C_BndEvt__BlastPass_K2Node_ComponentBoundEvent_5_OnLayeredButtonEvent__DelegateSignature final
{
public:
	class UMarinerLayeredButton*                  Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HomeMenu_C_BndEvt__BlastPass_K2Node_ComponentBoundEvent_5_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on HomeMenu_C_BndEvt__BlastPass_K2Node_ComponentBoundEvent_5_OnLayeredButtonEvent__DelegateSignature");
static_assert(sizeof(HomeMenu_C_BndEvt__BlastPass_K2Node_ComponentBoundEvent_5_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong size on HomeMenu_C_BndEvt__BlastPass_K2Node_ComponentBoundEvent_5_OnLayeredButtonEvent__DelegateSignature");
static_assert(offsetof(HomeMenu_C_BndEvt__BlastPass_K2Node_ComponentBoundEvent_5_OnLayeredButtonEvent__DelegateSignature, Instance) == 0x000000, "Member 'HomeMenu_C_BndEvt__BlastPass_K2Node_ComponentBoundEvent_5_OnLayeredButtonEvent__DelegateSignature::Instance' has a wrong offset!");

// Function HomeMenu.HomeMenu_C.BndEvt__NewsButton_K2Node_ComponentBoundEvent_3_OnLayeredButtonEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct HomeMenu_C_BndEvt__NewsButton_K2Node_ComponentBoundEvent_3_OnLayeredButtonEvent__DelegateSignature final
{
public:
	class UMarinerLayeredButton*                  Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HomeMenu_C_BndEvt__NewsButton_K2Node_ComponentBoundEvent_3_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on HomeMenu_C_BndEvt__NewsButton_K2Node_ComponentBoundEvent_3_OnLayeredButtonEvent__DelegateSignature");
static_assert(sizeof(HomeMenu_C_BndEvt__NewsButton_K2Node_ComponentBoundEvent_3_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong size on HomeMenu_C_BndEvt__NewsButton_K2Node_ComponentBoundEvent_3_OnLayeredButtonEvent__DelegateSignature");
static_assert(offsetof(HomeMenu_C_BndEvt__NewsButton_K2Node_ComponentBoundEvent_3_OnLayeredButtonEvent__DelegateSignature, Instance) == 0x000000, "Member 'HomeMenu_C_BndEvt__NewsButton_K2Node_ComponentBoundEvent_3_OnLayeredButtonEvent__DelegateSignature::Instance' has a wrong offset!");

// Function HomeMenu.HomeMenu_C.BP_OnExited
// 0x0001 (0x0001 - 0x0000)
struct HomeMenu_C_BP_OnExited final
{
public:
	bool                                          bToSubLayer;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HomeMenu_C_BP_OnExited) == 0x000001, "Wrong alignment on HomeMenu_C_BP_OnExited");
static_assert(sizeof(HomeMenu_C_BP_OnExited) == 0x000001, "Wrong size on HomeMenu_C_BP_OnExited");
static_assert(offsetof(HomeMenu_C_BP_OnExited, bToSubLayer) == 0x000000, "Member 'HomeMenu_C_BP_OnExited::bToSubLayer' has a wrong offset!");

// Function HomeMenu.HomeMenu_C.BndEvt__ChangeAccount_K2Node_ComponentBoundEvent_4_OnButtonSettingSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct HomeMenu_C_BndEvt__ChangeAccount_K2Node_ComponentBoundEvent_4_OnButtonSettingSelected__DelegateSignature final
{
public:
	class UMarinerSettingBase*                    Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HomeMenu_C_BndEvt__ChangeAccount_K2Node_ComponentBoundEvent_4_OnButtonSettingSelected__DelegateSignature) == 0x000008, "Wrong alignment on HomeMenu_C_BndEvt__ChangeAccount_K2Node_ComponentBoundEvent_4_OnButtonSettingSelected__DelegateSignature");
static_assert(sizeof(HomeMenu_C_BndEvt__ChangeAccount_K2Node_ComponentBoundEvent_4_OnButtonSettingSelected__DelegateSignature) == 0x000008, "Wrong size on HomeMenu_C_BndEvt__ChangeAccount_K2Node_ComponentBoundEvent_4_OnButtonSettingSelected__DelegateSignature");
static_assert(offsetof(HomeMenu_C_BndEvt__ChangeAccount_K2Node_ComponentBoundEvent_4_OnButtonSettingSelected__DelegateSignature, Instance) == 0x000000, "Member 'HomeMenu_C_BndEvt__ChangeAccount_K2Node_ComponentBoundEvent_4_OnButtonSettingSelected__DelegateSignature::Instance' has a wrong offset!");

// Function HomeMenu.HomeMenu_C.BndEvt__Rewards_K2Node_ComponentBoundEvent_1_OnButtonSettingSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct HomeMenu_C_BndEvt__Rewards_K2Node_ComponentBoundEvent_1_OnButtonSettingSelected__DelegateSignature final
{
public:
	class UMarinerSettingBase*                    Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HomeMenu_C_BndEvt__Rewards_K2Node_ComponentBoundEvent_1_OnButtonSettingSelected__DelegateSignature) == 0x000008, "Wrong alignment on HomeMenu_C_BndEvt__Rewards_K2Node_ComponentBoundEvent_1_OnButtonSettingSelected__DelegateSignature");
static_assert(sizeof(HomeMenu_C_BndEvt__Rewards_K2Node_ComponentBoundEvent_1_OnButtonSettingSelected__DelegateSignature) == 0x000008, "Wrong size on HomeMenu_C_BndEvt__Rewards_K2Node_ComponentBoundEvent_1_OnButtonSettingSelected__DelegateSignature");
static_assert(offsetof(HomeMenu_C_BndEvt__Rewards_K2Node_ComponentBoundEvent_1_OnButtonSettingSelected__DelegateSignature, Instance) == 0x000000, "Member 'HomeMenu_C_BndEvt__Rewards_K2Node_ComponentBoundEvent_1_OnButtonSettingSelected__DelegateSignature::Instance' has a wrong offset!");

// Function HomeMenu.HomeMenu_C.BndEvt__QuickPlay_K2Node_ComponentBoundEvent_0_OnButtonSettingSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct HomeMenu_C_BndEvt__QuickPlay_K2Node_ComponentBoundEvent_0_OnButtonSettingSelected__DelegateSignature final
{
public:
	class UMarinerSettingBase*                    Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HomeMenu_C_BndEvt__QuickPlay_K2Node_ComponentBoundEvent_0_OnButtonSettingSelected__DelegateSignature) == 0x000008, "Wrong alignment on HomeMenu_C_BndEvt__QuickPlay_K2Node_ComponentBoundEvent_0_OnButtonSettingSelected__DelegateSignature");
static_assert(sizeof(HomeMenu_C_BndEvt__QuickPlay_K2Node_ComponentBoundEvent_0_OnButtonSettingSelected__DelegateSignature) == 0x000008, "Wrong size on HomeMenu_C_BndEvt__QuickPlay_K2Node_ComponentBoundEvent_0_OnButtonSettingSelected__DelegateSignature");
static_assert(offsetof(HomeMenu_C_BndEvt__QuickPlay_K2Node_ComponentBoundEvent_0_OnButtonSettingSelected__DelegateSignature, Instance) == 0x000000, "Member 'HomeMenu_C_BndEvt__QuickPlay_K2Node_ComponentBoundEvent_0_OnButtonSettingSelected__DelegateSignature::Instance' has a wrong offset!");

// Function HomeMenu.HomeMenu_C.HasQuickPlay
// 0x0340 (0x0340 - 0x0000)
struct HomeMenu_C_HasQuickPlay final
{
public:
	bool                                          IsValid;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23C4[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMangoPlaylist                         Playlist;                                          // 0x0008(0x00F8)(Parm, OutParm)
	class FText                                   ButtonText;                                        // 0x0100(0x0018)(Parm, OutParm)
	bool                                          CanInteract;                                       // 0x0118(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23C5[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0120(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0138(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0150(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0168(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0180(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x0198(0x0018)()
	EPlaylistInteractionState                     Temp_byte_Variable;                                // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C6[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_6;                              // 0x01B8(0x0018)()
	class FText                                   Temp_text_Variable_7;                              // 0x01D0(0x0018)()
	class FText                                   Temp_text_Variable_8;                              // 0x01E8(0x0018)()
	EMatchmakingInteractionState                  Temp_byte_Variable_1;                              // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C7[0x7];                                     // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoCMSManager*                       CallFunc_Get_ReturnValue;                          // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMangoPlaylist                         CallFunc_GetQuickPlayPlaylist_OutPlaylist;         // 0x0210(0x00F8)()
	bool                                          CallFunc_GetQuickPlayPlaylist_ReturnValue;         // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMatchmakingInteractionState                  CallFunc_GetPlaylistInteractionState_OutMatchmakingState; // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlaylistInteractionState                     CallFunc_GetPlaylistInteractionState_ReturnValue;  // 0x030A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x030B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23C8[0x4];                                     // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0310(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0328(0x0018)()
};
static_assert(alignof(HomeMenu_C_HasQuickPlay) == 0x000008, "Wrong alignment on HomeMenu_C_HasQuickPlay");
static_assert(sizeof(HomeMenu_C_HasQuickPlay) == 0x000340, "Wrong size on HomeMenu_C_HasQuickPlay");
static_assert(offsetof(HomeMenu_C_HasQuickPlay, IsValid) == 0x000000, "Member 'HomeMenu_C_HasQuickPlay::IsValid' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_HasQuickPlay, Playlist) == 0x000008, "Member 'HomeMenu_C_HasQuickPlay::Playlist' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_HasQuickPlay, ButtonText) == 0x000100, "Member 'HomeMenu_C_HasQuickPlay::ButtonText' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_HasQuickPlay, CanInteract) == 0x000118, "Member 'HomeMenu_C_HasQuickPlay::CanInteract' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_HasQuickPlay, Temp_text_Variable) == 0x000120, "Member 'HomeMenu_C_HasQuickPlay::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_HasQuickPlay, Temp_text_Variable_1) == 0x000138, "Member 'HomeMenu_C_HasQuickPlay::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_HasQuickPlay, Temp_text_Variable_2) == 0x000150, "Member 'HomeMenu_C_HasQuickPlay::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_HasQuickPlay, Temp_text_Variable_3) == 0x000168, "Member 'HomeMenu_C_HasQuickPlay::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_HasQuickPlay, Temp_text_Variable_4) == 0x000180, "Member 'HomeMenu_C_HasQuickPlay::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_HasQuickPlay, Temp_text_Variable_5) == 0x000198, "Member 'HomeMenu_C_HasQuickPlay::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_HasQuickPlay, Temp_byte_Variable) == 0x0001B0, "Member 'HomeMenu_C_HasQuickPlay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_HasQuickPlay, Temp_text_Variable_6) == 0x0001B8, "Member 'HomeMenu_C_HasQuickPlay::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_HasQuickPlay, Temp_text_Variable_7) == 0x0001D0, "Member 'HomeMenu_C_HasQuickPlay::Temp_text_Variable_7' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_HasQuickPlay, Temp_text_Variable_8) == 0x0001E8, "Member 'HomeMenu_C_HasQuickPlay::Temp_text_Variable_8' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_HasQuickPlay, Temp_byte_Variable_1) == 0x000200, "Member 'HomeMenu_C_HasQuickPlay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_HasQuickPlay, CallFunc_Get_ReturnValue) == 0x000208, "Member 'HomeMenu_C_HasQuickPlay::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_HasQuickPlay, CallFunc_GetQuickPlayPlaylist_OutPlaylist) == 0x000210, "Member 'HomeMenu_C_HasQuickPlay::CallFunc_GetQuickPlayPlaylist_OutPlaylist' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_HasQuickPlay, CallFunc_GetQuickPlayPlaylist_ReturnValue) == 0x000308, "Member 'HomeMenu_C_HasQuickPlay::CallFunc_GetQuickPlayPlaylist_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_HasQuickPlay, CallFunc_GetPlaylistInteractionState_OutMatchmakingState) == 0x000309, "Member 'HomeMenu_C_HasQuickPlay::CallFunc_GetPlaylistInteractionState_OutMatchmakingState' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_HasQuickPlay, CallFunc_GetPlaylistInteractionState_ReturnValue) == 0x00030A, "Member 'HomeMenu_C_HasQuickPlay::CallFunc_GetPlaylistInteractionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_HasQuickPlay, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00030B, "Member 'HomeMenu_C_HasQuickPlay::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_HasQuickPlay, K2Node_Select_Default) == 0x000310, "Member 'HomeMenu_C_HasQuickPlay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_HasQuickPlay, K2Node_Select_Default_1) == 0x000328, "Member 'HomeMenu_C_HasQuickPlay::K2Node_Select_Default_1' has a wrong offset!");

// Function HomeMenu.HomeMenu_C.UpdateQuickPlayState
// 0x0480 (0x0480 - 0x0000)
struct HomeMenu_C_UpdateQuickPlayState final
{
public:
	class FText                                   Temp_text_Variable;                                // 0x0000(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23C9[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	class UMarinerGameInstance*                   CallFunc_GetMarinerGameInstance_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInMainMenu_ReturnValue;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23CA[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerFrontEndGlobals*                CallFunc_GetFrontEndGlobals_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMatchmakingInteractionState                  CallFunc_GetMatchmakingInteractionState_ReturnValue; // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23CB[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerPlaylistGlobals*                CallFunc_GetPlaylistGlobals_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_2;                              // 0x0060(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0078(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0090(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x00A8(0x0018)()
	class FText                                   Temp_text_Variable_6;                              // 0x00C0(0x0018)()
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMarinerCrossplayState                        CallFunc_GetCrossplayState_ReturnValue;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23CC[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoCMSManager*                       CallFunc_Get_ReturnValue;                          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23CD[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_7;                              // 0x00F8(0x0018)()
	EMatchmakingInteractionState                  Temp_byte_Variable;                                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasQuickPlay_IsValid;                     // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23CE[0x6];                                     // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMangoPlaylist                         CallFunc_HasQuickPlay_Playlist;                    // 0x0118(0x00F8)()
	class FText                                   CallFunc_HasQuickPlay_ButtonText;                  // 0x0210(0x0018)()
	bool                                          CallFunc_HasQuickPlay_CanInteract;                 // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23CF[0x7];                                     // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0230(0x0018)()
	struct FMarinerMenuButtonData                 CallFunc_ConvertPlaylistToMenuButtonData_ReturnValue; // 0x0248(0x0218)()
	bool                                          CallFunc_IsOnboardingPlaylist_ReturnValue;         // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0461(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0462(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0463(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0464(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23D0[0x3];                                     // 0x0465(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0468(0x0018)()
};
static_assert(alignof(HomeMenu_C_UpdateQuickPlayState) == 0x000008, "Wrong alignment on HomeMenu_C_UpdateQuickPlayState");
static_assert(sizeof(HomeMenu_C_UpdateQuickPlayState) == 0x000480, "Wrong size on HomeMenu_C_UpdateQuickPlayState");
static_assert(offsetof(HomeMenu_C_UpdateQuickPlayState, Temp_text_Variable) == 0x000000, "Member 'HomeMenu_C_UpdateQuickPlayState::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_UpdateQuickPlayState, Temp_bool_Variable) == 0x000018, "Member 'HomeMenu_C_UpdateQuickPlayState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_UpdateQuickPlayState, Temp_text_Variable_1) == 0x000020, "Member 'HomeMenu_C_UpdateQuickPlayState::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_UpdateQuickPlayState, CallFunc_GetMarinerGameInstance_ReturnValue) == 0x000038, "Member 'HomeMenu_C_UpdateQuickPlayState::CallFunc_GetMarinerGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_UpdateQuickPlayState, CallFunc_IsInMainMenu_ReturnValue) == 0x000040, "Member 'HomeMenu_C_UpdateQuickPlayState::CallFunc_IsInMainMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_UpdateQuickPlayState, CallFunc_GetFrontEndGlobals_ReturnValue) == 0x000048, "Member 'HomeMenu_C_UpdateQuickPlayState::CallFunc_GetFrontEndGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_UpdateQuickPlayState, CallFunc_GetMatchmakingInteractionState_ReturnValue) == 0x000050, "Member 'HomeMenu_C_UpdateQuickPlayState::CallFunc_GetMatchmakingInteractionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_UpdateQuickPlayState, CallFunc_GetPlaylistGlobals_ReturnValue) == 0x000058, "Member 'HomeMenu_C_UpdateQuickPlayState::CallFunc_GetPlaylistGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_UpdateQuickPlayState, Temp_text_Variable_2) == 0x000060, "Member 'HomeMenu_C_UpdateQuickPlayState::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_UpdateQuickPlayState, Temp_text_Variable_3) == 0x000078, "Member 'HomeMenu_C_UpdateQuickPlayState::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_UpdateQuickPlayState, Temp_text_Variable_4) == 0x000090, "Member 'HomeMenu_C_UpdateQuickPlayState::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_UpdateQuickPlayState, Temp_text_Variable_5) == 0x0000A8, "Member 'HomeMenu_C_UpdateQuickPlayState::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_UpdateQuickPlayState, Temp_text_Variable_6) == 0x0000C0, "Member 'HomeMenu_C_UpdateQuickPlayState::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_UpdateQuickPlayState, CallFunc_GetUserSettings_ReturnValue) == 0x0000D8, "Member 'HomeMenu_C_UpdateQuickPlayState::CallFunc_GetUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_UpdateQuickPlayState, CallFunc_GetCrossplayState_ReturnValue) == 0x0000E0, "Member 'HomeMenu_C_UpdateQuickPlayState::CallFunc_GetCrossplayState_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_UpdateQuickPlayState, CallFunc_Get_ReturnValue) == 0x0000E8, "Member 'HomeMenu_C_UpdateQuickPlayState::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_UpdateQuickPlayState, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000F0, "Member 'HomeMenu_C_UpdateQuickPlayState::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_UpdateQuickPlayState, Temp_text_Variable_7) == 0x0000F8, "Member 'HomeMenu_C_UpdateQuickPlayState::Temp_text_Variable_7' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_UpdateQuickPlayState, Temp_byte_Variable) == 0x000110, "Member 'HomeMenu_C_UpdateQuickPlayState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_UpdateQuickPlayState, CallFunc_HasQuickPlay_IsValid) == 0x000111, "Member 'HomeMenu_C_UpdateQuickPlayState::CallFunc_HasQuickPlay_IsValid' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_UpdateQuickPlayState, CallFunc_HasQuickPlay_Playlist) == 0x000118, "Member 'HomeMenu_C_UpdateQuickPlayState::CallFunc_HasQuickPlay_Playlist' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_UpdateQuickPlayState, CallFunc_HasQuickPlay_ButtonText) == 0x000210, "Member 'HomeMenu_C_UpdateQuickPlayState::CallFunc_HasQuickPlay_ButtonText' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_UpdateQuickPlayState, CallFunc_HasQuickPlay_CanInteract) == 0x000228, "Member 'HomeMenu_C_UpdateQuickPlayState::CallFunc_HasQuickPlay_CanInteract' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_UpdateQuickPlayState, K2Node_Select_Default) == 0x000230, "Member 'HomeMenu_C_UpdateQuickPlayState::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_UpdateQuickPlayState, CallFunc_ConvertPlaylistToMenuButtonData_ReturnValue) == 0x000248, "Member 'HomeMenu_C_UpdateQuickPlayState::CallFunc_ConvertPlaylistToMenuButtonData_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_UpdateQuickPlayState, CallFunc_IsOnboardingPlaylist_ReturnValue) == 0x000460, "Member 'HomeMenu_C_UpdateQuickPlayState::CallFunc_IsOnboardingPlaylist_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_UpdateQuickPlayState, CallFunc_BooleanAND_ReturnValue) == 0x000461, "Member 'HomeMenu_C_UpdateQuickPlayState::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_UpdateQuickPlayState, CallFunc_Not_PreBool_ReturnValue) == 0x000462, "Member 'HomeMenu_C_UpdateQuickPlayState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_UpdateQuickPlayState, CallFunc_BooleanAND_ReturnValue_1) == 0x000463, "Member 'HomeMenu_C_UpdateQuickPlayState::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_UpdateQuickPlayState, CallFunc_BooleanAND_ReturnValue_2) == 0x000464, "Member 'HomeMenu_C_UpdateQuickPlayState::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HomeMenu_C_UpdateQuickPlayState, K2Node_Select_Default_1) == 0x000468, "Member 'HomeMenu_C_UpdateQuickPlayState::K2Node_Select_Default_1' has a wrong offset!");

// Function HomeMenu.HomeMenu_C.UpdatePrompts
// 0x0370 (0x0370 - 0x0000)
struct HomeMenu_C_UpdatePrompts final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMarinerPromptInputDisplay                    Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMarinerPromptInputDisplay                    Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlatformPC_ReturnValue;                 // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
