#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ImpulsedByEnemyCameraEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ImpulsedByEnemyCameraEffect.ImpulsedByEnemyCameraEffect_C
// 0x0020 (0x02F0 - 0x02D0)
class AImpulsedByEnemyCameraEffect_C final : public AMarinerCameraLensEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FTimerHandle                           StartLoopTimer;                                    // 0x02D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           LoopTimer;                                         // 0x02E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ImpulsedByEnemyCameraEffect(int32 EntryPoint);
	void BP_OnDisabled();
	void BP_OnEnabled();
	void EndEmitter();
	void StartLoop();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ImpulsedByEnemyCameraEffect_C">();
	}
	static class AImpulsedByEnemyCameraEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AImpulsedByEnemyCameraEffect_C>();
	}
};
static_assert(alignof(AImpulsedByEnemyCameraEffect_C) == 0x000010, "Wrong alignment on AImpulsedByEnemyCameraEffect_C");
static_assert(sizeof(AImpulsedByEnemyCameraEffect_C) == 0x0002F0, "Wrong size on AImpulsedByEnemyCameraEffect_C");
static_assert(offsetof(AImpulsedByEnemyCameraEffect_C, UberGraphFrame) == 0x0002D0, "Member 'AImpulsedByEnemyCameraEffect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AImpulsedByEnemyCameraEffect_C, StartLoopTimer) == 0x0002D8, "Member 'AImpulsedByEnemyCameraEffect_C::StartLoopTimer' has a wrong offset!");
static_assert(offsetof(AImpulsedByEnemyCameraEffect_C, LoopTimer) == 0x0002E0, "Member 'AImpulsedByEnemyCameraEffect_C::LoopTimer' has a wrong offset!");

}

