#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InventoryBaseMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass InventoryBaseMenu.InventoryBaseMenu_C
// 0x0028 (0x1308 - 0x12E0)
class UInventoryBaseMenu_C : public UMarinerInventoryBaseMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x12E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           MainPanel;                                         // 0x12E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOwnedItemWidget_C*                     OwnedItemWidget;                                   // 0x12F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemProgressionWidget_C*               ProgressionMessage;                                // 0x12F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPurchasePreviewWidget_C*               PurchasePreviewWidget;                             // 0x1300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_InventoryBaseMenu(int32 EntryPoint);
	void PopulateOwnedItem(class UItemLoadResponse* LoadResponse);
	void PopulateUnlockPreview(class UItemLoadResponse* LoadResponse, class UMarinerCMSItemDataAsset* DataAsset, class UMarinerPlayableCharacter* Character);
	void ViewBlastPass(int32 Tier);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InventoryBaseMenu_C">();
	}
	static class UInventoryBaseMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInventoryBaseMenu_C>();
	}
};
static_assert(alignof(UInventoryBaseMenu_C) == 0x000008, "Wrong alignment on UInventoryBaseMenu_C");
static_assert(sizeof(UInventoryBaseMenu_C) == 0x001308, "Wrong size on UInventoryBaseMenu_C");
static_assert(offsetof(UInventoryBaseMenu_C, UberGraphFrame) == 0x0012E0, "Member 'UInventoryBaseMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInventoryBaseMenu_C, MainPanel) == 0x0012E8, "Member 'UInventoryBaseMenu_C::MainPanel' has a wrong offset!");
static_assert(offsetof(UInventoryBaseMenu_C, OwnedItemWidget) == 0x0012F0, "Member 'UInventoryBaseMenu_C::OwnedItemWidget' has a wrong offset!");
static_assert(offsetof(UInventoryBaseMenu_C, ProgressionMessage) == 0x0012F8, "Member 'UInventoryBaseMenu_C::ProgressionMessage' has a wrong offset!");
static_assert(offsetof(UInventoryBaseMenu_C, PurchasePreviewWidget) == 0x001300, "Member 'UInventoryBaseMenu_C::PurchasePreviewWidget' has a wrong offset!");

}

