#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InventoryBaseMenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function InventoryBaseMenu.InventoryBaseMenu_C.ExecuteUbergraph_InventoryBaseMenu
// 0x0050 (0x0050 - 0x0000)
struct InventoryBaseMenu_C_ExecuteUbergraph_InventoryBaseMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_233C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SwitchToStackManagerStack_ReturnValue;    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_233D[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerMenuStackLayer*                 CallFunc_GetLayerByClass_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlastPassMenu_C*                       K2Node_DynamicCast_AsBlast_Pass_Menu;              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_233E[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Tier;                                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemLoadResponse*                      K2Node_Event_LoadResponse_1;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerCMSItemDataAsset*               K2Node_Event_DataAsset;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerPlayableCharacter*              K2Node_Event_Character;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemLoadResponse*                      K2Node_Event_LoadResponse;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InventoryBaseMenu_C_ExecuteUbergraph_InventoryBaseMenu) == 0x000008, "Wrong alignment on InventoryBaseMenu_C_ExecuteUbergraph_InventoryBaseMenu");
static_assert(sizeof(InventoryBaseMenu_C_ExecuteUbergraph_InventoryBaseMenu) == 0x000050, "Wrong size on InventoryBaseMenu_C_ExecuteUbergraph_InventoryBaseMenu");
static_assert(offsetof(InventoryBaseMenu_C_ExecuteUbergraph_InventoryBaseMenu, EntryPoint) == 0x000000, "Member 'InventoryBaseMenu_C_ExecuteUbergraph_InventoryBaseMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(InventoryBaseMenu_C_ExecuteUbergraph_InventoryBaseMenu, CallFunc_GetMenuManager_ReturnValue) == 0x000008, "Member 'InventoryBaseMenu_C_ExecuteUbergraph_InventoryBaseMenu::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryBaseMenu_C_ExecuteUbergraph_InventoryBaseMenu, CallFunc_SwitchToStackManagerStack_ReturnValue) == 0x000010, "Member 'InventoryBaseMenu_C_ExecuteUbergraph_InventoryBaseMenu::CallFunc_SwitchToStackManagerStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryBaseMenu_C_ExecuteUbergraph_InventoryBaseMenu, CallFunc_GetLayerByClass_ReturnValue) == 0x000018, "Member 'InventoryBaseMenu_C_ExecuteUbergraph_InventoryBaseMenu::CallFunc_GetLayerByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryBaseMenu_C_ExecuteUbergraph_InventoryBaseMenu, K2Node_DynamicCast_AsBlast_Pass_Menu) == 0x000020, "Member 'InventoryBaseMenu_C_ExecuteUbergraph_InventoryBaseMenu::K2Node_DynamicCast_AsBlast_Pass_Menu' has a wrong offset!");
static_assert(offsetof(InventoryBaseMenu_C_ExecuteUbergraph_InventoryBaseMenu, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'InventoryBaseMenu_C_ExecuteUbergraph_InventoryBaseMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InventoryBaseMenu_C_ExecuteUbergraph_InventoryBaseMenu, K2Node_Event_Tier) == 0x00002C, "Member 'InventoryBaseMenu_C_ExecuteUbergraph_InventoryBaseMenu::K2Node_Event_Tier' has a wrong offset!");
static_assert(offsetof(InventoryBaseMenu_C_ExecuteUbergraph_InventoryBaseMenu, K2Node_Event_LoadResponse_1) == 0x000030, "Member 'InventoryBaseMenu_C_ExecuteUbergraph_InventoryBaseMenu::K2Node_Event_LoadResponse_1' has a wrong offset!");
static_assert(offsetof(InventoryBaseMenu_C_ExecuteUbergraph_InventoryBaseMenu, K2Node_Event_DataAsset) == 0x000038, "Member 'InventoryBaseMenu_C_ExecuteUbergraph_InventoryBaseMenu::K2Node_Event_DataAsset' has a wrong offset!");
static_assert(offsetof(InventoryBaseMenu_C_ExecuteUbergraph_InventoryBaseMenu, K2Node_Event_Character) == 0x000040, "Member 'InventoryBaseMenu_C_ExecuteUbergraph_InventoryBaseMenu::K2Node_Event_Character' has a wrong offset!");
static_assert(offsetof(InventoryBaseMenu_C_ExecuteUbergraph_InventoryBaseMenu, K2Node_Event_LoadResponse) == 0x000048, "Member 'InventoryBaseMenu_C_ExecuteUbergraph_InventoryBaseMenu::K2Node_Event_LoadResponse' has a wrong offset!");

// Function InventoryBaseMenu.InventoryBaseMenu_C.PopulateOwnedItem
// 0x0008 (0x0008 - 0x0000)
struct InventoryBaseMenu_C_PopulateOwnedItem final
{
public:
	class UItemLoadResponse*                      LoadResponse;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InventoryBaseMenu_C_PopulateOwnedItem) == 0x000008, "Wrong alignment on InventoryBaseMenu_C_PopulateOwnedItem");
static_assert(sizeof(InventoryBaseMenu_C_PopulateOwnedItem) == 0x000008, "Wrong size on InventoryBaseMenu_C_PopulateOwnedItem");
static_assert(offsetof(InventoryBaseMenu_C_PopulateOwnedItem, LoadResponse) == 0x000000, "Member 'InventoryBaseMenu_C_PopulateOwnedItem::LoadResponse' has a wrong offset!");

// Function InventoryBaseMenu.InventoryBaseMenu_C.PopulateUnlockPreview
// 0x0018 (0x0018 - 0x0000)
struct InventoryBaseMenu_C_PopulateUnlockPreview final
{
public:
	class UItemLoadResponse*                      LoadResponse;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerCMSItemDataAsset*               DataAsset;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerPlayableCharacter*              Character;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InventoryBaseMenu_C_PopulateUnlockPreview) == 0x000008, "Wrong alignment on InventoryBaseMenu_C_PopulateUnlockPreview");
static_assert(sizeof(InventoryBaseMenu_C_PopulateUnlockPreview) == 0x000018, "Wrong size on InventoryBaseMenu_C_PopulateUnlockPreview");
static_assert(offsetof(InventoryBaseMenu_C_PopulateUnlockPreview, LoadResponse) == 0x000000, "Member 'InventoryBaseMenu_C_PopulateUnlockPreview::LoadResponse' has a wrong offset!");
static_assert(offsetof(InventoryBaseMenu_C_PopulateUnlockPreview, DataAsset) == 0x000008, "Member 'InventoryBaseMenu_C_PopulateUnlockPreview::DataAsset' has a wrong offset!");
static_assert(offsetof(InventoryBaseMenu_C_PopulateUnlockPreview, Character) == 0x000010, "Member 'InventoryBaseMenu_C_PopulateUnlockPreview::Character' has a wrong offset!");

// Function InventoryBaseMenu.InventoryBaseMenu_C.ViewBlastPass
// 0x0004 (0x0004 - 0x0000)
struct InventoryBaseMenu_C_ViewBlastPass final
{
public:
	int32                                         Tier;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InventoryBaseMenu_C_ViewBlastPass) == 0x000004, "Wrong alignment on InventoryBaseMenu_C_ViewBlastPass");
static_assert(sizeof(InventoryBaseMenu_C_ViewBlastPass) == 0x000004, "Wrong size on InventoryBaseMenu_C_ViewBlastPass");
static_assert(offsetof(InventoryBaseMenu_C_ViewBlastPass, Tier) == 0x000000, "Member 'InventoryBaseMenu_C_ViewBlastPass::Tier' has a wrong offset!");

}

