#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemProgressionWidget

#include "Basic.hpp"

#include "MangoClient_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemProgressionWidget.ItemProgressionWidget_C
// 0x0050 (0x0468 - 0x0418)
class UItemProgressionWidget_C final : public UMarinerAnimatedWidget
{
public:
	class UImage*                                 Image_0;                                           // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RarityBarColor;                                    // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RarityText;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UnlockIcon;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             UnlockText;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FMangoProgressionCharacterItemUnlock   ItemUnlock;                                        // 0x0440(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsOwned;                                           // 0x0458(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_236D[0x7];                                     // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemLoadResponse*                      ItemLoadResponse;                                  // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetItemUnlock(struct FMangoProgressionCharacterItemUnlock& Param_ItemUnlock, bool Param_IsOwned, class UItemLoadResponse* Param_ItemLoadResponse);
	bool Populate();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemProgressionWidget_C">();
	}
	static class UItemProgressionWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemProgressionWidget_C>();
	}
};
static_assert(alignof(UItemProgressionWidget_C) == 0x000008, "Wrong alignment on UItemProgressionWidget_C");
static_assert(sizeof(UItemProgressionWidget_C) == 0x000468, "Wrong size on UItemProgressionWidget_C");
static_assert(offsetof(UItemProgressionWidget_C, Image_0) == 0x000418, "Member 'UItemProgressionWidget_C::Image_0' has a wrong offset!");
static_assert(offsetof(UItemProgressionWidget_C, RarityBarColor) == 0x000420, "Member 'UItemProgressionWidget_C::RarityBarColor' has a wrong offset!");
static_assert(offsetof(UItemProgressionWidget_C, RarityText) == 0x000428, "Member 'UItemProgressionWidget_C::RarityText' has a wrong offset!");
static_assert(offsetof(UItemProgressionWidget_C, UnlockIcon) == 0x000430, "Member 'UItemProgressionWidget_C::UnlockIcon' has a wrong offset!");
static_assert(offsetof(UItemProgressionWidget_C, UnlockText) == 0x000438, "Member 'UItemProgressionWidget_C::UnlockText' has a wrong offset!");
static_assert(offsetof(UItemProgressionWidget_C, ItemUnlock) == 0x000440, "Member 'UItemProgressionWidget_C::ItemUnlock' has a wrong offset!");
static_assert(offsetof(UItemProgressionWidget_C, IsOwned) == 0x000458, "Member 'UItemProgressionWidget_C::IsOwned' has a wrong offset!");
static_assert(offsetof(UItemProgressionWidget_C, ItemLoadResponse) == 0x000460, "Member 'UItemProgressionWidget_C::ItemLoadResponse' has a wrong offset!");

}

