#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Item_NinjaHeadband_AttachmentActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Mariner_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Item_NinjaHeadband_AttachmentActor.Item_NinjaHeadband_AttachmentActor_C
// 0x0050 (0x0268 - 0x0218)
class AItem_NinjaHeadband_AttachmentActor_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0218(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               Activate_FX;                                       // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Deactivate_FX;                                     // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_ScaleMask_E6C8622646CFC478BE77929AF34CC010; // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_E6C8622646CFC478BE77929AF34CC010; // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               SkeletalMeshDynamicMat;                            // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ActivationFX_Triggered;                            // 0x0258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsActive;                                          // 0x0259(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25A[0x6];                                      // 0x025A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        DodgeDistortion_FX;                                // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Item_NinjaHeadband_AttachmentActor(int32 EntryPoint);
	void SpawnDodgeDistortionVFX();
	void DodgeAbilityActivated();
	void BindToOwnerUnpossessed();
	void OnOwningPawnUnpossessed(class AMarinerPlayerController* UnpossessingController, class APawn* UnpossessedPawn);
	void HandleActivationDeactivationVisuals(bool ToggleOn);
	void OnEnteredRealityDelegate_Event_0(class AMarinerCharacter* ShiftingCharacter, EMarinerRealityState EnteringReality, bool bCharacterIsLocal);
	void ReceiveBeginPlay();
	void OnClientRealityChanged(EMarinerRealityState OldReality, EMarinerRealityState NewReality);
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void HandleDynamicMaterial();
	void HandleActivationSequence();
	void HandleDeactivationSequence();
	void HideActorOnDeactivation();
	void HandleActivationFX(bool Activating);
	void HandleDeactivationFX();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Item_NinjaHeadband_AttachmentActor_C">();
	}
	static class AItem_NinjaHeadband_AttachmentActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AItem_NinjaHeadband_AttachmentActor_C>();
	}
};
static_assert(alignof(AItem_NinjaHeadband_AttachmentActor_C) == 0x000008, "Wrong alignment on AItem_NinjaHeadband_AttachmentActor_C");
static_assert(sizeof(AItem_NinjaHeadband_AttachmentActor_C) == 0x000268, "Wrong size on AItem_NinjaHeadband_AttachmentActor_C");
static_assert(offsetof(AItem_NinjaHeadband_AttachmentActor_C, UberGraphFrame) == 0x000218, "Member 'AItem_NinjaHeadband_AttachmentActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AItem_NinjaHeadband_AttachmentActor_C, Activate_FX) == 0x000220, "Member 'AItem_NinjaHeadband_AttachmentActor_C::Activate_FX' has a wrong offset!");
static_assert(offsetof(AItem_NinjaHeadband_AttachmentActor_C, Deactivate_FX) == 0x000228, "Member 'AItem_NinjaHeadband_AttachmentActor_C::Deactivate_FX' has a wrong offset!");
static_assert(offsetof(AItem_NinjaHeadband_AttachmentActor_C, SkeletalMesh) == 0x000230, "Member 'AItem_NinjaHeadband_AttachmentActor_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(AItem_NinjaHeadband_AttachmentActor_C, DefaultSceneRoot) == 0x000238, "Member 'AItem_NinjaHeadband_AttachmentActor_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AItem_NinjaHeadband_AttachmentActor_C, Timeline_0_ScaleMask_E6C8622646CFC478BE77929AF34CC010) == 0x000240, "Member 'AItem_NinjaHeadband_AttachmentActor_C::Timeline_0_ScaleMask_E6C8622646CFC478BE77929AF34CC010' has a wrong offset!");
static_assert(offsetof(AItem_NinjaHeadband_AttachmentActor_C, Timeline_0__Direction_E6C8622646CFC478BE77929AF34CC010) == 0x000244, "Member 'AItem_NinjaHeadband_AttachmentActor_C::Timeline_0__Direction_E6C8622646CFC478BE77929AF34CC010' has a wrong offset!");
static_assert(offsetof(AItem_NinjaHeadband_AttachmentActor_C, Timeline_0) == 0x000248, "Member 'AItem_NinjaHeadband_AttachmentActor_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AItem_NinjaHeadband_AttachmentActor_C, SkeletalMeshDynamicMat) == 0x000250, "Member 'AItem_NinjaHeadband_AttachmentActor_C::SkeletalMeshDynamicMat' has a wrong offset!");
static_assert(offsetof(AItem_NinjaHeadband_AttachmentActor_C, ActivationFX_Triggered) == 0x000258, "Member 'AItem_NinjaHeadband_AttachmentActor_C::ActivationFX_Triggered' has a wrong offset!");
static_assert(offsetof(AItem_NinjaHeadband_AttachmentActor_C, IsActive) == 0x000259, "Member 'AItem_NinjaHeadband_AttachmentActor_C::IsActive' has a wrong offset!");
static_assert(offsetof(AItem_NinjaHeadband_AttachmentActor_C, DodgeDistortion_FX) == 0x000260, "Member 'AItem_NinjaHeadband_AttachmentActor_C::DodgeDistortion_FX' has a wrong offset!");

}

