#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemAbility_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ItemAbility_Base.ItemAbility_Base_C
// 0x0018 (0x06F0 - 0x06D8)
class UItemAbility_Base_C : public UMarinerAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 MoveAffectingActivationEffect;                     // 0x06E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEndAbilityOnActivate;                             // 0x06E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bItemUseInputHeld;                                 // 0x06E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ItemAbility_Base(int32 EntryPoint);
	void SpoofInputQueueing();
	void InternalTryInputQueueItemAbility();
	void ServerTryInputQueueItemAbility();
	void OnDodgeEnded(bool bWasCancelled);
	void BP_OnOwningControllerSet();
	void BP_OnAbilityActivated(const struct FGameplayAbilityActorInfo& ActorInfo);
	void BP_OnAnyInputReceived(EMarinerInputActions InputType, EInputEvent EventType);
	void UseItemInputPressed();
	void ApplyActivationEffect();
	void UseItemInputReleased();

	class AMarinerItem* GetHeldItem() const;
	bool CharacterOwnerHasRelevantItem() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemAbility_Base_C">();
	}
	static class UItemAbility_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemAbility_Base_C>();
	}
};
static_assert(alignof(UItemAbility_Base_C) == 0x000008, "Wrong alignment on UItemAbility_Base_C");
static_assert(sizeof(UItemAbility_Base_C) == 0x0006F0, "Wrong size on UItemAbility_Base_C");
static_assert(offsetof(UItemAbility_Base_C, UberGraphFrame) == 0x0006D8, "Member 'UItemAbility_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemAbility_Base_C, MoveAffectingActivationEffect) == 0x0006E0, "Member 'UItemAbility_Base_C::MoveAffectingActivationEffect' has a wrong offset!");
static_assert(offsetof(UItemAbility_Base_C, bEndAbilityOnActivate) == 0x0006E8, "Member 'UItemAbility_Base_C::bEndAbilityOnActivate' has a wrong offset!");
static_assert(offsetof(UItemAbility_Base_C, bItemUseInputHeld) == 0x0006E9, "Member 'UItemAbility_Base_C::bItemUseInputHeld' has a wrong offset!");

}

