#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemAbility_Base

#include "Basic.hpp"

#include "Mariner_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function ItemAbility_Base.ItemAbility_Base_C.ExecuteUbergraph_ItemAbility_Base
// 0x00B8 (0x00B8 - 0x0000)
struct ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMarinerInputActions                          K2Node_Event_InputType;                            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputEvent                                   K2Node_Event_EventType;                            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24BC[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bWasCancelled)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24BD[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              K2Node_Event_ActorInfo;                            // 0x0020(0x0040)(ContainsInstancedReference)
	class AMarinerCharacter*                      CallFunc_GetAvatarCharacterFromActorInfo_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerAbilitySystemComponent*         CallFunc_GetOwningAbilitySystemComponent_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24BE[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayAbility*                       CallFunc_GetAbilityInstanceForAbilityClass_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24BF[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDodgeAbility_C*                        K2Node_DynamicCast_AsDodge_Ability;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bWasCancelled;                  // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsLocallyControlled_ReturnValue;       // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CharacterOwnerHasRelevantItem_ReturnValue; // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CharacterOwnerHasRelevantItem_ReturnValue_1; // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24C0[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerAbilitySystemComponent*         CallFunc_GetOwningAbilitySystemComponent_ReturnValue_1; // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_HasAuthority_ReturnValue;              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24C1[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AuthorityTryActivateAbilityByClassWithAimData_ReturnValue; // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_HasAuthority_ReturnValue_1;            // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base) == 0x000008, "Wrong alignment on ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base");
static_assert(sizeof(ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base) == 0x0000B8, "Wrong size on ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base");
static_assert(offsetof(ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base, EntryPoint) == 0x000000, "Member 'ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base, K2Node_Event_InputType) == 0x000004, "Member 'ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base::K2Node_Event_InputType' has a wrong offset!");
static_assert(offsetof(ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base, K2Node_Event_EventType) == 0x000005, "Member 'ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base::K2Node_Event_EventType' has a wrong offset!");
static_assert(offsetof(ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000006, "Member 'ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000018, "Member 'ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000019, "Member 'ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base, K2Node_Event_ActorInfo) == 0x000020, "Member 'ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base::K2Node_Event_ActorInfo' has a wrong offset!");
static_assert(offsetof(ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base, CallFunc_GetAvatarCharacterFromActorInfo_ReturnValue) == 0x000060, "Member 'ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base::CallFunc_GetAvatarCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base, CallFunc_GetOwningAbilitySystemComponent_ReturnValue) == 0x000068, "Member 'ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base::CallFunc_GetOwningAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base, CallFunc_GetAbilityInstanceForAbilityClass_ReturnValue) == 0x000078, "Member 'ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base::CallFunc_GetAbilityInstanceForAbilityClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base, K2Node_DynamicCast_AsDodge_Ability) == 0x000088, "Member 'ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base::K2Node_DynamicCast_AsDodge_Ability' has a wrong offset!");
static_assert(offsetof(ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base, K2Node_CustomEvent_bWasCancelled) == 0x000091, "Member 'ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base::K2Node_CustomEvent_bWasCancelled' has a wrong offset!");
static_assert(offsetof(ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base, CallFunc_BP_IsLocallyControlled_ReturnValue) == 0x000092, "Member 'ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base::CallFunc_BP_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base, CallFunc_CharacterOwnerHasRelevantItem_ReturnValue) == 0x000093, "Member 'ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base::CallFunc_CharacterOwnerHasRelevantItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base, CallFunc_CharacterOwnerHasRelevantItem_ReturnValue_1) == 0x000094, "Member 'ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base::CallFunc_CharacterOwnerHasRelevantItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base, CallFunc_GetOwningAbilitySystemComponent_ReturnValue_1) == 0x000098, "Member 'ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base::CallFunc_GetOwningAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base, CallFunc_BP_HasAuthority_ReturnValue) == 0x0000A0, "Member 'ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base::CallFunc_BP_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base, CallFunc_GetObjectClass_ReturnValue) == 0x0000A8, "Member 'ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base, CallFunc_AuthorityTryActivateAbilityByClassWithAimData_ReturnValue) == 0x0000B0, "Member 'ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base::CallFunc_AuthorityTryActivateAbilityByClassWithAimData_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base, CallFunc_BP_HasAuthority_ReturnValue_1) == 0x0000B1, "Member 'ItemAbility_Base_C_ExecuteUbergraph_ItemAbility_Base::CallFunc_BP_HasAuthority_ReturnValue_1' has a wrong offset!");

// Function ItemAbility_Base.ItemAbility_Base_C.OnDodgeEnded
// 0x0001 (0x0001 - 0x0000)
struct ItemAbility_Base_C_OnDodgeEnded final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemAbility_Base_C_OnDodgeEnded) == 0x000001, "Wrong alignment on ItemAbility_Base_C_OnDodgeEnded");
static_assert(sizeof(ItemAbility_Base_C_OnDodgeEnded) == 0x000001, "Wrong size on ItemAbility_Base_C_OnDodgeEnded");
static_assert(offsetof(ItemAbility_Base_C_OnDodgeEnded, bWasCancelled) == 0x000000, "Member 'ItemAbility_Base_C_OnDodgeEnded::bWasCancelled' has a wrong offset!");

// Function ItemAbility_Base.ItemAbility_Base_C.BP_OnAbilityActivated
// 0x0040 (0x0040 - 0x0000)
struct ItemAbility_Base_C_BP_OnAbilityActivated final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(ItemAbility_Base_C_BP_OnAbilityActivated) == 0x000008, "Wrong alignment on ItemAbility_Base_C_BP_OnAbilityActivated");
static_assert(sizeof(ItemAbility_Base_C_BP_OnAbilityActivated) == 0x000040, "Wrong size on ItemAbility_Base_C_BP_OnAbilityActivated");
static_assert(offsetof(ItemAbility_Base_C_BP_OnAbilityActivated, ActorInfo) == 0x000000, "Member 'ItemAbility_Base_C_BP_OnAbilityActivated::ActorInfo' has a wrong offset!");

// Function ItemAbility_Base.ItemAbility_Base_C.BP_OnAnyInputReceived
// 0x0002 (0x0002 - 0x0000)
struct ItemAbility_Base_C_BP_OnAnyInputReceived final
{
public:
	EMarinerInputActions                          InputType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputEvent                                   EventType;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemAbility_Base_C_BP_OnAnyInputReceived) == 0x000001, "Wrong alignment on ItemAbility_Base_C_BP_OnAnyInputReceived");
static_assert(sizeof(ItemAbility_Base_C_BP_OnAnyInputReceived) == 0x000002, "Wrong size on ItemAbility_Base_C_BP_OnAnyInputReceived");
static_assert(offsetof(ItemAbility_Base_C_BP_OnAnyInputReceived, InputType) == 0x000000, "Member 'ItemAbility_Base_C_BP_OnAnyInputReceived::InputType' has a wrong offset!");
static_assert(offsetof(ItemAbility_Base_C_BP_OnAnyInputReceived, EventType) == 0x000001, "Member 'ItemAbility_Base_C_BP_OnAnyInputReceived::EventType' has a wrong offset!");

// Function ItemAbility_Base.ItemAbility_Base_C.ApplyActivationEffect
// 0x0001 (0x0001 - 0x0000)
struct ItemAbility_Base_C_ApplyActivationEffect final
{
public:
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemAbility_Base_C_ApplyActivationEffect) == 0x000001, "Wrong alignment on ItemAbility_Base_C_ApplyActivationEffect");
static_assert(sizeof(ItemAbility_Base_C_ApplyActivationEffect) == 0x000001, "Wrong size on ItemAbility_Base_C_ApplyActivationEffect");
static_assert(offsetof(ItemAbility_Base_C_ApplyActivationEffect, CallFunc_IsValidClass_ReturnValue) == 0x000000, "Member 'ItemAbility_Base_C_ApplyActivationEffect::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");

// Function ItemAbility_Base.ItemAbility_Base_C.GetHeldItem
// 0x0018 (0x0018 - 0x0000)
struct ItemAbility_Base_C_GetHeldItem final
{
public:
	class AMarinerItem*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMarinerCharacter*                      CallFunc_GetAvatarCharacterFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMarinerItem*                           CallFunc_GetItemBySlot_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemAbility_Base_C_GetHeldItem) == 0x000008, "Wrong alignment on ItemAbility_Base_C_GetHeldItem");
static_assert(sizeof(ItemAbility_Base_C_GetHeldItem) == 0x000018, "Wrong size on ItemAbility_Base_C_GetHeldItem");
static_assert(offsetof(ItemAbility_Base_C_GetHeldItem, ReturnValue) == 0x000000, "Member 'ItemAbility_Base_C_GetHeldItem::ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemAbility_Base_C_GetHeldItem, CallFunc_GetAvatarCharacterFromActorInfo_ReturnValue) == 0x000008, "Member 'ItemAbility_Base_C_GetHeldItem::CallFunc_GetAvatarCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemAbility_Base_C_GetHeldItem, CallFunc_GetItemBySlot_ReturnValue) == 0x000010, "Member 'ItemAbility_Base_C_GetHeldItem::CallFunc_GetItemBySlot_ReturnValue' has a wrong offset!");

// Function ItemAbility_Base.ItemAbility_Base_C.CharacterOwnerHasRelevantItem
// 0x0028 (0x0028 - 0x0000)
struct ItemAbility_Base_C_CharacterOwnerHasRelevantItem final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24C2[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMarinerItem*                           CallFunc_GetHeldItem_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24C3[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemAbility_Base_C_CharacterOwnerHasRelevantItem) == 0x000008, "Wrong alignment on ItemAbility_Base_C_CharacterOwnerHasRelevantItem");
static_assert(sizeof(ItemAbility_Base_C_CharacterOwnerHasRelevantItem) == 0x000028, "Wrong size on ItemAbility_Base_C_CharacterOwnerHasRelevantItem");
static_assert(offsetof(ItemAbility_Base_C_CharacterOwnerHasRelevantItem, ReturnValue) == 0x000000, "Member 'ItemAbility_Base_C_CharacterOwnerHasRelevantItem::ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemAbility_Base_C_CharacterOwnerHasRelevantItem, CallFunc_GetHeldItem_ReturnValue) == 0x000008, "Member 'ItemAbility_Base_C_CharacterOwnerHasRelevantItem::CallFunc_GetHeldItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemAbility_Base_C_CharacterOwnerHasRelevantItem, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'ItemAbility_Base_C_CharacterOwnerHasRelevantItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemAbility_Base_C_CharacterOwnerHasRelevantItem, CallFunc_GetObjectClass_ReturnValue) == 0x000018, "Member 'ItemAbility_Base_C_CharacterOwnerHasRelevantItem::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemAbility_Base_C_CharacterOwnerHasRelevantItem, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000020, "Member 'ItemAbility_Base_C_CharacterOwnerHasRelevantItem::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");

}

