#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemBoxPayload

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ItemBoxTypes_structs.hpp"


namespace SDK
{

// UserDefinedStruct ItemBoxPayload.ItemBoxPayload
// 0x0020 (0x0020 - 0x0000)
struct FItemBoxPayload final
{
public:
	EItemBoxTypes                                 ItemBoxType_2_08B0345C4832F3219B084AB2AC58FC1E;    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2493[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            OriginalStaticMesh_5_2CF849C443EA702188AA449D0AF77406; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OriginalScale_8_FFF8E3794076DF06746536AAF10E8CC5;  // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FItemBoxPayload) == 0x000008, "Wrong alignment on FItemBoxPayload");
static_assert(sizeof(FItemBoxPayload) == 0x000020, "Wrong size on FItemBoxPayload");
static_assert(offsetof(FItemBoxPayload, ItemBoxType_2_08B0345C4832F3219B084AB2AC58FC1E) == 0x000000, "Member 'FItemBoxPayload::ItemBoxType_2_08B0345C4832F3219B084AB2AC58FC1E' has a wrong offset!");
static_assert(offsetof(FItemBoxPayload, OriginalStaticMesh_5_2CF849C443EA702188AA449D0AF77406) == 0x000008, "Member 'FItemBoxPayload::OriginalStaticMesh_5_2CF849C443EA702188AA449D0AF77406' has a wrong offset!");
static_assert(offsetof(FItemBoxPayload, OriginalScale_8_FFF8E3794076DF06746536AAF10E8CC5) == 0x000010, "Member 'FItemBoxPayload::OriginalScale_8_FFF8E3794076DF06746536AAF10E8CC5' has a wrong offset!");

}

