#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JumpPadCameraEffect

#include "Basic.hpp"


namespace SDK::Params
{

// Function JumpPadCameraEffect.JumpPadCameraEffect_C.ExecuteUbergraph_JumpPadCameraEffect
// 0x0030 (0x0030 - 0x0000)
struct JumpPadCameraEffect_C_ExecuteUbergraph_JumpPadCameraEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24B9[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24BA[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24BB[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetGameplayEffectCount_ReturnValue;       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(JumpPadCameraEffect_C_ExecuteUbergraph_JumpPadCameraEffect) == 0x000008, "Wrong alignment on JumpPadCameraEffect_C_ExecuteUbergraph_JumpPadCameraEffect");
static_assert(sizeof(JumpPadCameraEffect_C_ExecuteUbergraph_JumpPadCameraEffect) == 0x000030, "Wrong size on JumpPadCameraEffect_C_ExecuteUbergraph_JumpPadCameraEffect");
static_assert(offsetof(JumpPadCameraEffect_C_ExecuteUbergraph_JumpPadCameraEffect, EntryPoint) == 0x000000, "Member 'JumpPadCameraEffect_C_ExecuteUbergraph_JumpPadCameraEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(JumpPadCameraEffect_C_ExecuteUbergraph_JumpPadCameraEffect, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'JumpPadCameraEffect_C_ExecuteUbergraph_JumpPadCameraEffect::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(JumpPadCameraEffect_C_ExecuteUbergraph_JumpPadCameraEffect, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'JumpPadCameraEffect_C_ExecuteUbergraph_JumpPadCameraEffect::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpPadCameraEffect_C_ExecuteUbergraph_JumpPadCameraEffect, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'JumpPadCameraEffect_C_ExecuteUbergraph_JumpPadCameraEffect::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(JumpPadCameraEffect_C_ExecuteUbergraph_JumpPadCameraEffect, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000018, "Member 'JumpPadCameraEffect_C_ExecuteUbergraph_JumpPadCameraEffect::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpPadCameraEffect_C_ExecuteUbergraph_JumpPadCameraEffect, Temp_bool_IsClosed_Variable) == 0x000020, "Member 'JumpPadCameraEffect_C_ExecuteUbergraph_JumpPadCameraEffect::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(JumpPadCameraEffect_C_ExecuteUbergraph_JumpPadCameraEffect, CallFunc_GetGameplayEffectCount_ReturnValue) == 0x000024, "Member 'JumpPadCameraEffect_C_ExecuteUbergraph_JumpPadCameraEffect::CallFunc_GetGameplayEffectCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(JumpPadCameraEffect_C_ExecuteUbergraph_JumpPadCameraEffect, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000028, "Member 'JumpPadCameraEffect_C_ExecuteUbergraph_JumpPadCameraEffect::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function JumpPadCameraEffect.JumpPadCameraEffect_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct JumpPadCameraEffect_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JumpPadCameraEffect_C_ReceiveTick) == 0x000004, "Wrong alignment on JumpPadCameraEffect_C_ReceiveTick");
static_assert(sizeof(JumpPadCameraEffect_C_ReceiveTick) == 0x000004, "Wrong size on JumpPadCameraEffect_C_ReceiveTick");
static_assert(offsetof(JumpPadCameraEffect_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'JumpPadCameraEffect_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

