#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KeyBindingSetting

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass KeyBindingSetting.KeyBindingSetting_C
// 0x0038 (0x0588 - 0x0550)
class UKeyBindingSetting_C final : public UMarinerSettingKeyBinding
{
public:
	class UWidgetAnimation*                       HoveredAnim;                                       // 0x0550(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPrompt_C*                       BindingPrompt;                                     // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerButton*                         ClickableArea;                                     // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Highlight;                                         // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LabelText;                                         // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Material;                                          // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FMarinerSettingKeyBindingAssets GetAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"KeyBindingSetting_C">();
	}
	static class UKeyBindingSetting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKeyBindingSetting_C>();
	}
};
static_assert(alignof(UKeyBindingSetting_C) == 0x000008, "Wrong alignment on UKeyBindingSetting_C");
static_assert(sizeof(UKeyBindingSetting_C) == 0x000588, "Wrong size on UKeyBindingSetting_C");
static_assert(offsetof(UKeyBindingSetting_C, HoveredAnim) == 0x000550, "Member 'UKeyBindingSetting_C::HoveredAnim' has a wrong offset!");
static_assert(offsetof(UKeyBindingSetting_C, Background) == 0x000558, "Member 'UKeyBindingSetting_C::Background' has a wrong offset!");
static_assert(offsetof(UKeyBindingSetting_C, BindingPrompt) == 0x000560, "Member 'UKeyBindingSetting_C::BindingPrompt' has a wrong offset!");
static_assert(offsetof(UKeyBindingSetting_C, ClickableArea) == 0x000568, "Member 'UKeyBindingSetting_C::ClickableArea' has a wrong offset!");
static_assert(offsetof(UKeyBindingSetting_C, Highlight) == 0x000570, "Member 'UKeyBindingSetting_C::Highlight' has a wrong offset!");
static_assert(offsetof(UKeyBindingSetting_C, LabelText) == 0x000578, "Member 'UKeyBindingSetting_C::LabelText' has a wrong offset!");
static_assert(offsetof(UKeyBindingSetting_C, Material) == 0x000580, "Member 'UKeyBindingSetting_C::Material' has a wrong offset!");

}

