#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LastMatchPlayerWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LastMatchPlayerWidget.LastMatchPlayerWidget_C
// 0x0020 (0x3910 - 0x38F0)
class ULastMatchPlayerWidget_C final : public UMarinerLastMatchPlayerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x38F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x38F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Background;                                        // 0x3900(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HighlightBorder;                                   // 0x3908(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LastMatchPlayerWidget(int32 EntryPoint);
	void Construct();
	void SetColorBySelection(bool bIsSelected);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LastMatchPlayerWidget_C">();
	}
	static class ULastMatchPlayerWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULastMatchPlayerWidget_C>();
	}
};
static_assert(alignof(ULastMatchPlayerWidget_C) == 0x000008, "Wrong alignment on ULastMatchPlayerWidget_C");
static_assert(sizeof(ULastMatchPlayerWidget_C) == 0x003910, "Wrong size on ULastMatchPlayerWidget_C");
static_assert(offsetof(ULastMatchPlayerWidget_C, UberGraphFrame) == 0x0038F0, "Member 'ULastMatchPlayerWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULastMatchPlayerWidget_C, HoverAnim) == 0x0038F8, "Member 'ULastMatchPlayerWidget_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(ULastMatchPlayerWidget_C, Background) == 0x003900, "Member 'ULastMatchPlayerWidget_C::Background' has a wrong offset!");
static_assert(offsetof(ULastMatchPlayerWidget_C, HighlightBorder) == 0x003908, "Member 'ULastMatchPlayerWidget_C::HighlightBorder' has a wrong offset!");

}

