#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LastMatchPlayerWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function LastMatchPlayerWidget.LastMatchPlayerWidget_C.ExecuteUbergraph_LastMatchPlayerWidget
// 0x0208 (0x0208 - 0x0000)
struct LastMatchPlayerWidget_C_ExecuteUbergraph_LastMatchPlayerWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0078(0x0018)()
	struct FMarinerMessageBoxData                 K2Node_MakeStruct_MarinerMessageBoxData;           // 0x0090(0x0170)(ContainsInstancedReference)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LastMatchPlayerWidget_C_ExecuteUbergraph_LastMatchPlayerWidget) == 0x000008, "Wrong alignment on LastMatchPlayerWidget_C_ExecuteUbergraph_LastMatchPlayerWidget");
static_assert(sizeof(LastMatchPlayerWidget_C_ExecuteUbergraph_LastMatchPlayerWidget) == 0x000208, "Wrong size on LastMatchPlayerWidget_C_ExecuteUbergraph_LastMatchPlayerWidget");
static_assert(offsetof(LastMatchPlayerWidget_C_ExecuteUbergraph_LastMatchPlayerWidget, EntryPoint) == 0x000000, "Member 'LastMatchPlayerWidget_C_ExecuteUbergraph_LastMatchPlayerWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(LastMatchPlayerWidget_C_ExecuteUbergraph_LastMatchPlayerWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'LastMatchPlayerWidget_C_ExecuteUbergraph_LastMatchPlayerWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(LastMatchPlayerWidget_C_ExecuteUbergraph_LastMatchPlayerWidget, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'LastMatchPlayerWidget_C_ExecuteUbergraph_LastMatchPlayerWidget::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(LastMatchPlayerWidget_C_ExecuteUbergraph_LastMatchPlayerWidget, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'LastMatchPlayerWidget_C_ExecuteUbergraph_LastMatchPlayerWidget::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(LastMatchPlayerWidget_C_ExecuteUbergraph_LastMatchPlayerWidget, K2Node_MakeArray_Array) == 0x000068, "Member 'LastMatchPlayerWidget_C_ExecuteUbergraph_LastMatchPlayerWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(LastMatchPlayerWidget_C_ExecuteUbergraph_LastMatchPlayerWidget, CallFunc_Format_ReturnValue) == 0x000078, "Member 'LastMatchPlayerWidget_C_ExecuteUbergraph_LastMatchPlayerWidget::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(LastMatchPlayerWidget_C_ExecuteUbergraph_LastMatchPlayerWidget, K2Node_MakeStruct_MarinerMessageBoxData) == 0x000090, "Member 'LastMatchPlayerWidget_C_ExecuteUbergraph_LastMatchPlayerWidget::K2Node_MakeStruct_MarinerMessageBoxData' has a wrong offset!");
static_assert(offsetof(LastMatchPlayerWidget_C_ExecuteUbergraph_LastMatchPlayerWidget, K2Node_Event_bIsSelected) == 0x000200, "Member 'LastMatchPlayerWidget_C_ExecuteUbergraph_LastMatchPlayerWidget::K2Node_Event_bIsSelected' has a wrong offset!");

// Function LastMatchPlayerWidget.LastMatchPlayerWidget_C.SetColorBySelection
// 0x0001 (0x0001 - 0x0000)
struct LastMatchPlayerWidget_C_SetColorBySelection final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LastMatchPlayerWidget_C_SetColorBySelection) == 0x000001, "Wrong alignment on LastMatchPlayerWidget_C_SetColorBySelection");
static_assert(sizeof(LastMatchPlayerWidget_C_SetColorBySelection) == 0x000001, "Wrong size on LastMatchPlayerWidget_C_SetColorBySelection");
static_assert(offsetof(LastMatchPlayerWidget_C_SetColorBySelection, bIsSelected) == 0x000000, "Member 'LastMatchPlayerWidget_C_SetColorBySelection::bIsSelected' has a wrong offset!");

}

