#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LeavePartyButton

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LeavePartyButton.LeavePartyButton_C
// 0x0050 (0x2FC8 - 0x2F78)
class ULeavePartyButton_C final : public UMarinerLayeredButton
{
public:
	class UWidgetAnimation*                       HoveredAnim;                                       // 0x2F78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             AuxiliaryText;                                     // 0x2F80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x2F88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Border;                                            // 0x2F90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x2F98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x2FA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Material;                                          // 0x2FA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PrimaryText;                                       // 0x2FB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPromptBanner_C*                 PromptBanner;                                      // 0x2FB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               RootSizeBox;                                       // 0x2FC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FMarinerLayeredButtonAssets GetAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LeavePartyButton_C">();
	}
	static class ULeavePartyButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULeavePartyButton_C>();
	}
};
static_assert(alignof(ULeavePartyButton_C) == 0x000008, "Wrong alignment on ULeavePartyButton_C");
static_assert(sizeof(ULeavePartyButton_C) == 0x002FC8, "Wrong size on ULeavePartyButton_C");
static_assert(offsetof(ULeavePartyButton_C, HoveredAnim) == 0x002F78, "Member 'ULeavePartyButton_C::HoveredAnim' has a wrong offset!");
static_assert(offsetof(ULeavePartyButton_C, AuxiliaryText) == 0x002F80, "Member 'ULeavePartyButton_C::AuxiliaryText' has a wrong offset!");
static_assert(offsetof(ULeavePartyButton_C, Background) == 0x002F88, "Member 'ULeavePartyButton_C::Background' has a wrong offset!");
static_assert(offsetof(ULeavePartyButton_C, Border) == 0x002F90, "Member 'ULeavePartyButton_C::Border' has a wrong offset!");
static_assert(offsetof(ULeavePartyButton_C, Button) == 0x002F98, "Member 'ULeavePartyButton_C::Button' has a wrong offset!");
static_assert(offsetof(ULeavePartyButton_C, Icon) == 0x002FA0, "Member 'ULeavePartyButton_C::Icon' has a wrong offset!");
static_assert(offsetof(ULeavePartyButton_C, Material) == 0x002FA8, "Member 'ULeavePartyButton_C::Material' has a wrong offset!");
static_assert(offsetof(ULeavePartyButton_C, PrimaryText) == 0x002FB0, "Member 'ULeavePartyButton_C::PrimaryText' has a wrong offset!");
static_assert(offsetof(ULeavePartyButton_C, PromptBanner) == 0x002FB8, "Member 'ULeavePartyButton_C::PromptBanner' has a wrong offset!");
static_assert(offsetof(ULeavePartyButton_C, RootSizeBox) == 0x002FC0, "Member 'ULeavePartyButton_C::RootSizeBox' has a wrong offset!");

}

