#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LegalMenuStack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LegalMenuStack.LegalMenuStack_C
// 0x0048 (0x06E0 - 0x0698)
class ULegalMenuStack_C final : public UMarinerMenuStackManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0698(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ULegalStackBase_C*                      DefaultStackBase;                                  // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPrompt_C*                       LTPrompt;                                          // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerGridPanel*                      NavRibbon;                                         // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPrimaryStackButtonWidget_C*            PrivacyPolicy;                                     // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPrompt_C*                       RTPrompt;                                          // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTabBackground_C*                       TabBackground;                                     // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextPlayerName;                                    // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPrimaryStackButtonWidget_C*            UserAgreement;                                     // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LegalMenuStack(int32 EntryPoint);
	void Construct();
	bool HandleInput(EMarinerInputActions InInput);
	void DummyEvent(struct FKey& KeyPressed);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LegalMenuStack_C">();
	}
	static class ULegalMenuStack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULegalMenuStack_C>();
	}
};
static_assert(alignof(ULegalMenuStack_C) == 0x000008, "Wrong alignment on ULegalMenuStack_C");
static_assert(sizeof(ULegalMenuStack_C) == 0x0006E0, "Wrong size on ULegalMenuStack_C");
static_assert(offsetof(ULegalMenuStack_C, UberGraphFrame) == 0x000698, "Member 'ULegalMenuStack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULegalMenuStack_C, DefaultStackBase) == 0x0006A0, "Member 'ULegalMenuStack_C::DefaultStackBase' has a wrong offset!");
static_assert(offsetof(ULegalMenuStack_C, LTPrompt) == 0x0006A8, "Member 'ULegalMenuStack_C::LTPrompt' has a wrong offset!");
static_assert(offsetof(ULegalMenuStack_C, NavRibbon) == 0x0006B0, "Member 'ULegalMenuStack_C::NavRibbon' has a wrong offset!");
static_assert(offsetof(ULegalMenuStack_C, PrivacyPolicy) == 0x0006B8, "Member 'ULegalMenuStack_C::PrivacyPolicy' has a wrong offset!");
static_assert(offsetof(ULegalMenuStack_C, RTPrompt) == 0x0006C0, "Member 'ULegalMenuStack_C::RTPrompt' has a wrong offset!");
static_assert(offsetof(ULegalMenuStack_C, TabBackground) == 0x0006C8, "Member 'ULegalMenuStack_C::TabBackground' has a wrong offset!");
static_assert(offsetof(ULegalMenuStack_C, TextPlayerName) == 0x0006D0, "Member 'ULegalMenuStack_C::TextPlayerName' has a wrong offset!");
static_assert(offsetof(ULegalMenuStack_C, UserAgreement) == 0x0006D8, "Member 'ULegalMenuStack_C::UserAgreement' has a wrong offset!");

}

