#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LegalMenuStack

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function LegalMenuStack.LegalMenuStack_C.ExecuteUbergraph_LegalMenuStack
// 0x0338 (0x0338 - 0x0000)
struct LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FD3[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FD4[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0040(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0058(0x0018)()
	struct FMarinerMenuStackManagerSetup          K2Node_MakeStruct_MarinerMenuStackManagerSetup;    // 0x0070(0x0028)(NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsEUBuild_ReturnValue;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEUBuild_ReturnValue_1;                  // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FD5[0x5];                                     // 0x009B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x00A0(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x00B8(0x0018)()
	struct FMarinerPromptData                     K2Node_MakeStruct_MarinerPromptData;               // 0x00D0(0x0118)()
	struct FMarinerPromptData                     K2Node_MakeStruct_MarinerPromptData_1;             // 0x01E8(0x0118)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMangoPlayerManager*                    CallFunc_Get_ReturnValue;                          // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetActiveAccountName_ReturnValue;         // 0x0310(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0320(0x0018)()
};
static_assert(alignof(LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack) == 0x000008, "Wrong alignment on LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack");
static_assert(sizeof(LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack) == 0x000338, "Wrong size on LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack");
static_assert(offsetof(LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack, EntryPoint) == 0x000000, "Member 'LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack::EntryPoint' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack, Temp_text_Variable) == 0x000008, "Member 'LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack, Temp_text_Variable_1) == 0x000020, "Member 'LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack, Temp_bool_Variable) == 0x000038, "Member 'LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack, Temp_text_Variable_2) == 0x000040, "Member 'LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack, Temp_text_Variable_3) == 0x000058, "Member 'LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack, K2Node_MakeStruct_MarinerMenuStackManagerSetup) == 0x000070, "Member 'LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack::K2Node_MakeStruct_MarinerMenuStackManagerSetup' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack, CallFunc_IsEUBuild_ReturnValue) == 0x000098, "Member 'LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack::CallFunc_IsEUBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack, Temp_bool_Variable_1) == 0x000099, "Member 'LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack, CallFunc_IsEUBuild_ReturnValue_1) == 0x00009A, "Member 'LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack::CallFunc_IsEUBuild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack, K2Node_Select_Default) == 0x0000A0, "Member 'LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack, K2Node_Select_Default_1) == 0x0000B8, "Member 'LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack, K2Node_MakeStruct_MarinerPromptData) == 0x0000D0, "Member 'LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack::K2Node_MakeStruct_MarinerPromptData' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack, K2Node_MakeStruct_MarinerPromptData_1) == 0x0001E8, "Member 'LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack::K2Node_MakeStruct_MarinerPromptData_1' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack, CallFunc_Array_Add_ReturnValue) == 0x000300, "Member 'LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack, CallFunc_Array_Add_ReturnValue_1) == 0x000304, "Member 'LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack, CallFunc_Get_ReturnValue) == 0x000308, "Member 'LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack, CallFunc_GetActiveAccountName_ReturnValue) == 0x000310, "Member 'LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack::CallFunc_GetActiveAccountName_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack, CallFunc_Conv_StringToText_ReturnValue) == 0x000320, "Member 'LegalMenuStack_C_ExecuteUbergraph_LegalMenuStack::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function LegalMenuStack.LegalMenuStack_C.HandleInput
// 0x0208 (0x0208 - 0x0000)
struct LegalMenuStack_C_HandleInput final
{
public:
	EMarinerInputActions                          InInput;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FD6[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HandleInput_ReturnValue;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FD7[0x5];                                     // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0028(0x0018)()
	bool                                          CallFunc_IsEUBuild_ReturnValue;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FD8[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FKey& KeyPressed)>      K2Node_CreateDelegate_OutputDelegate;              // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1FD9[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameInstance*                   CallFunc_GetMarinerGameInstance_ReturnValue;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FDA[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActivateRootLayer_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FDB[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0078(0x0018)()
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMarinerMessageBoxData                 K2Node_MakeStruct_MarinerMessageBoxData;           // 0x0098(0x0170)(ContainsInstancedReference)
};
static_assert(alignof(LegalMenuStack_C_HandleInput) == 0x000008, "Wrong alignment on LegalMenuStack_C_HandleInput");
static_assert(sizeof(LegalMenuStack_C_HandleInput) == 0x000208, "Wrong size on LegalMenuStack_C_HandleInput");
static_assert(offsetof(LegalMenuStack_C_HandleInput, InInput) == 0x000000, "Member 'LegalMenuStack_C_HandleInput::InInput' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_HandleInput, ReturnValue) == 0x000001, "Member 'LegalMenuStack_C_HandleInput::ReturnValue' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_HandleInput, Temp_text_Variable) == 0x000008, "Member 'LegalMenuStack_C_HandleInput::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_HandleInput, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000020, "Member 'LegalMenuStack_C_HandleInput::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_HandleInput, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000021, "Member 'LegalMenuStack_C_HandleInput::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_HandleInput, CallFunc_HandleInput_ReturnValue) == 0x000022, "Member 'LegalMenuStack_C_HandleInput::CallFunc_HandleInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_HandleInput, Temp_text_Variable_1) == 0x000028, "Member 'LegalMenuStack_C_HandleInput::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_HandleInput, CallFunc_IsEUBuild_ReturnValue) == 0x000040, "Member 'LegalMenuStack_C_HandleInput::CallFunc_IsEUBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_HandleInput, K2Node_CreateDelegate_OutputDelegate) == 0x000044, "Member 'LegalMenuStack_C_HandleInput::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_HandleInput, CallFunc_GetMarinerGameInstance_ReturnValue) == 0x000058, "Member 'LegalMenuStack_C_HandleInput::CallFunc_GetMarinerGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_HandleInput, Temp_bool_Variable) == 0x000060, "Member 'LegalMenuStack_C_HandleInput::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_HandleInput, CallFunc_GetMenuManager_ReturnValue) == 0x000068, "Member 'LegalMenuStack_C_HandleInput::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_HandleInput, CallFunc_ActivateRootLayer_ReturnValue) == 0x000070, "Member 'LegalMenuStack_C_HandleInput::CallFunc_ActivateRootLayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_HandleInput, K2Node_Select_Default) == 0x000078, "Member 'LegalMenuStack_C_HandleInput::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_HandleInput, CallFunc_GetUserSettings_ReturnValue) == 0x000090, "Member 'LegalMenuStack_C_HandleInput::CallFunc_GetUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegalMenuStack_C_HandleInput, K2Node_MakeStruct_MarinerMessageBoxData) == 0x000098, "Member 'LegalMenuStack_C_HandleInput::K2Node_MakeStruct_MarinerMessageBoxData' has a wrong offset!");

// Function LegalMenuStack.LegalMenuStack_C.DummyEvent
// 0x0018 (0x0018 - 0x0000)
struct LegalMenuStack_C_DummyEvent final
{
public:
	struct FKey                                   KeyPressed;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(LegalMenuStack_C_DummyEvent) == 0x000008, "Wrong alignment on LegalMenuStack_C_DummyEvent");
static_assert(sizeof(LegalMenuStack_C_DummyEvent) == 0x000018, "Wrong size on LegalMenuStack_C_DummyEvent");
static_assert(offsetof(LegalMenuStack_C_DummyEvent, KeyPressed) == 0x000000, "Member 'LegalMenuStack_C_DummyEvent::KeyPressed' has a wrong offset!");

}

