#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LegalStackBase

#include "Basic.hpp"

#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function LegalStackBase.LegalStackBase_C.ExecuteUbergraph_LegalStackBase
// 0x0050 (0x0050 - 0x0000)
struct LegalStackBase_C_ExecuteUbergraph_LegalStackBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEUBuild_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0038(0x0018)()
};
static_assert(alignof(LegalStackBase_C_ExecuteUbergraph_LegalStackBase) == 0x000008, "Wrong alignment on LegalStackBase_C_ExecuteUbergraph_LegalStackBase");
static_assert(sizeof(LegalStackBase_C_ExecuteUbergraph_LegalStackBase) == 0x000050, "Wrong size on LegalStackBase_C_ExecuteUbergraph_LegalStackBase");
static_assert(offsetof(LegalStackBase_C_ExecuteUbergraph_LegalStackBase, EntryPoint) == 0x000000, "Member 'LegalStackBase_C_ExecuteUbergraph_LegalStackBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(LegalStackBase_C_ExecuteUbergraph_LegalStackBase, CallFunc_IsEUBuild_ReturnValue) == 0x000004, "Member 'LegalStackBase_C_ExecuteUbergraph_LegalStackBase::CallFunc_IsEUBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(LegalStackBase_C_ExecuteUbergraph_LegalStackBase, Temp_bool_Variable) == 0x000005, "Member 'LegalStackBase_C_ExecuteUbergraph_LegalStackBase::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LegalStackBase_C_ExecuteUbergraph_LegalStackBase, Temp_text_Variable) == 0x000008, "Member 'LegalStackBase_C_ExecuteUbergraph_LegalStackBase::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(LegalStackBase_C_ExecuteUbergraph_LegalStackBase, Temp_text_Variable_1) == 0x000020, "Member 'LegalStackBase_C_ExecuteUbergraph_LegalStackBase::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(LegalStackBase_C_ExecuteUbergraph_LegalStackBase, K2Node_Select_Default) == 0x000038, "Member 'LegalStackBase_C_ExecuteUbergraph_LegalStackBase::K2Node_Select_Default' has a wrong offset!");

// Function LegalStackBase.LegalStackBase_C.GetWidgetSetup
// 0x0020 (0x0020 - 0x0000)
struct LegalStackBase_C_GetWidgetSetup final
{
public:
	struct FMarinerMenuStackBaseWidgetSetup       ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference)
	struct FMarinerMenuStackBaseWidgetSetup       K2Node_MakeStruct_MarinerMenuStackBaseWidgetSetup; // 0x0010(0x0010)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(LegalStackBase_C_GetWidgetSetup) == 0x000008, "Wrong alignment on LegalStackBase_C_GetWidgetSetup");
static_assert(sizeof(LegalStackBase_C_GetWidgetSetup) == 0x000020, "Wrong size on LegalStackBase_C_GetWidgetSetup");
static_assert(offsetof(LegalStackBase_C_GetWidgetSetup, ReturnValue) == 0x000000, "Member 'LegalStackBase_C_GetWidgetSetup::ReturnValue' has a wrong offset!");
static_assert(offsetof(LegalStackBase_C_GetWidgetSetup, K2Node_MakeStruct_MarinerMenuStackBaseWidgetSetup) == 0x000010, "Member 'LegalStackBase_C_GetWidgetSetup::K2Node_MakeStruct_MarinerMenuStackBaseWidgetSetup' has a wrong offset!");

}

