#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LegalStackBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LegalStackBase.LegalStackBase_C
// 0x0020 (0x0378 - 0x0358)
class ULegalStackBase_C final : public UMarinerMenuStackBaseWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             ConfirmText;                                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStackManagerContentScrollBox_C*        MenuContent;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPromptBanner_C*                 NavPrompts;                                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LegalStackBase(int32 EntryPoint);
	void Construct();

	struct FMarinerMenuStackBaseWidgetSetup GetWidgetSetup() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LegalStackBase_C">();
	}
	static class ULegalStackBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULegalStackBase_C>();
	}
};
static_assert(alignof(ULegalStackBase_C) == 0x000008, "Wrong alignment on ULegalStackBase_C");
static_assert(sizeof(ULegalStackBase_C) == 0x000378, "Wrong size on ULegalStackBase_C");
static_assert(offsetof(ULegalStackBase_C, UberGraphFrame) == 0x000358, "Member 'ULegalStackBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULegalStackBase_C, ConfirmText) == 0x000360, "Member 'ULegalStackBase_C::ConfirmText' has a wrong offset!");
static_assert(offsetof(ULegalStackBase_C, MenuContent) == 0x000368, "Member 'ULegalStackBase_C::MenuContent' has a wrong offset!");
static_assert(offsetof(ULegalStackBase_C, NavPrompts) == 0x000370, "Member 'ULegalStackBase_C::NavPrompts' has a wrong offset!");

}

