#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoadingScreenSkipWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LoadingScreenSkipWidget.LoadingScreenSkipWidget_C
// 0x0028 (0x02A8 - 0x0280)
class ULoadingScreenSkipWidget_C final : public UMarinerLoadingSkipWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_246;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_247;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerCircleProgress*                 MarinerCircleProgress_2;                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Textbacker;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LoadingScreenSkipWidget(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LoadingScreenSkipWidget_C">();
	}
	static class ULoadingScreenSkipWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoadingScreenSkipWidget_C>();
	}
};
static_assert(alignof(ULoadingScreenSkipWidget_C) == 0x000008, "Wrong alignment on ULoadingScreenSkipWidget_C");
static_assert(sizeof(ULoadingScreenSkipWidget_C) == 0x0002A8, "Wrong size on ULoadingScreenSkipWidget_C");
static_assert(offsetof(ULoadingScreenSkipWidget_C, UberGraphFrame) == 0x000280, "Member 'ULoadingScreenSkipWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULoadingScreenSkipWidget_C, Image_246) == 0x000288, "Member 'ULoadingScreenSkipWidget_C::Image_246' has a wrong offset!");
static_assert(offsetof(ULoadingScreenSkipWidget_C, Image_247) == 0x000290, "Member 'ULoadingScreenSkipWidget_C::Image_247' has a wrong offset!");
static_assert(offsetof(ULoadingScreenSkipWidget_C, MarinerCircleProgress_2) == 0x000298, "Member 'ULoadingScreenSkipWidget_C::MarinerCircleProgress_2' has a wrong offset!");
static_assert(offsetof(ULoadingScreenSkipWidget_C, Textbacker) == 0x0002A0, "Member 'ULoadingScreenSkipWidget_C::Textbacker' has a wrong offset!");

}

