#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoadingScreenSkipWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function LoadingScreenSkipWidget.LoadingScreenSkipWidget_C.ExecuteUbergraph_LoadingScreenSkipWidget
// 0x0008 (0x0008 - 0x0000)
struct LoadingScreenSkipWidget_C_ExecuteUbergraph_LoadingScreenSkipWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoadingScreenSkipWidget_C_ExecuteUbergraph_LoadingScreenSkipWidget) == 0x000004, "Wrong alignment on LoadingScreenSkipWidget_C_ExecuteUbergraph_LoadingScreenSkipWidget");
static_assert(sizeof(LoadingScreenSkipWidget_C_ExecuteUbergraph_LoadingScreenSkipWidget) == 0x000008, "Wrong size on LoadingScreenSkipWidget_C_ExecuteUbergraph_LoadingScreenSkipWidget");
static_assert(offsetof(LoadingScreenSkipWidget_C_ExecuteUbergraph_LoadingScreenSkipWidget, EntryPoint) == 0x000000, "Member 'LoadingScreenSkipWidget_C_ExecuteUbergraph_LoadingScreenSkipWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(LoadingScreenSkipWidget_C_ExecuteUbergraph_LoadingScreenSkipWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'LoadingScreenSkipWidget_C_ExecuteUbergraph_LoadingScreenSkipWidget::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function LoadingScreenSkipWidget.LoadingScreenSkipWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct LoadingScreenSkipWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoadingScreenSkipWidget_C_PreConstruct) == 0x000001, "Wrong alignment on LoadingScreenSkipWidget_C_PreConstruct");
static_assert(sizeof(LoadingScreenSkipWidget_C_PreConstruct) == 0x000001, "Wrong size on LoadingScreenSkipWidget_C_PreConstruct");
static_assert(offsetof(LoadingScreenSkipWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'LoadingScreenSkipWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

