#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoadingSpinner_Simplified

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LoadingSpinner_Simplified.LoadingSpinner_Simplified_C
// 0x0018 (0x0248 - 0x0230)
class ULoadingSpinner_Simplified_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loading;                                           // 0x0238(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 LoadingSpinner1;                                   // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LoadingSpinner_Simplified(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LoadingSpinner_Simplified_C">();
	}
	static class ULoadingSpinner_Simplified_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoadingSpinner_Simplified_C>();
	}
};
static_assert(alignof(ULoadingSpinner_Simplified_C) == 0x000008, "Wrong alignment on ULoadingSpinner_Simplified_C");
static_assert(sizeof(ULoadingSpinner_Simplified_C) == 0x000248, "Wrong size on ULoadingSpinner_Simplified_C");
static_assert(offsetof(ULoadingSpinner_Simplified_C, UberGraphFrame) == 0x000230, "Member 'ULoadingSpinner_Simplified_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULoadingSpinner_Simplified_C, Loading) == 0x000238, "Member 'ULoadingSpinner_Simplified_C::Loading' has a wrong offset!");
static_assert(offsetof(ULoadingSpinner_Simplified_C, LoadingSpinner1) == 0x000240, "Member 'ULoadingSpinner_Simplified_C::LoadingSpinner1' has a wrong offset!");

}

