#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoadingSpinner_Matchmaking

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LoadingSpinner_Matchmaking.LoadingSpinner_Matchmaking_C
// 0x0020 (0x0250 - 0x0230)
class ULoadingSpinner_Matchmaking_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loading;                                           // 0x0238(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 LoadingSpinner1;                                   // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LoadingSpinner2;                                   // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LoadingSpinner_Matchmaking(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LoadingSpinner_Matchmaking_C">();
	}
	static class ULoadingSpinner_Matchmaking_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoadingSpinner_Matchmaking_C>();
	}
};
static_assert(alignof(ULoadingSpinner_Matchmaking_C) == 0x000008, "Wrong alignment on ULoadingSpinner_Matchmaking_C");
static_assert(sizeof(ULoadingSpinner_Matchmaking_C) == 0x000250, "Wrong size on ULoadingSpinner_Matchmaking_C");
static_assert(offsetof(ULoadingSpinner_Matchmaking_C, UberGraphFrame) == 0x000230, "Member 'ULoadingSpinner_Matchmaking_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULoadingSpinner_Matchmaking_C, Loading) == 0x000238, "Member 'ULoadingSpinner_Matchmaking_C::Loading' has a wrong offset!");
static_assert(offsetof(ULoadingSpinner_Matchmaking_C, LoadingSpinner1) == 0x000240, "Member 'ULoadingSpinner_Matchmaking_C::LoadingSpinner1' has a wrong offset!");
static_assert(offsetof(ULoadingSpinner_Matchmaking_C, LoadingSpinner2) == 0x000248, "Member 'ULoadingSpinner_Matchmaking_C::LoadingSpinner2' has a wrong offset!");

}

