#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoadingScreen

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LoadingScreen.LoadingScreen_C
// 0x0018 (0x0338 - 0x0320)
class ULoadingScreen_C final : public UMarinerLoadingScreen
{
public:
	class UImage*                                 BlackBG;                                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_213;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LoadingScreen_C">();
	}
	static class ULoadingScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoadingScreen_C>();
	}
};
static_assert(alignof(ULoadingScreen_C) == 0x000008, "Wrong alignment on ULoadingScreen_C");
static_assert(sizeof(ULoadingScreen_C) == 0x000338, "Wrong size on ULoadingScreen_C");
static_assert(offsetof(ULoadingScreen_C, BlackBG) == 0x000320, "Member 'ULoadingScreen_C::BlackBG' has a wrong offset!");
static_assert(offsetof(ULoadingScreen_C, Image) == 0x000328, "Member 'ULoadingScreen_C::Image' has a wrong offset!");
static_assert(offsetof(ULoadingScreen_C, Image_213) == 0x000330, "Member 'ULoadingScreen_C::Image_213' has a wrong offset!");

}

