#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbySlotWidget

#include "Basic.hpp"

#include "Mariner_structs.hpp"
#include "SlateCore_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function LobbySlotWidget.LobbySlotWidget_C.ExecuteUbergraph_LobbySlotWidget
// 0x0078 (0x0078 - 0x0000)
struct LobbySlotWidget_C_ExecuteUbergraph_LobbySlotWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2327[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0010(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0020(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0030(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0044(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2328[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LobbySlotWidget_C_ExecuteUbergraph_LobbySlotWidget) == 0x000008, "Wrong alignment on LobbySlotWidget_C_ExecuteUbergraph_LobbySlotWidget");
static_assert(sizeof(LobbySlotWidget_C_ExecuteUbergraph_LobbySlotWidget) == 0x000078, "Wrong size on LobbySlotWidget_C_ExecuteUbergraph_LobbySlotWidget");
static_assert(offsetof(LobbySlotWidget_C_ExecuteUbergraph_LobbySlotWidget, EntryPoint) == 0x000000, "Member 'LobbySlotWidget_C_ExecuteUbergraph_LobbySlotWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(LobbySlotWidget_C_ExecuteUbergraph_LobbySlotWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'LobbySlotWidget_C_ExecuteUbergraph_LobbySlotWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbySlotWidget_C_ExecuteUbergraph_LobbySlotWidget, Temp_struct_Variable) == 0x000010, "Member 'LobbySlotWidget_C_ExecuteUbergraph_LobbySlotWidget::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(LobbySlotWidget_C_ExecuteUbergraph_LobbySlotWidget, Temp_delegate_Variable) == 0x000020, "Member 'LobbySlotWidget_C_ExecuteUbergraph_LobbySlotWidget::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(LobbySlotWidget_C_ExecuteUbergraph_LobbySlotWidget, Temp_struct_Variable_1) == 0x000030, "Member 'LobbySlotWidget_C_ExecuteUbergraph_LobbySlotWidget::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(LobbySlotWidget_C_ExecuteUbergraph_LobbySlotWidget, CallFunc_PostEvent_ReturnValue) == 0x000040, "Member 'LobbySlotWidget_C_ExecuteUbergraph_LobbySlotWidget::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbySlotWidget_C_ExecuteUbergraph_LobbySlotWidget, Temp_delegate_Variable_1) == 0x000044, "Member 'LobbySlotWidget_C_ExecuteUbergraph_LobbySlotWidget::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(LobbySlotWidget_C_ExecuteUbergraph_LobbySlotWidget, CallFunc_PostEvent_ReturnValue_1) == 0x000054, "Member 'LobbySlotWidget_C_ExecuteUbergraph_LobbySlotWidget::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LobbySlotWidget_C_ExecuteUbergraph_LobbySlotWidget, K2Node_ComponentBoundEvent_SelectedItem) == 0x000058, "Member 'LobbySlotWidget_C_ExecuteUbergraph_LobbySlotWidget::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(LobbySlotWidget_C_ExecuteUbergraph_LobbySlotWidget, K2Node_ComponentBoundEvent_SelectionType) == 0x000068, "Member 'LobbySlotWidget_C_ExecuteUbergraph_LobbySlotWidget::K2Node_ComponentBoundEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(LobbySlotWidget_C_ExecuteUbergraph_LobbySlotWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000070, "Member 'LobbySlotWidget_C_ExecuteUbergraph_LobbySlotWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function LobbySlotWidget.LobbySlotWidget_C.BndEvt__ComboBox_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct LobbySlotWidget_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LobbySlotWidget_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on LobbySlotWidget_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(LobbySlotWidget_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on LobbySlotWidget_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(LobbySlotWidget_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'LobbySlotWidget_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(LobbySlotWidget_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'LobbySlotWidget_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function LobbySlotWidget.LobbySlotWidget_C.GetAssets
// 0x0080 (0x0080 - 0x0000)
struct LobbySlotWidget_C_GetAssets final
{
public:
	struct FMarinerSettingComboBoxAssets          ReturnValue;                                       // 0x0000(0x0040)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference)
	struct FMarinerSettingComboBoxAssets          K2Node_MakeStruct_MarinerSettingComboBoxAssets;    // 0x0040(0x0040)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(LobbySlotWidget_C_GetAssets) == 0x000008, "Wrong alignment on LobbySlotWidget_C_GetAssets");
static_assert(sizeof(LobbySlotWidget_C_GetAssets) == 0x000080, "Wrong size on LobbySlotWidget_C_GetAssets");
static_assert(offsetof(LobbySlotWidget_C_GetAssets, ReturnValue) == 0x000000, "Member 'LobbySlotWidget_C_GetAssets::ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbySlotWidget_C_GetAssets, K2Node_MakeStruct_MarinerSettingComboBoxAssets) == 0x000040, "Member 'LobbySlotWidget_C_GetAssets::K2Node_MakeStruct_MarinerSettingComboBoxAssets' has a wrong offset!");

}

