#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LockerRoomMenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function LockerRoomMenu.LockerRoomMenu_C.ExecuteUbergraph_LockerRoomMenu
// 0x0050 (0x0050 - 0x0000)
struct LockerRoomMenu_C_ExecuteUbergraph_LockerRoomMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FD2[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMarinerInputInterface> CallFunc_SetActiveInputWidget_InputWidget_CastInput; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMarinerLayeredButton*                  K2Node_ComponentBoundEvent_Instance_1;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerLayeredButton*                  K2Node_ComponentBoundEvent_Instance;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue_1;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuStackLayer*                 CallFunc_PushLayerToActiveStack_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuStackLayer*                 CallFunc_PushLayerToActiveStack_ReturnValue_1;     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFromSubMenu;                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LockerRoomMenu_C_ExecuteUbergraph_LockerRoomMenu) == 0x000008, "Wrong alignment on LockerRoomMenu_C_ExecuteUbergraph_LockerRoomMenu");
static_assert(sizeof(LockerRoomMenu_C_ExecuteUbergraph_LockerRoomMenu) == 0x000050, "Wrong size on LockerRoomMenu_C_ExecuteUbergraph_LockerRoomMenu");
static_assert(offsetof(LockerRoomMenu_C_ExecuteUbergraph_LockerRoomMenu, EntryPoint) == 0x000000, "Member 'LockerRoomMenu_C_ExecuteUbergraph_LockerRoomMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(LockerRoomMenu_C_ExecuteUbergraph_LockerRoomMenu, CallFunc_SetActiveInputWidget_InputWidget_CastInput) == 0x000008, "Member 'LockerRoomMenu_C_ExecuteUbergraph_LockerRoomMenu::CallFunc_SetActiveInputWidget_InputWidget_CastInput' has a wrong offset!");
static_assert(offsetof(LockerRoomMenu_C_ExecuteUbergraph_LockerRoomMenu, K2Node_ComponentBoundEvent_Instance_1) == 0x000018, "Member 'LockerRoomMenu_C_ExecuteUbergraph_LockerRoomMenu::K2Node_ComponentBoundEvent_Instance_1' has a wrong offset!");
static_assert(offsetof(LockerRoomMenu_C_ExecuteUbergraph_LockerRoomMenu, K2Node_ComponentBoundEvent_Instance) == 0x000020, "Member 'LockerRoomMenu_C_ExecuteUbergraph_LockerRoomMenu::K2Node_ComponentBoundEvent_Instance' has a wrong offset!");
static_assert(offsetof(LockerRoomMenu_C_ExecuteUbergraph_LockerRoomMenu, CallFunc_GetMenuManager_ReturnValue) == 0x000028, "Member 'LockerRoomMenu_C_ExecuteUbergraph_LockerRoomMenu::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(LockerRoomMenu_C_ExecuteUbergraph_LockerRoomMenu, CallFunc_GetMenuManager_ReturnValue_1) == 0x000030, "Member 'LockerRoomMenu_C_ExecuteUbergraph_LockerRoomMenu::CallFunc_GetMenuManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LockerRoomMenu_C_ExecuteUbergraph_LockerRoomMenu, CallFunc_PushLayerToActiveStack_ReturnValue) == 0x000038, "Member 'LockerRoomMenu_C_ExecuteUbergraph_LockerRoomMenu::CallFunc_PushLayerToActiveStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(LockerRoomMenu_C_ExecuteUbergraph_LockerRoomMenu, CallFunc_PushLayerToActiveStack_ReturnValue_1) == 0x000040, "Member 'LockerRoomMenu_C_ExecuteUbergraph_LockerRoomMenu::CallFunc_PushLayerToActiveStack_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LockerRoomMenu_C_ExecuteUbergraph_LockerRoomMenu, K2Node_Event_bFromSubMenu) == 0x000048, "Member 'LockerRoomMenu_C_ExecuteUbergraph_LockerRoomMenu::K2Node_Event_bFromSubMenu' has a wrong offset!");

// Function LockerRoomMenu.LockerRoomMenu_C.BP_OnEntered
// 0x0001 (0x0001 - 0x0000)
struct LockerRoomMenu_C_BP_OnEntered final
{
public:
	bool                                          bFromSubMenu;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LockerRoomMenu_C_BP_OnEntered) == 0x000001, "Wrong alignment on LockerRoomMenu_C_BP_OnEntered");
static_assert(sizeof(LockerRoomMenu_C_BP_OnEntered) == 0x000001, "Wrong size on LockerRoomMenu_C_BP_OnEntered");
static_assert(offsetof(LockerRoomMenu_C_BP_OnEntered, bFromSubMenu) == 0x000000, "Member 'LockerRoomMenu_C_BP_OnEntered::bFromSubMenu' has a wrong offset!");

// Function LockerRoomMenu.LockerRoomMenu_C.BndEvt__Characters_K2Node_ComponentBoundEvent_212_OnLayeredButtonEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct LockerRoomMenu_C_BndEvt__Characters_K2Node_ComponentBoundEvent_212_OnLayeredButtonEvent__DelegateSignature final
{
public:
	class UMarinerLayeredButton*                  Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LockerRoomMenu_C_BndEvt__Characters_K2Node_ComponentBoundEvent_212_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on LockerRoomMenu_C_BndEvt__Characters_K2Node_ComponentBoundEvent_212_OnLayeredButtonEvent__DelegateSignature");
static_assert(sizeof(LockerRoomMenu_C_BndEvt__Characters_K2Node_ComponentBoundEvent_212_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong size on LockerRoomMenu_C_BndEvt__Characters_K2Node_ComponentBoundEvent_212_OnLayeredButtonEvent__DelegateSignature");
static_assert(offsetof(LockerRoomMenu_C_BndEvt__Characters_K2Node_ComponentBoundEvent_212_OnLayeredButtonEvent__DelegateSignature, Instance) == 0x000000, "Member 'LockerRoomMenu_C_BndEvt__Characters_K2Node_ComponentBoundEvent_212_OnLayeredButtonEvent__DelegateSignature::Instance' has a wrong offset!");

// Function LockerRoomMenu.LockerRoomMenu_C.BndEvt__Totems_K2Node_ComponentBoundEvent_256_OnLayeredButtonEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct LockerRoomMenu_C_BndEvt__Totems_K2Node_ComponentBoundEvent_256_OnLayeredButtonEvent__DelegateSignature final
{
public:
	class UMarinerLayeredButton*                  Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LockerRoomMenu_C_BndEvt__Totems_K2Node_ComponentBoundEvent_256_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on LockerRoomMenu_C_BndEvt__Totems_K2Node_ComponentBoundEvent_256_OnLayeredButtonEvent__DelegateSignature");
static_assert(sizeof(LockerRoomMenu_C_BndEvt__Totems_K2Node_ComponentBoundEvent_256_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong size on LockerRoomMenu_C_BndEvt__Totems_K2Node_ComponentBoundEvent_256_OnLayeredButtonEvent__DelegateSignature");
static_assert(offsetof(LockerRoomMenu_C_BndEvt__Totems_K2Node_ComponentBoundEvent_256_OnLayeredButtonEvent__DelegateSignature, Instance) == 0x000000, "Member 'LockerRoomMenu_C_BndEvt__Totems_K2Node_ComponentBoundEvent_256_OnLayeredButtonEvent__DelegateSignature::Instance' has a wrong offset!");

}

