#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LockerRoomMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LockerRoomMenu.LockerRoomMenu_C
// 0x0020 (0x0500 - 0x04E0)
class ULockerRoomMenu_C final : public UMarinerMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDefaultMenuButton_C*                   Characters;                                        // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerGridPanel*                      ContentPane;                                       // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultMenuButton_C*                   Totems;                                            // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LockerRoomMenu(int32 EntryPoint);
	void BP_OnEntered(bool bFromSubMenu);
	void BndEvt__Characters_K2Node_ComponentBoundEvent_212_OnLayeredButtonEvent__DelegateSignature(class UMarinerLayeredButton* Instance);
	void BndEvt__Totems_K2Node_ComponentBoundEvent_256_OnLayeredButtonEvent__DelegateSignature(class UMarinerLayeredButton* Instance);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LockerRoomMenu_C">();
	}
	static class ULockerRoomMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULockerRoomMenu_C>();
	}
};
static_assert(alignof(ULockerRoomMenu_C) == 0x000008, "Wrong alignment on ULockerRoomMenu_C");
static_assert(sizeof(ULockerRoomMenu_C) == 0x000500, "Wrong size on ULockerRoomMenu_C");
static_assert(offsetof(ULockerRoomMenu_C, UberGraphFrame) == 0x0004E0, "Member 'ULockerRoomMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULockerRoomMenu_C, Characters) == 0x0004E8, "Member 'ULockerRoomMenu_C::Characters' has a wrong offset!");
static_assert(offsetof(ULockerRoomMenu_C, ContentPane) == 0x0004F0, "Member 'ULockerRoomMenu_C::ContentPane' has a wrong offset!");
static_assert(offsetof(ULockerRoomMenu_C, Totems) == 0x0004F8, "Member 'ULockerRoomMenu_C::Totems' has a wrong offset!");

}

