#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MangoClient

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum MangoClient.EMapRecommendedNumberOfPlayers
// NumValues: 0x0003
enum class EMapRecommendedNumberOfPlayers : uint8
{
	TwoVsTwo                                 = 0,
	ThreeVsThree                             = 1,
	EMapRecommendedNumberOfPlayers_MAX       = 2,
};

// Enum MangoClient.EMangoBlastPassXPBonusType
// NumValues: 0x0004
enum class EMangoBlastPassXPBonusType : uint8
{
	Personal                                 = 0,
	Party                                    = 1,
	Invalid                                  = 2,
	EMangoBlastPassXPBonusType_MAX           = 3,
};

// Enum MangoClient.EMangoNativeOfferType
// NumValues: 0x0005
enum class EMangoNativeOfferType : uint8
{
	Hidden                                   = 0,
	Currency                                 = 1,
	Bundle                                   = 2,
	BlastPass                                = 3,
	EMangoNativeOfferType_MAX                = 4,
};

// Enum MangoClient.EMangoOfferType
// NumValues: 0x0005
enum class EMangoOfferType : uint8
{
	Hidden                                   = 0,
	Item                                     = 1,
	Character                                = 2,
	BlastPass                                = 3,
	EMangoOfferType_MAX                      = 4,
};

// Enum MangoClient.EMangoItemType
// NumValues: 0x0016
enum class EMangoItemType : uint8
{
	Invalid                                  = 0,
	Artifact                                 = 1,
	Character                                = 2,
	MegaBlastTrail                           = 3,
	ReturnTrail                              = 4,
	Skin                                     = 5,
	TotemBorder                              = 6,
	TotemPattern                             = 7,
	TotemShape                               = 8,
	TotemStand                               = 9,
	TotemSymbols                             = 10,
	TotemVFX                                 = 11,
	CoreArtifact                             = 12,
	SecondaryArtifact                        = 13,
	UtilityArtifact                          = 14,
	CharacterArtifact                        = 15,
	PreGameEmote                             = 16,
	ChatEmote                                = 17,
	VictoryPose                              = 18,
	TotemCompanion                           = 19,
	Last                                     = 20,
	EMangoItemType_MAX                       = 21,
};

// Enum MangoClient.EMarinerGameOutcome
// NumValues: 0x0006
enum class EMarinerGameOutcome : uint8
{
	Unknown                                  = 0,
	Win                                      = 1,
	Loss                                     = 2,
	Draw                                     = 3,
	Quit                                     = 4,
	EMarinerGameOutcome_MAX                  = 5,
};

// Enum MangoClient.EMangoQuestSlot
// NumValues: 0x0007
enum class EMangoQuestSlot : uint8
{
	Daily1                                   = 0,
	Daily2                                   = 1,
	Login                                    = 2,
	Weekly                                   = 3,
	Weekly2                                  = 4,
	Daily3                                   = 5,
	EMangoQuestSlot_MAX                      = 6,
};

// Enum MangoClient.EMangoQuestState
// NumValues: 0x0005
enum class EMangoQuestState : uint8
{
	Active                                   = 0,
	Complete                                 = 1,
	Dismissed                                = 2,
	Claimed                                  = 3,
	EMangoQuestState_MAX                     = 4,
};

// Enum MangoClient.EMangoStatType
// NumValues: 0x0004
enum class EMangoStatType : uint8
{
	Max                                      = 0,
	Min                                      = 1,
	Mean                                     = 2,
	Sum                                      = 3,
};

// Enum MangoClient.EMangoStatGroupType
// NumValues: 0x0003
enum class EMangoStatGroupType : uint8
{
	Lifetime                                 = 0,
	Playlist                                 = 1,
	EMangoStatGroupType_MAX                  = 2,
};

// ScriptStruct MangoClient.MatchEndTeam
// 0x0008 (0x0008 - 0x0000)
struct FMatchEndTeam final
{
public:
	int32                                         TeamIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Score;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMatchEndTeam) == 0x000004, "Wrong alignment on FMatchEndTeam");
static_assert(sizeof(FMatchEndTeam) == 0x000008, "Wrong size on FMatchEndTeam");
static_assert(offsetof(FMatchEndTeam, TeamIndex) == 0x000000, "Member 'FMatchEndTeam::TeamIndex' has a wrong offset!");
static_assert(offsetof(FMatchEndTeam, Score) == 0x000004, "Member 'FMatchEndTeam::Score' has a wrong offset!");

// ScriptStruct MangoClient.MangoCharacterRestriction
// 0x0020 (0x0020 - 0x0000)
struct FMangoCharacterRestriction final
{
public:
	class FString                                 Item_name;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Lookup_field;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMangoCharacterRestriction) == 0x000008, "Wrong alignment on FMangoCharacterRestriction");
static_assert(sizeof(FMangoCharacterRestriction) == 0x000020, "Wrong size on FMangoCharacterRestriction");
static_assert(offsetof(FMangoCharacterRestriction, Item_name) == 0x000000, "Member 'FMangoCharacterRestriction::Item_name' has a wrong offset!");
static_assert(offsetof(FMangoCharacterRestriction, Lookup_field) == 0x000010, "Member 'FMangoCharacterRestriction::Lookup_field' has a wrong offset!");

// ScriptStruct MangoClient.MangoItem
// 0x0050 (0x0050 - 0x0000)
struct FMangoItem final
{
public:
	class FString                                 Item_name;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Lookup_field;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Engine_asset_id;                                   // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMangoItemType                                Item_type;                                         // 0x0030(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Parts_value;                                       // 0x0034(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Equip_on_acquire;                                  // 0x0038(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMangoCharacterRestriction>     Character_restriction;                             // 0x0040(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMangoItem) == 0x000008, "Wrong alignment on FMangoItem");
static_assert(sizeof(FMangoItem) == 0x000050, "Wrong size on FMangoItem");
static_assert(offsetof(FMangoItem, Item_name) == 0x000000, "Member 'FMangoItem::Item_name' has a wrong offset!");
static_assert(offsetof(FMangoItem, Lookup_field) == 0x000010, "Member 'FMangoItem::Lookup_field' has a wrong offset!");
static_assert(offsetof(FMangoItem, Engine_asset_id) == 0x000020, "Member 'FMangoItem::Engine_asset_id' has a wrong offset!");
static_assert(offsetof(FMangoItem, Item_type) == 0x000030, "Member 'FMangoItem::Item_type' has a wrong offset!");
static_assert(offsetof(FMangoItem, Parts_value) == 0x000034, "Member 'FMangoItem::Parts_value' has a wrong offset!");
static_assert(offsetof(FMangoItem, Equip_on_acquire) == 0x000038, "Member 'FMangoItem::Equip_on_acquire' has a wrong offset!");
static_assert(offsetof(FMangoItem, Character_restriction) == 0x000040, "Member 'FMangoItem::Character_restriction' has a wrong offset!");

// ScriptStruct MangoClient.MangoItemTreasureBoxItemContainer
// 0x0020 (0x0020 - 0x0000)
struct FMangoItemTreasureBoxItemContainer final
{
public:
	class FString                                 Container_name;                                    // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMangoItem>                     Item_list;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMangoItemTreasureBoxItemContainer) == 0x000008, "Wrong alignment on FMangoItemTreasureBoxItemContainer");
static_assert(sizeof(FMangoItemTreasureBoxItemContainer) == 0x000020, "Wrong size on FMangoItemTreasureBoxItemContainer");
static_assert(offsetof(FMangoItemTreasureBoxItemContainer, Container_name) == 0x000000, "Member 'FMangoItemTreasureBoxItemContainer::Container_name' has a wrong offset!");
static_assert(offsetof(FMangoItemTreasureBoxItemContainer, Item_list) == 0x000010, "Member 'FMangoItemTreasureBoxItemContainer::Item_list' has a wrong offset!");

// ScriptStruct MangoClient.MangoItemTreasureBoxItemContainers
// 0x0028 (0x0028 - 0x0000)
struct FMangoItemTreasureBoxItemContainers final
{
public:
	int32                                         Container_weight;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMangoItemTreasureBoxItemContainer     Item_container;                                    // 0x0008(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMangoItemTreasureBoxItemContainers) == 0x000008, "Wrong alignment on FMangoItemTreasureBoxItemContainers");
static_assert(sizeof(FMangoItemTreasureBoxItemContainers) == 0x000028, "Wrong size on FMangoItemTreasureBoxItemContainers");
static_assert(offsetof(FMangoItemTreasureBoxItemContainers, Container_weight) == 0x000000, "Member 'FMangoItemTreasureBoxItemContainers::Container_weight' has a wrong offset!");
static_assert(offsetof(FMangoItemTreasureBoxItemContainers, Item_container) == 0x000008, "Member 'FMangoItemTreasureBoxItemContainers::Item_container' has a wrong offset!");

// ScriptStruct MangoClient.MangoQuestFilter
// 0x0028 (0x0028 - 0x0000)
struct FMangoQuestFilter final
{
public:
	class FName                                   Lookup_field;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Values;                                            // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMangoQuestFilter) == 0x000008, "Wrong alignment on FMangoQuestFilter");
static_assert(sizeof(FMangoQuestFilter) == 0x000028, "Wrong size on FMangoQuestFilter");
static_assert(offsetof(FMangoQuestFilter, Lookup_field) == 0x000000, "Member 'FMangoQuestFilter::Lookup_field' has a wrong offset!");
static_assert(offsetof(FMangoQuestFilter, Key) == 0x000008, "Member 'FMangoQuestFilter::Key' has a wrong offset!");
static_assert(offsetof(FMangoQuestFilter, Values) == 0x000018, "Member 'FMangoQuestFilter::Values' has a wrong offset!");

// ScriptStruct MangoClient.MangoQuest
// 0x0068 (0x0068 - 0x0000)
struct FMangoQuest final
{
public:
	class FName                                   Lookup_field;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Duration;                                          // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Goal;                                              // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Metric;                                            // 0x0040(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         blastpass_xp_reward;                               // 0x0050(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMangoQuestFilter>              Filters;                                           // 0x0058(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMangoQuest) == 0x000008, "Wrong alignment on FMangoQuest");
static_assert(sizeof(FMangoQuest) == 0x000068, "Wrong size on FMangoQuest");
static_assert(offsetof(FMangoQuest, Lookup_field) == 0x000000, "Member 'FMangoQuest::Lookup_field' has a wrong offset!");
static_assert(offsetof(FMangoQuest, Name) == 0x000008, "Member 'FMangoQuest::Name' has a wrong offset!");
static_assert(offsetof(FMangoQuest, Description) == 0x000018, "Member 'FMangoQuest::Description' has a wrong offset!");
static_assert(offsetof(FMangoQuest, Duration) == 0x000028, "Member 'FMangoQuest::Duration' has a wrong offset!");
static_assert(offsetof(FMangoQuest, Goal) == 0x000038, "Member 'FMangoQuest::Goal' has a wrong offset!");
static_assert(offsetof(FMangoQuest, Metric) == 0x000040, "Member 'FMangoQuest::Metric' has a wrong offset!");
static_assert(offsetof(FMangoQuest, blastpass_xp_reward) == 0x000050, "Member 'FMangoQuest::blastpass_xp_reward' has a wrong offset!");
static_assert(offsetof(FMangoQuest, Filters) == 0x000058, "Member 'FMangoQuest::Filters' has a wrong offset!");

// ScriptStruct MangoClient.MangoItemTreasureBoxItemSlot
// 0x0020 (0x0020 - 0x0000)
struct FMangoItemTreasureBoxItemSlot final
{
public:
	class FString                                 Table_name;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMangoItemTreasureBoxItemContainers> Item_containers;                                   // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMangoItemTreasureBoxItemSlot) == 0x000008, "Wrong alignment on FMangoItemTreasureBoxItemSlot");
static_assert(sizeof(FMangoItemTreasureBoxItemSlot) == 0x000020, "Wrong size on FMangoItemTreasureBoxItemSlot");
static_assert(offsetof(FMangoItemTreasureBoxItemSlot, Table_name) == 0x000000, "Member 'FMangoItemTreasureBoxItemSlot::Table_name' has a wrong offset!");
static_assert(offsetof(FMangoItemTreasureBoxItemSlot, Item_containers) == 0x000010, "Member 'FMangoItemTreasureBoxItemSlot::Item_containers' has a wrong offset!");

// ScriptStruct MangoClient.MangoTreasureBox
// 0x0040 (0x0040 - 0x0000)
struct FMangoTreasureBox final
{
public:
	class FString                                 box_name;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Lookup_field;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Display_engine_asset_id;                           // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMangoItemTreasureBoxItemSlot>  Item_slots;                                        // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMangoTreasureBox) == 0x000008, "Wrong alignment on FMangoTreasureBox");
static_assert(sizeof(FMangoTreasureBox) == 0x000040, "Wrong size on FMangoTreasureBox");
static_assert(offsetof(FMangoTreasureBox, box_name) == 0x000000, "Member 'FMangoTreasureBox::box_name' has a wrong offset!");
static_assert(offsetof(FMangoTreasureBox, Lookup_field) == 0x000010, "Member 'FMangoTreasureBox::Lookup_field' has a wrong offset!");
static_assert(offsetof(FMangoTreasureBox, Display_engine_asset_id) == 0x000020, "Member 'FMangoTreasureBox::Display_engine_asset_id' has a wrong offset!");
static_assert(offsetof(FMangoTreasureBox, Item_slots) == 0x000030, "Member 'FMangoTreasureBox::Item_slots' has a wrong offset!");

// ScriptStruct MangoClient.MangoQuestReward
// 0x00C8 (0x00C8 - 0x0000)
struct FMangoQuestReward final
{
public:
	class FName                                   Lookup_field;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMangoItem                             Item;                                              // 0x0008(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
	struct FMangoTreasureBox                      Treasurebox;                                       // 0x0058(0x0040)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
	int32                                         Treasurebox_quantity;                              // 0x0098(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Image_id;                                          // 0x009C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Description;                                       // 0x00A8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Xp;                                                // 0x00B8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Rocket_bucks;                                      // 0x00BC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Rocket_parts;                                      // 0x00C0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Login_cost;                                        // 0x00C4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMangoQuestReward) == 0x000008, "Wrong alignment on FMangoQuestReward");
static_assert(sizeof(FMangoQuestReward) == 0x0000C8, "Wrong size on FMangoQuestReward");
static_assert(offsetof(FMangoQuestReward, Lookup_field) == 0x000000, "Member 'FMangoQuestReward::Lookup_field' has a wrong offset!");
static_assert(offsetof(FMangoQuestReward, Item) == 0x000008, "Member 'FMangoQuestReward::Item' has a wrong offset!");
static_assert(offsetof(FMangoQuestReward, Treasurebox) == 0x000058, "Member 'FMangoQuestReward::Treasurebox' has a wrong offset!");
static_assert(offsetof(FMangoQuestReward, Treasurebox_quantity) == 0x000098, "Member 'FMangoQuestReward::Treasurebox_quantity' has a wrong offset!");
static_assert(offsetof(FMangoQuestReward, Image_id) == 0x00009C, "Member 'FMangoQuestReward::Image_id' has a wrong offset!");
static_assert(offsetof(FMangoQuestReward, Description) == 0x0000A8, "Member 'FMangoQuestReward::Description' has a wrong offset!");
static_assert(offsetof(FMangoQuestReward, Xp) == 0x0000B8, "Member 'FMangoQuestReward::Xp' has a wrong offset!");
static_assert(offsetof(FMangoQuestReward, Rocket_bucks) == 0x0000BC, "Member 'FMangoQuestReward::Rocket_bucks' has a wrong offset!");
static_assert(offsetof(FMangoQuestReward, Rocket_parts) == 0x0000C0, "Member 'FMangoQuestReward::Rocket_parts' has a wrong offset!");
static_assert(offsetof(FMangoQuestReward, Login_cost) == 0x0000C4, "Member 'FMangoQuestReward::Login_cost' has a wrong offset!");

// ScriptStruct MangoClient.MangoLoginReward
// 0x00D8 (0x00D8 - 0x0000)
struct FMangoLoginReward final
{
public:
	class FName                                   Lookup_field;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Active;                                            // 0x0008(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMangoQuestReward                      Reward;                                            // 0x0010(0x00C8)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMangoLoginReward) == 0x000008, "Wrong alignment on FMangoLoginReward");
static_assert(sizeof(FMangoLoginReward) == 0x0000D8, "Wrong size on FMangoLoginReward");
static_assert(offsetof(FMangoLoginReward, Lookup_field) == 0x000000, "Member 'FMangoLoginReward::Lookup_field' has a wrong offset!");
static_assert(offsetof(FMangoLoginReward, Active) == 0x000008, "Member 'FMangoLoginReward::Active' has a wrong offset!");
static_assert(offsetof(FMangoLoginReward, Reward) == 0x000010, "Member 'FMangoLoginReward::Reward' has a wrong offset!");

// ScriptStruct MangoClient.MangoGetQuestDocResponse
// 0x0030 (0x0030 - 0x0000)
struct FMangoGetQuestDocResponse final
{
public:
	TArray<struct FMangoQuest>                    Quests;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FMangoQuestReward>              Rewards;                                           // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FMangoLoginReward>              Loginrewards;                                      // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMangoGetQuestDocResponse) == 0x000008, "Wrong alignment on FMangoGetQuestDocResponse");
static_assert(sizeof(FMangoGetQuestDocResponse) == 0x000030, "Wrong size on FMangoGetQuestDocResponse");
static_assert(offsetof(FMangoGetQuestDocResponse, Quests) == 0x000000, "Member 'FMangoGetQuestDocResponse::Quests' has a wrong offset!");
static_assert(offsetof(FMangoGetQuestDocResponse, Rewards) == 0x000010, "Member 'FMangoGetQuestDocResponse::Rewards' has a wrong offset!");
static_assert(offsetof(FMangoGetQuestDocResponse, Loginrewards) == 0x000020, "Member 'FMangoGetQuestDocResponse::Loginrewards' has a wrong offset!");

// ScriptStruct MangoClient.MatchEndArtifact
// 0x0020 (0x0020 - 0x0000)
struct FMatchEndArtifact final
{
public:
	class FString                                 ArtifactType;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ArtifactId;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMatchEndArtifact) == 0x000008, "Wrong alignment on FMatchEndArtifact");
static_assert(sizeof(FMatchEndArtifact) == 0x000020, "Wrong size on FMatchEndArtifact");
static_assert(offsetof(FMatchEndArtifact, ArtifactType) == 0x000000, "Member 'FMatchEndArtifact::ArtifactType' has a wrong offset!");
static_assert(offsetof(FMatchEndArtifact, ArtifactId) == 0x000010, "Member 'FMatchEndArtifact::ArtifactId' has a wrong offset!");

// ScriptStruct MangoClient.MatchEndPlayer
// 0x00E8 (0x00E8 - 0x0000)
struct FMatchEndPlayer final
{
public:
	class FString                                 MangoId;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PlatformId;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSharingUsageData;                               // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSharingExternalUsageData;                       // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsUnderage;                                       // 0x0022(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PartyId;                                           // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Platform;                                          // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, int32>                      Stats;                                             // 0x0040(0x0050)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 PlayerName;                                        // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CharacterId;                                       // 0x00A0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CharacterLevelStart;                               // 0x00B0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CharacterLevelEnd;                                 // 0x00B4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SkinId;                                            // 0x00B8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMatchEndArtifact>              EquippedArtifacts;                                 // 0x00C8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         TeamIndex;                                         // 0x00D8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMarinerGameOutcome                           GameOutcome;                                       // 0x00DC(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RejoinCount;                                       // 0x00E0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsABot;                                           // 0x00E4(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMatchEndPlayer) == 0x000008, "Wrong alignment on FMatchEndPlayer");
static_assert(sizeof(FMatchEndPlayer) == 0x0000E8, "Wrong size on FMatchEndPlayer");
static_assert(offsetof(FMatchEndPlayer, MangoId) == 0x000000, "Member 'FMatchEndPlayer::MangoId' has a wrong offset!");
static_assert(offsetof(FMatchEndPlayer, PlatformId) == 0x000010, "Member 'FMatchEndPlayer::PlatformId' has a wrong offset!");
static_assert(offsetof(FMatchEndPlayer, bIsSharingUsageData) == 0x000020, "Member 'FMatchEndPlayer::bIsSharingUsageData' has a wrong offset!");
static_assert(offsetof(FMatchEndPlayer, bIsSharingExternalUsageData) == 0x000021, "Member 'FMatchEndPlayer::bIsSharingExternalUsageData' has a wrong offset!");
static_assert(offsetof(FMatchEndPlayer, bIsUnderage) == 0x000022, "Member 'FMatchEndPlayer::bIsUnderage' has a wrong offset!");
static_assert(offsetof(FMatchEndPlayer, PartyId) == 0x000028, "Member 'FMatchEndPlayer::PartyId' has a wrong offset!");
static_assert(offsetof(FMatchEndPlayer, Platform) == 0x000038, "Member 'FMatchEndPlayer::Platform' has a wrong offset!");
static_assert(offsetof(FMatchEndPlayer, Stats) == 0x000040, "Member 'FMatchEndPlayer::Stats' has a wrong offset!");
static_assert(offsetof(FMatchEndPlayer, PlayerName) == 0x000090, "Member 'FMatchEndPlayer::PlayerName' has a wrong offset!");
static_assert(offsetof(FMatchEndPlayer, CharacterId) == 0x0000A0, "Member 'FMatchEndPlayer::CharacterId' has a wrong offset!");
static_assert(offsetof(FMatchEndPlayer, CharacterLevelStart) == 0x0000B0, "Member 'FMatchEndPlayer::CharacterLevelStart' has a wrong offset!");
static_assert(offsetof(FMatchEndPlayer, CharacterLevelEnd) == 0x0000B4, "Member 'FMatchEndPlayer::CharacterLevelEnd' has a wrong offset!");
static_assert(offsetof(FMatchEndPlayer, SkinId) == 0x0000B8, "Member 'FMatchEndPlayer::SkinId' has a wrong offset!");
static_assert(offsetof(FMatchEndPlayer, EquippedArtifacts) == 0x0000C8, "Member 'FMatchEndPlayer::EquippedArtifacts' has a wrong offset!");
static_assert(offsetof(FMatchEndPlayer, TeamIndex) == 0x0000D8, "Member 'FMatchEndPlayer::TeamIndex' has a wrong offset!");
static_assert(offsetof(FMatchEndPlayer, GameOutcome) == 0x0000DC, "Member 'FMatchEndPlayer::GameOutcome' has a wrong offset!");
static_assert(offsetof(FMatchEndPlayer, RejoinCount) == 0x0000E0, "Member 'FMatchEndPlayer::RejoinCount' has a wrong offset!");
static_assert(offsetof(FMatchEndPlayer, bIsABot) == 0x0000E4, "Member 'FMatchEndPlayer::bIsABot' has a wrong offset!");

// ScriptStruct MangoClient.MatchEnd
// 0x0068 (0x0068 - 0x0000)
struct FMatchEnd final
{
public:
	struct FGuid                                  MatchID;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  PlaylistUniqueId;                                  // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMatchEndPlayer>                Players;                                           // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FMatchEndTeam>                  Teams;                                             // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         MatchTime;                                         // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  Map;                                               // 0x0044(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  Mode;                                              // 0x0054(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMatchmadeSession;                               // 0x0064(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRankedSession;                                  // 0x0065(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMatchEnd) == 0x000008, "Wrong alignment on FMatchEnd");
static_assert(sizeof(FMatchEnd) == 0x000068, "Wrong size on FMatchEnd");
static_assert(offsetof(FMatchEnd, MatchID) == 0x000000, "Member 'FMatchEnd::MatchID' has a wrong offset!");
static_assert(offsetof(FMatchEnd, PlaylistUniqueId) == 0x000010, "Member 'FMatchEnd::PlaylistUniqueId' has a wrong offset!");
static_assert(offsetof(FMatchEnd, Players) == 0x000020, "Member 'FMatchEnd::Players' has a wrong offset!");
static_assert(offsetof(FMatchEnd, Teams) == 0x000030, "Member 'FMatchEnd::Teams' has a wrong offset!");
static_assert(offsetof(FMatchEnd, MatchTime) == 0x000040, "Member 'FMatchEnd::MatchTime' has a wrong offset!");
static_assert(offsetof(FMatchEnd, Map) == 0x000044, "Member 'FMatchEnd::Map' has a wrong offset!");
static_assert(offsetof(FMatchEnd, Mode) == 0x000054, "Member 'FMatchEnd::Mode' has a wrong offset!");
static_assert(offsetof(FMatchEnd, bIsMatchmadeSession) == 0x000064, "Member 'FMatchEnd::bIsMatchmadeSession' has a wrong offset!");
static_assert(offsetof(FMatchEnd, bIsRankedSession) == 0x000065, "Member 'FMatchEnd::bIsRankedSession' has a wrong offset!");

// ScriptStruct MangoClient.MangoBotLevelPvP
// 0x0008 (0x0008 - 0x0000)
struct FMangoBotLevelPvP final
{
public:
	int32                                         bot_level;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Skill_min;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMangoBotLevelPvP) == 0x000004, "Wrong alignment on FMangoBotLevelPvP");
static_assert(sizeof(FMangoBotLevelPvP) == 0x000008, "Wrong size on FMangoBotLevelPvP");
static_assert(offsetof(FMangoBotLevelPvP, bot_level) == 0x000000, "Member 'FMangoBotLevelPvP::bot_level' has a wrong offset!");
static_assert(offsetof(FMangoBotLevelPvP, Skill_min) == 0x000004, "Member 'FMangoBotLevelPvP::Skill_min' has a wrong offset!");

// ScriptStruct MangoClient.MangoBlastPassSeason
// 0x0058 (0x0058 - 0x0000)
struct FMangoBlastPassSeason final
{
public:
	class FString                                 Lookup_field;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Offer_id;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
	int32                                         Season_num;                                        // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              Start_date;                                        // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              End_date;                                          // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x0038(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
	class FName                                   Splash_texture;                                    // 0x0050(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMangoBlastPassSeason) == 0x000008, "Wrong alignment on FMangoBlastPassSeason");
static_assert(sizeof(FMangoBlastPassSeason) == 0x000058, "Wrong size on FMangoBlastPassSeason");
static_assert(offsetof(FMangoBlastPassSeason, Lookup_field) == 0x000000, "Member 'FMangoBlastPassSeason::Lookup_field' has a wrong offset!");
static_assert(offsetof(FMangoBlastPassSeason, Offer_id) == 0x000010, "Member 'FMangoBlastPassSeason::Offer_id' has a wrong offset!");
static_assert(offsetof(FMangoBlastPassSeason, Season_num) == 0x000020, "Member 'FMangoBlastPassSeason::Season_num' has a wrong offset!");
static_assert(offsetof(FMangoBlastPassSeason, Start_date) == 0x000028, "Member 'FMangoBlastPassSeason::Start_date' has a wrong offset!");
static_assert(offsetof(FMangoBlastPassSeason, End_date) == 0x000030, "Member 'FMangoBlastPassSeason::End_date' has a wrong offset!");
static_assert(offsetof(FMangoBlastPassSeason, Description) == 0x000038, "Member 'FMangoBlastPassSeason::Description' has a wrong offset!");
static_assert(offsetof(FMangoBlastPassSeason, Splash_texture) == 0x000050, "Member 'FMangoBlastPassSeason::Splash_texture' has a wrong offset!");

// ScriptStruct MangoClient.MangoBlastPassTier
// 0x0030 (0x0030 - 0x0000)
struct FMangoBlastPassTier final
{
public:
	class FString                                 Lookup_field;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 blast_pass_lookup_field;                           // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Tier_number;                                       // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Xp_val;                                            // 0x0024(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Rocket_fuel_cost;                                  // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMangoBlastPassTier) == 0x000008, "Wrong alignment on FMangoBlastPassTier");
static_assert(sizeof(FMangoBlastPassTier) == 0x000030, "Wrong size on FMangoBlastPassTier");
static_assert(offsetof(FMangoBlastPassTier, Lookup_field) == 0x000000, "Member 'FMangoBlastPassTier::Lookup_field' has a wrong offset!");
static_assert(offsetof(FMangoBlastPassTier, blast_pass_lookup_field) == 0x000010, "Member 'FMangoBlastPassTier::blast_pass_lookup_field' has a wrong offset!");
static_assert(offsetof(FMangoBlastPassTier, Tier_number) == 0x000020, "Member 'FMangoBlastPassTier::Tier_number' has a wrong offset!");
static_assert(offsetof(FMangoBlastPassTier, Xp_val) == 0x000024, "Member 'FMangoBlastPassTier::Xp_val' has a wrong offset!");
static_assert(offsetof(FMangoBlastPassTier, Rocket_fuel_cost) == 0x000028, "Member 'FMangoBlastPassTier::Rocket_fuel_cost' has a wrong offset!");

// ScriptStruct MangoClient.MangoBlastPassXPBonus
// 0x0008 (0x0008 - 0x0000)
struct FMangoBlastPassXPBonus final
{
public:
	int32                                         Pct_bonus;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMangoBlastPassXPBonusType                    bonus_type;                                        // 0x0004(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMangoBlastPassXPBonus) == 0x000004, "Wrong alignment on FMangoBlastPassXPBonus");
static_assert(sizeof(FMangoBlastPassXPBonus) == 0x000008, "Wrong size on FMangoBlastPassXPBonus");
static_assert(offsetof(FMangoBlastPassXPBonus, Pct_bonus) == 0x000000, "Member 'FMangoBlastPassXPBonus::Pct_bonus' has a wrong offset!");
static_assert(offsetof(FMangoBlastPassXPBonus, bonus_type) == 0x000004, "Member 'FMangoBlastPassXPBonus::bonus_type' has a wrong offset!");

// ScriptStruct MangoClient.MangoBlastPassReward
// 0x00A8 (0x00A8 - 0x0000)
struct FMangoBlastPassReward final
{
public:
	class FString                                 Lookup_field;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMangoBlastPassTier                    blast_pass_tier;                                   // 0x0010(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
	struct FMangoItem                             Item_reward;                                       // 0x0040(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
	struct FMangoBlastPassXPBonus                 Xp_bonus_reward;                                   // 0x0090(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         Rocket_fuel_reward;                                // 0x0098(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Rocket_part_reward;                                // 0x009C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Is_free_tier;                                      // 0x00A0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMangoBlastPassReward) == 0x000008, "Wrong alignment on FMangoBlastPassReward");
static_assert(sizeof(FMangoBlastPassReward) == 0x0000A8, "Wrong size on FMangoBlastPassReward");
static_assert(offsetof(FMangoBlastPassReward, Lookup_field) == 0x000000, "Member 'FMangoBlastPassReward::Lookup_field' has a wrong offset!");
static_assert(offsetof(FMangoBlastPassReward, blast_pass_tier) == 0x000010, "Member 'FMangoBlastPassReward::blast_pass_tier' has a wrong offset!");
static_assert(offsetof(FMangoBlastPassReward, Item_reward) == 0x000040, "Member 'FMangoBlastPassReward::Item_reward' has a wrong offset!");
static_assert(offsetof(FMangoBlastPassReward, Xp_bonus_reward) == 0x000090, "Member 'FMangoBlastPassReward::Xp_bonus_reward' has a wrong offset!");
static_assert(offsetof(FMangoBlastPassReward, Rocket_fuel_reward) == 0x000098, "Member 'FMangoBlastPassReward::Rocket_fuel_reward' has a wrong offset!");
static_assert(offsetof(FMangoBlastPassReward, Rocket_part_reward) == 0x00009C, "Member 'FMangoBlastPassReward::Rocket_part_reward' has a wrong offset!");
static_assert(offsetof(FMangoBlastPassReward, Is_free_tier) == 0x0000A0, "Member 'FMangoBlastPassReward::Is_free_tier' has a wrong offset!");

// ScriptStruct MangoClient.MangoBlastPassTierDefinition
// 0x0040 (0x0040 - 0x0000)
struct FMangoBlastPassTierDefinition final
{
public:
	struct FMangoBlastPassTier                    Tier;                                              // 0x0000(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FMangoBlastPassReward>          Rewards;                                           // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMangoBlastPassTierDefinition) == 0x000008, "Wrong alignment on FMangoBlastPassTierDefinition");
static_assert(sizeof(FMangoBlastPassTierDefinition) == 0x000040, "Wrong size on FMangoBlastPassTierDefinition");
static_assert(offsetof(FMangoBlastPassTierDefinition, Tier) == 0x000000, "Member 'FMangoBlastPassTierDefinition::Tier' has a wrong offset!");
static_assert(offsetof(FMangoBlastPassTierDefinition, Rewards) == 0x000030, "Member 'FMangoBlastPassTierDefinition::Rewards' has a wrong offset!");

// ScriptStruct MangoClient.MangoBlastPassDefinition
// 0x0068 (0x0068 - 0x0000)
struct FMangoBlastPassDefinition final
{
public:
	struct FMangoBlastPassSeason                  Season;                                            // 0x0000(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FMangoBlastPassTierDefinition>  Tiers;                                             // 0x0058(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMangoBlastPassDefinition) == 0x000008, "Wrong alignment on FMangoBlastPassDefinition");
static_assert(sizeof(FMangoBlastPassDefinition) == 0x000068, "Wrong size on FMangoBlastPassDefinition");
static_assert(offsetof(FMangoBlastPassDefinition, Season) == 0x000000, "Member 'FMangoBlastPassDefinition::Season' has a wrong offset!");
static_assert(offsetof(FMangoBlastPassDefinition, Tiers) == 0x000058, "Member 'FMangoBlastPassDefinition::Tiers' has a wrong offset!");

// ScriptStruct MangoClient.MangoProgressionCharacterSpecificReward
// 0x0030 (0x0030 - 0x0000)
struct FMangoProgressionCharacterSpecificReward final
{
public:
	class FString                                 Lookup_field;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Character;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMangoItem>                     Direct_items;                                      // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMangoProgressionCharacterSpecificReward) == 0x000008, "Wrong alignment on FMangoProgressionCharacterSpecificReward");
static_assert(sizeof(FMangoProgressionCharacterSpecificReward) == 0x000030, "Wrong size on FMangoProgressionCharacterSpecificReward");
static_assert(offsetof(FMangoProgressionCharacterSpecificReward, Lookup_field) == 0x000000, "Member 'FMangoProgressionCharacterSpecificReward::Lookup_field' has a wrong offset!");
static_assert(offsetof(FMangoProgressionCharacterSpecificReward, Character) == 0x000010, "Member 'FMangoProgressionCharacterSpecificReward::Character' has a wrong offset!");
static_assert(offsetof(FMangoProgressionCharacterSpecificReward, Direct_items) == 0x000020, "Member 'FMangoProgressionCharacterSpecificReward::Direct_items' has a wrong offset!");

// ScriptStruct MangoClient.MangoProgressionLevelReward
// 0x0030 (0x0030 - 0x0000)
struct FMangoProgressionLevelReward final
{
public:
	class FString                                 Lookup_field;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Treasure_box_set_description;                      // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMangoProgressionCharacterSpecificReward> Members;                                           // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMangoProgressionLevelReward) == 0x000008, "Wrong alignment on FMangoProgressionLevelReward");
static_assert(sizeof(FMangoProgressionLevelReward) == 0x000030, "Wrong size on FMangoProgressionLevelReward");
static_assert(offsetof(FMangoProgressionLevelReward, Lookup_field) == 0x000000, "Member 'FMangoProgressionLevelReward::Lookup_field' has a wrong offset!");
static_assert(offsetof(FMangoProgressionLevelReward, Treasure_box_set_description) == 0x000010, "Member 'FMangoProgressionLevelReward::Treasure_box_set_description' has a wrong offset!");
static_assert(offsetof(FMangoProgressionLevelReward, Members) == 0x000020, "Member 'FMangoProgressionLevelReward::Members' has a wrong offset!");

// ScriptStruct MangoClient.MangoProgressionCharacterLevel
// 0x0058 (0x0058 - 0x0000)
struct FMangoProgressionCharacterLevel final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Xp_start;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Xp_end;                                            // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMangoProgressionLevelReward           Treasure_box_award;                                // 0x0010(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
	int32                                         Rocket_parts;                                      // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Rocket_fuel;                                       // 0x0044(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Lookup_field;                                      // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMangoProgressionCharacterLevel) == 0x000008, "Wrong alignment on FMangoProgressionCharacterLevel");
