#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MapSummary

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "MangoClient_structs.hpp"


namespace SDK::Params
{

// Function MapSummary.MapSummary_C.ExecuteUbergraph_MapSummary
// 0x0004 (0x0004 - 0x0000)
struct MapSummary_C_ExecuteUbergraph_MapSummary final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MapSummary_C_ExecuteUbergraph_MapSummary) == 0x000004, "Wrong alignment on MapSummary_C_ExecuteUbergraph_MapSummary");
static_assert(sizeof(MapSummary_C_ExecuteUbergraph_MapSummary) == 0x000004, "Wrong size on MapSummary_C_ExecuteUbergraph_MapSummary");
static_assert(offsetof(MapSummary_C_ExecuteUbergraph_MapSummary, EntryPoint) == 0x000000, "Member 'MapSummary_C_ExecuteUbergraph_MapSummary::EntryPoint' has a wrong offset!");

// Function MapSummary.MapSummary_C.GetMapText
// 0x0088 (0x0088 - 0x0000)
struct MapSummary_C_GetMapText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class UMarinerMapGlobals*                     CallFunc_GetMapGlobals_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryAndGetMangoMapFromCurrentMap_bIsValid; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F6B[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMangoMap                              CallFunc_TryAndGetMangoMapFromCurrentMap_ReturnValue; // 0x0028(0x0060)(ConstParm)
};
static_assert(alignof(MapSummary_C_GetMapText) == 0x000008, "Wrong alignment on MapSummary_C_GetMapText");
static_assert(sizeof(MapSummary_C_GetMapText) == 0x000088, "Wrong size on MapSummary_C_GetMapText");
static_assert(offsetof(MapSummary_C_GetMapText, ReturnValue) == 0x000000, "Member 'MapSummary_C_GetMapText::ReturnValue' has a wrong offset!");
static_assert(offsetof(MapSummary_C_GetMapText, CallFunc_GetMapGlobals_ReturnValue) == 0x000018, "Member 'MapSummary_C_GetMapText::CallFunc_GetMapGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapSummary_C_GetMapText, CallFunc_TryAndGetMangoMapFromCurrentMap_bIsValid) == 0x000020, "Member 'MapSummary_C_GetMapText::CallFunc_TryAndGetMangoMapFromCurrentMap_bIsValid' has a wrong offset!");
static_assert(offsetof(MapSummary_C_GetMapText, CallFunc_TryAndGetMangoMapFromCurrentMap_ReturnValue) == 0x000028, "Member 'MapSummary_C_GetMapText::CallFunc_TryAndGetMangoMapFromCurrentMap_ReturnValue' has a wrong offset!");

// Function MapSummary.MapSummary_C.GetGameModeText
// 0x00B8 (0x00B8 - 0x0000)
struct MapSummary_C_GetGameModeText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F6C[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0018)()
	class UMarinerModeGlobals*                    CallFunc_GetModeGlobals_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryAndGetMangoModeFromCurrentMode_bIsValid; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F6D[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMangoMode                             CallFunc_TryAndGetMangoModeFromCurrentMode_ReturnValue; // 0x0048(0x0058)(ConstParm)
	class FText                                   K2Node_Select_Default;                             // 0x00A0(0x0018)()
};
static_assert(alignof(MapSummary_C_GetGameModeText) == 0x000008, "Wrong alignment on MapSummary_C_GetGameModeText");
static_assert(sizeof(MapSummary_C_GetGameModeText) == 0x0000B8, "Wrong size on MapSummary_C_GetGameModeText");
static_assert(offsetof(MapSummary_C_GetGameModeText, ReturnValue) == 0x000000, "Member 'MapSummary_C_GetGameModeText::ReturnValue' has a wrong offset!");
static_assert(offsetof(MapSummary_C_GetGameModeText, Temp_bool_Variable) == 0x000018, "Member 'MapSummary_C_GetGameModeText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MapSummary_C_GetGameModeText, Temp_text_Variable) == 0x000020, "Member 'MapSummary_C_GetGameModeText::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(MapSummary_C_GetGameModeText, CallFunc_GetModeGlobals_ReturnValue) == 0x000038, "Member 'MapSummary_C_GetGameModeText::CallFunc_GetModeGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapSummary_C_GetGameModeText, CallFunc_TryAndGetMangoModeFromCurrentMode_bIsValid) == 0x000040, "Member 'MapSummary_C_GetGameModeText::CallFunc_TryAndGetMangoModeFromCurrentMode_bIsValid' has a wrong offset!");
static_assert(offsetof(MapSummary_C_GetGameModeText, CallFunc_TryAndGetMangoModeFromCurrentMode_ReturnValue) == 0x000048, "Member 'MapSummary_C_GetGameModeText::CallFunc_TryAndGetMangoModeFromCurrentMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapSummary_C_GetGameModeText, K2Node_Select_Default) == 0x0000A0, "Member 'MapSummary_C_GetGameModeText::K2Node_Select_Default' has a wrong offset!");

// Function MapSummary.MapSummary_C.Initialize
// 0x00B8 (0x00B8 - 0x0000)
struct MapSummary_C_Initialize final
{
public:
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0000(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0010(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMarinerBasePlayerController*           CallFunc_TryAndGetLocalPlayerController_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F6E[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameInstance*                   K2Node_DynamicCast_AsMariner_Game_Instance;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F6F[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue_1;        // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UMarinerVoiceOverManager*               CallFunc_GetVoiceOverManager_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameModeText_ReturnValue;              // 0x0080(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetMapText_ReturnValue;                   // 0x00A0(0x0018)()
};
static_assert(alignof(MapSummary_C_Initialize) == 0x000008, "Wrong alignment on MapSummary_C_Initialize");
static_assert(sizeof(MapSummary_C_Initialize) == 0x0000B8, "Wrong size on MapSummary_C_Initialize");
static_assert(offsetof(MapSummary_C_Initialize, Temp_struct_Variable) == 0x000000, "Member 'MapSummary_C_Initialize::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(MapSummary_C_Initialize, Temp_delegate_Variable) == 0x000010, "Member 'MapSummary_C_Initialize::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(MapSummary_C_Initialize, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000020, "Member 'MapSummary_C_Initialize::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapSummary_C_Initialize, CallFunc_TryAndGetLocalPlayerController_ReturnValue) == 0x000030, "Member 'MapSummary_C_Initialize::CallFunc_TryAndGetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapSummary_C_Initialize, CallFunc_PostEvent_ReturnValue) == 0x000038, "Member 'MapSummary_C_Initialize::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapSummary_C_Initialize, CallFunc_Conv_StringToName_ReturnValue) == 0x00003C, "Member 'MapSummary_C_Initialize::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapSummary_C_Initialize, CallFunc_GetGameInstance_ReturnValue) == 0x000048, "Member 'MapSummary_C_Initialize::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapSummary_C_Initialize, K2Node_DynamicCast_AsMariner_Game_Instance) == 0x000050, "Member 'MapSummary_C_Initialize::K2Node_DynamicCast_AsMariner_Game_Instance' has a wrong offset!");
static_assert(offsetof(MapSummary_C_Initialize, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'MapSummary_C_Initialize::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MapSummary_C_Initialize, CallFunc_GetCurrentLevelName_ReturnValue_1) == 0x000060, "Member 'MapSummary_C_Initialize::CallFunc_GetCurrentLevelName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MapSummary_C_Initialize, CallFunc_GetVoiceOverManager_ReturnValue) == 0x000070, "Member 'MapSummary_C_Initialize::CallFunc_GetVoiceOverManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapSummary_C_Initialize, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000078, "Member 'MapSummary_C_Initialize::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MapSummary_C_Initialize, CallFunc_GetGameModeText_ReturnValue) == 0x000080, "Member 'MapSummary_C_Initialize::CallFunc_GetGameModeText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapSummary_C_Initialize, CallFunc_PlayAnimation_ReturnValue) == 0x000098, "Member 'MapSummary_C_Initialize::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapSummary_C_Initialize, CallFunc_GetMapText_ReturnValue) == 0x0000A0, "Member 'MapSummary_C_Initialize::CallFunc_GetMapText_ReturnValue' has a wrong offset!");

}

