#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MapSelectButton

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MapSelectButton.MapSelectButton_C
// 0x0038 (0x3000 - 0x2FC8)
class UMapSelectButton_C final : public UMarinerMapSelectButton
{
public:
	class UWidgetAnimation*                       HoveredAnim;                                       // 0x2FC8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Border;                                            // 0x2FD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Bound_MapName;                                     // 0x2FD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                HitArea;                                           // 0x2FE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x2FE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MapImage;                                          // 0x2FF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Material;                                          // 0x2FF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FMarinerLayeredButtonAssets GetAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MapSelectButton_C">();
	}
	static class UMapSelectButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMapSelectButton_C>();
	}
};
static_assert(alignof(UMapSelectButton_C) == 0x000008, "Wrong alignment on UMapSelectButton_C");
static_assert(sizeof(UMapSelectButton_C) == 0x003000, "Wrong size on UMapSelectButton_C");
static_assert(offsetof(UMapSelectButton_C, HoveredAnim) == 0x002FC8, "Member 'UMapSelectButton_C::HoveredAnim' has a wrong offset!");
static_assert(offsetof(UMapSelectButton_C, Border) == 0x002FD0, "Member 'UMapSelectButton_C::Border' has a wrong offset!");
static_assert(offsetof(UMapSelectButton_C, Bound_MapName) == 0x002FD8, "Member 'UMapSelectButton_C::Bound_MapName' has a wrong offset!");
static_assert(offsetof(UMapSelectButton_C, HitArea) == 0x002FE0, "Member 'UMapSelectButton_C::HitArea' has a wrong offset!");
static_assert(offsetof(UMapSelectButton_C, Image_0) == 0x002FE8, "Member 'UMapSelectButton_C::Image_0' has a wrong offset!");
static_assert(offsetof(UMapSelectButton_C, MapImage) == 0x002FF0, "Member 'UMapSelectButton_C::MapImage' has a wrong offset!");
static_assert(offsetof(UMapSelectButton_C, Material) == 0x002FF8, "Member 'UMapSelectButton_C::Material' has a wrong offset!");

}

