#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mariner

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Mariner_structs.hpp"
#include "SlateCore_structs.hpp"
#include "MangoClient_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Slate_structs.hpp"
#include "Slate_classes.hpp"
#include "GenericGraphRuntime_classes.hpp"
#include "Gauntlet_classes.hpp"
#include "NavigationSystem_classes.hpp"
#include "InputCore_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// Class Mariner.MarinerMainMenuGameState
// 0x0000 (0x0258 - 0x0258)
class AMarinerMainMenuGameState final : public AGameStateBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MarinerMainMenuGameState">();
	}
	static class AMarinerMainMenuGameState* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMarinerMainMenuGameState>();
	}
};
static_assert(alignof(AMarinerMainMenuGameState) == 0x000008, "Wrong alignment on AMarinerMainMenuGameState");
static_assert(sizeof(AMarinerMainMenuGameState) == 0x000258, "Wrong size on AMarinerMainMenuGameState");

// Class Mariner.MangoBaseManager
// 0x0018 (0x0040 - 0x0028)
class UMangoBaseManager : public UObject
{
public:
	TWeakObjectPtr<class UMarinerGameInstance>    OwningMarinerGameInstance;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_140E[0x10];                                    // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MangoBaseManager">();
	}
	static class UMangoBaseManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMangoBaseManager>();
	}
};
static_assert(alignof(UMangoBaseManager) == 0x000008, "Wrong alignment on UMangoBaseManager");
static_assert(sizeof(UMangoBaseManager) == 0x000040, "Wrong size on UMangoBaseManager");
static_assert(offsetof(UMangoBaseManager, OwningMarinerGameInstance) == 0x000028, "Member 'UMangoBaseManager::OwningMarinerGameInstance' has a wrong offset!");

// Class Mariner.MangoPlayerManager
// 0x0748 (0x0788 - 0x0040)
class UMangoPlayerManager final : public UMangoBaseManager
{
public:
	UMulticastInlineDelegateProperty_             OnOnboardingActiveStateChanged;                    // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_140F[0x18];                                    // 0x0050(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastInlineDelegateProperty_             MangoProfileUpdated;                               // 0x0068(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_             MangoProfileUpdateFailed;                          // 0x0078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_             OnMangoProfileDeleted;                             // 0x0088(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_1410[0x6F0];                                   // 0x0098(0x06F0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UMangoPlayerManager* Get(const class UObject* WorldContextObject);

	void DeleteProfile();
	void SetActiveBlastPassSplashViewed();
	void SetLocalProfileAdvertStateActive(bool bActive);
	bool SetNewsViewed(const struct FGuid& NewsCmsId);

	const class FString GetActiveAccountName() const;
	bool GetActiveBlastPassProgression(struct FMangoBlastPassProgression* OutProgression) const;
	bool GetAllEquippedEmotesByType(const TSoftClassPtr<class UClass> CharacterClass, const struct FMangoProfile& Profile, EMangoItemType ItemType, TArray<struct FMangoItem>* OutItems) const;
	bool GetBlastPassProgression(const struct FMangoBlastPassDefinition& Definition, struct FMangoBlastPassProgression* OutProgression) const;
	bool GetCharacterProgressionForLocalProfile(const TSoftClassPtr<class UClass> CharacterClass, struct FMangoCharacterProgression* OutProgression) const;
	bool GetCharacterProgressionForProfile(const TSoftClassPtr<class UClass> CharacterClass, const struct FMangoProfile& Profile, struct FMangoCharacterProgression* OutProgression) const;
	const class FText GetCMSNameForSkinCollection(TSoftObjectPtr<class UMarinerSkinCollectionDataAsset> SkinCollection) const;
	bool GetEquippedCharacterItemForLocalProfile(const TSoftClassPtr<class UClass> CharacterClass, EMangoItemType ItemType, bool bRanked, struct FMangoItem* OutItem) const;
	bool GetEquippedCharacterItemForProfile(const TSoftClassPtr<class UClass> CharacterClass, const struct FMangoProfile& Profile, EMangoItemType ItemType, bool bRanked, struct FMangoItem* OutItem) const;
	bool GetEquippedProfileItem(const struct FMangoProfile& Profile, EMangoItemType ItemType, struct FMangoItem* OutItem) const;
	bool GetEquippedProfileItemForLocalProfile(EMangoItemType ItemType, struct FMangoItem* OutItem) const;
	TSoftObjectPtr<class UMarinerSkinCollectionDataAsset> GetEquippedSkinForLocalProfile(const TSoftClassPtr<class UClass> CharacterClass) const;
	TSoftObjectPtr<class UMarinerSkinCollectionDataAsset> GetEquippedSkinForProfile(const struct FMangoProfile& InProfile, const TSoftClassPtr<class UClass> CharacterClass) const;
	int32 GetItemCurrentLevel(const struct FMangoItem& InItem) const;
	int32 GetItemCurrentLevelForProfile(const struct FMangoItem& OutItem, const struct FMangoProfile& Profile) const;
	float GetItemCurrentProgress(const struct FMangoItem& InItem) const;
	const class FString GetLinkedOriginAccountName() const;
	int32 GetLocalProfileOnboardingState() const;
	bool GetLocalProfilePlaylistRank(const struct FGuid& InPlaylistId, struct FPlaylistRank* OutPlaylistRank) const;
	const struct FMangoId GetMangoId() const;
	const struct FMangoProfile GetMangoProfile() const;
	bool GetMangoProfileLastMatch(struct FMatchEnd* OutMatchEnd) const;
	void GetNewsViewed(TArray<struct FGuid>* OutNewsIds) const;
	bool IsActiveBlastPassAtMaxTier() const;
	bool IsActiveBlastPassSplashViewed() const;
	bool IsLocalProfileAdvertStateActive() const;
	bool IsLocalProfileOnboardingActive() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MangoPlayerManager">();
	}
	static class UMangoPlayerManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMangoPlayerManager>();
	}
};
static_assert(alignof(UMangoPlayerManager) == 0x000008, "Wrong alignment on UMangoPlayerManager");
static_assert(sizeof(UMangoPlayerManager) == 0x000788, "Wrong size on UMangoPlayerManager");
static_assert(offsetof(UMangoPlayerManager, OnOnboardingActiveStateChanged) == 0x000040, "Member 'UMangoPlayerManager::OnOnboardingActiveStateChanged' has a wrong offset!");
static_assert(offsetof(UMangoPlayerManager, MangoProfileUpdated) == 0x000068, "Member 'UMangoPlayerManager::MangoProfileUpdated' has a wrong offset!");
static_assert(offsetof(UMangoPlayerManager, MangoProfileUpdateFailed) == 0x000078, "Member 'UMangoPlayerManager::MangoProfileUpdateFailed' has a wrong offset!");
static_assert(offsetof(UMangoPlayerManager, OnMangoProfileDeleted) == 0x000088, "Member 'UMangoPlayerManager::OnMangoProfileDeleted' has a wrong offset!");

// Class Mariner.BTDecorator_ItemSpawnerHasItem
// 0x0028 (0x0090 - 0x0068)
class UBTDecorator_ItemSpawnerHasItem final : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                 ItemSpawnerKey;                                    // 0x0068(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BTDecorator_ItemSpawnerHasItem">();
	}
	static class UBTDecorator_ItemSpawnerHasItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTDecorator_ItemSpawnerHasItem>();
	}
};
static_assert(alignof(UBTDecorator_ItemSpawnerHasItem) == 0x000008, "Wrong alignment on UBTDecorator_ItemSpawnerHasItem");
static_assert(sizeof(UBTDecorator_ItemSpawnerHasItem) == 0x000090, "Wrong size on UBTDecorator_ItemSpawnerHasItem");
static_assert(offsetof(UBTDecorator_ItemSpawnerHasItem, ItemSpawnerKey) == 0x000068, "Member 'UBTDecorator_ItemSpawnerHasItem::ItemSpawnerKey' has a wrong offset!");

// Class Mariner.MarinerProjectileCollisionComponent
// 0x00E0 (0x04E0 - 0x0400)
class UMarinerProjectileCollisionComponent final : public USphereComponent
{
public:
	ECollisionChannel                             EnvironmentAndDynamicTestChannel;                  // 0x03F8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseSweepForEnvironmentTest;                       // 0x03F9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1425[0x2];                                     // 0x03FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EnvironmentSweepSphereRadius;                      // 0x03FC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         EnvironmentTraceAngleThreshold;                    // 0x0400(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIgnoreDamageableHitsBehind;                       // 0x0404(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShouldForceEnableSweeps;                          // 0x0405(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bMaskTeamCollision;                                // 0x0406(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1426[0x99];                                    // 0x0407(0x0099)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerFastSphereComponent*            ChildFastSweepSphereComponent;                     // 0x04A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1427[0x38];                                    // 0x04A8(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MarinerProjectileCollisionComponent">();
	}
	static class UMarinerProjectileCollisionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMarinerProjectileCollisionComponent>();
	}
};
static_assert(alignof(UMarinerProjectileCollisionComponent) == 0x000010, "Wrong alignment on UMarinerProjectileCollisionComponent");
static_assert(sizeof(UMarinerProjectileCollisionComponent) == 0x0004E0, "Wrong size on UMarinerProjectileCollisionComponent");
static_assert(offsetof(UMarinerProjectileCollisionComponent, EnvironmentAndDynamicTestChannel) == 0x0003F8, "Member 'UMarinerProjectileCollisionComponent::EnvironmentAndDynamicTestChannel' has a wrong offset!");
static_assert(offsetof(UMarinerProjectileCollisionComponent, bUseSweepForEnvironmentTest) == 0x0003F9, "Member 'UMarinerProjectileCollisionComponent::bUseSweepForEnvironmentTest' has a wrong offset!");
static_assert(offsetof(UMarinerProjectileCollisionComponent, EnvironmentSweepSphereRadius) == 0x0003FC, "Member 'UMarinerProjectileCollisionComponent::EnvironmentSweepSphereRadius' has a wrong offset!");
static_assert(offsetof(UMarinerProjectileCollisionComponent, EnvironmentTraceAngleThreshold) == 0x000400, "Member 'UMarinerProjectileCollisionComponent::EnvironmentTraceAngleThreshold' has a wrong offset!");
static_assert(offsetof(UMarinerProjectileCollisionComponent, bIgnoreDamageableHitsBehind) == 0x000404, "Member 'UMarinerProjectileCollisionComponent::bIgnoreDamageableHitsBehind' has a wrong offset!");
static_assert(offsetof(UMarinerProjectileCollisionComponent, bShouldForceEnableSweeps) == 0x000405, "Member 'UMarinerProjectileCollisionComponent::bShouldForceEnableSweeps' has a wrong offset!");
static_assert(offsetof(UMarinerProjectileCollisionComponent, bMaskTeamCollision) == 0x000406, "Member 'UMarinerProjectileCollisionComponent::bMaskTeamCollision' has a wrong offset!");
static_assert(offsetof(UMarinerProjectileCollisionComponent, ChildFastSweepSphereComponent) == 0x0004A0, "Member 'UMarinerProjectileCollisionComponent::ChildFastSweepSphereComponent' has a wrong offset!");

// Class Mariner.MarinerUserWidget
// 0x0080 (0x02B0 - 0x0230)
class UMarinerUserWidget : public UUserWidget
{
public:
	uint8                                         Pad_1428[0x8];                                     // 0x0230(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMarinerInputInterface> ActiveInputWidget;                                 // 0x0238(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_1429[0x18];                                    // 0x0248(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UUMGSequencePlayer*, float>        ManagedSequencePlayers;                            // 0x0260(0x0050)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

public:
	void PlayAudio(class UAkAudioEvent* Event);
	class UUMGSequencePlayer* PlayManagedAnimation(class UWidgetAnimation* InAnimation, float StartAtTime, int32 NumLoopsToPlay, EUMGSequencePlayMode PlayMode, float PlaybackSpeed);
	void ScrollIntoView(bool bAnimate);
	void SetActiveInputWidget(TScriptInterface<class IMarinerInputInterface> InputWidget, bool bGiveInputFocus);
	void SetManagedVisibility(EManagedVisibilityState InState, ESlateVisibility InVisibility);

	EPlayerInputType GetActiveInputType() const;
	class UMarinerGameInstance* GetMarinerGameInstance() const;
	class UMarinerMenuManager* GetMenuManager() const;
	class UMarinerMenuStackLayer* GetOwningLayer() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MarinerUserWidget">();
	}
	static class UMarinerUserWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMarinerUserWidget>();
	}
};
static_assert(alignof(UMarinerUserWidget) == 0x000008, "Wrong alignment on UMarinerUserWidget");
static_assert(sizeof(UMarinerUserWidget) == 0x0002B0, "Wrong size on UMarinerUserWidget");
static_assert(offsetof(UMarinerUserWidget, ActiveInputWidget) == 0x000238, "Member 'UMarinerUserWidget::ActiveInputWidget' has a wrong offset!");
static_assert(offsetof(UMarinerUserWidget, ManagedSequencePlayers) == 0x000260, "Member 'UMarinerUserWidget::ManagedSequencePlayers' has a wrong offset!");

// Class Mariner.MarinerSettingBase
// 0x01F0 (0x04A0 - 0x02B0)
class UMarinerSettingBase : public UMarinerUserWidget
{
public:
	UMulticastInlineDelegateProperty_             OnHighlighted;                                     // 0x02B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_             OnUnhighlighted;                                   // 0x02C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bCanBeSelected;                                    // 0x02D0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_142C[0x7];                                     // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMarinerPlatformText                   SettingLabel;                                      // 0x02D8(0x0078)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)
	EMarinerInputActions                          MouseSelectionInput;                               // 0x0350(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_142D[0x7];                                     // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMarinerPlatformText                   MenuStackTooltip;                                  // 0x0358(0x0078)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)
	struct FMarinerPlatformText                   AdditionalDesc;                                    // 0x03D0(0x0078)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	bool                                          bButtonInteractable;                               // 0x0448(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnabledOnPC;                                      // 0x0449(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnabledOnX1;                                      // 0x044A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnabledOnPS4;                                     // 0x044B(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnabledOnSwitch;                                  // 0x044C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnabledOnStadia;                                  // 0x044D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnabledForE3_18;                                  // 0x044E(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnabledForBeta;                                   // 0x044F(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAkAudioEvent*                          HighlightSFX;                                      // 0x0450(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAkAudioEvent*                          UnhighlightSFX;                                    // 0x0458(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_142E[0x40];                                    // 0x0460(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BPOnHighlight();
	void BPOnUnhighlight();
	bool GetBackgroundColor(struct FLinearColor* OutColor);
	bool GetLabelColor(struct FLinearColor* OutColor);
	void OnDefaultRestored();
	void OnMouseHovered();
	void OnMouseSelected();
	void OnMouseUnhovered();
	void SetIsInteractable(bool bInIsInteractable);
	void SetLabel(const class FText& LabelIn);
	void SetLabelPlatform(const struct FMarinerPlatformText& LabelIn);
	void SetUnviewed(bool bUnviewed);

	const class FText GetAdditionalDescription() const;
	bool IsEnabled() const;
	bool IsHighlighted() const;
	bool IsUnviewed() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MarinerSettingBase">();
	}
	static class UMarinerSettingBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMarinerSettingBase>();
	}
};
static_assert(alignof(UMarinerSettingBase) == 0x000008, "Wrong alignment on UMarinerSettingBase");
static_assert(sizeof(UMarinerSettingBase) == 0x0004A0, "Wrong size on UMarinerSettingBase");
static_assert(offsetof(UMarinerSettingBase, OnHighlighted) == 0x0002B0, "Member 'UMarinerSettingBase::OnHighlighted' has a wrong offset!");
static_assert(offsetof(UMarinerSettingBase, OnUnhighlighted) == 0x0002C0, "Member 'UMarinerSettingBase::OnUnhighlighted' has a wrong offset!");
static_assert(offsetof(UMarinerSettingBase, bCanBeSelected) == 0x0002D0, "Member 'UMarinerSettingBase::bCanBeSelected' has a wrong offset!");
static_assert(offsetof(UMarinerSettingBase, SettingLabel) == 0x0002D8, "Member 'UMarinerSettingBase::SettingLabel' has a wrong offset!");
static_assert(offsetof(UMarinerSettingBase, MouseSelectionInput) == 0x000350, "Member 'UMarinerSettingBase::MouseSelectionInput' has a wrong offset!");
static_assert(offsetof(UMarinerSettingBase, MenuStackTooltip) == 0x000358, "Member 'UMarinerSettingBase::MenuStackTooltip' has a wrong offset!");
static_assert(offsetof(UMarinerSettingBase, AdditionalDesc) == 0x0003D0, "Member 'UMarinerSettingBase::AdditionalDesc' has a wrong offset!");
static_assert(offsetof(UMarinerSettingBase, bButtonInteractable) == 0x000448, "Member 'UMarinerSettingBase::bButtonInteractable' has a wrong offset!");
static_assert(offsetof(UMarinerSettingBase, bEnabledOnPC) == 0x000449, "Member 'UMarinerSettingBase::bEnabledOnPC' has a wrong offset!");
static_assert(offsetof(UMarinerSettingBase, bEnabledOnX1) == 0x00044A, "Member 'UMarinerSettingBase::bEnabledOnX1' has a wrong offset!");
static_assert(offsetof(UMarinerSettingBase, bEnabledOnPS4) == 0x00044B, "Member 'UMarinerSettingBase::bEnabledOnPS4' has a wrong offset!");
static_assert(offsetof(UMarinerSettingBase, bEnabledOnSwitch) == 0x00044C, "Member 'UMarinerSettingBase::bEnabledOnSwitch' has a wrong offset!");
static_assert(offsetof(UMarinerSettingBase, bEnabledOnStadia) == 0x00044D, "Member 'UMarinerSettingBase::bEnabledOnStadia' has a wrong offset!");
static_assert(offsetof(UMarinerSettingBase, bEnabledForE3_18) == 0x00044E, "Member 'UMarinerSettingBase::bEnabledForE3_18' has a wrong offset!");
static_assert(offsetof(UMarinerSettingBase, bEnabledForBeta) == 0x00044F, "Member 'UMarinerSettingBase::bEnabledForBeta' has a wrong offset!");
static_assert(offsetof(UMarinerSettingBase, HighlightSFX) == 0x000450, "Member 'UMarinerSettingBase::HighlightSFX' has a wrong offset!");
static_assert(offsetof(UMarinerSettingBase, UnhighlightSFX) == 0x000458, "Member 'UMarinerSettingBase::UnhighlightSFX' has a wrong offset!");

// Class Mariner.MarinerSettingComboBox
// 0x0250 (0x06F0 - 0x04A0)
class UMarinerSettingComboBox : public UMarinerSettingBase
{
public:
	TArray<class FText>                           Options;                                           // 0x04A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)
	TArray<TDelegate<void()>>                     Callbacks;                                         // 0x04B0(0x0010)(ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	bool                                          bTreatSelectionAsButton;                           // 0x04C0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHideComboBoxWhileUnhighlighted;                   // 0x04C1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1431[0x6];                                     // 0x04C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastInlineDelegateProperty_             OnComboBoxIndexInit;                               // 0x04C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	UMulticastInlineDelegateProperty_             OnSelectionIndexChanged;                           // 0x04D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	UMulticastInlineDelegateProperty_             OnComboBoxOpened;                                  // 0x04E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	struct FMarinerCustomDropdownEditConfirmation EditConfirmationData;                              // 0x04F8(0x01C8)(Edit, BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FMarinerCustomDropdownSFX              DropdownSFX;                                       // 0x06C0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1432[0x8];                                     // 0x06E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddOption(const class FText& OptionText);
	void AddOptionWithCallback(const class FText& OptionText, const TDelegate<void()>& SelectedCallback);
	void ClearOptions();
	void OnComboBoxOutOfScope();
	void OnSelectionIndexChangedCallback(int32 SelectedIndex);
	void OnSettingDropdownOpened(const bool bOpen);
	void SetSelectedIndex(int32 Value, bool bBroadcast, bool bAnimate);

	struct FMarinerSettingComboBoxAssets GetAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MarinerSettingComboBox">();
	}
	static class UMarinerSettingComboBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMarinerSettingComboBox>();
	}
};
static_assert(alignof(UMarinerSettingComboBox) == 0x000008, "Wrong alignment on UMarinerSettingComboBox");
static_assert(sizeof(UMarinerSettingComboBox) == 0x0006F0, "Wrong size on UMarinerSettingComboBox");
static_assert(offsetof(UMarinerSettingComboBox, Options) == 0x0004A0, "Member 'UMarinerSettingComboBox::Options' has a wrong offset!");
static_assert(offsetof(UMarinerSettingComboBox, Callbacks) == 0x0004B0, "Member 'UMarinerSettingComboBox::Callbacks' has a wrong offset!");
static_assert(offsetof(UMarinerSettingComboBox, bTreatSelectionAsButton) == 0x0004C0, "Member 'UMarinerSettingComboBox::bTreatSelectionAsButton' has a wrong offset!");
static_assert(offsetof(UMarinerSettingComboBox, bHideComboBoxWhileUnhighlighted) == 0x0004C1, "Member 'UMarinerSettingComboBox::bHideComboBoxWhileUnhighlighted' has a wrong offset!");
static_assert(offsetof(UMarinerSettingComboBox, OnComboBoxIndexInit) == 0x0004C8, "Member 'UMarinerSettingComboBox::OnComboBoxIndexInit' has a wrong offset!");
static_assert(offsetof(UMarinerSettingComboBox, OnSelectionIndexChanged) == 0x0004D8, "Member 'UMarinerSettingComboBox::OnSelectionIndexChanged' has a wrong offset!");
static_assert(offsetof(UMarinerSettingComboBox, OnComboBoxOpened) == 0x0004E8, "Member 'UMarinerSettingComboBox::OnComboBoxOpened' has a wrong offset!");
static_assert(offsetof(UMarinerSettingComboBox, EditConfirmationData) == 0x0004F8, "Member 'UMarinerSettingComboBox::EditConfirmationData' has a wrong offset!");
static_assert(offsetof(UMarinerSettingComboBox, DropdownSFX) == 0x0006C0, "Member 'UMarinerSettingComboBox::DropdownSFX' has a wrong offset!");

// Class Mariner.MangoConnectionManager
// 0x01B8 (0x01F8 - 0x0040)
class UMangoConnectionManager final : public UMangoBaseManager
{
public:
	uint8                                         Pad_1434[0x90];                                    // 0x0040(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastInlineDelegateProperty_             OnGameVersionChanged;                              // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_1435[0x118];                                   // 0x00E0(0x0118)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UMangoConnectionManager* Get(const class UObject* WorldContextObject);

	void OnUserSettingsChanged();

	EMarinerGameVersion GetGameVersion() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MangoConnectionManager">();
	}
	static class UMangoConnectionManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMangoConnectionManager>();
	}
};
static_assert(alignof(UMangoConnectionManager) == 0x000008, "Wrong alignment on UMangoConnectionManager");
static_assert(sizeof(UMangoConnectionManager) == 0x0001F8, "Wrong size on UMangoConnectionManager");
static_assert(offsetof(UMangoConnectionManager, OnGameVersionChanged) == 0x0000D0, "Member 'UMangoConnectionManager::OnGameVersionChanged' has a wrong offset!");

// Class Mariner.AIDataProvider_BotManagerQueryParams
// 0x0000 (0x0040 - 0x0040)
class UAIDataProvider_BotManagerQueryParams final : public UAIDataProvider_QueryParams
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIDataProvider_BotManagerQueryParams">();
	}
	static class UAIDataProvider_BotManagerQueryParams* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIDataProvider_BotManagerQueryParams>();
	}
};
static_assert(alignof(UAIDataProvider_BotManagerQueryParams) == 0x000008, "Wrong alignment on UAIDataProvider_BotManagerQueryParams");
static_assert(sizeof(UAIDataProvider_BotManagerQueryParams) == 0x000040, "Wrong size on UAIDataProvider_BotManagerQueryParams");

// Class Mariner.MarinerPregameStateMachine
// 0x0040 (0x0068 - 0x0028)
class UMarinerPregameStateMachine final : public UObject
{
public:
	uint8                                         Pad_1436[0x20];                                    // 0x0028(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPregameState>                  PregameStates;                                     // 0x0048(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1437[0x10];                                    // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FName GetFirstState();
	class FName GetLastState();
	void OnMachineBegin();
	void OnMachineUpdate();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MarinerPregameStateMachine">();
	}
	static class UMarinerPregameStateMachine* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMarinerPregameStateMachine>();
	}
};
static_assert(alignof(UMarinerPregameStateMachine) == 0x000008, "Wrong alignment on UMarinerPregameStateMachine");
static_assert(sizeof(UMarinerPregameStateMachine) == 0x000068, "Wrong size on UMarinerPregameStateMachine");
static_assert(offsetof(UMarinerPregameStateMachine, PregameStates) == 0x000048, "Member 'UMarinerPregameStateMachine::PregameStates' has a wrong offset!");

// Class Mariner.BTTask_FindRandomPointOnNavMesh
// 0x0008 (0x00A0 - 0x0098)
class UBTTask_FindRandomPointOnNavMesh final : public UBTTask_BlackboardBase
{
public:
	float                                         SearchRadius;                                      // 0x0098(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1438[0x4];                                     // 0x009C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BTTask_FindRandomPointOnNavMesh">();
	}
	static class UBTTask_FindRandomPointOnNavMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_FindRandomPointOnNavMesh>();
	}
};
static_assert(alignof(UBTTask_FindRandomPointOnNavMesh) == 0x000008, "Wrong alignment on UBTTask_FindRandomPointOnNavMesh");
static_assert(sizeof(UBTTask_FindRandomPointOnNavMesh) == 0x0000A0, "Wrong size on UBTTask_FindRandomPointOnNavMesh");
static_assert(offsetof(UBTTask_FindRandomPointOnNavMesh, SearchRadius) == 0x000098, "Member 'UBTTask_FindRandomPointOnNavMesh::SearchRadius' has a wrong offset!");

// Class Mariner.BTDecorator_HasItem
// 0x0000 (0x0068 - 0x0068)
class UBTDecorator_HasItem final : public UBTDecorator
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BTDecorator_HasItem">();
	}
	static class UBTDecorator_HasItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTDecorator_HasItem>();
	}
};
static_assert(alignof(UBTDecorator_HasItem) == 0x000008, "Wrong alignment on UBTDecorator_HasItem");
static_assert(sizeof(UBTDecorator_HasItem) == 0x000068, "Wrong size on UBTDecorator_HasItem");

// Class Mariner.MarinerAbilityIcon
// 0x0130 (0x0360 - 0x0230)
class UMarinerAbilityIcon final : public UUserWidget
{
public:
	TSubclassOf<class UMarinerAbility>            AbilityClass;                                      // 0x0230(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Bound_Icon;                                        // 0x0238(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Bound_InfinityImage;                               // 0x0240(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Bound_RechargeFlash;                               // 0x0248(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Bound_FrameBorder;                                 // 0x0250(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             Bound_ReloadText;                                  // 0x0258(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             Bound_CountdownText;                               // 0x0260(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             Bound_AbilityActiveCountdownText;                  // 0x0268(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             Bound_PriorityItemText;                            // 0x0270(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             Bound_CurrentAmmoText;                             // 0x0278(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             Bound_MaxAmmoText;                                 // 0x0280(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMarinerPrompt*                         Bound_AbilityPrompt;                               // 0x0288(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTexture*                               BlackTexture;                                      // 0x0290(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UGameplayEffect>            BallCarrierEffect;                                 // 0x0298(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           PrimaryFireFailIgnoreTag;                          // 0x02A0(0x0008)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<EMarinerInputActions, struct FGameplayTag> HideWidgetTagMap;                                  // 0x02A8(0x0050)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UAkAudioEvent*                          OnCooldownCompleteSFX;                             // 0x02F8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               IconMaterial;                                      // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               RechargeFlashMaterial;                             // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMarinerAbilitySystemComponent*         AbilitySystemComponent;                            // 0x0310(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMarinerWeaponAttributes*               WeaponAttributes;                                  // 0x0318(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UHUDAbilityUIData>          HUDBarIconData;                                    // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UMarinerItemInteractionComponent> ItemInteractionComponent;                          // 0x0328(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1439[0x30];                                    // 0x0330(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BindToBPEvents();
	void BP_OnAbilityActivated();
	void BP_OnGameplayTagApplied(const struct FGameplayTag& GameplayTag);
	void BP_OnGameplayTagRemoved(const struct FGameplayTag& GameplayTag);
	void OnAbilityActivated();
	void OnAbilityEnded(bool bWasCancelled);
	void OnAbilityFailed(class UGameplayAbility* Ability, const struct FGameplayTagContainer& FailTags);
	void OnAbilityUIActivated();
	void OnAlternateAbilityIconUpdated(bool bInUseAlternateIcon, TSubclassOf<class UMarinerAbility> InAbilityClass);
	void OnArenaCurrentStateChanged(EMarinerArenaReturnState PrevState, EMarinerArenaReturnState NewState);
	void OnCharacterGameplayTagApplied(class AMarinerCharacter* Character, const struct FGameplayTag& GameplayTag);
	void OnCharacterGameplayTagRemoved(class AMarinerCharacter* Character, const struct FGameplayTag& GameplayTag);
	void OnCooldownEnded();
	void OnCooldownTimeChanged(float TimeRemaining, float Duration);
	void OnDropOrThrowRelease(class AMarinerCharacter* DroppingCharacter, EMarinerItemSlot ItemSlot);
	void OnLocalAmmoChanged(float NewAmount);
	void OnPriorityItemDropped(const class AMarinerCharacter* KnockOutInstigator, const bool bWasMegablast);
	void OnPriorityItemPickedUp(class AMarinerCharacter* CatchingCharacter, EMarinerItemSlot ItemSlot);
	void OnReloadActivated();
	void OnReloadEnded(bool bWasCancelled);
	void OnRepCurrentAmmo(float InCurrentAmmo, float MaxAmmo);
	void SetAbility(class UMarinerAbilitySystemComponent* InAbilitySystem, TSubclassOf<class UMarinerAbility> InAbilityClass, EMarinerInputActions InInputAction);
	void SetHUDBarIconData(const TSubclassOf<class UHUDAbilityUIData>& IconData);
	void SetIconType(EMarinerHudAbilityIconType InIconType);
	void UpdatePrompt();

	struct FMarinerAbilityIconAnimations GetAnimations() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MarinerAbilityIcon">();
	}
	static class UMarinerAbilityIcon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMarinerAbilityIcon>();
	}
};
static_assert(alignof(UMarinerAbilityIcon) == 0x000008, "Wrong alignment on UMarinerAbilityIcon");
static_assert(sizeof(UMarinerAbilityIcon) == 0x000360, "Wrong size on UMarinerAbilityIcon");
static_assert(offsetof(UMarinerAbilityIcon, AbilityClass) == 0x000230, "Member 'UMarinerAbilityIcon::AbilityClass' has a wrong offset!");
static_assert(offsetof(UMarinerAbilityIcon, Bound_Icon) == 0x000238, "Member 'UMarinerAbilityIcon::Bound_Icon' has a wrong offset!");
static_assert(offsetof(UMarinerAbilityIcon, Bound_InfinityImage) == 0x000240, "Member 'UMarinerAbilityIcon::Bound_InfinityImage' has a wrong offset!");
static_assert(offsetof(UMarinerAbilityIcon, Bound_RechargeFlash) == 0x000248, "Member 'UMarinerAbilityIcon::Bound_RechargeFlash' has a wrong offset!");
static_assert(offsetof(UMarinerAbilityIcon, Bound_FrameBorder) == 0x000250, "Member 'UMarinerAbilityIcon::Bound_FrameBorder' has a wrong offset!");
static_assert(offsetof(UMarinerAbilityIcon, Bound_ReloadText) == 0x000258, "Member 'UMarinerAbilityIcon::Bound_ReloadText' has a wrong offset!");
static_assert(offsetof(UMarinerAbilityIcon, Bound_CountdownText) == 0x000260, "Member 'UMarinerAbilityIcon::Bound_CountdownText' has a wrong offset!");
static_assert(offsetof(UMarinerAbilityIcon, Bound_AbilityActiveCountdownText) == 0x000268, "Member 'UMarinerAbilityIcon::Bound_AbilityActiveCountdownText' has a wrong offset!");
static_assert(offsetof(UMarinerAbilityIcon, Bound_PriorityItemText) == 0x000270, "Member 'UMarinerAbilityIcon::Bound_PriorityItemText' has a wrong offset!");
static_assert(offsetof(UMarinerAbilityIcon, Bound_CurrentAmmoText) == 0x000278, "Member 'UMarinerAbilityIcon::Bound_CurrentAmmoText' has a wrong offset!");
static_assert(offsetof(UMarinerAbilityIcon, Bound_MaxAmmoText) == 0x000280, "Member 'UMarinerAbilityIcon::Bound_MaxAmmoText' has a wrong offset!");
static_assert(offsetof(UMarinerAbilityIcon, Bound_AbilityPrompt) == 0x000288, "Member 'UMarinerAbilityIcon::Bound_AbilityPrompt' has a wrong offset!");
static_assert(offsetof(UMarinerAbilityIcon, BlackTexture) == 0x000290, "Member 'UMarinerAbilityIcon::BlackTexture' has a wrong offset!");
static_assert(offsetof(UMarinerAbilityIcon, BallCarrierEffect) == 0x000298, "Member 'UMarinerAbilityIcon::BallCarrierEffect' has a wrong offset!");
static_assert(offsetof(UMarinerAbilityIcon, PrimaryFireFailIgnoreTag) == 0x0002A0, "Member 'UMarinerAbilityIcon::PrimaryFireFailIgnoreTag' has a wrong offset!");
static_assert(offsetof(UMarinerAbilityIcon, HideWidgetTagMap) == 0x0002A8, "Member 'UMarinerAbilityIcon::HideWidgetTagMap' has a wrong offset!");
static_assert(offsetof(UMarinerAbilityIcon, OnCooldownCompleteSFX) == 0x0002F8, "Member 'UMarinerAbilityIcon::OnCooldownCompleteSFX' has a wrong offset!");
static_assert(offsetof(UMarinerAbilityIcon, IconMaterial) == 0x000300, "Member 'UMarinerAbilityIcon::IconMaterial' has a wrong offset!");
static_assert(offsetof(UMarinerAbilityIcon, RechargeFlashMaterial) == 0x000308, "Member 'UMarinerAbilityIcon::RechargeFlashMaterial' has a wrong offset!");
static_assert(offsetof(UMarinerAbilityIcon, AbilitySystemComponent) == 0x000310, "Member 'UMarinerAbilityIcon::AbilitySystemComponent' has a wrong offset!");
static_assert(offsetof(UMarinerAbilityIcon, WeaponAttributes) == 0x000318, "Member 'UMarinerAbilityIcon::WeaponAttributes' has a wrong offset!");
static_assert(offsetof(UMarinerAbilityIcon, HUDBarIconData) == 0x000320, "Member 'UMarinerAbilityIcon::HUDBarIconData' has a wrong offset!");
static_assert(offsetof(UMarinerAbilityIcon, ItemInteractionComponent) == 0x000328, "Member 'UMarinerAbilityIcon::ItemInteractionComponent' has a wrong offset!");

// Class Mariner.MarinerMaterialsSwapManagerComponent
// 0x0030 (0x00E0 - 0x00B0)
class UMarinerMaterialsSwapManagerComponent final : public UActorComponent
{
public:
	int32                                         MaterialToAlterFlagForBP;                          // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_143F[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMarinerMeshSwapReplicationData_Apply  AuthoritativeMeshSwapApplyRepData;                 // 0x00B8(0x0010)(Net, RepNotify, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FMarinerMeshSwapReplicationData_Apply  ClientPredictiveMeshSwapApplyData;                 // 0x00C8(0x0010)(NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FMarinerMeshSwapReplicationData_Revert AuthoritativeMeshSwapRevertRepData;                // 0x00D8(0x0002)(Net, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FMarinerMeshSwapReplicationData_Revert ClientPredictiveMeshSwapRevertData;                // 0x00DA(0x0002)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1440[0x4];                                     // 0x00DC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_MeshSwapApplyData();
	void OnRep_MeshSwapRevertData();
	void RevertMaterials(int32 Param_Flags);
	void RevertMaterialsMulticast(int32 Param_Flags);
	void SwapMaterials(int32 Param_Flags, class UMaterialInterface* NewMaterial);
	void SwapMaterialsMulticast(int32 Param_Flags, class UMaterialInterface* NewMaterial);

	bool HasPendingMeshSwapForMeshType(EMarinerChangeMeshEnum MeshType) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MarinerMaterialsSwapManagerComponent">();
	}
	static class UMarinerMaterialsSwapManagerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMarinerMaterialsSwapManagerComponent>();
	}
};
static_assert(alignof(UMarinerMaterialsSwapManagerComponent) == 0x000008, "Wrong alignment on UMarinerMaterialsSwapManagerComponent");
static_assert(sizeof(UMarinerMaterialsSwapManagerComponent) == 0x0000E0, "Wrong size on UMarinerMaterialsSwapManagerComponent");
static_assert(offsetof(UMarinerMaterialsSwapManagerComponent, MaterialToAlterFlagForBP) == 0x0000B0, "Member 'UMarinerMaterialsSwapManagerComponent::MaterialToAlterFlagForBP' has a wrong offset!");
static_assert(offsetof(UMarinerMaterialsSwapManagerComponent, AuthoritativeMeshSwapApplyRepData) == 0x0000B8, "Member 'UMarinerMaterialsSwapManagerComponent::AuthoritativeMeshSwapApplyRepData' has a wrong offset!");
static_assert(offsetof(UMarinerMaterialsSwapManagerComponent, ClientPredictiveMeshSwapApplyData) == 0x0000C8, "Member 'UMarinerMaterialsSwapManagerComponent::ClientPredictiveMeshSwapApplyData' has a wrong offset!");
static_assert(offsetof(UMarinerMaterialsSwapManagerComponent, AuthoritativeMeshSwapRevertRepData) == 0x0000D8, "Member 'UMarinerMaterialsSwapManagerComponent::AuthoritativeMeshSwapRevertRepData' has a wrong offset!");
static_assert(offsetof(UMarinerMaterialsSwapManagerComponent, ClientPredictiveMeshSwapRevertData) == 0x0000DA, "Member 'UMarinerMaterialsSwapManagerComponent::ClientPredictiveMeshSwapRevertData' has a wrong offset!");

// Class Mariner.MangoManagers
// 0x00A0 (0x00E0 - 0x0040)
class UMangoManagers final : public UMangoBaseManager
{
public:
	uint8                                         Pad_1443[0x18];                                    // 0x0040(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoAchievementsManager*              MangoAchievementManager;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMangoBlastPassManager*                 MangoBlastPassManager;                             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMangoCMSManager*                       MangoCMSManager;                                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMangoConnectionManager*                MangoConnectionManager;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMangoDedicatedServerManager*           MangoDedicatedServerManager;                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMangoPresenceManager*                  MangoPresenceManager;                              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMangoFriendsManager*                   MangoFriendsManager;                               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMangoInventoryManager*                 MangoInventoryManager;                             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMangoMatchmakingManager*               MangoMatchmakingManager;                           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMangoPartyManager*                     MangoPartyManager;                                 // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMangoPlayerManager*                    MangoPlayerManager;                                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMangoPrivateMatchManager*              MangoPrivateMatchManager;                          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMangoQOSManager*                       MangoQOSManager;                                   // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMangoQuestManager*                     MangoQuestManager;                                 // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMangoStoreManager*                     MangoStoreManager;                                 // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMangoTxnManager*                       MangoTxnManager;                                   // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMangoVoiceChatManager*                 MangoVoiceChatManager;                             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MangoManagers">();
	}
	static class UMangoManagers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMangoManagers>();
	}
};
static_assert(alignof(UMangoManagers) == 0x000008, "Wrong alignment on UMangoManagers");
static_assert(sizeof(UMangoManagers) == 0x0000E0, "Wrong size on UMangoManagers");
static_assert(offsetof(UMangoManagers, MangoAchievementManager) == 0x000058, "Member 'UMangoManagers::MangoAchievementManager' has a wrong offset!");
static_assert(offsetof(UMangoManagers, MangoBlastPassManager) == 0x000060, "Member 'UMangoManagers::MangoBlastPassManager' has a wrong offset!");
static_assert(offsetof(UMangoManagers, MangoCMSManager) == 0x000068, "Member 'UMangoManagers::MangoCMSManager' has a wrong offset!");
static_assert(offsetof(UMangoManagers, MangoConnectionManager) == 0x000070, "Member 'UMangoManagers::MangoConnectionManager' has a wrong offset!");
static_assert(offsetof(UMangoManagers, MangoDedicatedServerManager) == 0x000078, "Member 'UMangoManagers::MangoDedicatedServerManager' has a wrong offset!");
static_assert(offsetof(UMangoManagers, MangoPresenceManager) == 0x000080, "Member 'UMangoManagers::MangoPresenceManager' has a wrong offset!");
static_assert(offsetof(UMangoManagers, MangoFriendsManager) == 0x000088, "Member 'UMangoManagers::MangoFriendsManager' has a wrong offset!");
static_assert(offsetof(UMangoManagers, MangoInventoryManager) == 0x000090, "Member 'UMangoManagers::MangoInventoryManager' has a wrong offset!");
static_assert(offsetof(UMangoManagers, MangoMatchmakingManager) == 0x000098, "Member 'UMangoManagers::MangoMatchmakingManager' has a wrong offset!");
static_assert(offsetof(UMangoManagers, MangoPartyManager) == 0x0000A0, "Member 'UMangoManagers::MangoPartyManager' has a wrong offset!");
static_assert(offsetof(UMangoManagers, MangoPlayerManager) == 0x0000A8, "Member 'UMangoManagers::MangoPlayerManager' has a wrong offset!");
static_assert(offsetof(UMangoManagers, MangoPrivateMatchManager) == 0x0000B0, "Member 'UMangoManagers::MangoPrivateMatchManager' has a wrong offset!");
static_assert(offsetof(UMangoManagers, MangoQOSManager) == 0x0000B8, "Member 'UMangoManagers::MangoQOSManager' has a wrong offset!");
static_assert(offsetof(UMangoManagers, MangoQuestManager) == 0x0000C0, "Member 'UMangoManagers::MangoQuestManager' has a wrong offset!");
static_assert(offsetof(UMangoManagers, MangoStoreManager) == 0x0000C8, "Member 'UMangoManagers::MangoStoreManager' has a wrong offset!");
static_assert(offsetof(UMangoManagers, MangoTxnManager) == 0x0000D0, "Member 'UMangoManagers::MangoTxnManager' has a wrong offset!");
static_assert(offsetof(UMangoManagers, MangoVoiceChatManager) == 0x0000D8, "Member 'UMangoManagers::MangoVoiceChatManager' has a wrong offset!");

// Class Mariner.MarinerActivationDeviceTarget
// 0x0040 (0x0268 - 0x0228)
class AMarinerActivationDeviceTarget : public AStaticMeshActor
{
public:
	UMulticastInlineDelegateProperty_             OnStateChanged;                                    // 0x0228(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                         CoolDown;                                          // 0x0238(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Time;                                              // 0x023C(0x0004)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMarinerActivationTargetState                 State;                                             // 0x0240(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1444[0x7];                                     // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMarinerCharacter*                      ActivationInstigator;                              // 0x0248(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMarinerActivateDevicePayload          ActivationPayload;                                 // 0x0250(0x0010)(Net, Transient, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         DeactivationReplicationByte;                       // 0x0260(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1445[0x7];                                     // 0x0261(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Activate(class AMarinerCharacter* InInstigator);
	void Deactivate();
	void OnEventCooldownStart();
	void OnEventReady();
	void OnEventTriggered(class AMarinerCharacter* InActivationInstigator);
	void OnRep_ActivationPayload();
	void OnRep_DeactivationReplicationByte();
	void OnRep_State();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MarinerActivationDeviceTarget">();
	}
	static class AMarinerActivationDeviceTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMarinerActivationDeviceTarget>();
	}
};
