#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mariner

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Mariner_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "MangoClient_structs.hpp"
#include "InputCore_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function Mariner.MangoPlayerManager.Get
// 0x0010 (0x0010 - 0x0000)
struct MangoPlayerManager_Get final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMangoPlayerManager*                    ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MangoPlayerManager_Get) == 0x000008, "Wrong alignment on MangoPlayerManager_Get");
static_assert(sizeof(MangoPlayerManager_Get) == 0x000010, "Wrong size on MangoPlayerManager_Get");
static_assert(offsetof(MangoPlayerManager_Get, WorldContextObject) == 0x000000, "Member 'MangoPlayerManager_Get::WorldContextObject' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_Get, ReturnValue) == 0x000008, "Member 'MangoPlayerManager_Get::ReturnValue' has a wrong offset!");

// Function Mariner.MangoPlayerManager.SetLocalProfileAdvertStateActive
// 0x0001 (0x0001 - 0x0000)
struct MangoPlayerManager_SetLocalProfileAdvertStateActive final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MangoPlayerManager_SetLocalProfileAdvertStateActive) == 0x000001, "Wrong alignment on MangoPlayerManager_SetLocalProfileAdvertStateActive");
static_assert(sizeof(MangoPlayerManager_SetLocalProfileAdvertStateActive) == 0x000001, "Wrong size on MangoPlayerManager_SetLocalProfileAdvertStateActive");
static_assert(offsetof(MangoPlayerManager_SetLocalProfileAdvertStateActive, bActive) == 0x000000, "Member 'MangoPlayerManager_SetLocalProfileAdvertStateActive::bActive' has a wrong offset!");

// Function Mariner.MangoPlayerManager.SetNewsViewed
// 0x0014 (0x0014 - 0x0000)
struct MangoPlayerManager_SetNewsViewed final
{
public:
	struct FGuid                                  NewsCmsId;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1411[0x3];                                     // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MangoPlayerManager_SetNewsViewed) == 0x000004, "Wrong alignment on MangoPlayerManager_SetNewsViewed");
static_assert(sizeof(MangoPlayerManager_SetNewsViewed) == 0x000014, "Wrong size on MangoPlayerManager_SetNewsViewed");
static_assert(offsetof(MangoPlayerManager_SetNewsViewed, NewsCmsId) == 0x000000, "Member 'MangoPlayerManager_SetNewsViewed::NewsCmsId' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_SetNewsViewed, ReturnValue) == 0x000010, "Member 'MangoPlayerManager_SetNewsViewed::ReturnValue' has a wrong offset!");

// Function Mariner.MangoPlayerManager.GetActiveAccountName
// 0x0010 (0x0010 - 0x0000)
struct MangoPlayerManager_GetActiveAccountName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MangoPlayerManager_GetActiveAccountName) == 0x000008, "Wrong alignment on MangoPlayerManager_GetActiveAccountName");
static_assert(sizeof(MangoPlayerManager_GetActiveAccountName) == 0x000010, "Wrong size on MangoPlayerManager_GetActiveAccountName");
static_assert(offsetof(MangoPlayerManager_GetActiveAccountName, ReturnValue) == 0x000000, "Member 'MangoPlayerManager_GetActiveAccountName::ReturnValue' has a wrong offset!");

// Function Mariner.MangoPlayerManager.GetActiveBlastPassProgression
// 0x0030 (0x0030 - 0x0000)
struct MangoPlayerManager_GetActiveBlastPassProgression final
{
public:
	struct FMangoBlastPassProgression             OutProgression;                                    // 0x0000(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1412[0x7];                                     // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MangoPlayerManager_GetActiveBlastPassProgression) == 0x000008, "Wrong alignment on MangoPlayerManager_GetActiveBlastPassProgression");
static_assert(sizeof(MangoPlayerManager_GetActiveBlastPassProgression) == 0x000030, "Wrong size on MangoPlayerManager_GetActiveBlastPassProgression");
static_assert(offsetof(MangoPlayerManager_GetActiveBlastPassProgression, OutProgression) == 0x000000, "Member 'MangoPlayerManager_GetActiveBlastPassProgression::OutProgression' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetActiveBlastPassProgression, ReturnValue) == 0x000028, "Member 'MangoPlayerManager_GetActiveBlastPassProgression::ReturnValue' has a wrong offset!");

// Function Mariner.MangoPlayerManager.GetAllEquippedEmotesByType
// 0x0328 (0x0328 - 0x0000)
struct MangoPlayerManager_GetAllEquippedEmotesByType final
{
public:
	TSoftClassPtr<class UClass>                   CharacterClass;                                    // 0x0000(0x0028)(ConstParm, Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMangoProfile                          Profile;                                           // 0x0028(0x02E0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EMangoItemType                                ItemType;                                          // 0x0308(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1413[0x7];                                     // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMangoItem>                     OutItems;                                          // 0x0310(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0320(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1414[0x7];                                     // 0x0321(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MangoPlayerManager_GetAllEquippedEmotesByType) == 0x000008, "Wrong alignment on MangoPlayerManager_GetAllEquippedEmotesByType");
static_assert(sizeof(MangoPlayerManager_GetAllEquippedEmotesByType) == 0x000328, "Wrong size on MangoPlayerManager_GetAllEquippedEmotesByType");
static_assert(offsetof(MangoPlayerManager_GetAllEquippedEmotesByType, CharacterClass) == 0x000000, "Member 'MangoPlayerManager_GetAllEquippedEmotesByType::CharacterClass' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetAllEquippedEmotesByType, Profile) == 0x000028, "Member 'MangoPlayerManager_GetAllEquippedEmotesByType::Profile' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetAllEquippedEmotesByType, ItemType) == 0x000308, "Member 'MangoPlayerManager_GetAllEquippedEmotesByType::ItemType' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetAllEquippedEmotesByType, OutItems) == 0x000310, "Member 'MangoPlayerManager_GetAllEquippedEmotesByType::OutItems' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetAllEquippedEmotesByType, ReturnValue) == 0x000320, "Member 'MangoPlayerManager_GetAllEquippedEmotesByType::ReturnValue' has a wrong offset!");

// Function Mariner.MangoPlayerManager.GetBlastPassProgression
// 0x0098 (0x0098 - 0x0000)
struct MangoPlayerManager_GetBlastPassProgression final
{
public:
	struct FMangoBlastPassDefinition              Definition;                                        // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMangoBlastPassProgression             OutProgression;                                    // 0x0068(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1415[0x7];                                     // 0x0091(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MangoPlayerManager_GetBlastPassProgression) == 0x000008, "Wrong alignment on MangoPlayerManager_GetBlastPassProgression");
static_assert(sizeof(MangoPlayerManager_GetBlastPassProgression) == 0x000098, "Wrong size on MangoPlayerManager_GetBlastPassProgression");
static_assert(offsetof(MangoPlayerManager_GetBlastPassProgression, Definition) == 0x000000, "Member 'MangoPlayerManager_GetBlastPassProgression::Definition' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetBlastPassProgression, OutProgression) == 0x000068, "Member 'MangoPlayerManager_GetBlastPassProgression::OutProgression' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetBlastPassProgression, ReturnValue) == 0x000090, "Member 'MangoPlayerManager_GetBlastPassProgression::ReturnValue' has a wrong offset!");

// Function Mariner.MangoPlayerManager.GetCharacterProgressionForLocalProfile
// 0x0088 (0x0088 - 0x0000)
struct MangoPlayerManager_GetCharacterProgressionForLocalProfile final
{
public:
	TSoftClassPtr<class UClass>                   CharacterClass;                                    // 0x0000(0x0028)(ConstParm, Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMangoCharacterProgression             OutProgression;                                    // 0x0028(0x0058)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0080(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1416[0x7];                                     // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MangoPlayerManager_GetCharacterProgressionForLocalProfile) == 0x000008, "Wrong alignment on MangoPlayerManager_GetCharacterProgressionForLocalProfile");
static_assert(sizeof(MangoPlayerManager_GetCharacterProgressionForLocalProfile) == 0x000088, "Wrong size on MangoPlayerManager_GetCharacterProgressionForLocalProfile");
static_assert(offsetof(MangoPlayerManager_GetCharacterProgressionForLocalProfile, CharacterClass) == 0x000000, "Member 'MangoPlayerManager_GetCharacterProgressionForLocalProfile::CharacterClass' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetCharacterProgressionForLocalProfile, OutProgression) == 0x000028, "Member 'MangoPlayerManager_GetCharacterProgressionForLocalProfile::OutProgression' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetCharacterProgressionForLocalProfile, ReturnValue) == 0x000080, "Member 'MangoPlayerManager_GetCharacterProgressionForLocalProfile::ReturnValue' has a wrong offset!");

// Function Mariner.MangoPlayerManager.GetCharacterProgressionForProfile
// 0x0368 (0x0368 - 0x0000)
struct MangoPlayerManager_GetCharacterProgressionForProfile final
{
public:
	TSoftClassPtr<class UClass>                   CharacterClass;                                    // 0x0000(0x0028)(ConstParm, Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMangoProfile                          Profile;                                           // 0x0028(0x02E0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMangoCharacterProgression             OutProgression;                                    // 0x0308(0x0058)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0360(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1417[0x7];                                     // 0x0361(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MangoPlayerManager_GetCharacterProgressionForProfile) == 0x000008, "Wrong alignment on MangoPlayerManager_GetCharacterProgressionForProfile");
static_assert(sizeof(MangoPlayerManager_GetCharacterProgressionForProfile) == 0x000368, "Wrong size on MangoPlayerManager_GetCharacterProgressionForProfile");
static_assert(offsetof(MangoPlayerManager_GetCharacterProgressionForProfile, CharacterClass) == 0x000000, "Member 'MangoPlayerManager_GetCharacterProgressionForProfile::CharacterClass' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetCharacterProgressionForProfile, Profile) == 0x000028, "Member 'MangoPlayerManager_GetCharacterProgressionForProfile::Profile' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetCharacterProgressionForProfile, OutProgression) == 0x000308, "Member 'MangoPlayerManager_GetCharacterProgressionForProfile::OutProgression' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetCharacterProgressionForProfile, ReturnValue) == 0x000360, "Member 'MangoPlayerManager_GetCharacterProgressionForProfile::ReturnValue' has a wrong offset!");

// Function Mariner.MangoPlayerManager.GetCMSNameForSkinCollection
// 0x0040 (0x0040 - 0x0000)
struct MangoPlayerManager_GetCMSNameForSkinCollection final
{
public:
	TSoftObjectPtr<class UMarinerSkinCollectionDataAsset> SkinCollection;                                    // 0x0000(0x0028)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0028(0x0018)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MangoPlayerManager_GetCMSNameForSkinCollection) == 0x000008, "Wrong alignment on MangoPlayerManager_GetCMSNameForSkinCollection");
static_assert(sizeof(MangoPlayerManager_GetCMSNameForSkinCollection) == 0x000040, "Wrong size on MangoPlayerManager_GetCMSNameForSkinCollection");
static_assert(offsetof(MangoPlayerManager_GetCMSNameForSkinCollection, SkinCollection) == 0x000000, "Member 'MangoPlayerManager_GetCMSNameForSkinCollection::SkinCollection' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetCMSNameForSkinCollection, ReturnValue) == 0x000028, "Member 'MangoPlayerManager_GetCMSNameForSkinCollection::ReturnValue' has a wrong offset!");

// Function Mariner.MangoPlayerManager.GetEquippedCharacterItemForLocalProfile
// 0x0088 (0x0088 - 0x0000)
struct MangoPlayerManager_GetEquippedCharacterItemForLocalProfile final
{
public:
	TSoftClassPtr<class UClass>                   CharacterClass;                                    // 0x0000(0x0028)(ConstParm, Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMangoItemType                                ItemType;                                          // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRanked;                                           // 0x0029(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1418[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMangoItem                             OutItem;                                           // 0x0030(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0080(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1419[0x7];                                     // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MangoPlayerManager_GetEquippedCharacterItemForLocalProfile) == 0x000008, "Wrong alignment on MangoPlayerManager_GetEquippedCharacterItemForLocalProfile");
static_assert(sizeof(MangoPlayerManager_GetEquippedCharacterItemForLocalProfile) == 0x000088, "Wrong size on MangoPlayerManager_GetEquippedCharacterItemForLocalProfile");
static_assert(offsetof(MangoPlayerManager_GetEquippedCharacterItemForLocalProfile, CharacterClass) == 0x000000, "Member 'MangoPlayerManager_GetEquippedCharacterItemForLocalProfile::CharacterClass' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetEquippedCharacterItemForLocalProfile, ItemType) == 0x000028, "Member 'MangoPlayerManager_GetEquippedCharacterItemForLocalProfile::ItemType' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetEquippedCharacterItemForLocalProfile, bRanked) == 0x000029, "Member 'MangoPlayerManager_GetEquippedCharacterItemForLocalProfile::bRanked' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetEquippedCharacterItemForLocalProfile, OutItem) == 0x000030, "Member 'MangoPlayerManager_GetEquippedCharacterItemForLocalProfile::OutItem' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetEquippedCharacterItemForLocalProfile, ReturnValue) == 0x000080, "Member 'MangoPlayerManager_GetEquippedCharacterItemForLocalProfile::ReturnValue' has a wrong offset!");

// Function Mariner.MangoPlayerManager.GetEquippedCharacterItemForProfile
// 0x0368 (0x0368 - 0x0000)
struct MangoPlayerManager_GetEquippedCharacterItemForProfile final
{
public:
	TSoftClassPtr<class UClass>                   CharacterClass;                                    // 0x0000(0x0028)(ConstParm, Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMangoProfile                          Profile;                                           // 0x0028(0x02E0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EMangoItemType                                ItemType;                                          // 0x0308(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRanked;                                           // 0x0309(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_141A[0x6];                                     // 0x030A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMangoItem                             OutItem;                                           // 0x0310(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0360(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_141B[0x7];                                     // 0x0361(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MangoPlayerManager_GetEquippedCharacterItemForProfile) == 0x000008, "Wrong alignment on MangoPlayerManager_GetEquippedCharacterItemForProfile");
static_assert(sizeof(MangoPlayerManager_GetEquippedCharacterItemForProfile) == 0x000368, "Wrong size on MangoPlayerManager_GetEquippedCharacterItemForProfile");
static_assert(offsetof(MangoPlayerManager_GetEquippedCharacterItemForProfile, CharacterClass) == 0x000000, "Member 'MangoPlayerManager_GetEquippedCharacterItemForProfile::CharacterClass' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetEquippedCharacterItemForProfile, Profile) == 0x000028, "Member 'MangoPlayerManager_GetEquippedCharacterItemForProfile::Profile' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetEquippedCharacterItemForProfile, ItemType) == 0x000308, "Member 'MangoPlayerManager_GetEquippedCharacterItemForProfile::ItemType' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetEquippedCharacterItemForProfile, bRanked) == 0x000309, "Member 'MangoPlayerManager_GetEquippedCharacterItemForProfile::bRanked' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetEquippedCharacterItemForProfile, OutItem) == 0x000310, "Member 'MangoPlayerManager_GetEquippedCharacterItemForProfile::OutItem' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetEquippedCharacterItemForProfile, ReturnValue) == 0x000360, "Member 'MangoPlayerManager_GetEquippedCharacterItemForProfile::ReturnValue' has a wrong offset!");

// Function Mariner.MangoPlayerManager.GetEquippedProfileItem
// 0x0340 (0x0340 - 0x0000)
struct MangoPlayerManager_GetEquippedProfileItem final
{
public:
	struct FMangoProfile                          Profile;                                           // 0x0000(0x02E0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EMangoItemType                                ItemType;                                          // 0x02E0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_141C[0x7];                                     // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMangoItem                             OutItem;                                           // 0x02E8(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0338(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_141D[0x7];                                     // 0x0339(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MangoPlayerManager_GetEquippedProfileItem) == 0x000008, "Wrong alignment on MangoPlayerManager_GetEquippedProfileItem");
static_assert(sizeof(MangoPlayerManager_GetEquippedProfileItem) == 0x000340, "Wrong size on MangoPlayerManager_GetEquippedProfileItem");
static_assert(offsetof(MangoPlayerManager_GetEquippedProfileItem, Profile) == 0x000000, "Member 'MangoPlayerManager_GetEquippedProfileItem::Profile' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetEquippedProfileItem, ItemType) == 0x0002E0, "Member 'MangoPlayerManager_GetEquippedProfileItem::ItemType' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetEquippedProfileItem, OutItem) == 0x0002E8, "Member 'MangoPlayerManager_GetEquippedProfileItem::OutItem' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetEquippedProfileItem, ReturnValue) == 0x000338, "Member 'MangoPlayerManager_GetEquippedProfileItem::ReturnValue' has a wrong offset!");

// Function Mariner.MangoPlayerManager.GetEquippedProfileItemForLocalProfile
// 0x0060 (0x0060 - 0x0000)
struct MangoPlayerManager_GetEquippedProfileItemForLocalProfile final
{
public:
	EMangoItemType                                ItemType;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_141E[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMangoItem                             OutItem;                                           // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_141F[0x7];                                     // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MangoPlayerManager_GetEquippedProfileItemForLocalProfile) == 0x000008, "Wrong alignment on MangoPlayerManager_GetEquippedProfileItemForLocalProfile");
static_assert(sizeof(MangoPlayerManager_GetEquippedProfileItemForLocalProfile) == 0x000060, "Wrong size on MangoPlayerManager_GetEquippedProfileItemForLocalProfile");
static_assert(offsetof(MangoPlayerManager_GetEquippedProfileItemForLocalProfile, ItemType) == 0x000000, "Member 'MangoPlayerManager_GetEquippedProfileItemForLocalProfile::ItemType' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetEquippedProfileItemForLocalProfile, OutItem) == 0x000008, "Member 'MangoPlayerManager_GetEquippedProfileItemForLocalProfile::OutItem' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetEquippedProfileItemForLocalProfile, ReturnValue) == 0x000058, "Member 'MangoPlayerManager_GetEquippedProfileItemForLocalProfile::ReturnValue' has a wrong offset!");

// Function Mariner.MangoPlayerManager.GetEquippedSkinForLocalProfile
// 0x0050 (0x0050 - 0x0000)
struct MangoPlayerManager_GetEquippedSkinForLocalProfile final
{
public:
	TSoftClassPtr<class UClass>                   CharacterClass;                                    // 0x0000(0x0028)(ConstParm, Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMarinerSkinCollectionDataAsset> ReturnValue;                                       // 0x0028(0x0028)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MangoPlayerManager_GetEquippedSkinForLocalProfile) == 0x000008, "Wrong alignment on MangoPlayerManager_GetEquippedSkinForLocalProfile");
static_assert(sizeof(MangoPlayerManager_GetEquippedSkinForLocalProfile) == 0x000050, "Wrong size on MangoPlayerManager_GetEquippedSkinForLocalProfile");
static_assert(offsetof(MangoPlayerManager_GetEquippedSkinForLocalProfile, CharacterClass) == 0x000000, "Member 'MangoPlayerManager_GetEquippedSkinForLocalProfile::CharacterClass' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetEquippedSkinForLocalProfile, ReturnValue) == 0x000028, "Member 'MangoPlayerManager_GetEquippedSkinForLocalProfile::ReturnValue' has a wrong offset!");

// Function Mariner.MangoPlayerManager.GetEquippedSkinForProfile
// 0x0330 (0x0330 - 0x0000)
struct MangoPlayerManager_GetEquippedSkinForProfile final
{
public:
	struct FMangoProfile                          InProfile;                                         // 0x0000(0x02E0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   CharacterClass;                                    // 0x02E0(0x0028)(ConstParm, Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMarinerSkinCollectionDataAsset> ReturnValue;                                       // 0x0308(0x0028)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MangoPlayerManager_GetEquippedSkinForProfile) == 0x000008, "Wrong alignment on MangoPlayerManager_GetEquippedSkinForProfile");
static_assert(sizeof(MangoPlayerManager_GetEquippedSkinForProfile) == 0x000330, "Wrong size on MangoPlayerManager_GetEquippedSkinForProfile");
static_assert(offsetof(MangoPlayerManager_GetEquippedSkinForProfile, InProfile) == 0x000000, "Member 'MangoPlayerManager_GetEquippedSkinForProfile::InProfile' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetEquippedSkinForProfile, CharacterClass) == 0x0002E0, "Member 'MangoPlayerManager_GetEquippedSkinForProfile::CharacterClass' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetEquippedSkinForProfile, ReturnValue) == 0x000308, "Member 'MangoPlayerManager_GetEquippedSkinForProfile::ReturnValue' has a wrong offset!");

// Function Mariner.MangoPlayerManager.GetItemCurrentLevel
// 0x0058 (0x0058 - 0x0000)
struct MangoPlayerManager_GetItemCurrentLevel final
{
public:
	struct FMangoItem                             InItem;                                            // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0050(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1420[0x4];                                     // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MangoPlayerManager_GetItemCurrentLevel) == 0x000008, "Wrong alignment on MangoPlayerManager_GetItemCurrentLevel");
static_assert(sizeof(MangoPlayerManager_GetItemCurrentLevel) == 0x000058, "Wrong size on MangoPlayerManager_GetItemCurrentLevel");
static_assert(offsetof(MangoPlayerManager_GetItemCurrentLevel, InItem) == 0x000000, "Member 'MangoPlayerManager_GetItemCurrentLevel::InItem' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetItemCurrentLevel, ReturnValue) == 0x000050, "Member 'MangoPlayerManager_GetItemCurrentLevel::ReturnValue' has a wrong offset!");

// Function Mariner.MangoPlayerManager.GetItemCurrentLevelForProfile
// 0x0338 (0x0338 - 0x0000)
struct MangoPlayerManager_GetItemCurrentLevelForProfile final
{
public:
	struct FMangoItem                             OutItem;                                           // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMangoProfile                          Profile;                                           // 0x0050(0x02E0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0330(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1421[0x4];                                     // 0x0334(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MangoPlayerManager_GetItemCurrentLevelForProfile) == 0x000008, "Wrong alignment on MangoPlayerManager_GetItemCurrentLevelForProfile");
static_assert(sizeof(MangoPlayerManager_GetItemCurrentLevelForProfile) == 0x000338, "Wrong size on MangoPlayerManager_GetItemCurrentLevelForProfile");
static_assert(offsetof(MangoPlayerManager_GetItemCurrentLevelForProfile, OutItem) == 0x000000, "Member 'MangoPlayerManager_GetItemCurrentLevelForProfile::OutItem' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetItemCurrentLevelForProfile, Profile) == 0x000050, "Member 'MangoPlayerManager_GetItemCurrentLevelForProfile::Profile' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetItemCurrentLevelForProfile, ReturnValue) == 0x000330, "Member 'MangoPlayerManager_GetItemCurrentLevelForProfile::ReturnValue' has a wrong offset!");

// Function Mariner.MangoPlayerManager.GetItemCurrentProgress
// 0x0058 (0x0058 - 0x0000)
struct MangoPlayerManager_GetItemCurrentProgress final
{
public:
	struct FMangoItem                             InItem;                                            // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0050(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1422[0x4];                                     // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MangoPlayerManager_GetItemCurrentProgress) == 0x000008, "Wrong alignment on MangoPlayerManager_GetItemCurrentProgress");
static_assert(sizeof(MangoPlayerManager_GetItemCurrentProgress) == 0x000058, "Wrong size on MangoPlayerManager_GetItemCurrentProgress");
static_assert(offsetof(MangoPlayerManager_GetItemCurrentProgress, InItem) == 0x000000, "Member 'MangoPlayerManager_GetItemCurrentProgress::InItem' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetItemCurrentProgress, ReturnValue) == 0x000050, "Member 'MangoPlayerManager_GetItemCurrentProgress::ReturnValue' has a wrong offset!");

// Function Mariner.MangoPlayerManager.GetLinkedOriginAccountName
// 0x0010 (0x0010 - 0x0000)
struct MangoPlayerManager_GetLinkedOriginAccountName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MangoPlayerManager_GetLinkedOriginAccountName) == 0x000008, "Wrong alignment on MangoPlayerManager_GetLinkedOriginAccountName");
static_assert(sizeof(MangoPlayerManager_GetLinkedOriginAccountName) == 0x000010, "Wrong size on MangoPlayerManager_GetLinkedOriginAccountName");
static_assert(offsetof(MangoPlayerManager_GetLinkedOriginAccountName, ReturnValue) == 0x000000, "Member 'MangoPlayerManager_GetLinkedOriginAccountName::ReturnValue' has a wrong offset!");

// Function Mariner.MangoPlayerManager.GetLocalProfileOnboardingState
// 0x0004 (0x0004 - 0x0000)
struct MangoPlayerManager_GetLocalProfileOnboardingState final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MangoPlayerManager_GetLocalProfileOnboardingState) == 0x000004, "Wrong alignment on MangoPlayerManager_GetLocalProfileOnboardingState");
static_assert(sizeof(MangoPlayerManager_GetLocalProfileOnboardingState) == 0x000004, "Wrong size on MangoPlayerManager_GetLocalProfileOnboardingState");
static_assert(offsetof(MangoPlayerManager_GetLocalProfileOnboardingState, ReturnValue) == 0x000000, "Member 'MangoPlayerManager_GetLocalProfileOnboardingState::ReturnValue' has a wrong offset!");

// Function Mariner.MangoPlayerManager.GetLocalProfilePlaylistRank
// 0x0044 (0x0044 - 0x0000)
struct MangoPlayerManager_GetLocalProfilePlaylistRank final
{
public:
	struct FGuid                                  InPlaylistId;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPlaylistRank                          OutPlaylistRank;                                   // 0x0010(0x0030)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1423[0x3];                                     // 0x0041(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MangoPlayerManager_GetLocalProfilePlaylistRank) == 0x000004, "Wrong alignment on MangoPlayerManager_GetLocalProfilePlaylistRank");
static_assert(sizeof(MangoPlayerManager_GetLocalProfilePlaylistRank) == 0x000044, "Wrong size on MangoPlayerManager_GetLocalProfilePlaylistRank");
static_assert(offsetof(MangoPlayerManager_GetLocalProfilePlaylistRank, InPlaylistId) == 0x000000, "Member 'MangoPlayerManager_GetLocalProfilePlaylistRank::InPlaylistId' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetLocalProfilePlaylistRank, OutPlaylistRank) == 0x000010, "Member 'MangoPlayerManager_GetLocalProfilePlaylistRank::OutPlaylistRank' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetLocalProfilePlaylistRank, ReturnValue) == 0x000040, "Member 'MangoPlayerManager_GetLocalProfilePlaylistRank::ReturnValue' has a wrong offset!");

// Function Mariner.MangoPlayerManager.GetMangoId
// 0x0010 (0x0010 - 0x0000)
struct MangoPlayerManager_GetMangoId final
{
public:
	struct FMangoId                               ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MangoPlayerManager_GetMangoId) == 0x000008, "Wrong alignment on MangoPlayerManager_GetMangoId");
static_assert(sizeof(MangoPlayerManager_GetMangoId) == 0x000010, "Wrong size on MangoPlayerManager_GetMangoId");
static_assert(offsetof(MangoPlayerManager_GetMangoId, ReturnValue) == 0x000000, "Member 'MangoPlayerManager_GetMangoId::ReturnValue' has a wrong offset!");

// Function Mariner.MangoPlayerManager.GetMangoProfile
// 0x02E0 (0x02E0 - 0x0000)
struct MangoPlayerManager_GetMangoProfile final
{
public:
	struct FMangoProfile                          ReturnValue;                                       // 0x0000(0x02E0)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MangoPlayerManager_GetMangoProfile) == 0x000008, "Wrong alignment on MangoPlayerManager_GetMangoProfile");
static_assert(sizeof(MangoPlayerManager_GetMangoProfile) == 0x0002E0, "Wrong size on MangoPlayerManager_GetMangoProfile");
static_assert(offsetof(MangoPlayerManager_GetMangoProfile, ReturnValue) == 0x000000, "Member 'MangoPlayerManager_GetMangoProfile::ReturnValue' has a wrong offset!");

// Function Mariner.MangoPlayerManager.GetMangoProfileLastMatch
// 0x0070 (0x0070 - 0x0000)
struct MangoPlayerManager_GetMangoProfileLastMatch final
{
public:
	struct FMatchEnd                              OutMatchEnd;                                       // 0x0000(0x0068)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1424[0x7];                                     // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MangoPlayerManager_GetMangoProfileLastMatch) == 0x000008, "Wrong alignment on MangoPlayerManager_GetMangoProfileLastMatch");
static_assert(sizeof(MangoPlayerManager_GetMangoProfileLastMatch) == 0x000070, "Wrong size on MangoPlayerManager_GetMangoProfileLastMatch");
static_assert(offsetof(MangoPlayerManager_GetMangoProfileLastMatch, OutMatchEnd) == 0x000000, "Member 'MangoPlayerManager_GetMangoProfileLastMatch::OutMatchEnd' has a wrong offset!");
static_assert(offsetof(MangoPlayerManager_GetMangoProfileLastMatch, ReturnValue) == 0x000068, "Member 'MangoPlayerManager_GetMangoProfileLastMatch::ReturnValue' has a wrong offset!");

// Function Mariner.MangoPlayerManager.GetNewsViewed
// 0x0010 (0x0010 - 0x0000)
struct MangoPlayerManager_GetNewsViewed final
{
public:
	TArray<struct FGuid>                          OutNewsIds;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MangoPlayerManager_GetNewsViewed) == 0x000008, "Wrong alignment on MangoPlayerManager_GetNewsViewed");
static_assert(sizeof(MangoPlayerManager_GetNewsViewed) == 0x000010, "Wrong size on MangoPlayerManager_GetNewsViewed");
static_assert(offsetof(MangoPlayerManager_GetNewsViewed, OutNewsIds) == 0x000000, "Member 'MangoPlayerManager_GetNewsViewed::OutNewsIds' has a wrong offset!");

// Function Mariner.MangoPlayerManager.IsActiveBlastPassAtMaxTier
// 0x0001 (0x0001 - 0x0000)
struct MangoPlayerManager_IsActiveBlastPassAtMaxTier final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MangoPlayerManager_IsActiveBlastPassAtMaxTier) == 0x000001, "Wrong alignment on MangoPlayerManager_IsActiveBlastPassAtMaxTier");
static_assert(sizeof(MangoPlayerManager_IsActiveBlastPassAtMaxTier) == 0x000001, "Wrong size on MangoPlayerManager_IsActiveBlastPassAtMaxTier");
static_assert(offsetof(MangoPlayerManager_IsActiveBlastPassAtMaxTier, ReturnValue) == 0x000000, "Member 'MangoPlayerManager_IsActiveBlastPassAtMaxTier::ReturnValue' has a wrong offset!");

// Function Mariner.MangoPlayerManager.IsActiveBlastPassSplashViewed
// 0x0001 (0x0001 - 0x0000)
struct MangoPlayerManager_IsActiveBlastPassSplashViewed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MangoPlayerManager_IsActiveBlastPassSplashViewed) == 0x000001, "Wrong alignment on MangoPlayerManager_IsActiveBlastPassSplashViewed");
static_assert(sizeof(MangoPlayerManager_IsActiveBlastPassSplashViewed) == 0x000001, "Wrong size on MangoPlayerManager_IsActiveBlastPassSplashViewed");
static_assert(offsetof(MangoPlayerManager_IsActiveBlastPassSplashViewed, ReturnValue) == 0x000000, "Member 'MangoPlayerManager_IsActiveBlastPassSplashViewed::ReturnValue' has a wrong offset!");

// Function Mariner.MangoPlayerManager.IsLocalProfileAdvertStateActive
// 0x0001 (0x0001 - 0x0000)
struct MangoPlayerManager_IsLocalProfileAdvertStateActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MangoPlayerManager_IsLocalProfileAdvertStateActive) == 0x000001, "Wrong alignment on MangoPlayerManager_IsLocalProfileAdvertStateActive");
static_assert(sizeof(MangoPlayerManager_IsLocalProfileAdvertStateActive) == 0x000001, "Wrong size on MangoPlayerManager_IsLocalProfileAdvertStateActive");
static_assert(offsetof(MangoPlayerManager_IsLocalProfileAdvertStateActive, ReturnValue) == 0x000000, "Member 'MangoPlayerManager_IsLocalProfileAdvertStateActive::ReturnValue' has a wrong offset!");

// Function Mariner.MangoPlayerManager.IsLocalProfileOnboardingActive
// 0x0001 (0x0001 - 0x0000)
struct MangoPlayerManager_IsLocalProfileOnboardingActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MangoPlayerManager_IsLocalProfileOnboardingActive) == 0x000001, "Wrong alignment on MangoPlayerManager_IsLocalProfileOnboardingActive");
static_assert(sizeof(MangoPlayerManager_IsLocalProfileOnboardingActive) == 0x000001, "Wrong size on MangoPlayerManager_IsLocalProfileOnboardingActive");
static_assert(offsetof(MangoPlayerManager_IsLocalProfileOnboardingActive, ReturnValue) == 0x000000, "Member 'MangoPlayerManager_IsLocalProfileOnboardingActive::ReturnValue' has a wrong offset!");

// Function Mariner.MarinerUserWidget.PlayAudio
// 0x0008 (0x0008 - 0x0000)
struct MarinerUserWidget_PlayAudio final
{
public:
	class UAkAudioEvent*                          Event;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MarinerUserWidget_PlayAudio) == 0x000008, "Wrong alignment on MarinerUserWidget_PlayAudio");
static_assert(sizeof(MarinerUserWidget_PlayAudio) == 0x000008, "Wrong size on MarinerUserWidget_PlayAudio");
static_assert(offsetof(MarinerUserWidget_PlayAudio, Event) == 0x000000, "Member 'MarinerUserWidget_PlayAudio::Event' has a wrong offset!");

// Function Mariner.MarinerUserWidget.PlayManagedAnimation
// 0x0020 (0x0020 - 0x0000)
struct MarinerUserWidget_PlayManagedAnimation final
{
public:
	class UWidgetAnimation*                       InAnimation;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartAtTime;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumLoopsToPlay;                                    // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUMGSequencePlayMode                          PlayMode;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_142A[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlaybackSpeed;                                     // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUMGSequencePlayer*                     ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MarinerUserWidget_PlayManagedAnimation) == 0x000008, "Wrong alignment on MarinerUserWidget_PlayManagedAnimation");
static_assert(sizeof(MarinerUserWidget_PlayManagedAnimation) == 0x000020, "Wrong size on MarinerUserWidget_PlayManagedAnimation");
static_assert(offsetof(MarinerUserWidget_PlayManagedAnimation, InAnimation) == 0x000000, "Member 'MarinerUserWidget_PlayManagedAnimation::InAnimation' has a wrong offset!");
static_assert(offsetof(MarinerUserWidget_PlayManagedAnimation, StartAtTime) == 0x000008, "Member 'MarinerUserWidget_PlayManagedAnimation::StartAtTime' has a wrong offset!");
static_assert(offsetof(MarinerUserWidget_PlayManagedAnimation, NumLoopsToPlay) == 0x00000C, "Member 'MarinerUserWidget_PlayManagedAnimation::NumLoopsToPlay' has a wrong offset!");
static_assert(offsetof(MarinerUserWidget_PlayManagedAnimation, PlayMode) == 0x000010, "Member 'MarinerUserWidget_PlayManagedAnimation::PlayMode' has a wrong offset!");
static_assert(offsetof(MarinerUserWidget_PlayManagedAnimation, PlaybackSpeed) == 0x000014, "Member 'MarinerUserWidget_PlayManagedAnimation::PlaybackSpeed' has a wrong offset!");
static_assert(offsetof(MarinerUserWidget_PlayManagedAnimation, ReturnValue) == 0x000018, "Member 'MarinerUserWidget_PlayManagedAnimation::ReturnValue' has a wrong offset!");

// Function Mariner.MarinerUserWidget.ScrollIntoView
// 0x0001 (0x0001 - 0x0000)
struct MarinerUserWidget_ScrollIntoView final
{
public:
	bool                                          bAnimate;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MarinerUserWidget_ScrollIntoView) == 0x000001, "Wrong alignment on MarinerUserWidget_ScrollIntoView");
static_assert(sizeof(MarinerUserWidget_ScrollIntoView) == 0x000001, "Wrong size on MarinerUserWidget_ScrollIntoView");
static_assert(offsetof(MarinerUserWidget_ScrollIntoView, bAnimate) == 0x000000, "Member 'MarinerUserWidget_ScrollIntoView::bAnimate' has a wrong offset!");

// Function Mariner.MarinerUserWidget.SetActiveInputWidget
// 0x0018 (0x0018 - 0x0000)
struct MarinerUserWidget_SetActiveInputWidget final
{
public:
	TScriptInterface<class IMarinerInputInterface> InputWidget;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          bGiveInputFocus;                                   // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_142B[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MarinerUserWidget_SetActiveInputWidget) == 0x000008, "Wrong alignment on MarinerUserWidget_SetActiveInputWidget");
static_assert(sizeof(MarinerUserWidget_SetActiveInputWidget) == 0x000018, "Wrong size on MarinerUserWidget_SetActiveInputWidget");
static_assert(offsetof(MarinerUserWidget_SetActiveInputWidget, InputWidget) == 0x000000, "Member 'MarinerUserWidget_SetActiveInputWidget::InputWidget' has a wrong offset!");
static_assert(offsetof(MarinerUserWidget_SetActiveInputWidget, bGiveInputFocus) == 0x000010, "Member 'MarinerUserWidget_SetActiveInputWidget::bGiveInputFocus' has a wrong offset!");

// Function Mariner.MarinerUserWidget.SetManagedVisibility
// 0x0002 (0x0002 - 0x0000)
struct MarinerUserWidget_SetManagedVisibility final
{
public:
	EManagedVisibilityState                       InState;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateVisibility                              InVisibility;                                      // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MarinerUserWidget_SetManagedVisibility) == 0x000001, "Wrong alignment on MarinerUserWidget_SetManagedVisibility");
static_assert(sizeof(MarinerUserWidget_SetManagedVisibility) == 0x000002, "Wrong size on MarinerUserWidget_SetManagedVisibility");
static_assert(offsetof(MarinerUserWidget_SetManagedVisibility, InState) == 0x000000, "Member 'MarinerUserWidget_SetManagedVisibility::InState' has a wrong offset!");
static_assert(offsetof(MarinerUserWidget_SetManagedVisibility, InVisibility) == 0x000001, "Member 'MarinerUserWidget_SetManagedVisibility::InVisibility' has a wrong offset!");

// Function Mariner.MarinerUserWidget.GetActiveInputType
// 0x0001 (0x0001 - 0x0000)
struct MarinerUserWidget_GetActiveInputType final
{
public:
	EPlayerInputType                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MarinerUserWidget_GetActiveInputType) == 0x000001, "Wrong alignment on MarinerUserWidget_GetActiveInputType");
static_assert(sizeof(MarinerUserWidget_GetActiveInputType) == 0x000001, "Wrong size on MarinerUserWidget_GetActiveInputType");
static_assert(offsetof(MarinerUserWidget_GetActiveInputType, ReturnValue) == 0x000000, "Member 'MarinerUserWidget_GetActiveInputType::ReturnValue' has a wrong offset!");

// Function Mariner.MarinerUserWidget.GetMarinerGameInstance
// 0x0008 (0x0008 - 0x0000)
struct MarinerUserWidget_GetMarinerGameInstance final
{
public:
	class UMarinerGameInstance*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MarinerUserWidget_GetMarinerGameInstance) == 0x000008, "Wrong alignment on MarinerUserWidget_GetMarinerGameInstance");
static_assert(sizeof(MarinerUserWidget_GetMarinerGameInstance) == 0x000008, "Wrong size on MarinerUserWidget_GetMarinerGameInstance");
static_assert(offsetof(MarinerUserWidget_GetMarinerGameInstance, ReturnValue) == 0x000000, "Member 'MarinerUserWidget_GetMarinerGameInstance::ReturnValue' has a wrong offset!");

// Function Mariner.MarinerUserWidget.GetMenuManager
// 0x0008 (0x0008 - 0x0000)
struct MarinerUserWidget_GetMenuManager final
{
public:
	class UMarinerMenuManager*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MarinerUserWidget_GetMenuManager) == 0x000008, "Wrong alignment on MarinerUserWidget_GetMenuManager");
static_assert(sizeof(MarinerUserWidget_GetMenuManager) == 0x000008, "Wrong size on MarinerUserWidget_GetMenuManager");
static_assert(offsetof(MarinerUserWidget_GetMenuManager, ReturnValue) == 0x000000, "Member 'MarinerUserWidget_GetMenuManager::ReturnValue' has a wrong offset!");

// Function Mariner.MarinerUserWidget.GetOwningLayer
// 0x0008 (0x0008 - 0x0000)
struct MarinerUserWidget_GetOwningLayer final
{
public:
	class UMarinerMenuStackLayer*                 ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MarinerUserWidget_GetOwningLayer) == 0x000008, "Wrong alignment on MarinerUserWidget_GetOwningLayer");
static_assert(sizeof(MarinerUserWidget_GetOwningLayer) == 0x000008, "Wrong size on MarinerUserWidget_GetOwningLayer");
static_assert(offsetof(MarinerUserWidget_GetOwningLayer, ReturnValue) == 0x000000, "Member 'MarinerUserWidget_GetOwningLayer::ReturnValue' has a wrong offset!");

// Function Mariner.MarinerSettingBase.GetBackgroundColor
// 0x0014 (0x0014 - 0x0000)
struct MarinerSettingBase_GetBackgroundColor final
{
public:
	struct FLinearColor                           OutColor;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_142F[0x3];                                     // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MarinerSettingBase_GetBackgroundColor) == 0x000004, "Wrong alignment on MarinerSettingBase_GetBackgroundColor");
static_assert(sizeof(MarinerSettingBase_GetBackgroundColor) == 0x000014, "Wrong size on MarinerSettingBase_GetBackgroundColor");
static_assert(offsetof(MarinerSettingBase_GetBackgroundColor, OutColor) == 0x000000, "Member 'MarinerSettingBase_GetBackgroundColor::OutColor' has a wrong offset!");
static_assert(offsetof(MarinerSettingBase_GetBackgroundColor, ReturnValue) == 0x000010, "Member 'MarinerSettingBase_GetBackgroundColor::ReturnValue' has a wrong offset!");

// Function Mariner.MarinerSettingBase.GetLabelColor
// 0x0014 (0x0014 - 0x0000)
struct MarinerSettingBase_GetLabelColor final
{
public:
	struct FLinearColor                           OutColor;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1430[0x3];                                     // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MarinerSettingBase_GetLabelColor) == 0x000004, "Wrong alignment on MarinerSettingBase_GetLabelColor");
static_assert(sizeof(MarinerSettingBase_GetLabelColor) == 0x000014, "Wrong size on MarinerSettingBase_GetLabelColor");
static_assert(offsetof(MarinerSettingBase_GetLabelColor, OutColor) == 0x000000, "Member 'MarinerSettingBase_GetLabelColor::OutColor' has a wrong offset!");
static_assert(offsetof(MarinerSettingBase_GetLabelColor, ReturnValue) == 0x000010, "Member 'MarinerSettingBase_GetLabelColor::ReturnValue' has a wrong offset!");

// Function Mariner.MarinerSettingBase.SetIsInteractable
// 0x0001 (0x0001 - 0x0000)
struct MarinerSettingBase_SetIsInteractable final
{
public:
	bool                                          bInIsInteractable;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MarinerSettingBase_SetIsInteractable) == 0x000001, "Wrong alignment on MarinerSettingBase_SetIsInteractable");
static_assert(sizeof(MarinerSettingBase_SetIsInteractable) == 0x000001, "Wrong size on MarinerSettingBase_SetIsInteractable");
static_assert(offsetof(MarinerSettingBase_SetIsInteractable, bInIsInteractable) == 0x000000, "Member 'MarinerSettingBase_SetIsInteractable::bInIsInteractable' has a wrong offset!");

// Function Mariner.MarinerSettingBase.SetLabel
// 0x0018 (0x0018 - 0x0000)
struct MarinerSettingBase_SetLabel final
{
public:
	class FText                                   LabelIn;                                           // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MarinerSettingBase_SetLabel) == 0x000008, "Wrong alignment on MarinerSettingBase_SetLabel");
static_assert(sizeof(MarinerSettingBase_SetLabel) == 0x000018, "Wrong size on MarinerSettingBase_SetLabel");
static_assert(offsetof(MarinerSettingBase_SetLabel, LabelIn) == 0x000000, "Member 'MarinerSettingBase_SetLabel::LabelIn' has a wrong offset!");

// Function Mariner.MarinerSettingBase.SetLabelPlatform
// 0x0078 (0x0078 - 0x0000)
struct MarinerSettingBase_SetLabelPlatform final
{
public:
	struct FMarinerPlatformText                   LabelIn;                                           // 0x0000(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
