#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MarinerSoundBlueprintUtilities

#include "Basic.hpp"


namespace SDK::Params
{

// Function MarinerSoundBlueprintUtilities.MarinerSoundBlueprintUtilities_C.StartLevelSound
// 0x0018 (0x0018 - 0x0000)
struct MarinerSoundBlueprintUtilities_C_StartLevelSound final
{
public:
	class FName                                   AreaName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          GameInstance;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MarinerSoundBlueprintUtilities_C_StartLevelSound) == 0x000008, "Wrong alignment on MarinerSoundBlueprintUtilities_C_StartLevelSound");
static_assert(sizeof(MarinerSoundBlueprintUtilities_C_StartLevelSound) == 0x000018, "Wrong size on MarinerSoundBlueprintUtilities_C_StartLevelSound");
static_assert(offsetof(MarinerSoundBlueprintUtilities_C_StartLevelSound, AreaName) == 0x000000, "Member 'MarinerSoundBlueprintUtilities_C_StartLevelSound::AreaName' has a wrong offset!");
static_assert(offsetof(MarinerSoundBlueprintUtilities_C_StartLevelSound, GameInstance) == 0x000008, "Member 'MarinerSoundBlueprintUtilities_C_StartLevelSound::GameInstance' has a wrong offset!");
static_assert(offsetof(MarinerSoundBlueprintUtilities_C_StartLevelSound, __WorldContext) == 0x000010, "Member 'MarinerSoundBlueprintUtilities_C_StartLevelSound::__WorldContext' has a wrong offset!");

// Function MarinerSoundBlueprintUtilities.MarinerSoundBlueprintUtilities_C.StopLevelSound
// 0x0010 (0x0010 - 0x0000)
struct MarinerSoundBlueprintUtilities_C_StopLevelSound final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MarinerSoundBlueprintUtilities_C_StopLevelSound) == 0x000008, "Wrong alignment on MarinerSoundBlueprintUtilities_C_StopLevelSound");
static_assert(sizeof(MarinerSoundBlueprintUtilities_C_StopLevelSound) == 0x000010, "Wrong size on MarinerSoundBlueprintUtilities_C_StopLevelSound");
static_assert(offsetof(MarinerSoundBlueprintUtilities_C_StopLevelSound, __WorldContext) == 0x000000, "Member 'MarinerSoundBlueprintUtilities_C_StopLevelSound::__WorldContext' has a wrong offset!");
static_assert(offsetof(MarinerSoundBlueprintUtilities_C_StopLevelSound, CallFunc_PostEventAtLocation_ReturnValue) == 0x000008, "Member 'MarinerSoundBlueprintUtilities_C_StopLevelSound::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");

// Function MarinerSoundBlueprintUtilities.MarinerSoundBlueprintUtilities_C.GetMusicManager
// 0x0040 (0x0040 - 0x0000)
struct MarinerSoundBlueprintUtilities_C_GetMusicManager final
{
public:
	class UGameInstance*                          GameInstance;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMusicManager_C*                        MusicManager;                                      // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameInstance*                   K2Node_DynamicCast_AsMariner_Game_Instance;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24AB[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerMusicManager*                   CallFunc_GetMusicManager_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMusicManager_C*                        K2Node_DynamicCast_AsMusic_Manager;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MarinerSoundBlueprintUtilities_C_GetMusicManager) == 0x000008, "Wrong alignment on MarinerSoundBlueprintUtilities_C_GetMusicManager");
static_assert(sizeof(MarinerSoundBlueprintUtilities_C_GetMusicManager) == 0x000040, "Wrong size on MarinerSoundBlueprintUtilities_C_GetMusicManager");
static_assert(offsetof(MarinerSoundBlueprintUtilities_C_GetMusicManager, GameInstance) == 0x000000, "Member 'MarinerSoundBlueprintUtilities_C_GetMusicManager::GameInstance' has a wrong offset!");
static_assert(offsetof(MarinerSoundBlueprintUtilities_C_GetMusicManager, __WorldContext) == 0x000008, "Member 'MarinerSoundBlueprintUtilities_C_GetMusicManager::__WorldContext' has a wrong offset!");
static_assert(offsetof(MarinerSoundBlueprintUtilities_C_GetMusicManager, MusicManager) == 0x000010, "Member 'MarinerSoundBlueprintUtilities_C_GetMusicManager::MusicManager' has a wrong offset!");
static_assert(offsetof(MarinerSoundBlueprintUtilities_C_GetMusicManager, K2Node_DynamicCast_AsMariner_Game_Instance) == 0x000018, "Member 'MarinerSoundBlueprintUtilities_C_GetMusicManager::K2Node_DynamicCast_AsMariner_Game_Instance' has a wrong offset!");
static_assert(offsetof(MarinerSoundBlueprintUtilities_C_GetMusicManager, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'MarinerSoundBlueprintUtilities_C_GetMusicManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MarinerSoundBlueprintUtilities_C_GetMusicManager, CallFunc_GetMusicManager_ReturnValue) == 0x000028, "Member 'MarinerSoundBlueprintUtilities_C_GetMusicManager::CallFunc_GetMusicManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarinerSoundBlueprintUtilities_C_GetMusicManager, K2Node_DynamicCast_AsMusic_Manager) == 0x000030, "Member 'MarinerSoundBlueprintUtilities_C_GetMusicManager::K2Node_DynamicCast_AsMusic_Manager' has a wrong offset!");
static_assert(offsetof(MarinerSoundBlueprintUtilities_C_GetMusicManager, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'MarinerSoundBlueprintUtilities_C_GetMusicManager::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function MarinerSoundBlueprintUtilities.MarinerSoundBlueprintUtilities_C.GetVoiceOverManager
// 0x0038 (0x0038 - 0x0000)
struct MarinerSoundBlueprintUtilities_C_GetVoiceOverManager final
{
public:
	class UGameInstance*                          GameInstance;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerVoiceOverManager*               ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameInstance*                   K2Node_DynamicCast_AsMariner_Game_Instance;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24AC[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerVoiceOverManager*               CallFunc_GetVoiceOverManager_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MarinerSoundBlueprintUtilities_C_GetVoiceOverManager) == 0x000008, "Wrong alignment on MarinerSoundBlueprintUtilities_C_GetVoiceOverManager");
static_assert(sizeof(MarinerSoundBlueprintUtilities_C_GetVoiceOverManager) == 0x000038, "Wrong size on MarinerSoundBlueprintUtilities_C_GetVoiceOverManager");
static_assert(offsetof(MarinerSoundBlueprintUtilities_C_GetVoiceOverManager, GameInstance) == 0x000000, "Member 'MarinerSoundBlueprintUtilities_C_GetVoiceOverManager::GameInstance' has a wrong offset!");
static_assert(offsetof(MarinerSoundBlueprintUtilities_C_GetVoiceOverManager, __WorldContext) == 0x000008, "Member 'MarinerSoundBlueprintUtilities_C_GetVoiceOverManager::__WorldContext' has a wrong offset!");
static_assert(offsetof(MarinerSoundBlueprintUtilities_C_GetVoiceOverManager, ReturnValue) == 0x000010, "Member 'MarinerSoundBlueprintUtilities_C_GetVoiceOverManager::ReturnValue' has a wrong offset!");
static_assert(offsetof(MarinerSoundBlueprintUtilities_C_GetVoiceOverManager, K2Node_DynamicCast_AsMariner_Game_Instance) == 0x000018, "Member 'MarinerSoundBlueprintUtilities_C_GetVoiceOverManager::K2Node_DynamicCast_AsMariner_Game_Instance' has a wrong offset!");
static_assert(offsetof(MarinerSoundBlueprintUtilities_C_GetVoiceOverManager, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'MarinerSoundBlueprintUtilities_C_GetVoiceOverManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MarinerSoundBlueprintUtilities_C_GetVoiceOverManager, CallFunc_GetVoiceOverManager_ReturnValue) == 0x000028, "Member 'MarinerSoundBlueprintUtilities_C_GetVoiceOverManager::CallFunc_GetVoiceOverManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarinerSoundBlueprintUtilities_C_GetVoiceOverManager, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'MarinerSoundBlueprintUtilities_C_GetVoiceOverManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

