#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchmakingActiveMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_structs.hpp"
#include "Mariner_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MatchmakingActiveMenu.MatchmakingActiveMenu_C
// 0x0088 (0x0568 - 0x04E0)
class UMatchmakingActiveMenu_C final : public UMarinerMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       LoadingRockets;                                    // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDefaultPrompt_C*                       CancelPrompt;                                      // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LoadingRocket;                                     // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULoadingSpinner_Matchmaking_C*          LoadingSpinner_Matchmaking;                        // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlaylistName;                                      // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URankWidget_Large_C*                    PlaylistRank;                                      // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RegionText;                                        // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             StatusText;                                        // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AMarinerMainMenuVignettesManager*       VignetteManager;                                   // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   RegionLabel;                                       // 0x0530(0x0018)(Edit, BlueprintVisible)
	class FText                                   Recommended;                                       // 0x0548(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UWidget*                                NewVar_0;                                          // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MatchmakingActiveMenu(int32 EntryPoint);
	void Construct();
	void OnMatchmakingCancelStarted();
	void OnMatchmakingDescribeUpdate(const class FText& Status, bool bHasAcceptedMatch, const class FString& EstimatedWaitTime);
	void BP_OnExited(bool bToSubLayer);
	void BP_OnEntered(bool bFromSubMenu);
	bool HandleInput(EMarinerInputActions InInput);
	void ConfirmCallback(struct FKey& KeyPressed);
	void CancelCallback(struct FKey& KeyPressed);
	void DummyCallback(struct FKey& KeyPressed);
	void HandleMatchmakingRegion();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MatchmakingActiveMenu_C">();
	}
	static class UMatchmakingActiveMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchmakingActiveMenu_C>();
	}
};
static_assert(alignof(UMatchmakingActiveMenu_C) == 0x000008, "Wrong alignment on UMatchmakingActiveMenu_C");
static_assert(sizeof(UMatchmakingActiveMenu_C) == 0x000568, "Wrong size on UMatchmakingActiveMenu_C");
static_assert(offsetof(UMatchmakingActiveMenu_C, UberGraphFrame) == 0x0004E0, "Member 'UMatchmakingActiveMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMatchmakingActiveMenu_C, LoadingRockets) == 0x0004E8, "Member 'UMatchmakingActiveMenu_C::LoadingRockets' has a wrong offset!");
static_assert(offsetof(UMatchmakingActiveMenu_C, CancelPrompt) == 0x0004F0, "Member 'UMatchmakingActiveMenu_C::CancelPrompt' has a wrong offset!");
static_assert(offsetof(UMatchmakingActiveMenu_C, LoadingRocket) == 0x0004F8, "Member 'UMatchmakingActiveMenu_C::LoadingRocket' has a wrong offset!");
static_assert(offsetof(UMatchmakingActiveMenu_C, LoadingSpinner_Matchmaking) == 0x000500, "Member 'UMatchmakingActiveMenu_C::LoadingSpinner_Matchmaking' has a wrong offset!");
static_assert(offsetof(UMatchmakingActiveMenu_C, PlaylistName) == 0x000508, "Member 'UMatchmakingActiveMenu_C::PlaylistName' has a wrong offset!");
static_assert(offsetof(UMatchmakingActiveMenu_C, PlaylistRank) == 0x000510, "Member 'UMatchmakingActiveMenu_C::PlaylistRank' has a wrong offset!");
static_assert(offsetof(UMatchmakingActiveMenu_C, RegionText) == 0x000518, "Member 'UMatchmakingActiveMenu_C::RegionText' has a wrong offset!");
static_assert(offsetof(UMatchmakingActiveMenu_C, StatusText) == 0x000520, "Member 'UMatchmakingActiveMenu_C::StatusText' has a wrong offset!");
static_assert(offsetof(UMatchmakingActiveMenu_C, VignetteManager) == 0x000528, "Member 'UMatchmakingActiveMenu_C::VignetteManager' has a wrong offset!");
static_assert(offsetof(UMatchmakingActiveMenu_C, RegionLabel) == 0x000530, "Member 'UMatchmakingActiveMenu_C::RegionLabel' has a wrong offset!");
static_assert(offsetof(UMatchmakingActiveMenu_C, Recommended) == 0x000548, "Member 'UMatchmakingActiveMenu_C::Recommended' has a wrong offset!");
static_assert(offsetof(UMatchmakingActiveMenu_C, NewVar_0) == 0x000560, "Member 'UMatchmakingActiveMenu_C::NewVar_0' has a wrong offset!");

}

