#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchmakingActiveMenu

#include "Basic.hpp"

#include "MangoClient_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "Mariner_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MatchmakingActiveMenu.MatchmakingActiveMenu_C.ExecuteUbergraph_MatchmakingActiveMenu
// 0x0220 (0x0220 - 0x0000)
struct MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bFromSubMenu;                         // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bToSubLayer;                          // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoMatchmakingManager*               CallFunc_Get_ReturnValue;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMangoCMSManager*                       CallFunc_Get_ReturnValue_1;                        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMangoMatchmakingManager*               CallFunc_Get_ReturnValue_2;                        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSearching_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_GetActiveMatchmakingGuid_ReturnValue;     // 0x002C(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Status;                         // 0x0040(0x0018)(ConstParm)
	bool                                          K2Node_CustomEvent_bHasAcceptedMatch;              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EstimatedWaitTime;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FMangoPlaylist                         CallFunc_FindPlaylist_ReturnValue;                 // 0x0070(0x00F8)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0168(0x0018)()
	class UMangoMatchmakingManager*               CallFunc_Get_ReturnValue_3;                        // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanCancel_ReturnValue;                    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoMatchmakingManager*               CallFunc_Get_ReturnValue_4;                        // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanCancel_ReturnValue_1;                  // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x019C(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x01B0(0x0018)()
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DA[0x2];                                      // 0x01DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FText& Status, bool bHasAcceptedMatch, const class FString& EstimatedWaitTime)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x01DC(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AMarinerMainMenuVignettesManager*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x01F0(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMarinerMainMenuVignettesManager*       CallFunc_Array_Get_Item;                           // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu) == 0x000008, "Wrong alignment on MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu");
static_assert(sizeof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu) == 0x000220, "Wrong size on MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, EntryPoint) == 0x000000, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, Temp_byte_Variable) == 0x000004, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, Temp_byte_Variable_1) == 0x000005, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, Temp_int_Array_Index_Variable) == 0x000008, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, Temp_bool_Variable) == 0x00000C, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, K2Node_Event_bFromSubMenu) == 0x00000D, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::K2Node_Event_bFromSubMenu' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, K2Node_Event_bToSubLayer) == 0x00000E, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::K2Node_Event_bToSubLayer' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, CallFunc_Get_ReturnValue) == 0x000010, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, CallFunc_Get_ReturnValue_1) == 0x000018, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, CallFunc_Get_ReturnValue_2) == 0x000020, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::CallFunc_Get_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, CallFunc_IsSearching_ReturnValue) == 0x000028, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::CallFunc_IsSearching_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, CallFunc_GetActiveMatchmakingGuid_ReturnValue) == 0x00002C, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::CallFunc_GetActiveMatchmakingGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, K2Node_CustomEvent_Status) == 0x000040, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::K2Node_CustomEvent_Status' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, K2Node_CustomEvent_bHasAcceptedMatch) == 0x000058, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::K2Node_CustomEvent_bHasAcceptedMatch' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, K2Node_CustomEvent_EstimatedWaitTime) == 0x000060, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::K2Node_CustomEvent_EstimatedWaitTime' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, CallFunc_FindPlaylist_ReturnValue) == 0x000070, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::CallFunc_FindPlaylist_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, CallFunc_TextToUpper_ReturnValue) == 0x000168, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, CallFunc_Get_ReturnValue_3) == 0x000180, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::CallFunc_Get_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, CallFunc_CanCancel_ReturnValue) == 0x000188, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::CallFunc_CanCancel_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, CallFunc_Get_ReturnValue_4) == 0x000190, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::CallFunc_Get_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, CallFunc_CanCancel_ReturnValue_1) == 0x000198, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::CallFunc_CanCancel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, K2Node_CreateDelegate_OutputDelegate) == 0x00019C, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, K2Node_Select_Default) == 0x0001AC, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, CallFunc_MakeLiteralText_ReturnValue) == 0x0001B0, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, Temp_byte_Variable_2) == 0x0001C8, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, CallFunc_PlayAnimation_ReturnValue) == 0x0001D0, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, Temp_byte_Variable_3) == 0x0001D8, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, Temp_bool_Variable_1) == 0x0001D9, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001DC, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, K2Node_Select_Default_1) == 0x0001EC, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, CallFunc_GetAllActorsOfClass_OutActors) == 0x0001F0, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, Temp_int_Loop_Counter_Variable) == 0x000200, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, CallFunc_Array_Get_Item) == 0x000208, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, CallFunc_Add_IntInt_ReturnValue) == 0x000210, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, CallFunc_Array_Length_ReturnValue) == 0x000214, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu, CallFunc_Less_IntInt_ReturnValue) == 0x000218, "Member 'MatchmakingActiveMenu_C_ExecuteUbergraph_MatchmakingActiveMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function MatchmakingActiveMenu.MatchmakingActiveMenu_C.OnMatchmakingDescribeUpdate
// 0x0030 (0x0030 - 0x0000)
struct MatchmakingActiveMenu_C_OnMatchmakingDescribeUpdate final
{
public:
	class FText                                   Status;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bHasAcceptedMatch;                                 // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 EstimatedWaitTime;                                 // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(MatchmakingActiveMenu_C_OnMatchmakingDescribeUpdate) == 0x000008, "Wrong alignment on MatchmakingActiveMenu_C_OnMatchmakingDescribeUpdate");
static_assert(sizeof(MatchmakingActiveMenu_C_OnMatchmakingDescribeUpdate) == 0x000030, "Wrong size on MatchmakingActiveMenu_C_OnMatchmakingDescribeUpdate");
static_assert(offsetof(MatchmakingActiveMenu_C_OnMatchmakingDescribeUpdate, Status) == 0x000000, "Member 'MatchmakingActiveMenu_C_OnMatchmakingDescribeUpdate::Status' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_OnMatchmakingDescribeUpdate, bHasAcceptedMatch) == 0x000018, "Member 'MatchmakingActiveMenu_C_OnMatchmakingDescribeUpdate::bHasAcceptedMatch' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_OnMatchmakingDescribeUpdate, EstimatedWaitTime) == 0x000020, "Member 'MatchmakingActiveMenu_C_OnMatchmakingDescribeUpdate::EstimatedWaitTime' has a wrong offset!");

// Function MatchmakingActiveMenu.MatchmakingActiveMenu_C.BP_OnExited
// 0x0001 (0x0001 - 0x0000)
struct MatchmakingActiveMenu_C_BP_OnExited final
{
public:
	bool                                          bToSubLayer;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MatchmakingActiveMenu_C_BP_OnExited) == 0x000001, "Wrong alignment on MatchmakingActiveMenu_C_BP_OnExited");
static_assert(sizeof(MatchmakingActiveMenu_C_BP_OnExited) == 0x000001, "Wrong size on MatchmakingActiveMenu_C_BP_OnExited");
static_assert(offsetof(MatchmakingActiveMenu_C_BP_OnExited, bToSubLayer) == 0x000000, "Member 'MatchmakingActiveMenu_C_BP_OnExited::bToSubLayer' has a wrong offset!");

// Function MatchmakingActiveMenu.MatchmakingActiveMenu_C.BP_OnEntered
// 0x0001 (0x0001 - 0x0000)
struct MatchmakingActiveMenu_C_BP_OnEntered final
{
public:
	bool                                          bFromSubMenu;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MatchmakingActiveMenu_C_BP_OnEntered) == 0x000001, "Wrong alignment on MatchmakingActiveMenu_C_BP_OnEntered");
static_assert(sizeof(MatchmakingActiveMenu_C_BP_OnEntered) == 0x000001, "Wrong size on MatchmakingActiveMenu_C_BP_OnEntered");
static_assert(offsetof(MatchmakingActiveMenu_C_BP_OnEntered, bFromSubMenu) == 0x000000, "Member 'MatchmakingActiveMenu_C_BP_OnEntered::bFromSubMenu' has a wrong offset!");

// Function MatchmakingActiveMenu.MatchmakingActiveMenu_C.HandleInput
// 0x01D0 (0x01D0 - 0x0000)
struct MatchmakingActiveMenu_C_HandleInput final
{
public:
	EMarinerInputActions                          InInput;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HandleInput_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMarinerInputActions                          CallFunc_GetInputAction_ReturnValue;               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FKey& KeyPressed)>      K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoMatchmakingManager*               CallFunc_Get_ReturnValue;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanCancel_ReturnValue;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FKey& KeyPressed)>      K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(struct FKey& KeyPressed)>      K2Node_CreateDelegate_OutputDelegate_2;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMarinerMessageBoxData                 K2Node_MakeStruct_MarinerMessageBoxData;           // 0x0050(0x0170)(ContainsInstancedReference)
	class UMarinerGameInstance*                   K2Node_DynamicCast_AsMariner_Game_Instance;        // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MatchmakingActiveMenu_C_HandleInput) == 0x000008, "Wrong alignment on MatchmakingActiveMenu_C_HandleInput");
static_assert(sizeof(MatchmakingActiveMenu_C_HandleInput) == 0x0001D0, "Wrong size on MatchmakingActiveMenu_C_HandleInput");
static_assert(offsetof(MatchmakingActiveMenu_C_HandleInput, InInput) == 0x000000, "Member 'MatchmakingActiveMenu_C_HandleInput::InInput' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_HandleInput, ReturnValue) == 0x000001, "Member 'MatchmakingActiveMenu_C_HandleInput::ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_HandleInput, CallFunc_HandleInput_ReturnValue) == 0x000002, "Member 'MatchmakingActiveMenu_C_HandleInput::CallFunc_HandleInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_HandleInput, CallFunc_GetInputAction_ReturnValue) == 0x000003, "Member 'MatchmakingActiveMenu_C_HandleInput::CallFunc_GetInputAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_HandleInput, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'MatchmakingActiveMenu_C_HandleInput::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_HandleInput, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000014, "Member 'MatchmakingActiveMenu_C_HandleInput::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_HandleInput, CallFunc_Get_ReturnValue) == 0x000018, "Member 'MatchmakingActiveMenu_C_HandleInput::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_HandleInput, CallFunc_CanCancel_ReturnValue) == 0x000020, "Member 'MatchmakingActiveMenu_C_HandleInput::CallFunc_CanCancel_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_HandleInput, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'MatchmakingActiveMenu_C_HandleInput::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_HandleInput, K2Node_CreateDelegate_OutputDelegate_2) == 0x000034, "Member 'MatchmakingActiveMenu_C_HandleInput::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_HandleInput, CallFunc_GetGameInstance_ReturnValue) == 0x000048, "Member 'MatchmakingActiveMenu_C_HandleInput::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_HandleInput, K2Node_MakeStruct_MarinerMessageBoxData) == 0x000050, "Member 'MatchmakingActiveMenu_C_HandleInput::K2Node_MakeStruct_MarinerMessageBoxData' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_HandleInput, K2Node_DynamicCast_AsMariner_Game_Instance) == 0x0001C0, "Member 'MatchmakingActiveMenu_C_HandleInput::K2Node_DynamicCast_AsMariner_Game_Instance' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_HandleInput, K2Node_DynamicCast_bSuccess) == 0x0001C8, "Member 'MatchmakingActiveMenu_C_HandleInput::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function MatchmakingActiveMenu.MatchmakingActiveMenu_C.ConfirmCallback
// 0x0020 (0x0020 - 0x0000)
struct MatchmakingActiveMenu_C_ConfirmCallback final
{
public:
	struct FKey                                   KeyPressed;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	class UMangoMatchmakingManager*               CallFunc_Get_ReturnValue;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MatchmakingActiveMenu_C_ConfirmCallback) == 0x000008, "Wrong alignment on MatchmakingActiveMenu_C_ConfirmCallback");
static_assert(sizeof(MatchmakingActiveMenu_C_ConfirmCallback) == 0x000020, "Wrong size on MatchmakingActiveMenu_C_ConfirmCallback");
static_assert(offsetof(MatchmakingActiveMenu_C_ConfirmCallback, KeyPressed) == 0x000000, "Member 'MatchmakingActiveMenu_C_ConfirmCallback::KeyPressed' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_ConfirmCallback, CallFunc_Get_ReturnValue) == 0x000018, "Member 'MatchmakingActiveMenu_C_ConfirmCallback::CallFunc_Get_ReturnValue' has a wrong offset!");

// Function MatchmakingActiveMenu.MatchmakingActiveMenu_C.CancelCallback
// 0x0018 (0x0018 - 0x0000)
struct MatchmakingActiveMenu_C_CancelCallback final
{
public:
	struct FKey                                   KeyPressed;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(MatchmakingActiveMenu_C_CancelCallback) == 0x000008, "Wrong alignment on MatchmakingActiveMenu_C_CancelCallback");
static_assert(sizeof(MatchmakingActiveMenu_C_CancelCallback) == 0x000018, "Wrong size on MatchmakingActiveMenu_C_CancelCallback");
static_assert(offsetof(MatchmakingActiveMenu_C_CancelCallback, KeyPressed) == 0x000000, "Member 'MatchmakingActiveMenu_C_CancelCallback::KeyPressed' has a wrong offset!");

// Function MatchmakingActiveMenu.MatchmakingActiveMenu_C.DummyCallback
// 0x0018 (0x0018 - 0x0000)
struct MatchmakingActiveMenu_C_DummyCallback final
{
public:
	struct FKey                                   KeyPressed;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(MatchmakingActiveMenu_C_DummyCallback) == 0x000008, "Wrong alignment on MatchmakingActiveMenu_C_DummyCallback");
static_assert(sizeof(MatchmakingActiveMenu_C_DummyCallback) == 0x000018, "Wrong size on MatchmakingActiveMenu_C_DummyCallback");
static_assert(offsetof(MatchmakingActiveMenu_C_DummyCallback, KeyPressed) == 0x000000, "Member 'MatchmakingActiveMenu_C_DummyCallback::KeyPressed' has a wrong offset!");

// Function MatchmakingActiveMenu.MatchmakingActiveMenu_C.HandleMatchmakingRegion
// 0x01C0 (0x01C0 - 0x0000)
struct MatchmakingActiveMenu_C_HandleMatchmakingRegion final
{
public:
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0000(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0040(0x0018)()
	class UMangoQOSManager*                       CallFunc_Get_ReturnValue;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0060(0x0040)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetRecommendedMatchmakingRegion_ReturnValue; // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UMangoMatchmakingManager*               CallFunc_Get_ReturnValue_1;                        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetActiveMatchmakingRegion_ReturnValue;   // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FindTextInLocalizationTable_OutText;      // 0x00D0(0x0018)()
	bool                                          CallFunc_FindTextInLocalizationTable_ReturnValue;  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00F0(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0130(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0170(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0180(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0190(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01A8(0x0018)()
};
static_assert(alignof(MatchmakingActiveMenu_C_HandleMatchmakingRegion) == 0x000008, "Wrong alignment on MatchmakingActiveMenu_C_HandleMatchmakingRegion");
static_assert(sizeof(MatchmakingActiveMenu_C_HandleMatchmakingRegion) == 0x0001C0, "Wrong size on MatchmakingActiveMenu_C_HandleMatchmakingRegion");
static_assert(offsetof(MatchmakingActiveMenu_C_HandleMatchmakingRegion, K2Node_MakeStruct_FormatArgumentData) == 0x000000, "Member 'MatchmakingActiveMenu_C_HandleMatchmakingRegion::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(MatchmakingActiveMenu_C_HandleMatchmakingRegion, CallFunc_GetEmptyText_ReturnValue) == 0x000040, "Member 'MatchmakingActiveMenu_C_HandleMatchmakingRegion::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
