#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchmakingIntermissionMenu

#include "Basic.hpp"

#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function MatchmakingIntermissionMenu.MatchmakingIntermissionMenu_C.ExecuteUbergraph_MatchmakingIntermissionMenu
// 0x0008 (0x0008 - 0x0000)
struct MatchmakingIntermissionMenu_C_ExecuteUbergraph_MatchmakingIntermissionMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFromSubMenu;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MatchmakingIntermissionMenu_C_ExecuteUbergraph_MatchmakingIntermissionMenu) == 0x000004, "Wrong alignment on MatchmakingIntermissionMenu_C_ExecuteUbergraph_MatchmakingIntermissionMenu");
static_assert(sizeof(MatchmakingIntermissionMenu_C_ExecuteUbergraph_MatchmakingIntermissionMenu) == 0x000008, "Wrong size on MatchmakingIntermissionMenu_C_ExecuteUbergraph_MatchmakingIntermissionMenu");
static_assert(offsetof(MatchmakingIntermissionMenu_C_ExecuteUbergraph_MatchmakingIntermissionMenu, EntryPoint) == 0x000000, "Member 'MatchmakingIntermissionMenu_C_ExecuteUbergraph_MatchmakingIntermissionMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(MatchmakingIntermissionMenu_C_ExecuteUbergraph_MatchmakingIntermissionMenu, K2Node_Event_bFromSubMenu) == 0x000004, "Member 'MatchmakingIntermissionMenu_C_ExecuteUbergraph_MatchmakingIntermissionMenu::K2Node_Event_bFromSubMenu' has a wrong offset!");

// Function MatchmakingIntermissionMenu.MatchmakingIntermissionMenu_C.BP_OnEntered
// 0x0001 (0x0001 - 0x0000)
struct MatchmakingIntermissionMenu_C_BP_OnEntered final
{
public:
	bool                                          bFromSubMenu;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MatchmakingIntermissionMenu_C_BP_OnEntered) == 0x000001, "Wrong alignment on MatchmakingIntermissionMenu_C_BP_OnEntered");
static_assert(sizeof(MatchmakingIntermissionMenu_C_BP_OnEntered) == 0x000001, "Wrong size on MatchmakingIntermissionMenu_C_BP_OnEntered");
static_assert(offsetof(MatchmakingIntermissionMenu_C_BP_OnEntered, bFromSubMenu) == 0x000000, "Member 'MatchmakingIntermissionMenu_C_BP_OnEntered::bFromSubMenu' has a wrong offset!");

// Function MatchmakingIntermissionMenu.MatchmakingIntermissionMenu_C.UpdatePrompts
// 0x0128 (0x0128 - 0x0000)
struct MatchmakingIntermissionMenu_C_UpdatePrompts final
{
public:
	bool                                          CallFunc_CanCancelIntermission_CanCancel;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMarinerPromptData                     K2Node_MakeStruct_MarinerPromptData;               // 0x0008(0x0118)()
	bool                                          CallFunc_AddHostPrompt_ReturnValue;                // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ClearHostPrompts_ReturnValue;             // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MatchmakingIntermissionMenu_C_UpdatePrompts) == 0x000008, "Wrong alignment on MatchmakingIntermissionMenu_C_UpdatePrompts");
static_assert(sizeof(MatchmakingIntermissionMenu_C_UpdatePrompts) == 0x000128, "Wrong size on MatchmakingIntermissionMenu_C_UpdatePrompts");
static_assert(offsetof(MatchmakingIntermissionMenu_C_UpdatePrompts, CallFunc_CanCancelIntermission_CanCancel) == 0x000000, "Member 'MatchmakingIntermissionMenu_C_UpdatePrompts::CallFunc_CanCancelIntermission_CanCancel' has a wrong offset!");
static_assert(offsetof(MatchmakingIntermissionMenu_C_UpdatePrompts, K2Node_MakeStruct_MarinerPromptData) == 0x000008, "Member 'MatchmakingIntermissionMenu_C_UpdatePrompts::K2Node_MakeStruct_MarinerPromptData' has a wrong offset!");
static_assert(offsetof(MatchmakingIntermissionMenu_C_UpdatePrompts, CallFunc_AddHostPrompt_ReturnValue) == 0x000120, "Member 'MatchmakingIntermissionMenu_C_UpdatePrompts::CallFunc_AddHostPrompt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchmakingIntermissionMenu_C_UpdatePrompts, CallFunc_ClearHostPrompts_ReturnValue) == 0x000121, "Member 'MatchmakingIntermissionMenu_C_UpdatePrompts::CallFunc_ClearHostPrompts_ReturnValue' has a wrong offset!");

// Function MatchmakingIntermissionMenu.MatchmakingIntermissionMenu_C.HandleInput
// 0x0010 (0x0010 - 0x0000)
struct MatchmakingIntermissionMenu_C_HandleInput final
{
public:
	EMarinerInputActions                          InInput;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanCancelIntermission_CanCancel;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HandleInput_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoMatchmakingManager*               CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MatchmakingIntermissionMenu_C_HandleInput) == 0x000008, "Wrong alignment on MatchmakingIntermissionMenu_C_HandleInput");
static_assert(sizeof(MatchmakingIntermissionMenu_C_HandleInput) == 0x000010, "Wrong size on MatchmakingIntermissionMenu_C_HandleInput");
static_assert(offsetof(MatchmakingIntermissionMenu_C_HandleInput, InInput) == 0x000000, "Member 'MatchmakingIntermissionMenu_C_HandleInput::InInput' has a wrong offset!");
static_assert(offsetof(MatchmakingIntermissionMenu_C_HandleInput, ReturnValue) == 0x000001, "Member 'MatchmakingIntermissionMenu_C_HandleInput::ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchmakingIntermissionMenu_C_HandleInput, CallFunc_CanCancelIntermission_CanCancel) == 0x000002, "Member 'MatchmakingIntermissionMenu_C_HandleInput::CallFunc_CanCancelIntermission_CanCancel' has a wrong offset!");
static_assert(offsetof(MatchmakingIntermissionMenu_C_HandleInput, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000003, "Member 'MatchmakingIntermissionMenu_C_HandleInput::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchmakingIntermissionMenu_C_HandleInput, CallFunc_HandleInput_ReturnValue) == 0x000004, "Member 'MatchmakingIntermissionMenu_C_HandleInput::CallFunc_HandleInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchmakingIntermissionMenu_C_HandleInput, CallFunc_BooleanAND_ReturnValue) == 0x000005, "Member 'MatchmakingIntermissionMenu_C_HandleInput::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchmakingIntermissionMenu_C_HandleInput, CallFunc_Get_ReturnValue) == 0x000008, "Member 'MatchmakingIntermissionMenu_C_HandleInput::CallFunc_Get_ReturnValue' has a wrong offset!");

// Function MatchmakingIntermissionMenu.MatchmakingIntermissionMenu_C.CanCancelIntermission
// 0x0018 (0x0018 - 0x0000)
struct MatchmakingIntermissionMenu_C_CanCancelIntermission final
{
public:
	bool                                          CanCancel;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoPartyManager*                     CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreWePartyLeader_ReturnValue;             // 0x0010(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MatchmakingIntermissionMenu_C_CanCancelIntermission) == 0x000008, "Wrong alignment on MatchmakingIntermissionMenu_C_CanCancelIntermission");
static_assert(sizeof(MatchmakingIntermissionMenu_C_CanCancelIntermission) == 0x000018, "Wrong size on MatchmakingIntermissionMenu_C_CanCancelIntermission");
static_assert(offsetof(MatchmakingIntermissionMenu_C_CanCancelIntermission, CanCancel) == 0x000000, "Member 'MatchmakingIntermissionMenu_C_CanCancelIntermission::CanCancel' has a wrong offset!");
static_assert(offsetof(MatchmakingIntermissionMenu_C_CanCancelIntermission, CallFunc_Get_ReturnValue) == 0x000008, "Member 'MatchmakingIntermissionMenu_C_CanCancelIntermission::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchmakingIntermissionMenu_C_CanCancelIntermission, CallFunc_AreWePartyLeader_ReturnValue) == 0x000010, "Member 'MatchmakingIntermissionMenu_C_CanCancelIntermission::CallFunc_AreWePartyLeader_ReturnValue' has a wrong offset!");

}

