#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MegaBlastCutomizationHandler

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MegaBlastCutomizationHandler.MegaBlastCutomizationHandler_C
// 0x0028 (0x0240 - 0x0218)
class AMegaBlastCutomizationHandler_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0218(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               MegaBlastEmitterComponent;                         // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MegaBlastCutomizationHandler(int32 EntryPoint);
	void BndEvt__MegaBlastEmitterComponent_K2Node_ComponentBoundEvent_0_ParticleSpawnSignature__DelegateSignature(class FName EventName, float EmitterTime, const struct FVector& Location, const struct FVector& Velocity);
	void ReceiveBeginPlay();
	void SetEmitter(class UParticleSystem* NewEmitter);
	void ClearEmitter();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MegaBlastCutomizationHandler_C">();
	}
	static class AMegaBlastCutomizationHandler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMegaBlastCutomizationHandler_C>();
	}
};
static_assert(alignof(AMegaBlastCutomizationHandler_C) == 0x000008, "Wrong alignment on AMegaBlastCutomizationHandler_C");
static_assert(sizeof(AMegaBlastCutomizationHandler_C) == 0x000240, "Wrong size on AMegaBlastCutomizationHandler_C");
static_assert(offsetof(AMegaBlastCutomizationHandler_C, UberGraphFrame) == 0x000218, "Member 'AMegaBlastCutomizationHandler_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMegaBlastCutomizationHandler_C, SkeletalMesh) == 0x000220, "Member 'AMegaBlastCutomizationHandler_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(AMegaBlastCutomizationHandler_C, Ak) == 0x000228, "Member 'AMegaBlastCutomizationHandler_C::Ak' has a wrong offset!");
static_assert(offsetof(AMegaBlastCutomizationHandler_C, MegaBlastEmitterComponent) == 0x000230, "Member 'AMegaBlastCutomizationHandler_C::MegaBlastEmitterComponent' has a wrong offset!");
static_assert(offsetof(AMegaBlastCutomizationHandler_C, DefaultSceneRoot) == 0x000238, "Member 'AMegaBlastCutomizationHandler_C::DefaultSceneRoot' has a wrong offset!");

}

