#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MegaBlastCutomizationHandler

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MegaBlastCutomizationHandler.MegaBlastCutomizationHandler_C.ExecuteUbergraph_MegaBlastCutomizationHandler
// 0x00B0 (0x00B0 - 0x0000)
struct MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class FName                                   K2Node_ComponentBoundEvent_EventName;              // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_EmitterTime;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_Location;               // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_Velocity;               // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UParticleSystem* ParticleSystem)> K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class UMarinerGameInstance*                   K2Node_DynamicCast_AsMariner_Game_Instance;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuStackLayer*                 CallFunc_GetLayerByClass_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterCustomization_MegaBlasts_C*   K2Node_DynamicCast_AsCharacter_Customization_Mega_Blasts; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0098(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler) == 0x000008, "Wrong alignment on MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler");
static_assert(sizeof(MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler) == 0x0000B0, "Wrong size on MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler");
static_assert(offsetof(MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler, EntryPoint) == 0x000000, "Member 'MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler::EntryPoint' has a wrong offset!");
static_assert(offsetof(MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler, Temp_delegate_Variable) == 0x000004, "Member 'MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler, K2Node_ComponentBoundEvent_EventName) == 0x000014, "Member 'MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler::K2Node_ComponentBoundEvent_EventName' has a wrong offset!");
static_assert(offsetof(MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler, K2Node_ComponentBoundEvent_EmitterTime) == 0x00001C, "Member 'MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler::K2Node_ComponentBoundEvent_EmitterTime' has a wrong offset!");
static_assert(offsetof(MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler, K2Node_ComponentBoundEvent_Location) == 0x000020, "Member 'MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler::K2Node_ComponentBoundEvent_Location' has a wrong offset!");
static_assert(offsetof(MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler, K2Node_ComponentBoundEvent_Velocity) == 0x00002C, "Member 'MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler::K2Node_ComponentBoundEvent_Velocity' has a wrong offset!");
static_assert(offsetof(MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler, CallFunc_GetGameInstance_ReturnValue) == 0x000038, "Member 'MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler, K2Node_DynamicCast_AsMariner_Game_Instance) == 0x000050, "Member 'MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler::K2Node_DynamicCast_AsMariner_Game_Instance' has a wrong offset!");
static_assert(offsetof(MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler, K2Node_CreateDelegate_OutputDelegate_1) == 0x00005C, "Member 'MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler, CallFunc_GetMenuManager_ReturnValue) == 0x000070, "Member 'MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler, CallFunc_GetLayerByClass_ReturnValue) == 0x000078, "Member 'MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler::CallFunc_GetLayerByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler, K2Node_DynamicCast_AsCharacter_Customization_Mega_Blasts) == 0x000088, "Member 'MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler::K2Node_DynamicCast_AsCharacter_Customization_Mega_Blasts' has a wrong offset!");
static_assert(offsetof(MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler, Temp_struct_Variable) == 0x000098, "Member 'MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler, CallFunc_PostAkEvent_ReturnValue) == 0x0000A8, "Member 'MegaBlastCutomizationHandler_C_ExecuteUbergraph_MegaBlastCutomizationHandler::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

// Function MegaBlastCutomizationHandler.MegaBlastCutomizationHandler_C.BndEvt__MegaBlastEmitterComponent_K2Node_ComponentBoundEvent_0_ParticleSpawnSignature__DelegateSignature
// 0x0024 (0x0024 - 0x0000)
struct MegaBlastCutomizationHandler_C_BndEvt__MegaBlastEmitterComponent_K2Node_ComponentBoundEvent_0_ParticleSpawnSignature__DelegateSignature final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmitterTime;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Velocity;                                          // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MegaBlastCutomizationHandler_C_BndEvt__MegaBlastEmitterComponent_K2Node_ComponentBoundEvent_0_ParticleSpawnSignature__DelegateSignature) == 0x000004, "Wrong alignment on MegaBlastCutomizationHandler_C_BndEvt__MegaBlastEmitterComponent_K2Node_ComponentBoundEvent_0_ParticleSpawnSignature__DelegateSignature");
static_assert(sizeof(MegaBlastCutomizationHandler_C_BndEvt__MegaBlastEmitterComponent_K2Node_ComponentBoundEvent_0_ParticleSpawnSignature__DelegateSignature) == 0x000024, "Wrong size on MegaBlastCutomizationHandler_C_BndEvt__MegaBlastEmitterComponent_K2Node_ComponentBoundEvent_0_ParticleSpawnSignature__DelegateSignature");
static_assert(offsetof(MegaBlastCutomizationHandler_C_BndEvt__MegaBlastEmitterComponent_K2Node_ComponentBoundEvent_0_ParticleSpawnSignature__DelegateSignature, EventName) == 0x000000, "Member 'MegaBlastCutomizationHandler_C_BndEvt__MegaBlastEmitterComponent_K2Node_ComponentBoundEvent_0_ParticleSpawnSignature__DelegateSignature::EventName' has a wrong offset!");
static_assert(offsetof(MegaBlastCutomizationHandler_C_BndEvt__MegaBlastEmitterComponent_K2Node_ComponentBoundEvent_0_ParticleSpawnSignature__DelegateSignature, EmitterTime) == 0x000008, "Member 'MegaBlastCutomizationHandler_C_BndEvt__MegaBlastEmitterComponent_K2Node_ComponentBoundEvent_0_ParticleSpawnSignature__DelegateSignature::EmitterTime' has a wrong offset!");
static_assert(offsetof(MegaBlastCutomizationHandler_C_BndEvt__MegaBlastEmitterComponent_K2Node_ComponentBoundEvent_0_ParticleSpawnSignature__DelegateSignature, Location) == 0x00000C, "Member 'MegaBlastCutomizationHandler_C_BndEvt__MegaBlastEmitterComponent_K2Node_ComponentBoundEvent_0_ParticleSpawnSignature__DelegateSignature::Location' has a wrong offset!");
static_assert(offsetof(MegaBlastCutomizationHandler_C_BndEvt__MegaBlastEmitterComponent_K2Node_ComponentBoundEvent_0_ParticleSpawnSignature__DelegateSignature, Velocity) == 0x000018, "Member 'MegaBlastCutomizationHandler_C_BndEvt__MegaBlastEmitterComponent_K2Node_ComponentBoundEvent_0_ParticleSpawnSignature__DelegateSignature::Velocity' has a wrong offset!");

// Function MegaBlastCutomizationHandler.MegaBlastCutomizationHandler_C.SetEmitter
// 0x0050 (0x0050 - 0x0000)
struct MegaBlastCutomizationHandler_C_SetEmitter final
{
public:
	class UParticleSystem*                        NewEmitter;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0028(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GetAkComponent_ComponentCreated;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_GetAkComponent_ReturnValue;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MegaBlastCutomizationHandler_C_SetEmitter) == 0x000008, "Wrong alignment on MegaBlastCutomizationHandler_C_SetEmitter");
static_assert(sizeof(MegaBlastCutomizationHandler_C_SetEmitter) == 0x000050, "Wrong size on MegaBlastCutomizationHandler_C_SetEmitter");
static_assert(offsetof(MegaBlastCutomizationHandler_C_SetEmitter, NewEmitter) == 0x000000, "Member 'MegaBlastCutomizationHandler_C_SetEmitter::NewEmitter' has a wrong offset!");
static_assert(offsetof(MegaBlastCutomizationHandler_C_SetEmitter, Temp_struct_Variable) == 0x000008, "Member 'MegaBlastCutomizationHandler_C_SetEmitter::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(MegaBlastCutomizationHandler_C_SetEmitter, CallFunc_GetDisplayName_ReturnValue) == 0x000018, "Member 'MegaBlastCutomizationHandler_C_SetEmitter::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MegaBlastCutomizationHandler_C_SetEmitter, Temp_delegate_Variable) == 0x000028, "Member 'MegaBlastCutomizationHandler_C_SetEmitter::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(MegaBlastCutomizationHandler_C_SetEmitter, CallFunc_GetAkComponent_ComponentCreated) == 0x000038, "Member 'MegaBlastCutomizationHandler_C_SetEmitter::CallFunc_GetAkComponent_ComponentCreated' has a wrong offset!");
static_assert(offsetof(MegaBlastCutomizationHandler_C_SetEmitter, CallFunc_GetAkComponent_ReturnValue) == 0x000040, "Member 'MegaBlastCutomizationHandler_C_SetEmitter::CallFunc_GetAkComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(MegaBlastCutomizationHandler_C_SetEmitter, CallFunc_PostAkEvent_ReturnValue) == 0x000048, "Member 'MegaBlastCutomizationHandler_C_SetEmitter::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

}

