#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MenuTooltipBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function MenuTooltipBase.MenuTooltipBase_C.ExecuteUbergraph_MenuTooltipBase
// 0x0028 (0x0028 - 0x0000)
struct MenuTooltipBase_C_ExecuteUbergraph_MenuTooltipBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2399[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InDescription;                        // 0x0008(0x0018)(ConstParm)
	bool                                          K2Node_Event_bEnabled;                             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MenuTooltipBase_C_ExecuteUbergraph_MenuTooltipBase) == 0x000008, "Wrong alignment on MenuTooltipBase_C_ExecuteUbergraph_MenuTooltipBase");
static_assert(sizeof(MenuTooltipBase_C_ExecuteUbergraph_MenuTooltipBase) == 0x000028, "Wrong size on MenuTooltipBase_C_ExecuteUbergraph_MenuTooltipBase");
static_assert(offsetof(MenuTooltipBase_C_ExecuteUbergraph_MenuTooltipBase, EntryPoint) == 0x000000, "Member 'MenuTooltipBase_C_ExecuteUbergraph_MenuTooltipBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(MenuTooltipBase_C_ExecuteUbergraph_MenuTooltipBase, K2Node_Event_InDescription) == 0x000008, "Member 'MenuTooltipBase_C_ExecuteUbergraph_MenuTooltipBase::K2Node_Event_InDescription' has a wrong offset!");
static_assert(offsetof(MenuTooltipBase_C_ExecuteUbergraph_MenuTooltipBase, K2Node_Event_bEnabled) == 0x000020, "Member 'MenuTooltipBase_C_ExecuteUbergraph_MenuTooltipBase::K2Node_Event_bEnabled' has a wrong offset!");

// Function MenuTooltipBase.MenuTooltipBase_C.EnableHeader
// 0x0001 (0x0001 - 0x0000)
struct MenuTooltipBase_C_EnableHeader final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MenuTooltipBase_C_EnableHeader) == 0x000001, "Wrong alignment on MenuTooltipBase_C_EnableHeader");
static_assert(sizeof(MenuTooltipBase_C_EnableHeader) == 0x000001, "Wrong size on MenuTooltipBase_C_EnableHeader");
static_assert(offsetof(MenuTooltipBase_C_EnableHeader, bEnabled) == 0x000000, "Member 'MenuTooltipBase_C_EnableHeader::bEnabled' has a wrong offset!");

// Function MenuTooltipBase.MenuTooltipBase_C.Populate
// 0x0018 (0x0018 - 0x0000)
struct MenuTooltipBase_C_Populate final
{
public:
	class FText                                   InDescription;                                     // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(MenuTooltipBase_C_Populate) == 0x000008, "Wrong alignment on MenuTooltipBase_C_Populate");
static_assert(sizeof(MenuTooltipBase_C_Populate) == 0x000018, "Wrong size on MenuTooltipBase_C_Populate");
static_assert(offsetof(MenuTooltipBase_C_Populate, InDescription) == 0x000000, "Member 'MenuTooltipBase_C_Populate::InDescription' has a wrong offset!");

}

