#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MenuTooltipBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MenuTooltipBase.MenuTooltipBase_C
// 0x0018 (0x02C8 - 0x02B0)
class UMenuTooltipBase_C final : public UMarinerMenuTooltipWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTooltipText_C*                         HeaderText;                                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          FullHeaderAllowed;                                 // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         CurrentState;                                      // 0x02C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MenuTooltipBase(int32 EntryPoint);
	void EnableHeader(bool bEnabled);
	void Populate(const class FText& InDescription);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MenuTooltipBase_C">();
	}
	static class UMenuTooltipBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMenuTooltipBase_C>();
	}
};
static_assert(alignof(UMenuTooltipBase_C) == 0x000008, "Wrong alignment on UMenuTooltipBase_C");
static_assert(sizeof(UMenuTooltipBase_C) == 0x0002C8, "Wrong size on UMenuTooltipBase_C");
static_assert(offsetof(UMenuTooltipBase_C, UberGraphFrame) == 0x0002B0, "Member 'UMenuTooltipBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMenuTooltipBase_C, HeaderText) == 0x0002B8, "Member 'UMenuTooltipBase_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UMenuTooltipBase_C, FullHeaderAllowed) == 0x0002C0, "Member 'UMenuTooltipBase_C::FullHeaderAllowed' has a wrong offset!");
static_assert(offsetof(UMenuTooltipBase_C, CurrentState) == 0x0002C1, "Member 'UMenuTooltipBase_C::CurrentState' has a wrong offset!");

}

