#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Merlin_Mythic_Wisp_AnimStateNotify

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Merlin_Mythic_Wisp_AnimStateNotify.Merlin_Mythic_Wisp_AnimStateNotify_C
// 0x0038 (0x0068 - 0x0030)
class UMerlin_Mythic_Wisp_AnimStateNotify_C final : public UAnimNotifyState
{
public:
	TArray<class UMarinerParticleSystemComponent*> Mythic_FX;                                         // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          R_FlamesOnly;                                      // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UseCustomSocket;                                   // 0x0041(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CustomSockets;                                     // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	struct FVector                                Location;                                          // 0x0058(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool Received_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration) const;
	bool Received_NotifyEnd(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation) const;
	bool Received_NotifyTick(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float FrameDeltaTime) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Merlin_Mythic_Wisp_AnimStateNotify_C">();
	}
	static class UMerlin_Mythic_Wisp_AnimStateNotify_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMerlin_Mythic_Wisp_AnimStateNotify_C>();
	}
};
static_assert(alignof(UMerlin_Mythic_Wisp_AnimStateNotify_C) == 0x000008, "Wrong alignment on UMerlin_Mythic_Wisp_AnimStateNotify_C");
static_assert(sizeof(UMerlin_Mythic_Wisp_AnimStateNotify_C) == 0x000068, "Wrong size on UMerlin_Mythic_Wisp_AnimStateNotify_C");
static_assert(offsetof(UMerlin_Mythic_Wisp_AnimStateNotify_C, Mythic_FX) == 0x000030, "Member 'UMerlin_Mythic_Wisp_AnimStateNotify_C::Mythic_FX' has a wrong offset!");
static_assert(offsetof(UMerlin_Mythic_Wisp_AnimStateNotify_C, R_FlamesOnly) == 0x000040, "Member 'UMerlin_Mythic_Wisp_AnimStateNotify_C::R_FlamesOnly' has a wrong offset!");
static_assert(offsetof(UMerlin_Mythic_Wisp_AnimStateNotify_C, UseCustomSocket) == 0x000041, "Member 'UMerlin_Mythic_Wisp_AnimStateNotify_C::UseCustomSocket' has a wrong offset!");
static_assert(offsetof(UMerlin_Mythic_Wisp_AnimStateNotify_C, CustomSockets) == 0x000048, "Member 'UMerlin_Mythic_Wisp_AnimStateNotify_C::CustomSockets' has a wrong offset!");
static_assert(offsetof(UMerlin_Mythic_Wisp_AnimStateNotify_C, Location) == 0x000058, "Member 'UMerlin_Mythic_Wisp_AnimStateNotify_C::Location' has a wrong offset!");

}

