#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Merlin_Mythic_Wisp_AnimStateNotify

#include "Basic.hpp"


namespace SDK::Params
{

// Function Merlin_Mythic_Wisp_AnimStateNotify.Merlin_Mythic_Wisp_AnimStateNotify_C.Received_NotifyBegin
// 0x00A0 (0x00A0 - 0x0000)
struct Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDuration;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EB0[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EB1[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EB2[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EB3[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class FName>                           K2Node_MakeArray_Array_1;                          // 0x0050(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class FName>                           K2Node_Select_Default;                             // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class FName>                           K2Node_Select_Default_1;                           // 0x0070(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EB4[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerParticleSystemComponent*        CallFunc_SpawnMarinerEmitterAttached_ReturnValue;  // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin) == 0x000008, "Wrong alignment on Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin");
static_assert(sizeof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin) == 0x0000A0, "Wrong size on Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin, MeshComp) == 0x000000, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin::MeshComp' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin, Animation) == 0x000008, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin::Animation' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin, TotalDuration) == 0x000010, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin::TotalDuration' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin, ReturnValue) == 0x000014, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin::ReturnValue' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin, Temp_bool_Variable) == 0x000015, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin, CallFunc_GetDisplayName_ReturnValue) == 0x000018, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin, CallFunc_Contains_ReturnValue) == 0x000028, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin, Temp_bool_Variable_1) == 0x000034, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin, K2Node_MakeArray_Array) == 0x000040, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin, K2Node_MakeArray_Array_1) == 0x000050, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin, K2Node_Select_Default) == 0x000060, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin, K2Node_Select_Default_1) == 0x000070, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin, CallFunc_Array_Get_Item) == 0x000084, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin, CallFunc_Less_IntInt_ReturnValue) == 0x00008C, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin, CallFunc_SpawnMarinerEmitterAttached_ReturnValue) == 0x000090, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin::CallFunc_SpawnMarinerEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin, CallFunc_Array_Add_ReturnValue) == 0x000098, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyBegin::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function Merlin_Mythic_Wisp_AnimStateNotify.Merlin_Mythic_Wisp_AnimStateNotify_C.Received_NotifyEnd
// 0x0030 (0x0030 - 0x0000)
struct Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyEnd final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EB5[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerParticleSystemComponent*        CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyEnd) == 0x000008, "Wrong alignment on Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyEnd");
static_assert(sizeof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyEnd) == 0x000030, "Wrong size on Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyEnd");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyEnd, MeshComp) == 0x000000, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyEnd::MeshComp' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyEnd, Animation) == 0x000008, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyEnd::Animation' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyEnd, ReturnValue) == 0x000010, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyEnd::ReturnValue' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyEnd, Temp_int_Array_Index_Variable) == 0x000014, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyEnd::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyEnd, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyEnd::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyEnd, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyEnd::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyEnd, CallFunc_Array_Get_Item) == 0x000020, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyEnd::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyEnd, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyEnd::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyEnd, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyEnd::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyEnd, CallFunc_Less_IntInt_ReturnValue) == 0x00002D, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyEnd::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function Merlin_Mythic_Wisp_AnimStateNotify.Merlin_Mythic_Wisp_AnimStateNotify_C.Received_NotifyTick
// 0x0038 (0x0038 - 0x0000)
struct Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyTick final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FrameDeltaTime;                                    // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EB6[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerParticleSystemComponent*        CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyTick) == 0x000008, "Wrong alignment on Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyTick");
static_assert(sizeof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyTick) == 0x000038, "Wrong size on Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyTick");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyTick, MeshComp) == 0x000000, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyTick::MeshComp' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyTick, Animation) == 0x000008, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyTick::Animation' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyTick, FrameDeltaTime) == 0x000010, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyTick::FrameDeltaTime' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyTick, ReturnValue) == 0x000014, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyTick::ReturnValue' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyTick, Temp_int_Array_Index_Variable) == 0x000018, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyTick::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyTick, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyTick::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyTick, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyTick::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyTick, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyTick::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyTick, CallFunc_Array_Get_Item) == 0x000028, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyTick::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyTick, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyTick::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyTick, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyTick::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyTick, CallFunc_IsActive_ReturnValue) == 0x000032, "Member 'Merlin_Mythic_Wisp_AnimStateNotify_C_Received_NotifyTick::CallFunc_IsActive_ReturnValue' has a wrong offset!");

}

