#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MiniProgressionRewardPreview

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MiniProgressionRewardPreview.MiniProgressionRewardPreview_C
// 0x00E0 (0x3138 - 0x3058)
class UMiniProgressionRewardPreview_C final : public UMarinerRewardPreview
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x3058(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DuplicateItemAnim;                                 // 0x3060(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UnhoveredAnim;                                     // 0x3068(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoveredAnim;                                       // 0x3070(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x3078(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackgroundCollectionColorGradient;                 // 0x3080(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x3088(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ContentStateIcon;                                  // 0x3090(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemFrame;                                         // 0x3098(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemImage;                                         // 0x30A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemRarityPanel;                                   // 0x30A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULoadingSpinner_C*                      LoadingSpinner;                                    // 0x30B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RarityImage;                                       // 0x30B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               RootSizeBox;                                       // 0x30C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FMarinerUIItemButtonData               UIItemButtonData;                                  // 0x30C8(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_MiniProgressionRewardPreview(int32 EntryPoint);
	void PopulateRewardPreview(const struct FMangoReward& Reward);
	void PopulateQuestReward(const struct FMangoQuestReward& Reward);
	void PopulateXP(int32 Xp);
	void PopulateRocketbucks(int32 RocketBucks);
	void PopulateRocketparts(int32 RocketParts);
	void PopulateItem(const struct FMangoItem& Item);
	void PopulateNativeOffer(const struct FMangoNativeOffer& Nativeoffer);
	void PopulateProgressionReward(const struct FMangoReward& Reward);
	void PopulateUIItemData(const struct FMarinerUIItemButtonData& Param_UIItemButtonData);
	void PopulateBPXPBonusPersonal(int32 BonusPct);
	void PopulateBPXPBonusParty(int32 BonusPct);
	void PopulateMangoReward(const struct FMangoReward& MangoReward);

	struct FMarinerLayeredButtonAssets GetAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MiniProgressionRewardPreview_C">();
	}
	static class UMiniProgressionRewardPreview_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMiniProgressionRewardPreview_C>();
	}
};
static_assert(alignof(UMiniProgressionRewardPreview_C) == 0x000008, "Wrong alignment on UMiniProgressionRewardPreview_C");
static_assert(sizeof(UMiniProgressionRewardPreview_C) == 0x003138, "Wrong size on UMiniProgressionRewardPreview_C");
static_assert(offsetof(UMiniProgressionRewardPreview_C, UberGraphFrame) == 0x003058, "Member 'UMiniProgressionRewardPreview_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMiniProgressionRewardPreview_C, DuplicateItemAnim) == 0x003060, "Member 'UMiniProgressionRewardPreview_C::DuplicateItemAnim' has a wrong offset!");
static_assert(offsetof(UMiniProgressionRewardPreview_C, UnhoveredAnim) == 0x003068, "Member 'UMiniProgressionRewardPreview_C::UnhoveredAnim' has a wrong offset!");
static_assert(offsetof(UMiniProgressionRewardPreview_C, HoveredAnim) == 0x003070, "Member 'UMiniProgressionRewardPreview_C::HoveredAnim' has a wrong offset!");
static_assert(offsetof(UMiniProgressionRewardPreview_C, Background) == 0x003078, "Member 'UMiniProgressionRewardPreview_C::Background' has a wrong offset!");
static_assert(offsetof(UMiniProgressionRewardPreview_C, BackgroundCollectionColorGradient) == 0x003080, "Member 'UMiniProgressionRewardPreview_C::BackgroundCollectionColorGradient' has a wrong offset!");
static_assert(offsetof(UMiniProgressionRewardPreview_C, Button) == 0x003088, "Member 'UMiniProgressionRewardPreview_C::Button' has a wrong offset!");
static_assert(offsetof(UMiniProgressionRewardPreview_C, ContentStateIcon) == 0x003090, "Member 'UMiniProgressionRewardPreview_C::ContentStateIcon' has a wrong offset!");
static_assert(offsetof(UMiniProgressionRewardPreview_C, ItemFrame) == 0x003098, "Member 'UMiniProgressionRewardPreview_C::ItemFrame' has a wrong offset!");
static_assert(offsetof(UMiniProgressionRewardPreview_C, ItemImage) == 0x0030A0, "Member 'UMiniProgressionRewardPreview_C::ItemImage' has a wrong offset!");
static_assert(offsetof(UMiniProgressionRewardPreview_C, ItemRarityPanel) == 0x0030A8, "Member 'UMiniProgressionRewardPreview_C::ItemRarityPanel' has a wrong offset!");
static_assert(offsetof(UMiniProgressionRewardPreview_C, LoadingSpinner) == 0x0030B0, "Member 'UMiniProgressionRewardPreview_C::LoadingSpinner' has a wrong offset!");
static_assert(offsetof(UMiniProgressionRewardPreview_C, RarityImage) == 0x0030B8, "Member 'UMiniProgressionRewardPreview_C::RarityImage' has a wrong offset!");
static_assert(offsetof(UMiniProgressionRewardPreview_C, RootSizeBox) == 0x0030C0, "Member 'UMiniProgressionRewardPreview_C::RootSizeBox' has a wrong offset!");
static_assert(offsetof(UMiniProgressionRewardPreview_C, UIItemButtonData) == 0x0030C8, "Member 'UMiniProgressionRewardPreview_C::UIItemButtonData' has a wrong offset!");

}

