#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MiniProgressionRewardPreview

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "MangoClient_structs.hpp"
#include "Mariner_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MiniProgressionRewardPreview.MiniProgressionRewardPreview_C.ExecuteUbergraph_MiniProgressionRewardPreview
// 0x0048 (0x0048 - 0x0000)
struct MiniProgressionRewardPreview_C_ExecuteUbergraph_MiniProgressionRewardPreview final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21FA[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMangoReward                           K2Node_Event_Reward;                               // 0x0008(0x0040)(ConstParm)
};
static_assert(alignof(MiniProgressionRewardPreview_C_ExecuteUbergraph_MiniProgressionRewardPreview) == 0x000008, "Wrong alignment on MiniProgressionRewardPreview_C_ExecuteUbergraph_MiniProgressionRewardPreview");
static_assert(sizeof(MiniProgressionRewardPreview_C_ExecuteUbergraph_MiniProgressionRewardPreview) == 0x000048, "Wrong size on MiniProgressionRewardPreview_C_ExecuteUbergraph_MiniProgressionRewardPreview");
static_assert(offsetof(MiniProgressionRewardPreview_C_ExecuteUbergraph_MiniProgressionRewardPreview, EntryPoint) == 0x000000, "Member 'MiniProgressionRewardPreview_C_ExecuteUbergraph_MiniProgressionRewardPreview::EntryPoint' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_ExecuteUbergraph_MiniProgressionRewardPreview, K2Node_Event_Reward) == 0x000008, "Member 'MiniProgressionRewardPreview_C_ExecuteUbergraph_MiniProgressionRewardPreview::K2Node_Event_Reward' has a wrong offset!");

// Function MiniProgressionRewardPreview.MiniProgressionRewardPreview_C.PopulateRewardPreview
// 0x0040 (0x0040 - 0x0000)
struct MiniProgressionRewardPreview_C_PopulateRewardPreview final
{
public:
	struct FMangoReward                           Reward;                                            // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(MiniProgressionRewardPreview_C_PopulateRewardPreview) == 0x000008, "Wrong alignment on MiniProgressionRewardPreview_C_PopulateRewardPreview");
static_assert(sizeof(MiniProgressionRewardPreview_C_PopulateRewardPreview) == 0x000040, "Wrong size on MiniProgressionRewardPreview_C_PopulateRewardPreview");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateRewardPreview, Reward) == 0x000000, "Member 'MiniProgressionRewardPreview_C_PopulateRewardPreview::Reward' has a wrong offset!");

// Function MiniProgressionRewardPreview.MiniProgressionRewardPreview_C.PopulateQuestReward
// 0x00D0 (0x00D0 - 0x0000)
struct MiniProgressionRewardPreview_C_PopulateQuestReward final
{
public:
	struct FMangoQuestReward                      Reward;                                            // 0x0000(0x00C8)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MiniProgressionRewardPreview_C_PopulateQuestReward) == 0x000008, "Wrong alignment on MiniProgressionRewardPreview_C_PopulateQuestReward");
static_assert(sizeof(MiniProgressionRewardPreview_C_PopulateQuestReward) == 0x0000D0, "Wrong size on MiniProgressionRewardPreview_C_PopulateQuestReward");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateQuestReward, Reward) == 0x000000, "Member 'MiniProgressionRewardPreview_C_PopulateQuestReward::Reward' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateQuestReward, CallFunc_Greater_IntInt_ReturnValue) == 0x0000C8, "Member 'MiniProgressionRewardPreview_C_PopulateQuestReward::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateQuestReward, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0000C9, "Member 'MiniProgressionRewardPreview_C_PopulateQuestReward::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateQuestReward, CallFunc_Greater_IntInt_ReturnValue_2) == 0x0000CA, "Member 'MiniProgressionRewardPreview_C_PopulateQuestReward::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");

// Function MiniProgressionRewardPreview.MiniProgressionRewardPreview_C.PopulateXP
// 0x0090 (0x0090 - 0x0000)
struct MiniProgressionRewardPreview_C_PopulateXP final
{
public:
	int32                                         Xp;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21FB[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0008(0x0088)()
};
static_assert(alignof(MiniProgressionRewardPreview_C_PopulateXP) == 0x000008, "Wrong alignment on MiniProgressionRewardPreview_C_PopulateXP");
static_assert(sizeof(MiniProgressionRewardPreview_C_PopulateXP) == 0x000090, "Wrong size on MiniProgressionRewardPreview_C_PopulateXP");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateXP, Xp) == 0x000000, "Member 'MiniProgressionRewardPreview_C_PopulateXP::Xp' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateXP, K2Node_MakeStruct_SlateBrush) == 0x000008, "Member 'MiniProgressionRewardPreview_C_PopulateXP::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

// Function MiniProgressionRewardPreview.MiniProgressionRewardPreview_C.PopulateRocketbucks
// 0x0168 (0x0168 - 0x0000)
struct MiniProgressionRewardPreview_C_PopulateRocketbucks final
{
public:
	int32                                         RocketBucks;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21FC[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0060(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A0(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C8(0x0018)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x00E0(0x0088)()
};
static_assert(alignof(MiniProgressionRewardPreview_C_PopulateRocketbucks) == 0x000008, "Wrong alignment on MiniProgressionRewardPreview_C_PopulateRocketbucks");
static_assert(sizeof(MiniProgressionRewardPreview_C_PopulateRocketbucks) == 0x000168, "Wrong size on MiniProgressionRewardPreview_C_PopulateRocketbucks");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateRocketbucks, RocketBucks) == 0x000000, "Member 'MiniProgressionRewardPreview_C_PopulateRocketbucks::RocketBucks' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateRocketbucks, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'MiniProgressionRewardPreview_C_PopulateRocketbucks::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateRocketbucks, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'MiniProgressionRewardPreview_C_PopulateRocketbucks::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateRocketbucks, K2Node_MakeStruct_FormatArgumentData_1) == 0x000060, "Member 'MiniProgressionRewardPreview_C_PopulateRocketbucks::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateRocketbucks, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A0, "Member 'MiniProgressionRewardPreview_C_PopulateRocketbucks::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateRocketbucks, K2Node_MakeArray_Array) == 0x0000B8, "Member 'MiniProgressionRewardPreview_C_PopulateRocketbucks::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateRocketbucks, CallFunc_Format_ReturnValue) == 0x0000C8, "Member 'MiniProgressionRewardPreview_C_PopulateRocketbucks::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateRocketbucks, K2Node_MakeStruct_SlateBrush) == 0x0000E0, "Member 'MiniProgressionRewardPreview_C_PopulateRocketbucks::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

// Function MiniProgressionRewardPreview.MiniProgressionRewardPreview_C.PopulateRocketparts
// 0x0198 (0x0198 - 0x0000)
struct MiniProgressionRewardPreview_C_PopulateRocketparts final
{
public:
	int32                                         RocketParts;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21FD[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             RocketPartIcon;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0010(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0068(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21FE[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B0(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21FF[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00C8(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0018)()
	int32                                         CallFunc_Blueprint_GetSizeY_ReturnValue;           // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Blueprint_GetSizeX_ReturnValue;           // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0110(0x0088)()
};
static_assert(alignof(MiniProgressionRewardPreview_C_PopulateRocketparts) == 0x000008, "Wrong alignment on MiniProgressionRewardPreview_C_PopulateRocketparts");
static_assert(sizeof(MiniProgressionRewardPreview_C_PopulateRocketparts) == 0x000198, "Wrong size on MiniProgressionRewardPreview_C_PopulateRocketparts");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateRocketparts, RocketParts) == 0x000000, "Member 'MiniProgressionRewardPreview_C_PopulateRocketparts::RocketParts' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateRocketparts, RocketPartIcon) == 0x000008, "Member 'MiniProgressionRewardPreview_C_PopulateRocketparts::RocketPartIcon' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateRocketparts, CallFunc_MakeLiteralText_ReturnValue) == 0x000010, "Member 'MiniProgressionRewardPreview_C_PopulateRocketparts::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateRocketparts, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'MiniProgressionRewardPreview_C_PopulateRocketparts::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateRocketparts, K2Node_MakeStruct_FormatArgumentData_1) == 0x000068, "Member 'MiniProgressionRewardPreview_C_PopulateRocketparts::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateRocketparts, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000A8, "Member 'MiniProgressionRewardPreview_C_PopulateRocketparts::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateRocketparts, K2Node_MakeArray_Array) == 0x0000B0, "Member 'MiniProgressionRewardPreview_C_PopulateRocketparts::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateRocketparts, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x0000C0, "Member 'MiniProgressionRewardPreview_C_PopulateRocketparts::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateRocketparts, CallFunc_Conv_StringToText_ReturnValue) == 0x0000C8, "Member 'MiniProgressionRewardPreview_C_PopulateRocketparts::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateRocketparts, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'MiniProgressionRewardPreview_C_PopulateRocketparts::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateRocketparts, CallFunc_Blueprint_GetSizeY_ReturnValue) == 0x0000F8, "Member 'MiniProgressionRewardPreview_C_PopulateRocketparts::CallFunc_Blueprint_GetSizeY_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateRocketparts, CallFunc_Blueprint_GetSizeX_ReturnValue) == 0x0000FC, "Member 'MiniProgressionRewardPreview_C_PopulateRocketparts::CallFunc_Blueprint_GetSizeX_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateRocketparts, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000100, "Member 'MiniProgressionRewardPreview_C_PopulateRocketparts::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateRocketparts, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000104, "Member 'MiniProgressionRewardPreview_C_PopulateRocketparts::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateRocketparts, CallFunc_MakeVector2D_ReturnValue) == 0x000108, "Member 'MiniProgressionRewardPreview_C_PopulateRocketparts::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateRocketparts, K2Node_MakeStruct_SlateBrush) == 0x000110, "Member 'MiniProgressionRewardPreview_C_PopulateRocketparts::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

// Function MiniProgressionRewardPreview.MiniProgressionRewardPreview_C.PopulateItem
// 0x0148 (0x0148 - 0x0000)
struct MiniProgressionRewardPreview_C_PopulateItem final
{
public:
	struct FMangoItem                             Item;                                              // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UMarinerUIGlobals*                      CallFunc_GetUIGlobals_ReturnValue;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetItemTypeName_ReturnValue;              // 0x0058(0x0018)()
	class FText                                   CallFunc_TextFromStringTable_ReturnValue;          // 0x0070(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0088(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00C8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0108(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0118(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0130(0x0018)()
};
static_assert(alignof(MiniProgressionRewardPreview_C_PopulateItem) == 0x000008, "Wrong alignment on MiniProgressionRewardPreview_C_PopulateItem");
static_assert(sizeof(MiniProgressionRewardPreview_C_PopulateItem) == 0x000148, "Wrong size on MiniProgressionRewardPreview_C_PopulateItem");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateItem, Item) == 0x000000, "Member 'MiniProgressionRewardPreview_C_PopulateItem::Item' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateItem, CallFunc_GetUIGlobals_ReturnValue) == 0x000050, "Member 'MiniProgressionRewardPreview_C_PopulateItem::CallFunc_GetUIGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateItem, CallFunc_GetItemTypeName_ReturnValue) == 0x000058, "Member 'MiniProgressionRewardPreview_C_PopulateItem::CallFunc_GetItemTypeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateItem, CallFunc_TextFromStringTable_ReturnValue) == 0x000070, "Member 'MiniProgressionRewardPreview_C_PopulateItem::CallFunc_TextFromStringTable_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateItem, K2Node_MakeStruct_FormatArgumentData) == 0x000088, "Member 'MiniProgressionRewardPreview_C_PopulateItem::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateItem, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000C8, "Member 'MiniProgressionRewardPreview_C_PopulateItem::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateItem, K2Node_MakeArray_Array) == 0x000108, "Member 'MiniProgressionRewardPreview_C_PopulateItem::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateItem, CallFunc_Conv_StringToText_ReturnValue) == 0x000118, "Member 'MiniProgressionRewardPreview_C_PopulateItem::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateItem, CallFunc_Format_ReturnValue) == 0x000130, "Member 'MiniProgressionRewardPreview_C_PopulateItem::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function MiniProgressionRewardPreview.MiniProgressionRewardPreview_C.PopulateNativeOffer
// 0x0160 (0x0160 - 0x0000)
struct MiniProgressionRewardPreview_C_PopulateNativeOffer final
{
public:
	struct FMangoNativeOffer                      Nativeoffer;                                       // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UMarinerFrontEndGlobals*                CallFunc_GetFrontEndGlobals_ReturnValue;           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerStoreGlobals*                   CallFunc_GetStoreGlobals_ReturnValue;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_GetImage_ImageBrushOut;                   // 0x00D0(0x0088)()
	bool                                          CallFunc_GetImage_ReturnValue;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MiniProgressionRewardPreview_C_PopulateNativeOffer) == 0x000008, "Wrong alignment on MiniProgressionRewardPreview_C_PopulateNativeOffer");
static_assert(sizeof(MiniProgressionRewardPreview_C_PopulateNativeOffer) == 0x000160, "Wrong size on MiniProgressionRewardPreview_C_PopulateNativeOffer");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateNativeOffer, Nativeoffer) == 0x000000, "Member 'MiniProgressionRewardPreview_C_PopulateNativeOffer::Nativeoffer' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateNativeOffer, CallFunc_GetFrontEndGlobals_ReturnValue) == 0x0000C0, "Member 'MiniProgressionRewardPreview_C_PopulateNativeOffer::CallFunc_GetFrontEndGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateNativeOffer, CallFunc_GetStoreGlobals_ReturnValue) == 0x0000C8, "Member 'MiniProgressionRewardPreview_C_PopulateNativeOffer::CallFunc_GetStoreGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateNativeOffer, CallFunc_GetImage_ImageBrushOut) == 0x0000D0, "Member 'MiniProgressionRewardPreview_C_PopulateNativeOffer::CallFunc_GetImage_ImageBrushOut' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateNativeOffer, CallFunc_GetImage_ReturnValue) == 0x000158, "Member 'MiniProgressionRewardPreview_C_PopulateNativeOffer::CallFunc_GetImage_ReturnValue' has a wrong offset!");

// Function MiniProgressionRewardPreview.MiniProgressionRewardPreview_C.PopulateProgressionReward
// 0x00A8 (0x00A8 - 0x0000)
struct MiniProgressionRewardPreview_C_PopulateProgressionReward final
{
public:
	struct FMangoReward                           Reward;                                            // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UMangoCMSManager*                       CallFunc_Get_ReturnValue;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2200[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMangoItem                             CallFunc_TryGetItemByCMSID_OutItem;                // 0x0050(0x0050)()
	bool                                          CallFunc_TryGetItemByCMSID_ReturnValue;            // 0x00A0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MiniProgressionRewardPreview_C_PopulateProgressionReward) == 0x000008, "Wrong alignment on MiniProgressionRewardPreview_C_PopulateProgressionReward");
static_assert(sizeof(MiniProgressionRewardPreview_C_PopulateProgressionReward) == 0x0000A8, "Wrong size on MiniProgressionRewardPreview_C_PopulateProgressionReward");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateProgressionReward, Reward) == 0x000000, "Member 'MiniProgressionRewardPreview_C_PopulateProgressionReward::Reward' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateProgressionReward, CallFunc_Get_ReturnValue) == 0x000040, "Member 'MiniProgressionRewardPreview_C_PopulateProgressionReward::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateProgressionReward, CallFunc_Greater_IntInt_ReturnValue) == 0x000048, "Member 'MiniProgressionRewardPreview_C_PopulateProgressionReward::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateProgressionReward, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000049, "Member 'MiniProgressionRewardPreview_C_PopulateProgressionReward::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateProgressionReward, CallFunc_TryGetItemByCMSID_OutItem) == 0x000050, "Member 'MiniProgressionRewardPreview_C_PopulateProgressionReward::CallFunc_TryGetItemByCMSID_OutItem' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateProgressionReward, CallFunc_TryGetItemByCMSID_ReturnValue) == 0x0000A0, "Member 'MiniProgressionRewardPreview_C_PopulateProgressionReward::CallFunc_TryGetItemByCMSID_ReturnValue' has a wrong offset!");

// Function MiniProgressionRewardPreview.MiniProgressionRewardPreview_C.PopulateUIItemData
// 0x0078 (0x0078 - 0x0000)
struct MiniProgressionRewardPreview_C_PopulateUIItemData final
{
public:
	struct FMarinerUIItemButtonData               Param_UIItemButtonData;                            // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MiniProgressionRewardPreview_C_PopulateUIItemData) == 0x000008, "Wrong alignment on MiniProgressionRewardPreview_C_PopulateUIItemData");
static_assert(sizeof(MiniProgressionRewardPreview_C_PopulateUIItemData) == 0x000078, "Wrong size on MiniProgressionRewardPreview_C_PopulateUIItemData");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateUIItemData, Param_UIItemButtonData) == 0x000000, "Member 'MiniProgressionRewardPreview_C_PopulateUIItemData::Param_UIItemButtonData' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateUIItemData, K2Node_SwitchEnum_CmpSuccess) == 0x000070, "Member 'MiniProgressionRewardPreview_C_PopulateUIItemData::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function MiniProgressionRewardPreview.MiniProgressionRewardPreview_C.PopulateBPXPBonusPersonal
// 0x0090 (0x0090 - 0x0000)
struct MiniProgressionRewardPreview_C_PopulateBPXPBonusPersonal final
{
public:
	int32                                         BonusPct;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2201[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0008(0x0088)()
};
static_assert(alignof(MiniProgressionRewardPreview_C_PopulateBPXPBonusPersonal) == 0x000008, "Wrong alignment on MiniProgressionRewardPreview_C_PopulateBPXPBonusPersonal");
static_assert(sizeof(MiniProgressionRewardPreview_C_PopulateBPXPBonusPersonal) == 0x000090, "Wrong size on MiniProgressionRewardPreview_C_PopulateBPXPBonusPersonal");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateBPXPBonusPersonal, BonusPct) == 0x000000, "Member 'MiniProgressionRewardPreview_C_PopulateBPXPBonusPersonal::BonusPct' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateBPXPBonusPersonal, K2Node_MakeStruct_SlateBrush) == 0x000008, "Member 'MiniProgressionRewardPreview_C_PopulateBPXPBonusPersonal::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

// Function MiniProgressionRewardPreview.MiniProgressionRewardPreview_C.PopulateBPXPBonusParty
// 0x0090 (0x0090 - 0x0000)
struct MiniProgressionRewardPreview_C_PopulateBPXPBonusParty final
{
public:
	int32                                         BonusPct;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2202[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0008(0x0088)()
};
static_assert(alignof(MiniProgressionRewardPreview_C_PopulateBPXPBonusParty) == 0x000008, "Wrong alignment on MiniProgressionRewardPreview_C_PopulateBPXPBonusParty");
static_assert(sizeof(MiniProgressionRewardPreview_C_PopulateBPXPBonusParty) == 0x000090, "Wrong size on MiniProgressionRewardPreview_C_PopulateBPXPBonusParty");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateBPXPBonusParty, BonusPct) == 0x000000, "Member 'MiniProgressionRewardPreview_C_PopulateBPXPBonusParty::BonusPct' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateBPXPBonusParty, K2Node_MakeStruct_SlateBrush) == 0x000008, "Member 'MiniProgressionRewardPreview_C_PopulateBPXPBonusParty::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

// Function MiniProgressionRewardPreview.MiniProgressionRewardPreview_C.PopulateMangoReward
// 0x00A8 (0x00A8 - 0x0000)
struct MiniProgressionRewardPreview_C_PopulateMangoReward final
{
public:
	struct FMangoReward                           MangoReward;                                       // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UMangoCMSManager*                       CallFunc_Get_ReturnValue;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2203[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMangoItem                             CallFunc_TryGetItemByCMSID_OutItem;                // 0x0050(0x0050)()
	bool                                          CallFunc_TryGetItemByCMSID_ReturnValue;            // 0x00A0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MiniProgressionRewardPreview_C_PopulateMangoReward) == 0x000008, "Wrong alignment on MiniProgressionRewardPreview_C_PopulateMangoReward");
static_assert(sizeof(MiniProgressionRewardPreview_C_PopulateMangoReward) == 0x0000A8, "Wrong size on MiniProgressionRewardPreview_C_PopulateMangoReward");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateMangoReward, MangoReward) == 0x000000, "Member 'MiniProgressionRewardPreview_C_PopulateMangoReward::MangoReward' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateMangoReward, CallFunc_Get_ReturnValue) == 0x000040, "Member 'MiniProgressionRewardPreview_C_PopulateMangoReward::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateMangoReward, CallFunc_Greater_IntInt_ReturnValue) == 0x000048, "Member 'MiniProgressionRewardPreview_C_PopulateMangoReward::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateMangoReward, CallFunc_TryGetItemByCMSID_OutItem) == 0x000050, "Member 'MiniProgressionRewardPreview_C_PopulateMangoReward::CallFunc_TryGetItemByCMSID_OutItem' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateMangoReward, CallFunc_TryGetItemByCMSID_ReturnValue) == 0x0000A0, "Member 'MiniProgressionRewardPreview_C_PopulateMangoReward::CallFunc_TryGetItemByCMSID_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateMangoReward, CallFunc_NotEqual_StrStr_ReturnValue) == 0x0000A1, "Member 'MiniProgressionRewardPreview_C_PopulateMangoReward::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_PopulateMangoReward, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0000A2, "Member 'MiniProgressionRewardPreview_C_PopulateMangoReward::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");

// Function MiniProgressionRewardPreview.MiniProgressionRewardPreview_C.GetAssets
// 0x00D0 (0x00D0 - 0x0000)
struct MiniProgressionRewardPreview_C_GetAssets final
{
public:
	struct FMarinerLayeredButtonAssets            ReturnValue;                                       // 0x0000(0x0068)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference)
	struct FMarinerLayeredButtonAssets            K2Node_MakeStruct_MarinerLayeredButtonAssets;      // 0x0068(0x0068)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(MiniProgressionRewardPreview_C_GetAssets) == 0x000008, "Wrong alignment on MiniProgressionRewardPreview_C_GetAssets");
static_assert(sizeof(MiniProgressionRewardPreview_C_GetAssets) == 0x0000D0, "Wrong size on MiniProgressionRewardPreview_C_GetAssets");
static_assert(offsetof(MiniProgressionRewardPreview_C_GetAssets, ReturnValue) == 0x000000, "Member 'MiniProgressionRewardPreview_C_GetAssets::ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniProgressionRewardPreview_C_GetAssets, K2Node_MakeStruct_MarinerLayeredButtonAssets) == 0x000068, "Member 'MiniProgressionRewardPreview_C_GetAssets::K2Node_MakeStruct_MarinerLayeredButtonAssets' has a wrong offset!");

}

