#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModeSummaryPanel

#include "Basic.hpp"


namespace SDK::Params
{

// Function ModeSummaryPanel.ModeSummaryPanel_C.SetUpPanel
// 0x0010 (0x0010 - 0x0000)
struct ModeSummaryPanel_C_SetUpPanel final
{
public:
	class UMarinerModeDataAsset*                  GameModeData;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ModeSummaryPanel_C_SetUpPanel) == 0x000008, "Wrong alignment on ModeSummaryPanel_C_SetUpPanel");
static_assert(sizeof(ModeSummaryPanel_C_SetUpPanel) == 0x000010, "Wrong size on ModeSummaryPanel_C_SetUpPanel");
static_assert(offsetof(ModeSummaryPanel_C_SetUpPanel, GameModeData) == 0x000000, "Member 'ModeSummaryPanel_C_SetUpPanel::GameModeData' has a wrong offset!");
static_assert(offsetof(ModeSummaryPanel_C_SetUpPanel, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'ModeSummaryPanel_C_SetUpPanel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModeSummaryPanel_C_SetUpPanel, CallFunc_Less_IntInt_ReturnValue) == 0x00000C, "Member 'ModeSummaryPanel_C_SetUpPanel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

