#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModeSummaryPanel

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ModeSummaryPanel.ModeSummaryPanel_C
// 0x0028 (0x0258 - 0x0230)
class UModeSummaryPanel_C final : public UUserWidget
{
public:
	class UImage*                                 Modebacker;                                        // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Modebackermaterial;                                // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PanelImage;                                        // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PanelText;                                         // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetUpPanel(class UMarinerModeDataAsset* GameModeData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ModeSummaryPanel_C">();
	}
	static class UModeSummaryPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModeSummaryPanel_C>();
	}
};
static_assert(alignof(UModeSummaryPanel_C) == 0x000008, "Wrong alignment on UModeSummaryPanel_C");
static_assert(sizeof(UModeSummaryPanel_C) == 0x000258, "Wrong size on UModeSummaryPanel_C");
static_assert(offsetof(UModeSummaryPanel_C, Modebacker) == 0x000230, "Member 'UModeSummaryPanel_C::Modebacker' has a wrong offset!");
static_assert(offsetof(UModeSummaryPanel_C, Modebackermaterial) == 0x000238, "Member 'UModeSummaryPanel_C::Modebackermaterial' has a wrong offset!");
static_assert(offsetof(UModeSummaryPanel_C, PanelImage) == 0x000240, "Member 'UModeSummaryPanel_C::PanelImage' has a wrong offset!");
static_assert(offsetof(UModeSummaryPanel_C, PanelText) == 0x000248, "Member 'UModeSummaryPanel_C::PanelText' has a wrong offset!");
static_assert(offsetof(UModeSummaryPanel_C, Index_0) == 0x000250, "Member 'UModeSummaryPanel_C::Index_0' has a wrong offset!");

}

