#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModeSelectButton

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ModeSelectButton.ModeSelectButton_C
// 0x0038 (0x2FD8 - 0x2FA0)
class UModeSelectButton_C final : public UMarinerModeSelectButton
{
public:
	class UWidgetAnimation*                       HoveredAnim;                                       // 0x2FA0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x2FA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Border;                                            // 0x2FB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                HitArea;                                           // 0x2FB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ModeIcon;                                          // 0x2FC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ModeName;                                          // 0x2FC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PartyWarning;                                      // 0x2FD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FMarinerLayeredButtonAssets GetAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ModeSelectButton_C">();
	}
	static class UModeSelectButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModeSelectButton_C>();
	}
};
static_assert(alignof(UModeSelectButton_C) == 0x000008, "Wrong alignment on UModeSelectButton_C");
static_assert(sizeof(UModeSelectButton_C) == 0x002FD8, "Wrong size on UModeSelectButton_C");
static_assert(offsetof(UModeSelectButton_C, HoveredAnim) == 0x002FA0, "Member 'UModeSelectButton_C::HoveredAnim' has a wrong offset!");
static_assert(offsetof(UModeSelectButton_C, Background) == 0x002FA8, "Member 'UModeSelectButton_C::Background' has a wrong offset!");
static_assert(offsetof(UModeSelectButton_C, Border) == 0x002FB0, "Member 'UModeSelectButton_C::Border' has a wrong offset!");
static_assert(offsetof(UModeSelectButton_C, HitArea) == 0x002FB8, "Member 'UModeSelectButton_C::HitArea' has a wrong offset!");
static_assert(offsetof(UModeSelectButton_C, ModeIcon) == 0x002FC0, "Member 'UModeSelectButton_C::ModeIcon' has a wrong offset!");
static_assert(offsetof(UModeSelectButton_C, ModeName) == 0x002FC8, "Member 'UModeSelectButton_C::ModeName' has a wrong offset!");
static_assert(offsetof(UModeSelectButton_C, PartyWarning) == 0x002FD0, "Member 'UModeSelectButton_C::PartyWarning' has a wrong offset!");

}

