#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewsDefaultStackBase

#include "Basic.hpp"

#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function NewsDefaultStackBase.NewsDefaultStackBase_C.ExecuteUbergraph_NewsDefaultStackBase
// 0x0010 (0x0010 - 0x0000)
struct NewsDefaultStackBase_C_ExecuteUbergraph_NewsDefaultStackBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NewsDefaultStackBase_C_ExecuteUbergraph_NewsDefaultStackBase) == 0x000008, "Wrong alignment on NewsDefaultStackBase_C_ExecuteUbergraph_NewsDefaultStackBase");
static_assert(sizeof(NewsDefaultStackBase_C_ExecuteUbergraph_NewsDefaultStackBase) == 0x000010, "Wrong size on NewsDefaultStackBase_C_ExecuteUbergraph_NewsDefaultStackBase");
static_assert(offsetof(NewsDefaultStackBase_C_ExecuteUbergraph_NewsDefaultStackBase, EntryPoint) == 0x000000, "Member 'NewsDefaultStackBase_C_ExecuteUbergraph_NewsDefaultStackBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(NewsDefaultStackBase_C_ExecuteUbergraph_NewsDefaultStackBase, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'NewsDefaultStackBase_C_ExecuteUbergraph_NewsDefaultStackBase::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function NewsDefaultStackBase.NewsDefaultStackBase_C.GetWidgetSetup
// 0x0020 (0x0020 - 0x0000)
struct NewsDefaultStackBase_C_GetWidgetSetup final
{
public:
	struct FMarinerMenuStackBaseWidgetSetup       ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference)
	struct FMarinerMenuStackBaseWidgetSetup       K2Node_MakeStruct_MarinerMenuStackBaseWidgetSetup; // 0x0010(0x0010)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(NewsDefaultStackBase_C_GetWidgetSetup) == 0x000008, "Wrong alignment on NewsDefaultStackBase_C_GetWidgetSetup");
static_assert(sizeof(NewsDefaultStackBase_C_GetWidgetSetup) == 0x000020, "Wrong size on NewsDefaultStackBase_C_GetWidgetSetup");
static_assert(offsetof(NewsDefaultStackBase_C_GetWidgetSetup, ReturnValue) == 0x000000, "Member 'NewsDefaultStackBase_C_GetWidgetSetup::ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsDefaultStackBase_C_GetWidgetSetup, K2Node_MakeStruct_MarinerMenuStackBaseWidgetSetup) == 0x000010, "Member 'NewsDefaultStackBase_C_GetWidgetSetup::K2Node_MakeStruct_MarinerMenuStackBaseWidgetSetup' has a wrong offset!");

}

