#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewsMenuStack

#include "Basic.hpp"

#include "MangoClient_structs.hpp"
#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function NewsMenuStack.NewsMenuStack_C.ExecuteUbergraph_NewsMenuStack
// 0x0050 (0x0050 - 0x0000)
struct NewsMenuStack_C_ExecuteUbergraph_NewsMenuStack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFromSubMenu;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoCMSManager*                       CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNewsLoaded_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMarinerMenuStackManagerSetup          K2Node_MakeStruct_MarinerMenuStackManagerSetup;    // 0x0028(0x0028)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(NewsMenuStack_C_ExecuteUbergraph_NewsMenuStack) == 0x000008, "Wrong alignment on NewsMenuStack_C_ExecuteUbergraph_NewsMenuStack");
static_assert(sizeof(NewsMenuStack_C_ExecuteUbergraph_NewsMenuStack) == 0x000050, "Wrong size on NewsMenuStack_C_ExecuteUbergraph_NewsMenuStack");
static_assert(offsetof(NewsMenuStack_C_ExecuteUbergraph_NewsMenuStack, EntryPoint) == 0x000000, "Member 'NewsMenuStack_C_ExecuteUbergraph_NewsMenuStack::EntryPoint' has a wrong offset!");
static_assert(offsetof(NewsMenuStack_C_ExecuteUbergraph_NewsMenuStack, K2Node_Event_bFromSubMenu) == 0x000004, "Member 'NewsMenuStack_C_ExecuteUbergraph_NewsMenuStack::K2Node_Event_bFromSubMenu' has a wrong offset!");
static_assert(offsetof(NewsMenuStack_C_ExecuteUbergraph_NewsMenuStack, CallFunc_Get_ReturnValue) == 0x000008, "Member 'NewsMenuStack_C_ExecuteUbergraph_NewsMenuStack::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsMenuStack_C_ExecuteUbergraph_NewsMenuStack, CallFunc_IsNewsLoaded_ReturnValue) == 0x000010, "Member 'NewsMenuStack_C_ExecuteUbergraph_NewsMenuStack::CallFunc_IsNewsLoaded_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsMenuStack_C_ExecuteUbergraph_NewsMenuStack, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'NewsMenuStack_C_ExecuteUbergraph_NewsMenuStack::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(NewsMenuStack_C_ExecuteUbergraph_NewsMenuStack, K2Node_MakeStruct_MarinerMenuStackManagerSetup) == 0x000028, "Member 'NewsMenuStack_C_ExecuteUbergraph_NewsMenuStack::K2Node_MakeStruct_MarinerMenuStackManagerSetup' has a wrong offset!");

// Function NewsMenuStack.NewsMenuStack_C.BP_OnEntered
// 0x0001 (0x0001 - 0x0000)
struct NewsMenuStack_C_BP_OnEntered final
{
public:
	bool                                          bFromSubMenu;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewsMenuStack_C_BP_OnEntered) == 0x000001, "Wrong alignment on NewsMenuStack_C_BP_OnEntered");
static_assert(sizeof(NewsMenuStack_C_BP_OnEntered) == 0x000001, "Wrong size on NewsMenuStack_C_BP_OnEntered");
static_assert(offsetof(NewsMenuStack_C_BP_OnEntered, bFromSubMenu) == 0x000000, "Member 'NewsMenuStack_C_BP_OnEntered::bFromSubMenu' has a wrong offset!");

// Function NewsMenuStack.NewsMenuStack_C.ConstructNewsStacks
// 0x0090 (0x0090 - 0x0000)
struct NewsMenuStack_C_ConstructNewsStacks final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UMarinerMenuStackButton* ButtonInstance, int32 StackIndex)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UMangoCMSManager*                       CallFunc_Get_ReturnValue;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNewsCount_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMangoNews                             CallFunc_GetNewsAtIndex_ReturnValue;               // 0x0038(0x0048)(ConstParm)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerMenuStackButton*                CallFunc_AddStack_ReturnValue;                     // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NewsMenuStack_C_ConstructNewsStacks) == 0x000008, "Wrong alignment on NewsMenuStack_C_ConstructNewsStacks");
static_assert(sizeof(NewsMenuStack_C_ConstructNewsStacks) == 0x000090, "Wrong size on NewsMenuStack_C_ConstructNewsStacks");
static_assert(offsetof(NewsMenuStack_C_ConstructNewsStacks, Temp_int_Variable) == 0x000000, "Member 'NewsMenuStack_C_ConstructNewsStacks::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(NewsMenuStack_C_ConstructNewsStacks, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'NewsMenuStack_C_ConstructNewsStacks::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(NewsMenuStack_C_ConstructNewsStacks, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'NewsMenuStack_C_ConstructNewsStacks::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsMenuStack_C_ConstructNewsStacks, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'NewsMenuStack_C_ConstructNewsStacks::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(NewsMenuStack_C_ConstructNewsStacks, CallFunc_Get_ReturnValue) == 0x000028, "Member 'NewsMenuStack_C_ConstructNewsStacks::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsMenuStack_C_ConstructNewsStacks, CallFunc_GetNewsCount_ReturnValue) == 0x000030, "Member 'NewsMenuStack_C_ConstructNewsStacks::CallFunc_GetNewsCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsMenuStack_C_ConstructNewsStacks, CallFunc_GetNewsAtIndex_ReturnValue) == 0x000038, "Member 'NewsMenuStack_C_ConstructNewsStacks::CallFunc_GetNewsAtIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsMenuStack_C_ConstructNewsStacks, CallFunc_Subtract_IntInt_ReturnValue) == 0x000080, "Member 'NewsMenuStack_C_ConstructNewsStacks::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsMenuStack_C_ConstructNewsStacks, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000084, "Member 'NewsMenuStack_C_ConstructNewsStacks::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsMenuStack_C_ConstructNewsStacks, CallFunc_AddStack_ReturnValue) == 0x000088, "Member 'NewsMenuStack_C_ConstructNewsStacks::CallFunc_AddStack_ReturnValue' has a wrong offset!");

// Function NewsMenuStack.NewsMenuStack_C.ShowLoading
// 0x0001 (0x0001 - 0x0000)
struct NewsMenuStack_C_ShowLoading final
{
public:
	bool                                          IsVisible_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewsMenuStack_C_ShowLoading) == 0x000001, "Wrong alignment on NewsMenuStack_C_ShowLoading");
static_assert(sizeof(NewsMenuStack_C_ShowLoading) == 0x000001, "Wrong size on NewsMenuStack_C_ShowLoading");
static_assert(offsetof(NewsMenuStack_C_ShowLoading, IsVisible_0) == 0x000000, "Member 'NewsMenuStack_C_ShowLoading::IsVisible_0' has a wrong offset!");

// Function NewsMenuStack.NewsMenuStack_C.OnNewsStackActivated
// 0x0070 (0x0070 - 0x0000)
struct NewsMenuStack_C_OnNewsStackActivated final
{
public:
	class UMarinerMenuStackButton*                Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StackIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoPlayerManager*                    CallFunc_Get_ReturnValue;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMangoCMSManager*                       CallFunc_Get_ReturnValue_1;                        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetNewsViewed_ReturnValue;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMangoNews                             CallFunc_GetNewsAtIndex_ReturnValue;               // 0x0028(0x0048)(ConstParm)
};
static_assert(alignof(NewsMenuStack_C_OnNewsStackActivated) == 0x000008, "Wrong alignment on NewsMenuStack_C_OnNewsStackActivated");
static_assert(sizeof(NewsMenuStack_C_OnNewsStackActivated) == 0x000070, "Wrong size on NewsMenuStack_C_OnNewsStackActivated");
static_assert(offsetof(NewsMenuStack_C_OnNewsStackActivated, Button) == 0x000000, "Member 'NewsMenuStack_C_OnNewsStackActivated::Button' has a wrong offset!");
static_assert(offsetof(NewsMenuStack_C_OnNewsStackActivated, StackIndex) == 0x000008, "Member 'NewsMenuStack_C_OnNewsStackActivated::StackIndex' has a wrong offset!");
static_assert(offsetof(NewsMenuStack_C_OnNewsStackActivated, CallFunc_Get_ReturnValue) == 0x000010, "Member 'NewsMenuStack_C_OnNewsStackActivated::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsMenuStack_C_OnNewsStackActivated, CallFunc_Get_ReturnValue_1) == 0x000018, "Member 'NewsMenuStack_C_OnNewsStackActivated::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewsMenuStack_C_OnNewsStackActivated, CallFunc_SetNewsViewed_ReturnValue) == 0x000020, "Member 'NewsMenuStack_C_OnNewsStackActivated::CallFunc_SetNewsViewed_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsMenuStack_C_OnNewsStackActivated, CallFunc_GetNewsAtIndex_ReturnValue) == 0x000028, "Member 'NewsMenuStack_C_OnNewsStackActivated::CallFunc_GetNewsAtIndex_ReturnValue' has a wrong offset!");

// Function NewsMenuStack.NewsMenuStack_C.OnNewsStackPopulated
// 0x0048 (0x0048 - 0x0000)
struct NewsMenuStack_C_OnNewsStackPopulated final
{
public:
	TDelegate<void(class FName& ImageId, class UTexture2D* Texture)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class UMarinerFrontEndGlobals*                CallFunc_GetFrontEndGlobals_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerNewsGlobals*                    CallFunc_GetNewsGlobals_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuStackLayer*                 CallFunc_GetLayerByClass_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestImage_ReturnValue;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNewsMenu_C*                            K2Node_DynamicCast_AsNews_Menu;                    // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewsMenuStack_C_OnNewsStackPopulated) == 0x000008, "Wrong alignment on NewsMenuStack_C_OnNewsStackPopulated");
static_assert(sizeof(NewsMenuStack_C_OnNewsStackPopulated) == 0x000048, "Wrong size on NewsMenuStack_C_OnNewsStackPopulated");
static_assert(offsetof(NewsMenuStack_C_OnNewsStackPopulated, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'NewsMenuStack_C_OnNewsStackPopulated::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(NewsMenuStack_C_OnNewsStackPopulated, CallFunc_GetFrontEndGlobals_ReturnValue) == 0x000010, "Member 'NewsMenuStack_C_OnNewsStackPopulated::CallFunc_GetFrontEndGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsMenuStack_C_OnNewsStackPopulated, CallFunc_GetNewsGlobals_ReturnValue) == 0x000018, "Member 'NewsMenuStack_C_OnNewsStackPopulated::CallFunc_GetNewsGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsMenuStack_C_OnNewsStackPopulated, CallFunc_GetMenuManager_ReturnValue) == 0x000020, "Member 'NewsMenuStack_C_OnNewsStackPopulated::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsMenuStack_C_OnNewsStackPopulated, CallFunc_GetLayerByClass_ReturnValue) == 0x000028, "Member 'NewsMenuStack_C_OnNewsStackPopulated::CallFunc_GetLayerByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsMenuStack_C_OnNewsStackPopulated, CallFunc_RequestImage_ReturnValue) == 0x000030, "Member 'NewsMenuStack_C_OnNewsStackPopulated::CallFunc_RequestImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsMenuStack_C_OnNewsStackPopulated, K2Node_DynamicCast_AsNews_Menu) == 0x000038, "Member 'NewsMenuStack_C_OnNewsStackPopulated::K2Node_DynamicCast_AsNews_Menu' has a wrong offset!");
static_assert(offsetof(NewsMenuStack_C_OnNewsStackPopulated, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'NewsMenuStack_C_OnNewsStackPopulated::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function NewsMenuStack.NewsMenuStack_C.OnNewsImageLoaded
// 0x0018 (0x0018 - 0x0000)
struct NewsMenuStack_C_OnNewsImageLoaded final
{
public:
	class FName                                   ImageId;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Texture;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewsMenuStack_C_OnNewsImageLoaded) == 0x000008, "Wrong alignment on NewsMenuStack_C_OnNewsImageLoaded");
static_assert(sizeof(NewsMenuStack_C_OnNewsImageLoaded) == 0x000018, "Wrong size on NewsMenuStack_C_OnNewsImageLoaded");
static_assert(offsetof(NewsMenuStack_C_OnNewsImageLoaded, ImageId) == 0x000000, "Member 'NewsMenuStack_C_OnNewsImageLoaded::ImageId' has a wrong offset!");
static_assert(offsetof(NewsMenuStack_C_OnNewsImageLoaded, Texture) == 0x000008, "Member 'NewsMenuStack_C_OnNewsImageLoaded::Texture' has a wrong offset!");
static_assert(offsetof(NewsMenuStack_C_OnNewsImageLoaded, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'NewsMenuStack_C_OnNewsImageLoaded::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

