#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewsDefaultStackBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass NewsDefaultStackBase.NewsDefaultStackBase_C
// 0x0020 (0x0378 - 0x0358)
class UNewsDefaultStackBase_C final : public UMarinerMenuStackBaseWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewsImageIdleAnim;                                 // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UStackManagerContentWidget_C*           MenuContent;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NewsMenuBackgroundImage;                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_NewsDefaultStackBase(int32 EntryPoint);
	void Construct();

	struct FMarinerMenuStackBaseWidgetSetup GetWidgetSetup() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NewsDefaultStackBase_C">();
	}
	static class UNewsDefaultStackBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNewsDefaultStackBase_C>();
	}
};
static_assert(alignof(UNewsDefaultStackBase_C) == 0x000008, "Wrong alignment on UNewsDefaultStackBase_C");
static_assert(sizeof(UNewsDefaultStackBase_C) == 0x000378, "Wrong size on UNewsDefaultStackBase_C");
static_assert(offsetof(UNewsDefaultStackBase_C, UberGraphFrame) == 0x000358, "Member 'UNewsDefaultStackBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNewsDefaultStackBase_C, NewsImageIdleAnim) == 0x000360, "Member 'UNewsDefaultStackBase_C::NewsImageIdleAnim' has a wrong offset!");
static_assert(offsetof(UNewsDefaultStackBase_C, MenuContent) == 0x000368, "Member 'UNewsDefaultStackBase_C::MenuContent' has a wrong offset!");
static_assert(offsetof(UNewsDefaultStackBase_C, NewsMenuBackgroundImage) == 0x000370, "Member 'UNewsDefaultStackBase_C::NewsMenuBackgroundImage' has a wrong offset!");

}

