#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NinjaHeadBand_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass NinjaHeadBand_AnimBP.NinjaHeadBand_AnimBP_C
// 0x07D0 (0x0A40 - 0x0270)
class UNinjaHeadBand_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_257ED90D4DFF23599A998190A70F0A1C; // 0x0278(0x0030)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_0EDFEA5549C75325B7108E85E323EEB9; // 0x02A8(0x0020)()
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Trail                        AnimGraphNode_Trail_C73DB3F6444C9B66A0BCB4BD2C07110B; // 0x02D0(0x0260)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_108DC29947433805F27478B7C3F84DBF; // 0x0530(0x0020)()
	struct FAnimNode_Trail                        AnimGraphNode_Trail_E097996747C3884F808FEBBCAA85C798; // 0x0550(0x0260)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3CFEE35349F3CC30EFBDFD8B75AE3227; // 0x07B0(0x0078)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_B30C2E134911E6B7439DE193E6C1A667; // 0x0828(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2FC9E50D4C25F375614116B41771C5A5; // 0x0930(0x0108)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_NinjaHeadBand_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NinjaHeadBand_AnimBP_C">();
	}
	static class UNinjaHeadBand_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNinjaHeadBand_AnimBP_C>();
	}
};
static_assert(alignof(UNinjaHeadBand_AnimBP_C) == 0x000010, "Wrong alignment on UNinjaHeadBand_AnimBP_C");
static_assert(sizeof(UNinjaHeadBand_AnimBP_C) == 0x000A40, "Wrong size on UNinjaHeadBand_AnimBP_C");
static_assert(offsetof(UNinjaHeadBand_AnimBP_C, UberGraphFrame) == 0x000270, "Member 'UNinjaHeadBand_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNinjaHeadBand_AnimBP_C, AnimGraphNode_Root_257ED90D4DFF23599A998190A70F0A1C) == 0x000278, "Member 'UNinjaHeadBand_AnimBP_C::AnimGraphNode_Root_257ED90D4DFF23599A998190A70F0A1C' has a wrong offset!");
static_assert(offsetof(UNinjaHeadBand_AnimBP_C, AnimGraphNode_LocalToComponentSpace_0EDFEA5549C75325B7108E85E323EEB9) == 0x0002A8, "Member 'UNinjaHeadBand_AnimBP_C::AnimGraphNode_LocalToComponentSpace_0EDFEA5549C75325B7108E85E323EEB9' has a wrong offset!");
static_assert(offsetof(UNinjaHeadBand_AnimBP_C, AnimGraphNode_Trail_C73DB3F6444C9B66A0BCB4BD2C07110B) == 0x0002D0, "Member 'UNinjaHeadBand_AnimBP_C::AnimGraphNode_Trail_C73DB3F6444C9B66A0BCB4BD2C07110B' has a wrong offset!");
static_assert(offsetof(UNinjaHeadBand_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_108DC29947433805F27478B7C3F84DBF) == 0x000530, "Member 'UNinjaHeadBand_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_108DC29947433805F27478B7C3F84DBF' has a wrong offset!");
static_assert(offsetof(UNinjaHeadBand_AnimBP_C, AnimGraphNode_Trail_E097996747C3884F808FEBBCAA85C798) == 0x000550, "Member 'UNinjaHeadBand_AnimBP_C::AnimGraphNode_Trail_E097996747C3884F808FEBBCAA85C798' has a wrong offset!");
static_assert(offsetof(UNinjaHeadBand_AnimBP_C, AnimGraphNode_SequencePlayer_3CFEE35349F3CC30EFBDFD8B75AE3227) == 0x0007B0, "Member 'UNinjaHeadBand_AnimBP_C::AnimGraphNode_SequencePlayer_3CFEE35349F3CC30EFBDFD8B75AE3227' has a wrong offset!");
static_assert(offsetof(UNinjaHeadBand_AnimBP_C, AnimGraphNode_ModifyBone_B30C2E134911E6B7439DE193E6C1A667) == 0x000828, "Member 'UNinjaHeadBand_AnimBP_C::AnimGraphNode_ModifyBone_B30C2E134911E6B7439DE193E6C1A667' has a wrong offset!");
static_assert(offsetof(UNinjaHeadBand_AnimBP_C, AnimGraphNode_ModifyBone_2FC9E50D4C25F375614116B41771C5A5) == 0x000930, "Member 'UNinjaHeadBand_AnimBP_C::AnimGraphNode_ModifyBone_2FC9E50D4C25F375614116B41771C5A5' has a wrong offset!");

}

