#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NinjaHeadBand_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function NinjaHeadBand_AnimBP.NinjaHeadBand_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct NinjaHeadBand_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(NinjaHeadBand_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on NinjaHeadBand_AnimBP_C_AnimGraph");
static_assert(sizeof(NinjaHeadBand_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on NinjaHeadBand_AnimBP_C_AnimGraph");
static_assert(offsetof(NinjaHeadBand_AnimBP_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'NinjaHeadBand_AnimBP_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function NinjaHeadBand_AnimBP.NinjaHeadBand_AnimBP_C.ExecuteUbergraph_NinjaHeadBand_AnimBP
// 0x0004 (0x0004 - 0x0000)
struct NinjaHeadBand_AnimBP_C_ExecuteUbergraph_NinjaHeadBand_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NinjaHeadBand_AnimBP_C_ExecuteUbergraph_NinjaHeadBand_AnimBP) == 0x000004, "Wrong alignment on NinjaHeadBand_AnimBP_C_ExecuteUbergraph_NinjaHeadBand_AnimBP");
static_assert(sizeof(NinjaHeadBand_AnimBP_C_ExecuteUbergraph_NinjaHeadBand_AnimBP) == 0x000004, "Wrong size on NinjaHeadBand_AnimBP_C_ExecuteUbergraph_NinjaHeadBand_AnimBP");
static_assert(offsetof(NinjaHeadBand_AnimBP_C_ExecuteUbergraph_NinjaHeadBand_AnimBP, EntryPoint) == 0x000000, "Member 'NinjaHeadBand_AnimBP_C_ExecuteUbergraph_NinjaHeadBand_AnimBP::EntryPoint' has a wrong offset!");

}

