#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OfferPurchaseButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MangoClient_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass OfferPurchaseButton.OfferPurchaseButton_C
// 0x0148 (0x30C0 - 0x2F78)
class UOfferPurchaseButton_C final : public UMarinerLayeredButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x2F78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       UnhoveredAnim;                                     // 0x2F80(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoveredAnim;                                       // 0x2F88(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x2F90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Border;                                            // 0x2F98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x2FA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CharacterPrice;                                    // 0x2FA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CurrencyIcon;                                      // 0x2FB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_85;                                          // 0x2FB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_148;                                         // 0x2FC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Material;                                          // 0x2FC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               RootSizeBox;                                       // 0x2FD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerPlayableCharacter*              Character;                                         // 0x2FD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Premium;                                           // 0x2FE0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2365[0x7];                                     // 0x2FE1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMangoPurchaseOffer                    Offer;                                             // 0x2FE8(0x00D8)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_OfferPurchaseButton(int32 EntryPoint);
	void BeginOfferPurchase(class UMarinerLayeredButton* Instance);
	void SetOffer(const struct FMangoPurchaseOffer& PurchaseOffer, class UMarinerPlayableCharacter* Param_Character);

	struct FMarinerLayeredButtonAssets GetAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OfferPurchaseButton_C">();
	}
	static class UOfferPurchaseButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOfferPurchaseButton_C>();
	}
};
static_assert(alignof(UOfferPurchaseButton_C) == 0x000008, "Wrong alignment on UOfferPurchaseButton_C");
static_assert(sizeof(UOfferPurchaseButton_C) == 0x0030C0, "Wrong size on UOfferPurchaseButton_C");
static_assert(offsetof(UOfferPurchaseButton_C, UberGraphFrame) == 0x002F78, "Member 'UOfferPurchaseButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOfferPurchaseButton_C, UnhoveredAnim) == 0x002F80, "Member 'UOfferPurchaseButton_C::UnhoveredAnim' has a wrong offset!");
static_assert(offsetof(UOfferPurchaseButton_C, HoveredAnim) == 0x002F88, "Member 'UOfferPurchaseButton_C::HoveredAnim' has a wrong offset!");
static_assert(offsetof(UOfferPurchaseButton_C, Background) == 0x002F90, "Member 'UOfferPurchaseButton_C::Background' has a wrong offset!");
static_assert(offsetof(UOfferPurchaseButton_C, Border) == 0x002F98, "Member 'UOfferPurchaseButton_C::Border' has a wrong offset!");
static_assert(offsetof(UOfferPurchaseButton_C, Button) == 0x002FA0, "Member 'UOfferPurchaseButton_C::Button' has a wrong offset!");
static_assert(offsetof(UOfferPurchaseButton_C, CharacterPrice) == 0x002FA8, "Member 'UOfferPurchaseButton_C::CharacterPrice' has a wrong offset!");
static_assert(offsetof(UOfferPurchaseButton_C, CurrencyIcon) == 0x002FB0, "Member 'UOfferPurchaseButton_C::CurrencyIcon' has a wrong offset!");
static_assert(offsetof(UOfferPurchaseButton_C, Image_85) == 0x002FB8, "Member 'UOfferPurchaseButton_C::Image_85' has a wrong offset!");
static_assert(offsetof(UOfferPurchaseButton_C, Image_148) == 0x002FC0, "Member 'UOfferPurchaseButton_C::Image_148' has a wrong offset!");
static_assert(offsetof(UOfferPurchaseButton_C, Material) == 0x002FC8, "Member 'UOfferPurchaseButton_C::Material' has a wrong offset!");
static_assert(offsetof(UOfferPurchaseButton_C, RootSizeBox) == 0x002FD0, "Member 'UOfferPurchaseButton_C::RootSizeBox' has a wrong offset!");
static_assert(offsetof(UOfferPurchaseButton_C, Character) == 0x002FD8, "Member 'UOfferPurchaseButton_C::Character' has a wrong offset!");
static_assert(offsetof(UOfferPurchaseButton_C, Premium) == 0x002FE0, "Member 'UOfferPurchaseButton_C::Premium' has a wrong offset!");
static_assert(offsetof(UOfferPurchaseButton_C, Offer) == 0x002FE8, "Member 'UOfferPurchaseButton_C::Offer' has a wrong offset!");

}

