#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OfferListMessageBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass OfferListMessageBox.OfferListMessageBox_C
// 0x0050 (0x04D0 - 0x0480)
class UOfferListMessageBox_C final : public UMarinerOfferListMessageBox
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_73;                                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_118;                                         // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_202;                                         // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_218;                                         // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_314;                                         // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Material;                                          // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OpacityBacker;                                     // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerScrollBox*                      RewardScrollBox;                                   // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopBar;                                            // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_OfferListMessageBox(int32 EntryPoint);
	void PopulateNativeOffer(class UMarinerLayeredButton* ButtonInstance, const class FString& OfferId);
	void PopulateOffer(class UMarinerLayeredButton* ButtonInstance, const class FString& OfferId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OfferListMessageBox_C">();
	}
	static class UOfferListMessageBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOfferListMessageBox_C>();
	}
};
static_assert(alignof(UOfferListMessageBox_C) == 0x000008, "Wrong alignment on UOfferListMessageBox_C");
static_assert(sizeof(UOfferListMessageBox_C) == 0x0004D0, "Wrong size on UOfferListMessageBox_C");
static_assert(offsetof(UOfferListMessageBox_C, UberGraphFrame) == 0x000480, "Member 'UOfferListMessageBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOfferListMessageBox_C, Image_73) == 0x000488, "Member 'UOfferListMessageBox_C::Image_73' has a wrong offset!");
static_assert(offsetof(UOfferListMessageBox_C, Image_118) == 0x000490, "Member 'UOfferListMessageBox_C::Image_118' has a wrong offset!");
static_assert(offsetof(UOfferListMessageBox_C, Image_202) == 0x000498, "Member 'UOfferListMessageBox_C::Image_202' has a wrong offset!");
static_assert(offsetof(UOfferListMessageBox_C, Image_218) == 0x0004A0, "Member 'UOfferListMessageBox_C::Image_218' has a wrong offset!");
static_assert(offsetof(UOfferListMessageBox_C, Image_314) == 0x0004A8, "Member 'UOfferListMessageBox_C::Image_314' has a wrong offset!");
static_assert(offsetof(UOfferListMessageBox_C, Material) == 0x0004B0, "Member 'UOfferListMessageBox_C::Material' has a wrong offset!");
static_assert(offsetof(UOfferListMessageBox_C, OpacityBacker) == 0x0004B8, "Member 'UOfferListMessageBox_C::OpacityBacker' has a wrong offset!");
static_assert(offsetof(UOfferListMessageBox_C, RewardScrollBox) == 0x0004C0, "Member 'UOfferListMessageBox_C::RewardScrollBox' has a wrong offset!");
static_assert(offsetof(UOfferListMessageBox_C, TopBar) == 0x0004C8, "Member 'UOfferListMessageBox_C::TopBar' has a wrong offset!");

}

