#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OfferPurchaseButton

#include "Basic.hpp"

#include "Mariner_structs.hpp"
#include "MangoClient_structs.hpp"


namespace SDK::Params
{

// Function OfferPurchaseButton.OfferPurchaseButton_C.ExecuteUbergraph_OfferPurchaseButton
// 0x0150 (0x0150 - 0x0000)
struct OfferPurchaseButton_C_ExecuteUbergraph_OfferPurchaseButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2366[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerLayeredButton*                  K2Node_CustomEvent_Instance;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerAsyncUIFlowHandler*             CallFunc_Get_ReturnValue;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsyncFlowOffers_C*                     K2Node_DynamicCast_AsAsync_Flow_Offers;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2367[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0028(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2368[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0048(0x0018)()
	struct FMangoPurchaseOffer                    K2Node_CustomEvent_PurchaseOffer;                  // 0x0060(0x00D8)()
	class UMarinerPlayableCharacter*              K2Node_CustomEvent_Character;                      // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UMarinerLayeredButton* Instance)> K2Node_CreateDelegate_OutputDelegate;              // 0x0140(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(OfferPurchaseButton_C_ExecuteUbergraph_OfferPurchaseButton) == 0x000008, "Wrong alignment on OfferPurchaseButton_C_ExecuteUbergraph_OfferPurchaseButton");
static_assert(sizeof(OfferPurchaseButton_C_ExecuteUbergraph_OfferPurchaseButton) == 0x000150, "Wrong size on OfferPurchaseButton_C_ExecuteUbergraph_OfferPurchaseButton");
static_assert(offsetof(OfferPurchaseButton_C_ExecuteUbergraph_OfferPurchaseButton, EntryPoint) == 0x000000, "Member 'OfferPurchaseButton_C_ExecuteUbergraph_OfferPurchaseButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(OfferPurchaseButton_C_ExecuteUbergraph_OfferPurchaseButton, K2Node_CustomEvent_Instance) == 0x000008, "Member 'OfferPurchaseButton_C_ExecuteUbergraph_OfferPurchaseButton::K2Node_CustomEvent_Instance' has a wrong offset!");
static_assert(offsetof(OfferPurchaseButton_C_ExecuteUbergraph_OfferPurchaseButton, CallFunc_Get_ReturnValue) == 0x000010, "Member 'OfferPurchaseButton_C_ExecuteUbergraph_OfferPurchaseButton::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(OfferPurchaseButton_C_ExecuteUbergraph_OfferPurchaseButton, K2Node_DynamicCast_AsAsync_Flow_Offers) == 0x000018, "Member 'OfferPurchaseButton_C_ExecuteUbergraph_OfferPurchaseButton::K2Node_DynamicCast_AsAsync_Flow_Offers' has a wrong offset!");
static_assert(offsetof(OfferPurchaseButton_C_ExecuteUbergraph_OfferPurchaseButton, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'OfferPurchaseButton_C_ExecuteUbergraph_OfferPurchaseButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OfferPurchaseButton_C_ExecuteUbergraph_OfferPurchaseButton, CallFunc_Greater_IntInt_ReturnValue) == 0x000021, "Member 'OfferPurchaseButton_C_ExecuteUbergraph_OfferPurchaseButton::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OfferPurchaseButton_C_ExecuteUbergraph_OfferPurchaseButton, CallFunc_Conv_IntToText_ReturnValue) == 0x000028, "Member 'OfferPurchaseButton_C_ExecuteUbergraph_OfferPurchaseButton::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(OfferPurchaseButton_C_ExecuteUbergraph_OfferPurchaseButton, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000040, "Member 'OfferPurchaseButton_C_ExecuteUbergraph_OfferPurchaseButton::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OfferPurchaseButton_C_ExecuteUbergraph_OfferPurchaseButton, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000048, "Member 'OfferPurchaseButton_C_ExecuteUbergraph_OfferPurchaseButton::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OfferPurchaseButton_C_ExecuteUbergraph_OfferPurchaseButton, K2Node_CustomEvent_PurchaseOffer) == 0x000060, "Member 'OfferPurchaseButton_C_ExecuteUbergraph_OfferPurchaseButton::K2Node_CustomEvent_PurchaseOffer' has a wrong offset!");
static_assert(offsetof(OfferPurchaseButton_C_ExecuteUbergraph_OfferPurchaseButton, K2Node_CustomEvent_Character) == 0x000138, "Member 'OfferPurchaseButton_C_ExecuteUbergraph_OfferPurchaseButton::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(OfferPurchaseButton_C_ExecuteUbergraph_OfferPurchaseButton, K2Node_CreateDelegate_OutputDelegate) == 0x000140, "Member 'OfferPurchaseButton_C_ExecuteUbergraph_OfferPurchaseButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function OfferPurchaseButton.OfferPurchaseButton_C.BeginOfferPurchase
// 0x0008 (0x0008 - 0x0000)
struct OfferPurchaseButton_C_BeginOfferPurchase final
{
public:
	class UMarinerLayeredButton*                  Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OfferPurchaseButton_C_BeginOfferPurchase) == 0x000008, "Wrong alignment on OfferPurchaseButton_C_BeginOfferPurchase");
static_assert(sizeof(OfferPurchaseButton_C_BeginOfferPurchase) == 0x000008, "Wrong size on OfferPurchaseButton_C_BeginOfferPurchase");
static_assert(offsetof(OfferPurchaseButton_C_BeginOfferPurchase, Instance) == 0x000000, "Member 'OfferPurchaseButton_C_BeginOfferPurchase::Instance' has a wrong offset!");

// Function OfferPurchaseButton.OfferPurchaseButton_C.SetOffer
// 0x00E0 (0x00E0 - 0x0000)
struct OfferPurchaseButton_C_SetOffer final
{
public:
	struct FMangoPurchaseOffer                    PurchaseOffer;                                     // 0x0000(0x00D8)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UMarinerPlayableCharacter*              Param_Character;                                   // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OfferPurchaseButton_C_SetOffer) == 0x000008, "Wrong alignment on OfferPurchaseButton_C_SetOffer");
static_assert(sizeof(OfferPurchaseButton_C_SetOffer) == 0x0000E0, "Wrong size on OfferPurchaseButton_C_SetOffer");
static_assert(offsetof(OfferPurchaseButton_C_SetOffer, PurchaseOffer) == 0x000000, "Member 'OfferPurchaseButton_C_SetOffer::PurchaseOffer' has a wrong offset!");
static_assert(offsetof(OfferPurchaseButton_C_SetOffer, Param_Character) == 0x0000D8, "Member 'OfferPurchaseButton_C_SetOffer::Param_Character' has a wrong offset!");

// Function OfferPurchaseButton.OfferPurchaseButton_C.GetAssets
// 0x00D0 (0x00D0 - 0x0000)
struct OfferPurchaseButton_C_GetAssets final
{
public:
	struct FMarinerLayeredButtonAssets            ReturnValue;                                       // 0x0000(0x0068)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference)
	struct FMarinerLayeredButtonAssets            K2Node_MakeStruct_MarinerLayeredButtonAssets;      // 0x0068(0x0068)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(OfferPurchaseButton_C_GetAssets) == 0x000008, "Wrong alignment on OfferPurchaseButton_C_GetAssets");
static_assert(sizeof(OfferPurchaseButton_C_GetAssets) == 0x0000D0, "Wrong size on OfferPurchaseButton_C_GetAssets");
static_assert(offsetof(OfferPurchaseButton_C_GetAssets, ReturnValue) == 0x000000, "Member 'OfferPurchaseButton_C_GetAssets::ReturnValue' has a wrong offset!");
static_assert(offsetof(OfferPurchaseButton_C_GetAssets, K2Node_MakeStruct_MarinerLayeredButtonAssets) == 0x000068, "Member 'OfferPurchaseButton_C_GetAssets::K2Node_MakeStruct_MarinerLayeredButtonAssets' has a wrong offset!");

}

