#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnboardingLockWidget

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass OnboardingLockWidget.OnboardingLockWidget_C
// 0x0038 (0x0288 - 0x0250)
class UOnboardingLockWidget_C final : public UMarinerSingleAnimationWidget
{
public:
	class UImage*                                 Fuelparticles;                                     // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow;                                              // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LockBase;                                          // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LockTop;                                           // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RadialLightRays;                                   // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shockwave;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerLayeredButton*                  ParentButton;                                      // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OnboardingLockWidget_C">();
	}
	static class UOnboardingLockWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnboardingLockWidget_C>();
	}
};
static_assert(alignof(UOnboardingLockWidget_C) == 0x000008, "Wrong alignment on UOnboardingLockWidget_C");
static_assert(sizeof(UOnboardingLockWidget_C) == 0x000288, "Wrong size on UOnboardingLockWidget_C");
static_assert(offsetof(UOnboardingLockWidget_C, Fuelparticles) == 0x000250, "Member 'UOnboardingLockWidget_C::Fuelparticles' has a wrong offset!");
static_assert(offsetof(UOnboardingLockWidget_C, Glow) == 0x000258, "Member 'UOnboardingLockWidget_C::Glow' has a wrong offset!");
static_assert(offsetof(UOnboardingLockWidget_C, LockBase) == 0x000260, "Member 'UOnboardingLockWidget_C::LockBase' has a wrong offset!");
static_assert(offsetof(UOnboardingLockWidget_C, LockTop) == 0x000268, "Member 'UOnboardingLockWidget_C::LockTop' has a wrong offset!");
static_assert(offsetof(UOnboardingLockWidget_C, RadialLightRays) == 0x000270, "Member 'UOnboardingLockWidget_C::RadialLightRays' has a wrong offset!");
static_assert(offsetof(UOnboardingLockWidget_C, Shockwave) == 0x000278, "Member 'UOnboardingLockWidget_C::Shockwave' has a wrong offset!");
static_assert(offsetof(UOnboardingLockWidget_C, ParentButton) == 0x000280, "Member 'UOnboardingLockWidget_C::ParentButton' has a wrong offset!");

}

