#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnPreroundCountdownPayload

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct OnPreroundCountdownPayload.OnPreroundCountdownPayload
// 0x000C (0x000C - 0x0000)
struct FOnPreroundCountdownPayload final
{
public:
	int32                                         TimeLeft_2_35C045B74A676E16828B56810F848F8B;       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxTimeToShow_4_2D168BA442EC7D520BB242BA387D8A8B;  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldEnable_7_CB1F992C4F10469BB8977EB686CA8058;  // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         ReplicationByte_13_C3AC847F4A51785A4800F5BC012B68AA; // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FOnPreroundCountdownPayload) == 0x000004, "Wrong alignment on FOnPreroundCountdownPayload");
static_assert(sizeof(FOnPreroundCountdownPayload) == 0x00000C, "Wrong size on FOnPreroundCountdownPayload");
static_assert(offsetof(FOnPreroundCountdownPayload, TimeLeft_2_35C045B74A676E16828B56810F848F8B) == 0x000000, "Member 'FOnPreroundCountdownPayload::TimeLeft_2_35C045B74A676E16828B56810F848F8B' has a wrong offset!");
static_assert(offsetof(FOnPreroundCountdownPayload, MaxTimeToShow_4_2D168BA442EC7D520BB242BA387D8A8B) == 0x000004, "Member 'FOnPreroundCountdownPayload::MaxTimeToShow_4_2D168BA442EC7D520BB242BA387D8A8B' has a wrong offset!");
static_assert(offsetof(FOnPreroundCountdownPayload, bShouldEnable_7_CB1F992C4F10469BB8977EB686CA8058) == 0x000008, "Member 'FOnPreroundCountdownPayload::bShouldEnable_7_CB1F992C4F10469BB8977EB686CA8058' has a wrong offset!");
static_assert(offsetof(FOnPreroundCountdownPayload, ReplicationByte_13_C3AC847F4A51785A4800F5BC012B68AA) == 0x000009, "Member 'FOnPreroundCountdownPayload::ReplicationByte_13_C3AC847F4A51785A4800F5BC012B68AA' has a wrong offset!");

}

