#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OwnedItemWidget

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass OwnedItemWidget.OwnedItemWidget_C
// 0x0030 (0x0448 - 0x0418)
class UOwnedItemWidget_C final : public UMarinerAnimatedWidget
{
public:
	class UTextBlock*                             ItemName;                                          // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RarityBarColor;                                    // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaritySymbol;                                      // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RarityText;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemLoadResponse*                      ItemLoadResponse;                                  // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOwned;                                           // 0x0440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	bool Populate();
	void SetOwnedItem(class UItemLoadResponse* ItemLoadResponse_0, bool IsOwned_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OwnedItemWidget_C">();
	}
	static class UOwnedItemWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOwnedItemWidget_C>();
	}
};
static_assert(alignof(UOwnedItemWidget_C) == 0x000008, "Wrong alignment on UOwnedItemWidget_C");
static_assert(sizeof(UOwnedItemWidget_C) == 0x000448, "Wrong size on UOwnedItemWidget_C");
static_assert(offsetof(UOwnedItemWidget_C, ItemName) == 0x000418, "Member 'UOwnedItemWidget_C::ItemName' has a wrong offset!");
static_assert(offsetof(UOwnedItemWidget_C, RarityBarColor) == 0x000420, "Member 'UOwnedItemWidget_C::RarityBarColor' has a wrong offset!");
static_assert(offsetof(UOwnedItemWidget_C, RaritySymbol) == 0x000428, "Member 'UOwnedItemWidget_C::RaritySymbol' has a wrong offset!");
static_assert(offsetof(UOwnedItemWidget_C, RarityText) == 0x000430, "Member 'UOwnedItemWidget_C::RarityText' has a wrong offset!");
static_assert(offsetof(UOwnedItemWidget_C, ItemLoadResponse) == 0x000438, "Member 'UOwnedItemWidget_C::ItemLoadResponse' has a wrong offset!");
static_assert(offsetof(UOwnedItemWidget_C, IsOwned) == 0x000440, "Member 'UOwnedItemWidget_C::IsOwned' has a wrong offset!");

}

