#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PartyMenuStack

#include "Basic.hpp"

#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function PartyMenuStack.PartyMenuStack_C.ExecuteUbergraph_PartyMenuStack
// 0x0050 (0x0050 - 0x0000)
struct PartyMenuStack_C_ExecuteUbergraph_PartyMenuStack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bToSubLayer;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F23[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActivateStackManager_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasActiveOrPendingRootLayer_ReturnValue;  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F24[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMarinerMenuStackManagerSetup          K2Node_MakeStruct_MarinerMenuStackManagerSetup;    // 0x0018(0x0028)(NoDestructor, ContainsInstancedReference)
	class UMangoFriendsManager*                   CallFunc_Get_ReturnValue;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesPlatformSupportFriendManagement_ReturnValue; // 0x0048(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyMenuStack_C_ExecuteUbergraph_PartyMenuStack) == 0x000008, "Wrong alignment on PartyMenuStack_C_ExecuteUbergraph_PartyMenuStack");
static_assert(sizeof(PartyMenuStack_C_ExecuteUbergraph_PartyMenuStack) == 0x000050, "Wrong size on PartyMenuStack_C_ExecuteUbergraph_PartyMenuStack");
static_assert(offsetof(PartyMenuStack_C_ExecuteUbergraph_PartyMenuStack, EntryPoint) == 0x000000, "Member 'PartyMenuStack_C_ExecuteUbergraph_PartyMenuStack::EntryPoint' has a wrong offset!");
static_assert(offsetof(PartyMenuStack_C_ExecuteUbergraph_PartyMenuStack, K2Node_Event_bToSubLayer) == 0x000004, "Member 'PartyMenuStack_C_ExecuteUbergraph_PartyMenuStack::K2Node_Event_bToSubLayer' has a wrong offset!");
static_assert(offsetof(PartyMenuStack_C_ExecuteUbergraph_PartyMenuStack, CallFunc_GetMenuManager_ReturnValue) == 0x000008, "Member 'PartyMenuStack_C_ExecuteUbergraph_PartyMenuStack::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyMenuStack_C_ExecuteUbergraph_PartyMenuStack, CallFunc_ActivateStackManager_ReturnValue) == 0x000010, "Member 'PartyMenuStack_C_ExecuteUbergraph_PartyMenuStack::CallFunc_ActivateStackManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyMenuStack_C_ExecuteUbergraph_PartyMenuStack, CallFunc_HasActiveOrPendingRootLayer_ReturnValue) == 0x000011, "Member 'PartyMenuStack_C_ExecuteUbergraph_PartyMenuStack::CallFunc_HasActiveOrPendingRootLayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyMenuStack_C_ExecuteUbergraph_PartyMenuStack, K2Node_MakeStruct_MarinerMenuStackManagerSetup) == 0x000018, "Member 'PartyMenuStack_C_ExecuteUbergraph_PartyMenuStack::K2Node_MakeStruct_MarinerMenuStackManagerSetup' has a wrong offset!");
static_assert(offsetof(PartyMenuStack_C_ExecuteUbergraph_PartyMenuStack, CallFunc_Get_ReturnValue) == 0x000040, "Member 'PartyMenuStack_C_ExecuteUbergraph_PartyMenuStack::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyMenuStack_C_ExecuteUbergraph_PartyMenuStack, CallFunc_DoesPlatformSupportFriendManagement_ReturnValue) == 0x000048, "Member 'PartyMenuStack_C_ExecuteUbergraph_PartyMenuStack::CallFunc_DoesPlatformSupportFriendManagement_ReturnValue' has a wrong offset!");

// Function PartyMenuStack.PartyMenuStack_C.BP_OnExited
// 0x0001 (0x0001 - 0x0000)
struct PartyMenuStack_C_BP_OnExited final
{
public:
	bool                                          bToSubLayer;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyMenuStack_C_BP_OnExited) == 0x000001, "Wrong alignment on PartyMenuStack_C_BP_OnExited");
static_assert(sizeof(PartyMenuStack_C_BP_OnExited) == 0x000001, "Wrong size on PartyMenuStack_C_BP_OnExited");
static_assert(offsetof(PartyMenuStack_C_BP_OnExited, bToSubLayer) == 0x000000, "Member 'PartyMenuStack_C_BP_OnExited::bToSubLayer' has a wrong offset!");

// Function PartyMenuStack.PartyMenuStack_C.UpdatePlayerHeaderIsOnGameTabs
// 0x0010 (0x0010 - 0x0000)
struct PartyMenuStack_C_UpdatePlayerHeaderIsOnGameTabs final
{
public:
	bool                                          bGameTabs;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F25[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyMenuStack_C_UpdatePlayerHeaderIsOnGameTabs) == 0x000008, "Wrong alignment on PartyMenuStack_C_UpdatePlayerHeaderIsOnGameTabs");
static_assert(sizeof(PartyMenuStack_C_UpdatePlayerHeaderIsOnGameTabs) == 0x000010, "Wrong size on PartyMenuStack_C_UpdatePlayerHeaderIsOnGameTabs");
static_assert(offsetof(PartyMenuStack_C_UpdatePlayerHeaderIsOnGameTabs, bGameTabs) == 0x000000, "Member 'PartyMenuStack_C_UpdatePlayerHeaderIsOnGameTabs::bGameTabs' has a wrong offset!");
static_assert(offsetof(PartyMenuStack_C_UpdatePlayerHeaderIsOnGameTabs, CallFunc_GetMenuManager_ReturnValue) == 0x000008, "Member 'PartyMenuStack_C_UpdatePlayerHeaderIsOnGameTabs::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");

}

