#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PartyMenuStack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PartyMenuStack.PartyMenuStack_C
// 0x0048 (0x06E0 - 0x0698)
class UPartyMenuStack_C final : public UMarinerMenuStackManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0698(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPrimaryStackButtonWidget_C*            FriendsAndParty;                                   // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPrimaryStackButtonWidget_C*            Invites;                                           // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPrompt_C*                       LTPrompt;                                          // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerGridPanel*                      NavRibbon;                                         // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPartyDefaultStackBase_C*               PartyDefaultStackBase;                             // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPrimaryStackButtonWidget_C*            Profile;                                           // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPrompt_C*                       RTPrompt;                                          // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuTooltipBase_C*                     ToolTip;                                           // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PartyMenuStack(int32 EntryPoint);
	void BP_OnExited(bool bToSubLayer);
	void Construct();
	void UpdatePlayerHeaderIsOnGameTabs(bool bGameTabs);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PartyMenuStack_C">();
	}
	static class UPartyMenuStack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPartyMenuStack_C>();
	}
};
static_assert(alignof(UPartyMenuStack_C) == 0x000008, "Wrong alignment on UPartyMenuStack_C");
static_assert(sizeof(UPartyMenuStack_C) == 0x0006E0, "Wrong size on UPartyMenuStack_C");
static_assert(offsetof(UPartyMenuStack_C, UberGraphFrame) == 0x000698, "Member 'UPartyMenuStack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPartyMenuStack_C, FriendsAndParty) == 0x0006A0, "Member 'UPartyMenuStack_C::FriendsAndParty' has a wrong offset!");
static_assert(offsetof(UPartyMenuStack_C, Invites) == 0x0006A8, "Member 'UPartyMenuStack_C::Invites' has a wrong offset!");
static_assert(offsetof(UPartyMenuStack_C, LTPrompt) == 0x0006B0, "Member 'UPartyMenuStack_C::LTPrompt' has a wrong offset!");
static_assert(offsetof(UPartyMenuStack_C, NavRibbon) == 0x0006B8, "Member 'UPartyMenuStack_C::NavRibbon' has a wrong offset!");
static_assert(offsetof(UPartyMenuStack_C, PartyDefaultStackBase) == 0x0006C0, "Member 'UPartyMenuStack_C::PartyDefaultStackBase' has a wrong offset!");
static_assert(offsetof(UPartyMenuStack_C, Profile) == 0x0006C8, "Member 'UPartyMenuStack_C::Profile' has a wrong offset!");
static_assert(offsetof(UPartyMenuStack_C, RTPrompt) == 0x0006D0, "Member 'UPartyMenuStack_C::RTPrompt' has a wrong offset!");
static_assert(offsetof(UPartyMenuStack_C, ToolTip) == 0x0006D8, "Member 'UPartyMenuStack_C::ToolTip' has a wrong offset!");

}

