#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PauseMenuStack

#include "Basic.hpp"

#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function PauseMenuStack.PauseMenuStack_C.ExecuteUbergraph_PauseMenuStack
// 0x0048 (0x0048 - 0x0000)
struct PauseMenuStack_C_ExecuteUbergraph_PauseMenuStack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFromSubMenu;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bToSubLayer;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMarinerMenuStackManagerSetup          K2Node_MakeStruct_MarinerMenuStackManagerSetup;    // 0x0008(0x0028)(NoDestructor, ContainsInstancedReference)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMarinerCharacter*                      K2Node_DynamicCast_AsMariner_Character;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PauseMenuStack_C_ExecuteUbergraph_PauseMenuStack) == 0x000008, "Wrong alignment on PauseMenuStack_C_ExecuteUbergraph_PauseMenuStack");
static_assert(sizeof(PauseMenuStack_C_ExecuteUbergraph_PauseMenuStack) == 0x000048, "Wrong size on PauseMenuStack_C_ExecuteUbergraph_PauseMenuStack");
static_assert(offsetof(PauseMenuStack_C_ExecuteUbergraph_PauseMenuStack, EntryPoint) == 0x000000, "Member 'PauseMenuStack_C_ExecuteUbergraph_PauseMenuStack::EntryPoint' has a wrong offset!");
static_assert(offsetof(PauseMenuStack_C_ExecuteUbergraph_PauseMenuStack, K2Node_Event_bFromSubMenu) == 0x000004, "Member 'PauseMenuStack_C_ExecuteUbergraph_PauseMenuStack::K2Node_Event_bFromSubMenu' has a wrong offset!");
static_assert(offsetof(PauseMenuStack_C_ExecuteUbergraph_PauseMenuStack, K2Node_Event_bToSubLayer) == 0x000005, "Member 'PauseMenuStack_C_ExecuteUbergraph_PauseMenuStack::K2Node_Event_bToSubLayer' has a wrong offset!");
static_assert(offsetof(PauseMenuStack_C_ExecuteUbergraph_PauseMenuStack, K2Node_MakeStruct_MarinerMenuStackManagerSetup) == 0x000008, "Member 'PauseMenuStack_C_ExecuteUbergraph_PauseMenuStack::K2Node_MakeStruct_MarinerMenuStackManagerSetup' has a wrong offset!");
static_assert(offsetof(PauseMenuStack_C_ExecuteUbergraph_PauseMenuStack, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000030, "Member 'PauseMenuStack_C_ExecuteUbergraph_PauseMenuStack::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(PauseMenuStack_C_ExecuteUbergraph_PauseMenuStack, K2Node_DynamicCast_AsMariner_Character) == 0x000038, "Member 'PauseMenuStack_C_ExecuteUbergraph_PauseMenuStack::K2Node_DynamicCast_AsMariner_Character' has a wrong offset!");
static_assert(offsetof(PauseMenuStack_C_ExecuteUbergraph_PauseMenuStack, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'PauseMenuStack_C_ExecuteUbergraph_PauseMenuStack::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function PauseMenuStack.PauseMenuStack_C.BP_OnExited
// 0x0001 (0x0001 - 0x0000)
struct PauseMenuStack_C_BP_OnExited final
{
public:
	bool                                          bToSubLayer;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PauseMenuStack_C_BP_OnExited) == 0x000001, "Wrong alignment on PauseMenuStack_C_BP_OnExited");
static_assert(sizeof(PauseMenuStack_C_BP_OnExited) == 0x000001, "Wrong size on PauseMenuStack_C_BP_OnExited");
static_assert(offsetof(PauseMenuStack_C_BP_OnExited, bToSubLayer) == 0x000000, "Member 'PauseMenuStack_C_BP_OnExited::bToSubLayer' has a wrong offset!");

// Function PauseMenuStack.PauseMenuStack_C.BP_OnEntered
// 0x0001 (0x0001 - 0x0000)
struct PauseMenuStack_C_BP_OnEntered final
{
public:
	bool                                          bFromSubMenu;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PauseMenuStack_C_BP_OnEntered) == 0x000001, "Wrong alignment on PauseMenuStack_C_BP_OnEntered");
static_assert(sizeof(PauseMenuStack_C_BP_OnEntered) == 0x000001, "Wrong size on PauseMenuStack_C_BP_OnEntered");
static_assert(offsetof(PauseMenuStack_C_BP_OnEntered, bFromSubMenu) == 0x000000, "Member 'PauseMenuStack_C_BP_OnEntered::bFromSubMenu' has a wrong offset!");

// Function PauseMenuStack.PauseMenuStack_C.SuppressInput
// 0x0020 (0x0020 - 0x0000)
struct PauseMenuStack_C_SuppressInput final
{
public:
	bool                                          Suppress;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMarinerPlayerController*               K2Node_DynamicCast_AsMariner_Player_Controller;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PauseMenuStack_C_SuppressInput) == 0x000008, "Wrong alignment on PauseMenuStack_C_SuppressInput");
static_assert(sizeof(PauseMenuStack_C_SuppressInput) == 0x000020, "Wrong size on PauseMenuStack_C_SuppressInput");
static_assert(offsetof(PauseMenuStack_C_SuppressInput, Suppress) == 0x000000, "Member 'PauseMenuStack_C_SuppressInput::Suppress' has a wrong offset!");
static_assert(offsetof(PauseMenuStack_C_SuppressInput, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'PauseMenuStack_C_SuppressInput::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PauseMenuStack_C_SuppressInput, K2Node_DynamicCast_AsMariner_Player_Controller) == 0x000010, "Member 'PauseMenuStack_C_SuppressInput::K2Node_DynamicCast_AsMariner_Player_Controller' has a wrong offset!");
static_assert(offsetof(PauseMenuStack_C_SuppressInput, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PauseMenuStack_C_SuppressInput::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PauseMenuStack_C_SuppressInput, CallFunc_HasAuthority_ReturnValue) == 0x000019, "Member 'PauseMenuStack_C_SuppressInput::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

}

