#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PauseMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PauseMenu.PauseMenu_C
// 0x0070 (0x0728 - 0x06B8)
class UPauseMenu_C final : public UMarinerInGamePauseMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ResumeHoverAnim;                                   // 0x06C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UArtifactHighlight_C*                   ActiveArtifact;                                    // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CharacterName;                                     // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBoxMutePlayer_C*                  CheckBoxMutePlayer1;                               // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBoxMutePlayer_C*                  CheckBoxMutePlayer2;                               // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Header;                                            // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Material;                                          // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MaterialBacker;                                    // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterAbility_C*                    Primary;                                           // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterAbility_C*                    Secondary;                                         // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerButton*                         Settings;                                          // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterAbility_C*                    Special;                                           // 0x0718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bMutePlayersMenuOpen;                              // 0x0720(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_PauseMenu(int32 EntryPoint);
	void Dummy2(const struct FKey& KeyPressed);
	void ConfirmLeaveNoLoss(const struct FKey& KeyPressed);
	void Dummy1(const struct FKey& KeyPressed);
	void ConfirmLeaveAndLoss(const struct FKey& KeyPressed);
	void LoadArtifactData(const TSoftClassPtr<class UClass>& CharacterClass);
	void FinishMatchNoOp(const struct FKey& KeyPressed);
	void LeaveGameConfirm(const struct FKey& KeyPressed);
	void BndEvt__QuitMatch_K2Node_ComponentBoundEvent_137_OnButtonClickedEvent__DelegateSignature();
	void BP_OnEntered(bool bFromSubMenu);
	void BndEvt__Settings_K2Node_ComponentBoundEvent_128_OnButtonClickedEvent__DelegateSignature();
	void LoadFinished_628E3A0C4AF26E19232397955439E9D7(const TArray<class UItemLoadResponse*>& LoadedDataResponse);
	void LoadFailed_628E3A0C4AF26E19232397955439E9D7();
	void PopulateActiveCharacter();
	void ConfirtmLeave();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PauseMenu_C">();
	}
	static class UPauseMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPauseMenu_C>();
	}
};
static_assert(alignof(UPauseMenu_C) == 0x000008, "Wrong alignment on UPauseMenu_C");
static_assert(sizeof(UPauseMenu_C) == 0x000728, "Wrong size on UPauseMenu_C");
static_assert(offsetof(UPauseMenu_C, UberGraphFrame) == 0x0006B8, "Member 'UPauseMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPauseMenu_C, ResumeHoverAnim) == 0x0006C0, "Member 'UPauseMenu_C::ResumeHoverAnim' has a wrong offset!");
static_assert(offsetof(UPauseMenu_C, ActiveArtifact) == 0x0006C8, "Member 'UPauseMenu_C::ActiveArtifact' has a wrong offset!");
static_assert(offsetof(UPauseMenu_C, CharacterName) == 0x0006D0, "Member 'UPauseMenu_C::CharacterName' has a wrong offset!");
static_assert(offsetof(UPauseMenu_C, CheckBoxMutePlayer1) == 0x0006D8, "Member 'UPauseMenu_C::CheckBoxMutePlayer1' has a wrong offset!");
static_assert(offsetof(UPauseMenu_C, CheckBoxMutePlayer2) == 0x0006E0, "Member 'UPauseMenu_C::CheckBoxMutePlayer2' has a wrong offset!");
static_assert(offsetof(UPauseMenu_C, Header) == 0x0006E8, "Member 'UPauseMenu_C::Header' has a wrong offset!");
static_assert(offsetof(UPauseMenu_C, Material) == 0x0006F0, "Member 'UPauseMenu_C::Material' has a wrong offset!");
static_assert(offsetof(UPauseMenu_C, MaterialBacker) == 0x0006F8, "Member 'UPauseMenu_C::MaterialBacker' has a wrong offset!");
static_assert(offsetof(UPauseMenu_C, Primary) == 0x000700, "Member 'UPauseMenu_C::Primary' has a wrong offset!");
static_assert(offsetof(UPauseMenu_C, Secondary) == 0x000708, "Member 'UPauseMenu_C::Secondary' has a wrong offset!");
static_assert(offsetof(UPauseMenu_C, Settings) == 0x000710, "Member 'UPauseMenu_C::Settings' has a wrong offset!");
static_assert(offsetof(UPauseMenu_C, Special) == 0x000718, "Member 'UPauseMenu_C::Special' has a wrong offset!");
static_assert(offsetof(UPauseMenu_C, bMutePlayersMenuOpen) == 0x000720, "Member 'UPauseMenu_C::bMutePlayersMenuOpen' has a wrong offset!");

}

