#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlaylistsMenu

#include "Basic.hpp"

#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function PlaylistsMenu.PlaylistsMenu_C.ExecuteUbergraph_PlaylistsMenu
// 0x0068 (0x0068 - 0x0000)
struct PlaylistsMenu_C_ExecuteUbergraph_PlaylistsMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerLayeredButton*                  K2Node_ComponentBoundEvent_Instance;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameInstance*                   CallFunc_GetMarinerGameInstance_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMarinerServerTravelConfig             K2Node_MakeStruct_MarinerServerTravelConfig;       // 0x0018(0x0040)()
	class UMarinerLayeredButton*                  K2Node_ComponentBoundEvent_Instance_1;             // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMangoPrivateMatchManager*              CallFunc_Get_ReturnValue;                          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlaylistsMenu_C_ExecuteUbergraph_PlaylistsMenu) == 0x000008, "Wrong alignment on PlaylistsMenu_C_ExecuteUbergraph_PlaylistsMenu");
static_assert(sizeof(PlaylistsMenu_C_ExecuteUbergraph_PlaylistsMenu) == 0x000068, "Wrong size on PlaylistsMenu_C_ExecuteUbergraph_PlaylistsMenu");
static_assert(offsetof(PlaylistsMenu_C_ExecuteUbergraph_PlaylistsMenu, EntryPoint) == 0x000000, "Member 'PlaylistsMenu_C_ExecuteUbergraph_PlaylistsMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlaylistsMenu_C_ExecuteUbergraph_PlaylistsMenu, K2Node_ComponentBoundEvent_Instance) == 0x000008, "Member 'PlaylistsMenu_C_ExecuteUbergraph_PlaylistsMenu::K2Node_ComponentBoundEvent_Instance' has a wrong offset!");
static_assert(offsetof(PlaylistsMenu_C_ExecuteUbergraph_PlaylistsMenu, CallFunc_GetMarinerGameInstance_ReturnValue) == 0x000010, "Member 'PlaylistsMenu_C_ExecuteUbergraph_PlaylistsMenu::CallFunc_GetMarinerGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlaylistsMenu_C_ExecuteUbergraph_PlaylistsMenu, K2Node_MakeStruct_MarinerServerTravelConfig) == 0x000018, "Member 'PlaylistsMenu_C_ExecuteUbergraph_PlaylistsMenu::K2Node_MakeStruct_MarinerServerTravelConfig' has a wrong offset!");
static_assert(offsetof(PlaylistsMenu_C_ExecuteUbergraph_PlaylistsMenu, K2Node_ComponentBoundEvent_Instance_1) == 0x000058, "Member 'PlaylistsMenu_C_ExecuteUbergraph_PlaylistsMenu::K2Node_ComponentBoundEvent_Instance_1' has a wrong offset!");
static_assert(offsetof(PlaylistsMenu_C_ExecuteUbergraph_PlaylistsMenu, CallFunc_Get_ReturnValue) == 0x000060, "Member 'PlaylistsMenu_C_ExecuteUbergraph_PlaylistsMenu::CallFunc_Get_ReturnValue' has a wrong offset!");

// Function PlaylistsMenu.PlaylistsMenu_C.BndEvt__NewPractice_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PlaylistsMenu_C_BndEvt__NewPractice_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature final
{
public:
	class UMarinerLayeredButton*                  Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlaylistsMenu_C_BndEvt__NewPractice_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on PlaylistsMenu_C_BndEvt__NewPractice_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature");
static_assert(sizeof(PlaylistsMenu_C_BndEvt__NewPractice_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong size on PlaylistsMenu_C_BndEvt__NewPractice_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature");
static_assert(offsetof(PlaylistsMenu_C_BndEvt__NewPractice_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature, Instance) == 0x000000, "Member 'PlaylistsMenu_C_BndEvt__NewPractice_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature::Instance' has a wrong offset!");

// Function PlaylistsMenu.PlaylistsMenu_C.BndEvt__NewPrivateMatch_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PlaylistsMenu_C_BndEvt__NewPrivateMatch_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature final
{
public:
	class UMarinerLayeredButton*                  Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlaylistsMenu_C_BndEvt__NewPrivateMatch_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on PlaylistsMenu_C_BndEvt__NewPrivateMatch_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature");
static_assert(sizeof(PlaylistsMenu_C_BndEvt__NewPrivateMatch_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong size on PlaylistsMenu_C_BndEvt__NewPrivateMatch_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature");
static_assert(offsetof(PlaylistsMenu_C_BndEvt__NewPrivateMatch_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature, Instance) == 0x000000, "Member 'PlaylistsMenu_C_BndEvt__NewPrivateMatch_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature::Instance' has a wrong offset!");

}

