#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlaylistsMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlaylistsMenu.PlaylistsMenu_C
// 0x0040 (0x0A90 - 0x0A50)
class UPlaylistsMenu_C final : public UMarinerPlaylistMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A50(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewAnimation;                                      // 0x0A58(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDummyPlaylistWidget_C*                 DummyPlaylistWidget;                               // 0x0A60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPracticeButton_C*                      Practice;                                          // 0x0A68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultOnboardingButton_C*             PrivateMatch;                                      // 0x0A70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuitPenaltyWidget_C*                   QuitPenalityWidget;                                // 0x0A78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPlaylistGroupButton_C*          RankedPlaylistGroup;                               // 0x0A80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPlaylistGroupButton_C*          SocialPlaylistGroup;                               // 0x0A88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PlaylistsMenu(int32 EntryPoint);
	void BndEvt__NewPractice_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature(class UMarinerLayeredButton* Instance);
	void BndEvt__NewPrivateMatch_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature(class UMarinerLayeredButton* Instance);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlaylistsMenu_C">();
	}
	static class UPlaylistsMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlaylistsMenu_C>();
	}
};
static_assert(alignof(UPlaylistsMenu_C) == 0x000008, "Wrong alignment on UPlaylistsMenu_C");
static_assert(sizeof(UPlaylistsMenu_C) == 0x000A90, "Wrong size on UPlaylistsMenu_C");
static_assert(offsetof(UPlaylistsMenu_C, UberGraphFrame) == 0x000A50, "Member 'UPlaylistsMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlaylistsMenu_C, NewAnimation) == 0x000A58, "Member 'UPlaylistsMenu_C::NewAnimation' has a wrong offset!");
static_assert(offsetof(UPlaylistsMenu_C, DummyPlaylistWidget) == 0x000A60, "Member 'UPlaylistsMenu_C::DummyPlaylistWidget' has a wrong offset!");
static_assert(offsetof(UPlaylistsMenu_C, Practice) == 0x000A68, "Member 'UPlaylistsMenu_C::Practice' has a wrong offset!");
static_assert(offsetof(UPlaylistsMenu_C, PrivateMatch) == 0x000A70, "Member 'UPlaylistsMenu_C::PrivateMatch' has a wrong offset!");
static_assert(offsetof(UPlaylistsMenu_C, QuitPenalityWidget) == 0x000A78, "Member 'UPlaylistsMenu_C::QuitPenalityWidget' has a wrong offset!");
static_assert(offsetof(UPlaylistsMenu_C, RankedPlaylistGroup) == 0x000A80, "Member 'UPlaylistsMenu_C::RankedPlaylistGroup' has a wrong offset!");
static_assert(offsetof(UPlaylistsMenu_C, SocialPlaylistGroup) == 0x000A88, "Member 'UPlaylistsMenu_C::SocialPlaylistGroup' has a wrong offset!");

}

