#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerHeader

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerHeader.PlayerHeader_C
// 0x0028 (0x0308 - 0x02E0)
class UPlayerHeader_C final : public UMarinerPlayerHeader
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HighlightAnim;                                     // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UServiceInterruptWidget_C*              ServiceInterruptWidget;                            // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          PartyWidgetEnabled;                                // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ProfileWidgetEnabled;                              // 0x0301(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_PlayerHeader(int32 EntryPoint);
	void BndEvt__HighlightButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void SetProfileWidgetEnabled(bool bEnabled);
	void BndEvt__HighlightButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void SetPartyWidgetEnabled(bool bEnabled);
	void BndEvt__HighlightButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void HandleInputDeviceChanged(EPlayerInputType InputType);
	void Construct();
	bool HandleInput(EMarinerInputActions InInput);
	void IsPartyWidgetAllowed(bool* Allowed);
	void IsProfileWidgetAllowed(bool* Allowed);
	void UpdateBackground(bool Highlighted);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerHeader_C">();
	}
	static class UPlayerHeader_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerHeader_C>();
	}
};
static_assert(alignof(UPlayerHeader_C) == 0x000008, "Wrong alignment on UPlayerHeader_C");
static_assert(sizeof(UPlayerHeader_C) == 0x000308, "Wrong size on UPlayerHeader_C");
static_assert(offsetof(UPlayerHeader_C, UberGraphFrame) == 0x0002E0, "Member 'UPlayerHeader_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerHeader_C, HighlightAnim) == 0x0002E8, "Member 'UPlayerHeader_C::HighlightAnim' has a wrong offset!");
static_assert(offsetof(UPlayerHeader_C, Background) == 0x0002F0, "Member 'UPlayerHeader_C::Background' has a wrong offset!");
static_assert(offsetof(UPlayerHeader_C, ServiceInterruptWidget) == 0x0002F8, "Member 'UPlayerHeader_C::ServiceInterruptWidget' has a wrong offset!");
static_assert(offsetof(UPlayerHeader_C, PartyWidgetEnabled) == 0x000300, "Member 'UPlayerHeader_C::PartyWidgetEnabled' has a wrong offset!");
static_assert(offsetof(UPlayerHeader_C, ProfileWidgetEnabled) == 0x000301, "Member 'UPlayerHeader_C::ProfileWidgetEnabled' has a wrong offset!");

}

