#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerPostGameWidget

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerPostGameWidget.PlayerPostGameWidget_C
// 0x0018 (0x0858 - 0x0840)
class UPlayerPostGameWidget_C final : public UMarinerPlayerPostGameWidget
{
public:
	class UCustomComboBox_C*                      CustomComboBox;                                    // 0x0840(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HighlightBorder;                                   // 0x0848(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerButton*                         HitArea;                                           // 0x0850(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	bool GetBackgroundColor(struct FLinearColor* OutColor);

	struct FMarinerSettingComboBoxAssets GetAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerPostGameWidget_C">();
	}
	static class UPlayerPostGameWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerPostGameWidget_C>();
	}
};
static_assert(alignof(UPlayerPostGameWidget_C) == 0x000008, "Wrong alignment on UPlayerPostGameWidget_C");
static_assert(sizeof(UPlayerPostGameWidget_C) == 0x000858, "Wrong size on UPlayerPostGameWidget_C");
static_assert(offsetof(UPlayerPostGameWidget_C, CustomComboBox) == 0x000840, "Member 'UPlayerPostGameWidget_C::CustomComboBox' has a wrong offset!");
static_assert(offsetof(UPlayerPostGameWidget_C, HighlightBorder) == 0x000848, "Member 'UPlayerPostGameWidget_C::HighlightBorder' has a wrong offset!");
static_assert(offsetof(UPlayerPostGameWidget_C, HitArea) == 0x000850, "Member 'UPlayerPostGameWidget_C::HitArea' has a wrong offset!");

}

