#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayNowButton

#include "Basic.hpp"

#include "Mariner_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function PlayNowButton.PlayNowButton_C.ExecuteUbergraph_PlayNowButton
// 0x0040 (0x0040 - 0x0000)
struct PlayNowButton_C_ExecuteUbergraph_PlayNowButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_210C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0010(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0020(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_210D[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayNowButton_C_ExecuteUbergraph_PlayNowButton) == 0x000008, "Wrong alignment on PlayNowButton_C_ExecuteUbergraph_PlayNowButton");
static_assert(sizeof(PlayNowButton_C_ExecuteUbergraph_PlayNowButton) == 0x000040, "Wrong size on PlayNowButton_C_ExecuteUbergraph_PlayNowButton");
static_assert(offsetof(PlayNowButton_C_ExecuteUbergraph_PlayNowButton, EntryPoint) == 0x000000, "Member 'PlayNowButton_C_ExecuteUbergraph_PlayNowButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayNowButton_C_ExecuteUbergraph_PlayNowButton, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'PlayNowButton_C_ExecuteUbergraph_PlayNowButton::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayNowButton_C_ExecuteUbergraph_PlayNowButton, Temp_struct_Variable) == 0x000010, "Member 'PlayNowButton_C_ExecuteUbergraph_PlayNowButton::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PlayNowButton_C_ExecuteUbergraph_PlayNowButton, Temp_delegate_Variable) == 0x000020, "Member 'PlayNowButton_C_ExecuteUbergraph_PlayNowButton::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(PlayNowButton_C_ExecuteUbergraph_PlayNowButton, CallFunc_PostEvent_ReturnValue) == 0x000030, "Member 'PlayNowButton_C_ExecuteUbergraph_PlayNowButton::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayNowButton_C_ExecuteUbergraph_PlayNowButton, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'PlayNowButton_C_ExecuteUbergraph_PlayNowButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function PlayNowButton.PlayNowButton_C.GetAssets
// 0x00D0 (0x00D0 - 0x0000)
struct PlayNowButton_C_GetAssets final
{
public:
	struct FMarinerLayeredButtonAssets            ReturnValue;                                       // 0x0000(0x0068)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference)
	struct FMarinerLayeredButtonAssets            K2Node_MakeStruct_MarinerLayeredButtonAssets;      // 0x0068(0x0068)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PlayNowButton_C_GetAssets) == 0x000008, "Wrong alignment on PlayNowButton_C_GetAssets");
static_assert(sizeof(PlayNowButton_C_GetAssets) == 0x0000D0, "Wrong size on PlayNowButton_C_GetAssets");
static_assert(offsetof(PlayNowButton_C_GetAssets, ReturnValue) == 0x000000, "Member 'PlayNowButton_C_GetAssets::ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayNowButton_C_GetAssets, K2Node_MakeStruct_MarinerLayeredButtonAssets) == 0x000068, "Member 'PlayNowButton_C_GetAssets::K2Node_MakeStruct_MarinerLayeredButtonAssets' has a wrong offset!");

}

