#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PoeSecondaryItemStunInterface

#include "Basic.hpp"


namespace SDK::Params
{

// Function PoeSecondaryItemStunInterface.PoeSecondaryItemStunInterface_C.GetCanItemBeStunned
// 0x0001 (0x0001 - 0x0000)
struct PoeSecondaryItemStunInterface_C_GetCanItemBeStunned final
{
public:
	bool                                          CanItemBeStunned;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PoeSecondaryItemStunInterface_C_GetCanItemBeStunned) == 0x000001, "Wrong alignment on PoeSecondaryItemStunInterface_C_GetCanItemBeStunned");
static_assert(sizeof(PoeSecondaryItemStunInterface_C_GetCanItemBeStunned) == 0x000001, "Wrong size on PoeSecondaryItemStunInterface_C_GetCanItemBeStunned");
static_assert(offsetof(PoeSecondaryItemStunInterface_C_GetCanItemBeStunned, CanItemBeStunned) == 0x000000, "Member 'PoeSecondaryItemStunInterface_C_GetCanItemBeStunned::CanItemBeStunned' has a wrong offset!");

// Function PoeSecondaryItemStunInterface.PoeSecondaryItemStunInterface_C.ToggleItemStun
// 0x0010 (0x0010 - 0x0000)
struct PoeSecondaryItemStunInterface_C_ToggleItemStun final
{
public:
	bool                                          StunActive;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StunDuration;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Emitter;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PoeSecondaryItemStunInterface_C_ToggleItemStun) == 0x000008, "Wrong alignment on PoeSecondaryItemStunInterface_C_ToggleItemStun");
static_assert(sizeof(PoeSecondaryItemStunInterface_C_ToggleItemStun) == 0x000010, "Wrong size on PoeSecondaryItemStunInterface_C_ToggleItemStun");
static_assert(offsetof(PoeSecondaryItemStunInterface_C_ToggleItemStun, StunActive) == 0x000000, "Member 'PoeSecondaryItemStunInterface_C_ToggleItemStun::StunActive' has a wrong offset!");
static_assert(offsetof(PoeSecondaryItemStunInterface_C_ToggleItemStun, StunDuration) == 0x000004, "Member 'PoeSecondaryItemStunInterface_C_ToggleItemStun::StunDuration' has a wrong offset!");
static_assert(offsetof(PoeSecondaryItemStunInterface_C_ToggleItemStun, Emitter) == 0x000008, "Member 'PoeSecondaryItemStunInterface_C_ToggleItemStun::Emitter' has a wrong offset!");

// Function PoeSecondaryItemStunInterface.PoeSecondaryItemStunInterface_C.GetIsItemStunned
// 0x0001 (0x0001 - 0x0000)
struct PoeSecondaryItemStunInterface_C_GetIsItemStunned final
{
public:
	bool                                          IsStunned;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PoeSecondaryItemStunInterface_C_GetIsItemStunned) == 0x000001, "Wrong alignment on PoeSecondaryItemStunInterface_C_GetIsItemStunned");
static_assert(sizeof(PoeSecondaryItemStunInterface_C_GetIsItemStunned) == 0x000001, "Wrong size on PoeSecondaryItemStunInterface_C_GetIsItemStunned");
static_assert(offsetof(PoeSecondaryItemStunInterface_C_GetIsItemStunned, IsStunned) == 0x000000, "Member 'PoeSecondaryItemStunInterface_C_GetIsItemStunned::IsStunned' has a wrong offset!");

}

