#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PostGameBackground

#include "Basic.hpp"

#include "MangoClient_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PostGameBackground.PostGameBackground_C.ExecuteUbergraph_PostGameBackground
// 0x0220 (0x0220 - 0x0000)
struct PostGameBackground_C_ExecuteUbergraph_PostGameBackground final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22B7[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMapGlobals*                     CallFunc_GetMapGlobals_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameInstance*                   K2Node_DynamicCast_AsMariner_Game_Instance;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22B8[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMangoCMSManager*                       CallFunc_Get_ReturnValue;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuSequence*                   CallFunc_GetActiveSequence_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGuid, struct FMangoMap>          CallFunc_GetMaps_ReturnValue;                      // 0x0040(0x0050)(ConstParm, ZeroConstructor)
	class UMarinerPostGameSequence*               K2Node_DynamicCast_AsMariner_Post_Game_Sequence;   // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22B9[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchEnd                              CallFunc_GetMatchEndData_ReturnValue;              // 0x00A0(0x0068)(ConstParm)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0108(0x0088)()
	struct FMangoMap                              CallFunc_Map_Find_Value;                           // 0x0190(0x0060)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22BA[0x7];                                     // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetSoftImage_ReturnValue;                 // 0x01F8(0x0028)(ConstParm, HasGetValueTypeHash)
};
static_assert(alignof(PostGameBackground_C_ExecuteUbergraph_PostGameBackground) == 0x000008, "Wrong alignment on PostGameBackground_C_ExecuteUbergraph_PostGameBackground");
static_assert(sizeof(PostGameBackground_C_ExecuteUbergraph_PostGameBackground) == 0x000220, "Wrong size on PostGameBackground_C_ExecuteUbergraph_PostGameBackground");
static_assert(offsetof(PostGameBackground_C_ExecuteUbergraph_PostGameBackground, EntryPoint) == 0x000000, "Member 'PostGameBackground_C_ExecuteUbergraph_PostGameBackground::EntryPoint' has a wrong offset!");
static_assert(offsetof(PostGameBackground_C_ExecuteUbergraph_PostGameBackground, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'PostGameBackground_C_ExecuteUbergraph_PostGameBackground::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameBackground_C_ExecuteUbergraph_PostGameBackground, CallFunc_GetMapGlobals_ReturnValue) == 0x000010, "Member 'PostGameBackground_C_ExecuteUbergraph_PostGameBackground::CallFunc_GetMapGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameBackground_C_ExecuteUbergraph_PostGameBackground, K2Node_DynamicCast_AsMariner_Game_Instance) == 0x000018, "Member 'PostGameBackground_C_ExecuteUbergraph_PostGameBackground::K2Node_DynamicCast_AsMariner_Game_Instance' has a wrong offset!");
static_assert(offsetof(PostGameBackground_C_ExecuteUbergraph_PostGameBackground, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'PostGameBackground_C_ExecuteUbergraph_PostGameBackground::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PostGameBackground_C_ExecuteUbergraph_PostGameBackground, CallFunc_GetMenuManager_ReturnValue) == 0x000028, "Member 'PostGameBackground_C_ExecuteUbergraph_PostGameBackground::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameBackground_C_ExecuteUbergraph_PostGameBackground, CallFunc_Get_ReturnValue) == 0x000030, "Member 'PostGameBackground_C_ExecuteUbergraph_PostGameBackground::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameBackground_C_ExecuteUbergraph_PostGameBackground, CallFunc_GetActiveSequence_ReturnValue) == 0x000038, "Member 'PostGameBackground_C_ExecuteUbergraph_PostGameBackground::CallFunc_GetActiveSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameBackground_C_ExecuteUbergraph_PostGameBackground, CallFunc_GetMaps_ReturnValue) == 0x000040, "Member 'PostGameBackground_C_ExecuteUbergraph_PostGameBackground::CallFunc_GetMaps_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameBackground_C_ExecuteUbergraph_PostGameBackground, K2Node_DynamicCast_AsMariner_Post_Game_Sequence) == 0x000090, "Member 'PostGameBackground_C_ExecuteUbergraph_PostGameBackground::K2Node_DynamicCast_AsMariner_Post_Game_Sequence' has a wrong offset!");
static_assert(offsetof(PostGameBackground_C_ExecuteUbergraph_PostGameBackground, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'PostGameBackground_C_ExecuteUbergraph_PostGameBackground::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PostGameBackground_C_ExecuteUbergraph_PostGameBackground, CallFunc_GetMatchEndData_ReturnValue) == 0x0000A0, "Member 'PostGameBackground_C_ExecuteUbergraph_PostGameBackground::CallFunc_GetMatchEndData_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameBackground_C_ExecuteUbergraph_PostGameBackground, K2Node_MakeStruct_SlateBrush) == 0x000108, "Member 'PostGameBackground_C_ExecuteUbergraph_PostGameBackground::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(PostGameBackground_C_ExecuteUbergraph_PostGameBackground, CallFunc_Map_Find_Value) == 0x000190, "Member 'PostGameBackground_C_ExecuteUbergraph_PostGameBackground::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(PostGameBackground_C_ExecuteUbergraph_PostGameBackground, CallFunc_Map_Find_ReturnValue) == 0x0001F0, "Member 'PostGameBackground_C_ExecuteUbergraph_PostGameBackground::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameBackground_C_ExecuteUbergraph_PostGameBackground, CallFunc_GetSoftImage_ReturnValue) == 0x0001F8, "Member 'PostGameBackground_C_ExecuteUbergraph_PostGameBackground::CallFunc_GetSoftImage_ReturnValue' has a wrong offset!");

}

