#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PostGameCurrencySmall

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function PostGameCurrencySmall.PostGameCurrencySmall_C.ExecuteUbergraph_PostGameCurrencySmall
// 0x0068 (0x0068 - 0x0000)
struct PostGameCurrencySmall_C_ExecuteUbergraph_PostGameCurrencySmall final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_Text;                                 // 0x0040(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PostGameCurrencySmall_C_ExecuteUbergraph_PostGameCurrencySmall) == 0x000008, "Wrong alignment on PostGameCurrencySmall_C_ExecuteUbergraph_PostGameCurrencySmall");
static_assert(sizeof(PostGameCurrencySmall_C_ExecuteUbergraph_PostGameCurrencySmall) == 0x000068, "Wrong size on PostGameCurrencySmall_C_ExecuteUbergraph_PostGameCurrencySmall");
static_assert(offsetof(PostGameCurrencySmall_C_ExecuteUbergraph_PostGameCurrencySmall, EntryPoint) == 0x000000, "Member 'PostGameCurrencySmall_C_ExecuteUbergraph_PostGameCurrencySmall::EntryPoint' has a wrong offset!");
static_assert(offsetof(PostGameCurrencySmall_C_ExecuteUbergraph_PostGameCurrencySmall, K2Node_Event_MyGeometry) == 0x000004, "Member 'PostGameCurrencySmall_C_ExecuteUbergraph_PostGameCurrencySmall::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(PostGameCurrencySmall_C_ExecuteUbergraph_PostGameCurrencySmall, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'PostGameCurrencySmall_C_ExecuteUbergraph_PostGameCurrencySmall::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(PostGameCurrencySmall_C_ExecuteUbergraph_PostGameCurrencySmall, K2Node_Event_Text) == 0x000040, "Member 'PostGameCurrencySmall_C_ExecuteUbergraph_PostGameCurrencySmall::K2Node_Event_Text' has a wrong offset!");
static_assert(offsetof(PostGameCurrencySmall_C_ExecuteUbergraph_PostGameCurrencySmall, CallFunc_PlayAnimation_ReturnValue) == 0x000058, "Member 'PostGameCurrencySmall_C_ExecuteUbergraph_PostGameCurrencySmall::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameCurrencySmall_C_ExecuteUbergraph_PostGameCurrencySmall, CallFunc_PlayAnimation_ReturnValue_1) == 0x000060, "Member 'PostGameCurrencySmall_C_ExecuteUbergraph_PostGameCurrencySmall::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function PostGameCurrencySmall.PostGameCurrencySmall_C.Tick
// 0x003C (0x003C - 0x0000)
struct PostGameCurrencySmall_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PostGameCurrencySmall_C_Tick) == 0x000004, "Wrong alignment on PostGameCurrencySmall_C_Tick");
static_assert(sizeof(PostGameCurrencySmall_C_Tick) == 0x00003C, "Wrong size on PostGameCurrencySmall_C_Tick");
static_assert(offsetof(PostGameCurrencySmall_C_Tick, MyGeometry) == 0x000000, "Member 'PostGameCurrencySmall_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(PostGameCurrencySmall_C_Tick, InDeltaTime) == 0x000038, "Member 'PostGameCurrencySmall_C_Tick::InDeltaTime' has a wrong offset!");

// Function PostGameCurrencySmall.PostGameCurrencySmall_C.SetCurrencyText
// 0x0018 (0x0018 - 0x0000)
struct PostGameCurrencySmall_C_SetCurrencyText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(PostGameCurrencySmall_C_SetCurrencyText) == 0x000008, "Wrong alignment on PostGameCurrencySmall_C_SetCurrencyText");
static_assert(sizeof(PostGameCurrencySmall_C_SetCurrencyText) == 0x000018, "Wrong size on PostGameCurrencySmall_C_SetCurrencyText");
static_assert(offsetof(PostGameCurrencySmall_C_SetCurrencyText, Text) == 0x000000, "Member 'PostGameCurrencySmall_C_SetCurrencyText::Text' has a wrong offset!");

}

