#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PostGameCurrencyMenu

#include "Basic.hpp"

#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function PostGameCurrencyMenu.PostGameCurrencyMenu_C.ExecuteUbergraph_PostGameCurrencyMenu
// 0x03B8 (0x03B8 - 0x0000)
struct PostGameCurrencyMenu_C_ExecuteUbergraph_PostGameCurrencyMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2281[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveSelf_ReturnValue;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2282[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bToSubLayer;                          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2283[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuSequence*                   CallFunc_GetActiveSequence_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPostGameSequence_C*                    K2Node_DynamicCast_AsPost_Game_Sequence;           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2284[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMarinerPostGameData                   CallFunc_GetLocalPlayerPostGameData_ReturnValue;   // 0x0058(0x0358)(ConstParm)
	bool                                          K2Node_Event_bFromSubMenu;                         // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2285[0x3];                                     // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PostGameCurrencyMenu_C_ExecuteUbergraph_PostGameCurrencyMenu) == 0x000008, "Wrong alignment on PostGameCurrencyMenu_C_ExecuteUbergraph_PostGameCurrencyMenu");
static_assert(sizeof(PostGameCurrencyMenu_C_ExecuteUbergraph_PostGameCurrencyMenu) == 0x0003B8, "Wrong size on PostGameCurrencyMenu_C_ExecuteUbergraph_PostGameCurrencyMenu");
static_assert(offsetof(PostGameCurrencyMenu_C_ExecuteUbergraph_PostGameCurrencyMenu, EntryPoint) == 0x000000, "Member 'PostGameCurrencyMenu_C_ExecuteUbergraph_PostGameCurrencyMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(PostGameCurrencyMenu_C_ExecuteUbergraph_PostGameCurrencyMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'PostGameCurrencyMenu_C_ExecuteUbergraph_PostGameCurrencyMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PostGameCurrencyMenu_C_ExecuteUbergraph_PostGameCurrencyMenu, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'PostGameCurrencyMenu_C_ExecuteUbergraph_PostGameCurrencyMenu::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameCurrencyMenu_C_ExecuteUbergraph_PostGameCurrencyMenu, CallFunc_RemoveSelf_ReturnValue) == 0x000020, "Member 'PostGameCurrencyMenu_C_ExecuteUbergraph_PostGameCurrencyMenu::CallFunc_RemoveSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameCurrencyMenu_C_ExecuteUbergraph_PostGameCurrencyMenu, CallFunc_PlayAnimation_ReturnValue_1) == 0x000028, "Member 'PostGameCurrencyMenu_C_ExecuteUbergraph_PostGameCurrencyMenu::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PostGameCurrencyMenu_C_ExecuteUbergraph_PostGameCurrencyMenu, K2Node_Event_bToSubLayer) == 0x000030, "Member 'PostGameCurrencyMenu_C_ExecuteUbergraph_PostGameCurrencyMenu::K2Node_Event_bToSubLayer' has a wrong offset!");
static_assert(offsetof(PostGameCurrencyMenu_C_ExecuteUbergraph_PostGameCurrencyMenu, CallFunc_GetMenuManager_ReturnValue) == 0x000038, "Member 'PostGameCurrencyMenu_C_ExecuteUbergraph_PostGameCurrencyMenu::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameCurrencyMenu_C_ExecuteUbergraph_PostGameCurrencyMenu, CallFunc_GetActiveSequence_ReturnValue) == 0x000040, "Member 'PostGameCurrencyMenu_C_ExecuteUbergraph_PostGameCurrencyMenu::CallFunc_GetActiveSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameCurrencyMenu_C_ExecuteUbergraph_PostGameCurrencyMenu, K2Node_DynamicCast_AsPost_Game_Sequence) == 0x000048, "Member 'PostGameCurrencyMenu_C_ExecuteUbergraph_PostGameCurrencyMenu::K2Node_DynamicCast_AsPost_Game_Sequence' has a wrong offset!");
static_assert(offsetof(PostGameCurrencyMenu_C_ExecuteUbergraph_PostGameCurrencyMenu, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'PostGameCurrencyMenu_C_ExecuteUbergraph_PostGameCurrencyMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PostGameCurrencyMenu_C_ExecuteUbergraph_PostGameCurrencyMenu, CallFunc_GetLocalPlayerPostGameData_ReturnValue) == 0x000058, "Member 'PostGameCurrencyMenu_C_ExecuteUbergraph_PostGameCurrencyMenu::CallFunc_GetLocalPlayerPostGameData_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameCurrencyMenu_C_ExecuteUbergraph_PostGameCurrencyMenu, K2Node_Event_bFromSubMenu) == 0x0003B0, "Member 'PostGameCurrencyMenu_C_ExecuteUbergraph_PostGameCurrencyMenu::K2Node_Event_bFromSubMenu' has a wrong offset!");
static_assert(offsetof(PostGameCurrencyMenu_C_ExecuteUbergraph_PostGameCurrencyMenu, CallFunc_Add_IntInt_ReturnValue) == 0x0003B4, "Member 'PostGameCurrencyMenu_C_ExecuteUbergraph_PostGameCurrencyMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function PostGameCurrencyMenu.PostGameCurrencyMenu_C.BP_OnExited
// 0x0001 (0x0001 - 0x0000)
struct PostGameCurrencyMenu_C_BP_OnExited final
{
public:
	bool                                          bToSubLayer;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PostGameCurrencyMenu_C_BP_OnExited) == 0x000001, "Wrong alignment on PostGameCurrencyMenu_C_BP_OnExited");
static_assert(sizeof(PostGameCurrencyMenu_C_BP_OnExited) == 0x000001, "Wrong size on PostGameCurrencyMenu_C_BP_OnExited");
static_assert(offsetof(PostGameCurrencyMenu_C_BP_OnExited, bToSubLayer) == 0x000000, "Member 'PostGameCurrencyMenu_C_BP_OnExited::bToSubLayer' has a wrong offset!");

// Function PostGameCurrencyMenu.PostGameCurrencyMenu_C.BP_OnEntered
// 0x0001 (0x0001 - 0x0000)
struct PostGameCurrencyMenu_C_BP_OnEntered final
{
public:
	bool                                          bFromSubMenu;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PostGameCurrencyMenu_C_BP_OnEntered) == 0x000001, "Wrong alignment on PostGameCurrencyMenu_C_BP_OnEntered");
static_assert(sizeof(PostGameCurrencyMenu_C_BP_OnEntered) == 0x000001, "Wrong size on PostGameCurrencyMenu_C_BP_OnEntered");
static_assert(offsetof(PostGameCurrencyMenu_C_BP_OnEntered, bFromSubMenu) == 0x000000, "Member 'PostGameCurrencyMenu_C_BP_OnEntered::bFromSubMenu' has a wrong offset!");

// Function PostGameCurrencyMenu.PostGameCurrencyMenu_C.ApplySoftCurrency
// 0x0020 (0x0020 - 0x0000)
struct PostGameCurrencyMenu_C_ApplySoftCurrency final
{
public:
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue;               // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuSequence*                   CallFunc_GetActiveSequence_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPostGameSequence_C*                    K2Node_DynamicCast_AsPost_Game_Sequence;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PostGameCurrencyMenu_C_ApplySoftCurrency) == 0x000008, "Wrong alignment on PostGameCurrencyMenu_C_ApplySoftCurrency");
static_assert(sizeof(PostGameCurrencyMenu_C_ApplySoftCurrency) == 0x000020, "Wrong size on PostGameCurrencyMenu_C_ApplySoftCurrency");
static_assert(offsetof(PostGameCurrencyMenu_C_ApplySoftCurrency, CallFunc_GetMenuManager_ReturnValue) == 0x000000, "Member 'PostGameCurrencyMenu_C_ApplySoftCurrency::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameCurrencyMenu_C_ApplySoftCurrency, CallFunc_GetActiveSequence_ReturnValue) == 0x000008, "Member 'PostGameCurrencyMenu_C_ApplySoftCurrency::CallFunc_GetActiveSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameCurrencyMenu_C_ApplySoftCurrency, K2Node_DynamicCast_AsPost_Game_Sequence) == 0x000010, "Member 'PostGameCurrencyMenu_C_ApplySoftCurrency::K2Node_DynamicCast_AsPost_Game_Sequence' has a wrong offset!");
static_assert(offsetof(PostGameCurrencyMenu_C_ApplySoftCurrency, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PostGameCurrencyMenu_C_ApplySoftCurrency::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

