#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PostGameCharacterXP

#include "Basic.hpp"

#include "MangoClient_structs.hpp"
#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PostGameCharacterXP.PostGameCharacterXP_C
// 0x00D8 (0x05B8 - 0x04E0)
class UPostGameCharacterXP_C final : public UMarinerMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowXPBarAnim;                                     // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ResetAnim;                                         // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideRewardAnim;                                    // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowRewardAnim;                                    // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShrinkXPBarAnim;                                   // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Backer;                                            // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flash00;                                           // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flash01;                                           // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flash02;                                           // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flash03;                                           // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flash04;                                           // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flash05;                                           // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fuelparticles;                                     // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow;                                              // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_11;                                          // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_12;                                          // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_13;                                          // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterXPGroup_C*                    PersonalGroup;                                     // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressionRewardPreview_C*            ProgressionRewardPreview;                          // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultRewardButton_C*                 RewardButton;                                      // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shockwave;                                         // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterXPGroup_C*                    TeamworkGroup;                                     // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WinningTeamGlow;                                   // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         RewardTimer;                                       // 0x05A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrencyAwarded;                                   // 0x05A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FMangoReward>                   Rewards;                                           // 0x05A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_PostGameCharacterXP(int32 EntryPoint);
	void Destruct();
	void BP_OnEntered(bool bFromSubMenu);
	void WidgetAnimationEvt_ShowXPBarAnim_K2Node_WidgetAnimationEvent_3();
	void BarAnimationComplete();
	void OnTeamworkSequenceComplete();
	void OnPersonalSequenceComplete();
	void WidgetAnimationEvt_HideRewardAnim_K2Node_WidgetAnimationEvent_2();
	void WidgetAnimationEvt_ShowRewardAnim_K2Node_WidgetAnimationEvent_1();
	void WidgetAnimationEvt_ShrinkXPBarAnim_K2Node_WidgetAnimationEvent_0();
	void ShowNextReward();
	void PopulatePostGameCharacterXp(bool Init, const struct FMarinerPostGameData& PostGameData);
	void ConsumeNextReward(bool* IsValid, struct FMangoReward* OutReward);
	void HasRewardItems(bool* HasRewardItems_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PostGameCharacterXP_C">();
	}
	static class UPostGameCharacterXP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPostGameCharacterXP_C>();
	}
};
static_assert(alignof(UPostGameCharacterXP_C) == 0x000008, "Wrong alignment on UPostGameCharacterXP_C");
static_assert(sizeof(UPostGameCharacterXP_C) == 0x0005B8, "Wrong size on UPostGameCharacterXP_C");
static_assert(offsetof(UPostGameCharacterXP_C, UberGraphFrame) == 0x0004E0, "Member 'UPostGameCharacterXP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPostGameCharacterXP_C, ShowXPBarAnim) == 0x0004E8, "Member 'UPostGameCharacterXP_C::ShowXPBarAnim' has a wrong offset!");
static_assert(offsetof(UPostGameCharacterXP_C, ResetAnim) == 0x0004F0, "Member 'UPostGameCharacterXP_C::ResetAnim' has a wrong offset!");
static_assert(offsetof(UPostGameCharacterXP_C, HideRewardAnim) == 0x0004F8, "Member 'UPostGameCharacterXP_C::HideRewardAnim' has a wrong offset!");
static_assert(offsetof(UPostGameCharacterXP_C, ShowRewardAnim) == 0x000500, "Member 'UPostGameCharacterXP_C::ShowRewardAnim' has a wrong offset!");
static_assert(offsetof(UPostGameCharacterXP_C, ShrinkXPBarAnim) == 0x000508, "Member 'UPostGameCharacterXP_C::ShrinkXPBarAnim' has a wrong offset!");
static_assert(offsetof(UPostGameCharacterXP_C, Backer) == 0x000510, "Member 'UPostGameCharacterXP_C::Backer' has a wrong offset!");
static_assert(offsetof(UPostGameCharacterXP_C, Flash00) == 0x000518, "Member 'UPostGameCharacterXP_C::Flash00' has a wrong offset!");
static_assert(offsetof(UPostGameCharacterXP_C, Flash01) == 0x000520, "Member 'UPostGameCharacterXP_C::Flash01' has a wrong offset!");
static_assert(offsetof(UPostGameCharacterXP_C, Flash02) == 0x000528, "Member 'UPostGameCharacterXP_C::Flash02' has a wrong offset!");
static_assert(offsetof(UPostGameCharacterXP_C, Flash03) == 0x000530, "Member 'UPostGameCharacterXP_C::Flash03' has a wrong offset!");
static_assert(offsetof(UPostGameCharacterXP_C, Flash04) == 0x000538, "Member 'UPostGameCharacterXP_C::Flash04' has a wrong offset!");
static_assert(offsetof(UPostGameCharacterXP_C, Flash05) == 0x000540, "Member 'UPostGameCharacterXP_C::Flash05' has a wrong offset!");
static_assert(offsetof(UPostGameCharacterXP_C, Fuelparticles) == 0x000548, "Member 'UPostGameCharacterXP_C::Fuelparticles' has a wrong offset!");
static_assert(offsetof(UPostGameCharacterXP_C, Glow) == 0x000550, "Member 'UPostGameCharacterXP_C::Glow' has a wrong offset!");
static_assert(offsetof(UPostGameCharacterXP_C, Image_11) == 0x000558, "Member 'UPostGameCharacterXP_C::Image_11' has a wrong offset!");
static_assert(offsetof(UPostGameCharacterXP_C, Image_12) == 0x000560, "Member 'UPostGameCharacterXP_C::Image_12' has a wrong offset!");
static_assert(offsetof(UPostGameCharacterXP_C, Image_13) == 0x000568, "Member 'UPostGameCharacterXP_C::Image_13' has a wrong offset!");
static_assert(offsetof(UPostGameCharacterXP_C, PersonalGroup) == 0x000570, "Member 'UPostGameCharacterXP_C::PersonalGroup' has a wrong offset!");
static_assert(offsetof(UPostGameCharacterXP_C, ProgressionRewardPreview) == 0x000578, "Member 'UPostGameCharacterXP_C::ProgressionRewardPreview' has a wrong offset!");
static_assert(offsetof(UPostGameCharacterXP_C, RewardButton) == 0x000580, "Member 'UPostGameCharacterXP_C::RewardButton' has a wrong offset!");
static_assert(offsetof(UPostGameCharacterXP_C, Shockwave) == 0x000588, "Member 'UPostGameCharacterXP_C::Shockwave' has a wrong offset!");
static_assert(offsetof(UPostGameCharacterXP_C, TeamworkGroup) == 0x000590, "Member 'UPostGameCharacterXP_C::TeamworkGroup' has a wrong offset!");
static_assert(offsetof(UPostGameCharacterXP_C, WinningTeamGlow) == 0x000598, "Member 'UPostGameCharacterXP_C::WinningTeamGlow' has a wrong offset!");
static_assert(offsetof(UPostGameCharacterXP_C, RewardTimer) == 0x0005A0, "Member 'UPostGameCharacterXP_C::RewardTimer' has a wrong offset!");
static_assert(offsetof(UPostGameCharacterXP_C, CurrencyAwarded) == 0x0005A4, "Member 'UPostGameCharacterXP_C::CurrencyAwarded' has a wrong offset!");
static_assert(offsetof(UPostGameCharacterXP_C, Rewards) == 0x0005A8, "Member 'UPostGameCharacterXP_C::Rewards' has a wrong offset!");

}

