#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PostGameMenuStack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PostGameMenuStack.PostGameMenuStack_C
// 0x0050 (0x06E8 - 0x0698)
class UPostGameMenuStack_C final : public UMarinerPostGameMenuStack
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0698(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostGameDefaultStackBase_C*            DefaultStackBase;                                  // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIntermissionCountdown_C*               IntermissionCountdown;                             // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             IntermissionText;                                  // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPrompt_C*                       LTPrompt;                                          // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerGridPanel*                      NavRibbon;                                         // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPrimaryStackButtonWidget_C*            Progress;                                          // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPrompt_C*                       RTPrompt;                                          // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPrimaryStackButtonWidget_C*            Stats;                                             // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTabBackground_C*                       TabBackground;                                     // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PostGameMenuStack(int32 EntryPoint);
	void IntermissionEnded();
	void IntermissionStarted();
	void Construct();
	void UpdateIntermissionWidgets(bool Param_IsActive);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PostGameMenuStack_C">();
	}
	static class UPostGameMenuStack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPostGameMenuStack_C>();
	}
};
static_assert(alignof(UPostGameMenuStack_C) == 0x000008, "Wrong alignment on UPostGameMenuStack_C");
static_assert(sizeof(UPostGameMenuStack_C) == 0x0006E8, "Wrong size on UPostGameMenuStack_C");
static_assert(offsetof(UPostGameMenuStack_C, UberGraphFrame) == 0x000698, "Member 'UPostGameMenuStack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPostGameMenuStack_C, DefaultStackBase) == 0x0006A0, "Member 'UPostGameMenuStack_C::DefaultStackBase' has a wrong offset!");
static_assert(offsetof(UPostGameMenuStack_C, IntermissionCountdown) == 0x0006A8, "Member 'UPostGameMenuStack_C::IntermissionCountdown' has a wrong offset!");
static_assert(offsetof(UPostGameMenuStack_C, IntermissionText) == 0x0006B0, "Member 'UPostGameMenuStack_C::IntermissionText' has a wrong offset!");
static_assert(offsetof(UPostGameMenuStack_C, LTPrompt) == 0x0006B8, "Member 'UPostGameMenuStack_C::LTPrompt' has a wrong offset!");
static_assert(offsetof(UPostGameMenuStack_C, NavRibbon) == 0x0006C0, "Member 'UPostGameMenuStack_C::NavRibbon' has a wrong offset!");
static_assert(offsetof(UPostGameMenuStack_C, Progress) == 0x0006C8, "Member 'UPostGameMenuStack_C::Progress' has a wrong offset!");
static_assert(offsetof(UPostGameMenuStack_C, RTPrompt) == 0x0006D0, "Member 'UPostGameMenuStack_C::RTPrompt' has a wrong offset!");
static_assert(offsetof(UPostGameMenuStack_C, Stats) == 0x0006D8, "Member 'UPostGameMenuStack_C::Stats' has a wrong offset!");
static_assert(offsetof(UPostGameMenuStack_C, TabBackground) == 0x0006E0, "Member 'UPostGameMenuStack_C::TabBackground' has a wrong offset!");

}

