#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PostGameStatsMenu

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MangoClient_structs.hpp"


namespace SDK::Params
{

// Function PostGameStatsMenu.PostGameStatsMenu_C.ExecuteUbergraph_PostGameStatsMenu
// 0x0060 (0x0060 - 0x0000)
struct PostGameStatsMenu_C_ExecuteUbergraph_PostGameStatsMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuSequence*                   CallFunc_GetActiveSequence_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFromSubMenu;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPostGameSequence_C*                    K2Node_DynamicCast_AsPost_Game_Sequence;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMarinerInputInterface> CallFunc_SetActiveInputWidget_InputWidget_CastInput; // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bToSubLayer;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMusicManager_C*                        CallFunc_GetMusicManager_MusicManager;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurrentlyInGameplayMap_ReturnValue;     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PostGameStatsMenu_C_ExecuteUbergraph_PostGameStatsMenu) == 0x000008, "Wrong alignment on PostGameStatsMenu_C_ExecuteUbergraph_PostGameStatsMenu");
static_assert(sizeof(PostGameStatsMenu_C_ExecuteUbergraph_PostGameStatsMenu) == 0x000060, "Wrong size on PostGameStatsMenu_C_ExecuteUbergraph_PostGameStatsMenu");
static_assert(offsetof(PostGameStatsMenu_C_ExecuteUbergraph_PostGameStatsMenu, EntryPoint) == 0x000000, "Member 'PostGameStatsMenu_C_ExecuteUbergraph_PostGameStatsMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(PostGameStatsMenu_C_ExecuteUbergraph_PostGameStatsMenu, CallFunc_GetMenuManager_ReturnValue) == 0x000008, "Member 'PostGameStatsMenu_C_ExecuteUbergraph_PostGameStatsMenu::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameStatsMenu_C_ExecuteUbergraph_PostGameStatsMenu, CallFunc_GetActiveSequence_ReturnValue) == 0x000010, "Member 'PostGameStatsMenu_C_ExecuteUbergraph_PostGameStatsMenu::CallFunc_GetActiveSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameStatsMenu_C_ExecuteUbergraph_PostGameStatsMenu, K2Node_Event_bFromSubMenu) == 0x000018, "Member 'PostGameStatsMenu_C_ExecuteUbergraph_PostGameStatsMenu::K2Node_Event_bFromSubMenu' has a wrong offset!");
static_assert(offsetof(PostGameStatsMenu_C_ExecuteUbergraph_PostGameStatsMenu, K2Node_DynamicCast_AsPost_Game_Sequence) == 0x000020, "Member 'PostGameStatsMenu_C_ExecuteUbergraph_PostGameStatsMenu::K2Node_DynamicCast_AsPost_Game_Sequence' has a wrong offset!");
static_assert(offsetof(PostGameStatsMenu_C_ExecuteUbergraph_PostGameStatsMenu, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'PostGameStatsMenu_C_ExecuteUbergraph_PostGameStatsMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PostGameStatsMenu_C_ExecuteUbergraph_PostGameStatsMenu, CallFunc_SetActiveInputWidget_InputWidget_CastInput) == 0x000030, "Member 'PostGameStatsMenu_C_ExecuteUbergraph_PostGameStatsMenu::CallFunc_SetActiveInputWidget_InputWidget_CastInput' has a wrong offset!");
static_assert(offsetof(PostGameStatsMenu_C_ExecuteUbergraph_PostGameStatsMenu, K2Node_Event_bToSubLayer) == 0x000040, "Member 'PostGameStatsMenu_C_ExecuteUbergraph_PostGameStatsMenu::K2Node_Event_bToSubLayer' has a wrong offset!");
static_assert(offsetof(PostGameStatsMenu_C_ExecuteUbergraph_PostGameStatsMenu, CallFunc_GetGameInstance_ReturnValue) == 0x000048, "Member 'PostGameStatsMenu_C_ExecuteUbergraph_PostGameStatsMenu::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameStatsMenu_C_ExecuteUbergraph_PostGameStatsMenu, CallFunc_GetMusicManager_MusicManager) == 0x000050, "Member 'PostGameStatsMenu_C_ExecuteUbergraph_PostGameStatsMenu::CallFunc_GetMusicManager_MusicManager' has a wrong offset!");
static_assert(offsetof(PostGameStatsMenu_C_ExecuteUbergraph_PostGameStatsMenu, CallFunc_IsCurrentlyInGameplayMap_ReturnValue) == 0x000058, "Member 'PostGameStatsMenu_C_ExecuteUbergraph_PostGameStatsMenu::CallFunc_IsCurrentlyInGameplayMap_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameStatsMenu_C_ExecuteUbergraph_PostGameStatsMenu, CallFunc_Not_PreBool_ReturnValue) == 0x000059, "Member 'PostGameStatsMenu_C_ExecuteUbergraph_PostGameStatsMenu::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function PostGameStatsMenu.PostGameStatsMenu_C.BP_OnExited
// 0x0001 (0x0001 - 0x0000)
struct PostGameStatsMenu_C_BP_OnExited final
{
public:
	bool                                          bToSubLayer;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PostGameStatsMenu_C_BP_OnExited) == 0x000001, "Wrong alignment on PostGameStatsMenu_C_BP_OnExited");
static_assert(sizeof(PostGameStatsMenu_C_BP_OnExited) == 0x000001, "Wrong size on PostGameStatsMenu_C_BP_OnExited");
static_assert(offsetof(PostGameStatsMenu_C_BP_OnExited, bToSubLayer) == 0x000000, "Member 'PostGameStatsMenu_C_BP_OnExited::bToSubLayer' has a wrong offset!");

// Function PostGameStatsMenu.PostGameStatsMenu_C.BP_OnEntered
// 0x0001 (0x0001 - 0x0000)
struct PostGameStatsMenu_C_BP_OnEntered final
{
public:
	bool                                          bFromSubMenu;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PostGameStatsMenu_C_BP_OnEntered) == 0x000001, "Wrong alignment on PostGameStatsMenu_C_BP_OnEntered");
static_assert(sizeof(PostGameStatsMenu_C_BP_OnEntered) == 0x000001, "Wrong size on PostGameStatsMenu_C_BP_OnEntered");
static_assert(offsetof(PostGameStatsMenu_C_BP_OnEntered, bFromSubMenu) == 0x000000, "Member 'PostGameStatsMenu_C_BP_OnEntered::bFromSubMenu' has a wrong offset!");

// Function PostGameStatsMenu.PostGameStatsMenu_C.HandleRocketBotAttackMode
// 0x0140 (0x0140 - 0x0000)
struct PostGameStatsMenu_C_HandleRocketBotAttackMode final
{
public:
	class UMangoCMSManager*                       CallFunc_Get_ReturnValue;                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGuid, struct FMangoMode>         CallFunc_GetModes_ReturnValue;                     // 0x0008(0x0050)(ConstParm, ZeroConstructor)
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuSequence*                   CallFunc_GetActiveSequence_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerPostGameSequence*               K2Node_DynamicCast_AsMariner_Post_Game_Sequence;   // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchEnd                              CallFunc_GetMatchEndData_ReturnValue;              // 0x0078(0x0068)(ConstParm)
	struct FMangoMode                             CallFunc_Map_Find_Value;                           // 0x00E0(0x0058)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PostGameStatsMenu_C_HandleRocketBotAttackMode) == 0x000008, "Wrong alignment on PostGameStatsMenu_C_HandleRocketBotAttackMode");
static_assert(sizeof(PostGameStatsMenu_C_HandleRocketBotAttackMode) == 0x000140, "Wrong size on PostGameStatsMenu_C_HandleRocketBotAttackMode");
static_assert(offsetof(PostGameStatsMenu_C_HandleRocketBotAttackMode, CallFunc_Get_ReturnValue) == 0x000000, "Member 'PostGameStatsMenu_C_HandleRocketBotAttackMode::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameStatsMenu_C_HandleRocketBotAttackMode, CallFunc_GetModes_ReturnValue) == 0x000008, "Member 'PostGameStatsMenu_C_HandleRocketBotAttackMode::CallFunc_GetModes_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameStatsMenu_C_HandleRocketBotAttackMode, CallFunc_GetMenuManager_ReturnValue) == 0x000058, "Member 'PostGameStatsMenu_C_HandleRocketBotAttackMode::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameStatsMenu_C_HandleRocketBotAttackMode, CallFunc_GetActiveSequence_ReturnValue) == 0x000060, "Member 'PostGameStatsMenu_C_HandleRocketBotAttackMode::CallFunc_GetActiveSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameStatsMenu_C_HandleRocketBotAttackMode, K2Node_DynamicCast_AsMariner_Post_Game_Sequence) == 0x000068, "Member 'PostGameStatsMenu_C_HandleRocketBotAttackMode::K2Node_DynamicCast_AsMariner_Post_Game_Sequence' has a wrong offset!");
static_assert(offsetof(PostGameStatsMenu_C_HandleRocketBotAttackMode, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'PostGameStatsMenu_C_HandleRocketBotAttackMode::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PostGameStatsMenu_C_HandleRocketBotAttackMode, CallFunc_GetMatchEndData_ReturnValue) == 0x000078, "Member 'PostGameStatsMenu_C_HandleRocketBotAttackMode::CallFunc_GetMatchEndData_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameStatsMenu_C_HandleRocketBotAttackMode, CallFunc_Map_Find_Value) == 0x0000E0, "Member 'PostGameStatsMenu_C_HandleRocketBotAttackMode::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(PostGameStatsMenu_C_HandleRocketBotAttackMode, CallFunc_Map_Find_ReturnValue) == 0x000138, "Member 'PostGameStatsMenu_C_HandleRocketBotAttackMode::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameStatsMenu_C_HandleRocketBotAttackMode, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000139, "Member 'PostGameStatsMenu_C_HandleRocketBotAttackMode::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

}

