#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PostGameArtifactsMenu

#include "Basic.hpp"

#include "MangoClient_structs.hpp"
#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PostGameArtifactsMenu.PostGameArtifactsMenu_C
// 0x0058 (0x0538 - 0x04E0)
class UPostGameArtifactsMenu_C final : public UMarinerMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             ArtifactUnlocked;                                  // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             EquipInfo;                                         // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         RootPanel;                                         // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FMangoItemResult>               LevelUpArtifacts;                                  // 0x0500(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         ArtifactPresentTimer;                              // 0x0510(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22BB[0x4];                                     // 0x0514(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMangoLevelRewardItem>          UnlockedArtifacts;                                 // 0x0518(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         ProgressPresentationsComplete;                     // 0x0528(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StartingArtifactLevel;                             // 0x052C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ArtifactEndLevel;                                  // 0x0530(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PostGameArtifactsMenu(int32 EntryPoint);
	void OnUnlockHideComplete();
	void OnProgressHideComplete();
	void OnProgressPresentationComplete();
	void OnUnlockPresentationComplete();
	void BP_OnEntered(bool bFromSubMenu);
	void PresentArtifactsProgress(bool* ArtifactPresented);
	void PresentArtifactUnlocked(bool* ArtifactPresented);
	void Advance();
	void BuildArtifactData(class UMarinerPostGameSequence* Sequence);
	void Complete_Artifacts_Progress();
	void CompleteArtifactUnlocked();
	void OnLevelChanged(int32 Level);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PostGameArtifactsMenu_C">();
	}
	static class UPostGameArtifactsMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPostGameArtifactsMenu_C>();
	}
};
static_assert(alignof(UPostGameArtifactsMenu_C) == 0x000008, "Wrong alignment on UPostGameArtifactsMenu_C");
static_assert(sizeof(UPostGameArtifactsMenu_C) == 0x000538, "Wrong size on UPostGameArtifactsMenu_C");
static_assert(offsetof(UPostGameArtifactsMenu_C, UberGraphFrame) == 0x0004E0, "Member 'UPostGameArtifactsMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPostGameArtifactsMenu_C, ArtifactUnlocked) == 0x0004E8, "Member 'UPostGameArtifactsMenu_C::ArtifactUnlocked' has a wrong offset!");
static_assert(offsetof(UPostGameArtifactsMenu_C, EquipInfo) == 0x0004F0, "Member 'UPostGameArtifactsMenu_C::EquipInfo' has a wrong offset!");
static_assert(offsetof(UPostGameArtifactsMenu_C, RootPanel) == 0x0004F8, "Member 'UPostGameArtifactsMenu_C::RootPanel' has a wrong offset!");
static_assert(offsetof(UPostGameArtifactsMenu_C, LevelUpArtifacts) == 0x000500, "Member 'UPostGameArtifactsMenu_C::LevelUpArtifacts' has a wrong offset!");
static_assert(offsetof(UPostGameArtifactsMenu_C, ArtifactPresentTimer) == 0x000510, "Member 'UPostGameArtifactsMenu_C::ArtifactPresentTimer' has a wrong offset!");
static_assert(offsetof(UPostGameArtifactsMenu_C, UnlockedArtifacts) == 0x000518, "Member 'UPostGameArtifactsMenu_C::UnlockedArtifacts' has a wrong offset!");
static_assert(offsetof(UPostGameArtifactsMenu_C, ProgressPresentationsComplete) == 0x000528, "Member 'UPostGameArtifactsMenu_C::ProgressPresentationsComplete' has a wrong offset!");
static_assert(offsetof(UPostGameArtifactsMenu_C, StartingArtifactLevel) == 0x00052C, "Member 'UPostGameArtifactsMenu_C::StartingArtifactLevel' has a wrong offset!");
static_assert(offsetof(UPostGameArtifactsMenu_C, ArtifactEndLevel) == 0x000530, "Member 'UPostGameArtifactsMenu_C::ArtifactEndLevel' has a wrong offset!");

}

