#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PostGameCharacterXP

#include "Basic.hpp"

#include "MangoClient_structs.hpp"
#include "Mariner_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function PostGameCharacterXP.PostGameCharacterXP_C.ExecuteUbergraph_PostGameCharacterXP
// 0x08A0 (0x08A0 - 0x0000)
struct PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasRewardItems_HasRewardItems;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveSelf_ReturnValue;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ConsumeNextReward_IsValid;                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMangoReward                           CallFunc_ConsumeNextReward_OutReward;              // 0x0028(0x0040)()
	bool                                          CallFunc_RemoveSelf_ReturnValue_1;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0078(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0090(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue;               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuSequence*                   CallFunc_GetActiveSequence_ReturnValue;            // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	class UPostGameSequence_C*                    K2Node_DynamicCast_AsPost_Game_Sequence;           // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue_1;             // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuSequence*                   CallFunc_GetActiveSequence_ReturnValue_1;          // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerPostGameSequence*               K2Node_DynamicCast_AsMariner_Post_Game_Sequence;   // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMarinerPostGameData                   CallFunc_GetLocalPlayerPostGameData_ReturnValue;   // 0x0138(0x0358)(ConstParm)
	TArray<struct FMangoReward>                   CallFunc_ParseMangoRewards_OutParsedRewards;       // 0x0490(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x04A0(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x04B0(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x04C0(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D4[0x4];                                      // 0x04D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_2;                            // 0x04D8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x04E8(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue_2;                  // 0x04F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FC[0x4];                                      // 0x04FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue_2;             // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFromSubMenu;                         // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_509[0x7];                                      // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerMenuSequence*                   CallFunc_GetActiveSequence_ReturnValue_2;          // 0x0510(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerPostGameSequence*               K2Node_DynamicCast_AsMariner_Post_Game_Sequence_1; // 0x0518(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_521[0x7];                                      // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMarinerPostGameData                   CallFunc_GetLocalPlayerPostGameData_ReturnValue_1; // 0x0530(0x0358)(ConstParm)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_3;                            // 0x0888(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_PostEvent_ReturnValue_3;                  // 0x0898(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP) == 0x000008, "Wrong alignment on PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP");
static_assert(sizeof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP) == 0x0008A0, "Wrong size on PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, EntryPoint) == 0x000000, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::EntryPoint' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, CallFunc_HasRewardItems_HasRewardItems) == 0x000010, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::CallFunc_HasRewardItems_HasRewardItems' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, CallFunc_RemoveSelf_ReturnValue) == 0x000020, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::CallFunc_RemoveSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, CallFunc_ConsumeNextReward_IsValid) == 0x000021, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::CallFunc_ConsumeNextReward_IsValid' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, CallFunc_ConsumeNextReward_OutReward) == 0x000028, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::CallFunc_ConsumeNextReward_OutReward' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, CallFunc_RemoveSelf_ReturnValue_1) == 0x000068, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::CallFunc_RemoveSelf_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, CallFunc_PlayAnimation_ReturnValue_1) == 0x000070, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, Temp_delegate_Variable) == 0x000078, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, CallFunc_PlayAnimation_ReturnValue_2) == 0x000088, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, Temp_struct_Variable) == 0x000090, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, CallFunc_PostEvent_ReturnValue) == 0x0000A0, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000A8, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, CallFunc_PlayAnimation_ReturnValue_3) == 0x0000B0, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x0000B8, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, K2Node_CreateDelegate_OutputDelegate) == 0x0000C0, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000D0, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, CallFunc_GetMenuManager_ReturnValue) == 0x0000E0, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, CallFunc_GetActiveSequence_ReturnValue) == 0x0000E8, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::CallFunc_GetActiveSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000F0, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, K2Node_DynamicCast_AsPost_Game_Sequence) == 0x000100, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::K2Node_DynamicCast_AsPost_Game_Sequence' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, CallFunc_GetOwningPlayer_ReturnValue_2) == 0x000110, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::CallFunc_GetOwningPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, CallFunc_GetMenuManager_ReturnValue_1) == 0x000118, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::CallFunc_GetMenuManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, CallFunc_GetActiveSequence_ReturnValue_1) == 0x000120, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::CallFunc_GetActiveSequence_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, K2Node_DynamicCast_AsMariner_Post_Game_Sequence) == 0x000128, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::K2Node_DynamicCast_AsMariner_Post_Game_Sequence' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, K2Node_DynamicCast_bSuccess_1) == 0x000130, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, CallFunc_GetLocalPlayerPostGameData_ReturnValue) == 0x000138, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::CallFunc_GetLocalPlayerPostGameData_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, CallFunc_ParseMangoRewards_OutParsedRewards) == 0x000490, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::CallFunc_ParseMangoRewards_OutParsedRewards' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, Temp_delegate_Variable_1) == 0x0004A0, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, Temp_struct_Variable_1) == 0x0004B0, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, Temp_delegate_Variable_2) == 0x0004C0, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, CallFunc_PostEvent_ReturnValue_1) == 0x0004D0, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, Temp_struct_Variable_2) == 0x0004D8, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, Temp_delegate_Variable_3) == 0x0004E8, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, CallFunc_PostEvent_ReturnValue_2) == 0x0004F8, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::CallFunc_PostEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, CallFunc_GetMenuManager_ReturnValue_2) == 0x000500, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::CallFunc_GetMenuManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, K2Node_Event_bFromSubMenu) == 0x000508, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::K2Node_Event_bFromSubMenu' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, CallFunc_GetActiveSequence_ReturnValue_2) == 0x000510, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::CallFunc_GetActiveSequence_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, K2Node_DynamicCast_AsMariner_Post_Game_Sequence_1) == 0x000518, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::K2Node_DynamicCast_AsMariner_Post_Game_Sequence_1' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, K2Node_DynamicCast_bSuccess_2) == 0x000520, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, CallFunc_PlayAnimation_ReturnValue_4) == 0x000528, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, CallFunc_GetLocalPlayerPostGameData_ReturnValue_1) == 0x000530, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::CallFunc_GetLocalPlayerPostGameData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, Temp_struct_Variable_3) == 0x000888, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP, CallFunc_PostEvent_ReturnValue_3) == 0x000898, "Member 'PostGameCharacterXP_C_ExecuteUbergraph_PostGameCharacterXP::CallFunc_PostEvent_ReturnValue_3' has a wrong offset!");

// Function PostGameCharacterXP.PostGameCharacterXP_C.BP_OnEntered
// 0x0001 (0x0001 - 0x0000)
struct PostGameCharacterXP_C_BP_OnEntered final
{
public:
	bool                                          bFromSubMenu;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PostGameCharacterXP_C_BP_OnEntered) == 0x000001, "Wrong alignment on PostGameCharacterXP_C_BP_OnEntered");
static_assert(sizeof(PostGameCharacterXP_C_BP_OnEntered) == 0x000001, "Wrong size on PostGameCharacterXP_C_BP_OnEntered");
static_assert(offsetof(PostGameCharacterXP_C_BP_OnEntered, bFromSubMenu) == 0x000000, "Member 'PostGameCharacterXP_C_BP_OnEntered::bFromSubMenu' has a wrong offset!");

// Function PostGameCharacterXP.PostGameCharacterXP_C.PopulatePostGameCharacterXp
// 0x0360 (0x0360 - 0x0000)
struct PostGameCharacterXP_C_PopulatePostGameCharacterXp final
{
public:
	bool                                          Init;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMarinerPostGameData                   PostGameData;                                      // 0x0008(0x0358)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(PostGameCharacterXP_C_PopulatePostGameCharacterXp) == 0x000008, "Wrong alignment on PostGameCharacterXP_C_PopulatePostGameCharacterXp");
static_assert(sizeof(PostGameCharacterXP_C_PopulatePostGameCharacterXp) == 0x000360, "Wrong size on PostGameCharacterXP_C_PopulatePostGameCharacterXp");
static_assert(offsetof(PostGameCharacterXP_C_PopulatePostGameCharacterXp, Init) == 0x000000, "Member 'PostGameCharacterXP_C_PopulatePostGameCharacterXp::Init' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_PopulatePostGameCharacterXp, PostGameData) == 0x000008, "Member 'PostGameCharacterXP_C_PopulatePostGameCharacterXp::PostGameData' has a wrong offset!");

// Function PostGameCharacterXP.PostGameCharacterXP_C.ConsumeNextReward
// 0x00D8 (0x00D8 - 0x0000)
struct PostGameCharacterXP_C_ConsumeNextReward final
{
public:
	bool                                          IsValid;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMangoReward                           OutReward;                                         // 0x0008(0x0040)(Parm, OutParm)
	struct FMangoReward                           RewardToUse;                                       // 0x0048(0x0040)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMangoReward                           CallFunc_Array_Get_Item;                           // 0x0090(0x0040)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PostGameCharacterXP_C_ConsumeNextReward) == 0x000008, "Wrong alignment on PostGameCharacterXP_C_ConsumeNextReward");
static_assert(sizeof(PostGameCharacterXP_C_ConsumeNextReward) == 0x0000D8, "Wrong size on PostGameCharacterXP_C_ConsumeNextReward");
static_assert(offsetof(PostGameCharacterXP_C_ConsumeNextReward, IsValid) == 0x000000, "Member 'PostGameCharacterXP_C_ConsumeNextReward::IsValid' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ConsumeNextReward, OutReward) == 0x000008, "Member 'PostGameCharacterXP_C_ConsumeNextReward::OutReward' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ConsumeNextReward, RewardToUse) == 0x000048, "Member 'PostGameCharacterXP_C_ConsumeNextReward::RewardToUse' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ConsumeNextReward, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'PostGameCharacterXP_C_ConsumeNextReward::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ConsumeNextReward, CallFunc_Array_Get_Item) == 0x000090, "Member 'PostGameCharacterXP_C_ConsumeNextReward::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_ConsumeNextReward, CallFunc_Greater_IntInt_ReturnValue) == 0x0000D0, "Member 'PostGameCharacterXP_C_ConsumeNextReward::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function PostGameCharacterXP.PostGameCharacterXP_C.HasRewardItems
// 0x000C (0x000C - 0x0000)
struct PostGameCharacterXP_C_HasRewardItems final
{
public:
	bool                                          HasRewardItems_0;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PostGameCharacterXP_C_HasRewardItems) == 0x000004, "Wrong alignment on PostGameCharacterXP_C_HasRewardItems");
static_assert(sizeof(PostGameCharacterXP_C_HasRewardItems) == 0x00000C, "Wrong size on PostGameCharacterXP_C_HasRewardItems");
static_assert(offsetof(PostGameCharacterXP_C_HasRewardItems, HasRewardItems_0) == 0x000000, "Member 'PostGameCharacterXP_C_HasRewardItems::HasRewardItems_0' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_HasRewardItems, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'PostGameCharacterXP_C_HasRewardItems::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameCharacterXP_C_HasRewardItems, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'PostGameCharacterXP_C_HasRewardItems::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

