#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PostGameArtifactsMenu

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "MangoClient_structs.hpp"
#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function PostGameArtifactsMenu.PostGameArtifactsMenu_C.ExecuteUbergraph_PostGameArtifactsMenu
// 0x0050 (0x0050 - 0x0000)
struct PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFromSubMenu;                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerMenuSequence*                   CallFunc_GetActiveSequence_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPostGameSequence_C*                    K2Node_DynamicCast_AsPost_Game_Sequence;           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue_1;           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu) == 0x000008, "Wrong alignment on PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu");
static_assert(sizeof(PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu) == 0x000050, "Wrong size on PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu");
static_assert(offsetof(PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu, EntryPoint) == 0x000000, "Member 'PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu, Temp_int_Variable) == 0x000004, "Member 'PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu, K2Node_Event_bFromSubMenu) == 0x000008, "Member 'PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu::K2Node_Event_bFromSubMenu' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu, CallFunc_GetMenuManager_ReturnValue) == 0x000010, "Member 'PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu, Temp_int_Variable_1) == 0x000018, "Member 'PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu, CallFunc_GetActiveSequence_ReturnValue) == 0x000020, "Member 'PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu::CallFunc_GetActiveSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu, K2Node_DynamicCast_AsPost_Game_Sequence) == 0x000028, "Member 'PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu::K2Node_DynamicCast_AsPost_Game_Sequence' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu, CallFunc_GetChildrenCount_ReturnValue) == 0x000034, "Member 'PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00003C, "Member 'PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu, CallFunc_GetChildrenCount_ReturnValue_1) == 0x000040, "Member 'PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu::CallFunc_GetChildrenCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu, CallFunc_Add_IntInt_ReturnValue_1) == 0x000044, "Member 'PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000048, "Member 'PostGameArtifactsMenu_C_ExecuteUbergraph_PostGameArtifactsMenu::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function PostGameArtifactsMenu.PostGameArtifactsMenu_C.BP_OnEntered
// 0x0001 (0x0001 - 0x0000)
struct PostGameArtifactsMenu_C_BP_OnEntered final
{
public:
	bool                                          bFromSubMenu;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PostGameArtifactsMenu_C_BP_OnEntered) == 0x000001, "Wrong alignment on PostGameArtifactsMenu_C_BP_OnEntered");
static_assert(sizeof(PostGameArtifactsMenu_C_BP_OnEntered) == 0x000001, "Wrong size on PostGameArtifactsMenu_C_BP_OnEntered");
static_assert(offsetof(PostGameArtifactsMenu_C_BP_OnEntered, bFromSubMenu) == 0x000000, "Member 'PostGameArtifactsMenu_C_BP_OnEntered::bFromSubMenu' has a wrong offset!");

// Function PostGameArtifactsMenu.PostGameArtifactsMenu_C.PresentArtifactsProgress
// 0x0088 (0x0088 - 0x0000)
struct PostGameArtifactsMenu_C_PresentArtifactsProgress final
{
public:
	bool                                          ArtifactPresented;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Level)>                  K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class UPostGameArtifact_C*                    CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UArtifactProgressBar_C*                 CallFunc_Get_Artifact_Progress_Bar_ArtifactProgressBar; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMangoItemResult                       CallFunc_Array_Get_Item;                           // 0x0048(0x0030)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PostGameArtifactsMenu_C_PresentArtifactsProgress) == 0x000008, "Wrong alignment on PostGameArtifactsMenu_C_PresentArtifactsProgress");
static_assert(sizeof(PostGameArtifactsMenu_C_PresentArtifactsProgress) == 0x000088, "Wrong size on PostGameArtifactsMenu_C_PresentArtifactsProgress");
static_assert(offsetof(PostGameArtifactsMenu_C_PresentArtifactsProgress, ArtifactPresented) == 0x000000, "Member 'PostGameArtifactsMenu_C_PresentArtifactsProgress::ArtifactPresented' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_PresentArtifactsProgress, Temp_int_Array_Index_Variable) == 0x000004, "Member 'PostGameArtifactsMenu_C_PresentArtifactsProgress::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_PresentArtifactsProgress, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'PostGameArtifactsMenu_C_PresentArtifactsProgress::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_PresentArtifactsProgress, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'PostGameArtifactsMenu_C_PresentArtifactsProgress::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_PresentArtifactsProgress, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'PostGameArtifactsMenu_C_PresentArtifactsProgress::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_PresentArtifactsProgress, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'PostGameArtifactsMenu_C_PresentArtifactsProgress::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_PresentArtifactsProgress, CallFunc_Create_ReturnValue) == 0x000030, "Member 'PostGameArtifactsMenu_C_PresentArtifactsProgress::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_PresentArtifactsProgress, CallFunc_AddChild_ReturnValue) == 0x000038, "Member 'PostGameArtifactsMenu_C_PresentArtifactsProgress::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_PresentArtifactsProgress, CallFunc_Get_Artifact_Progress_Bar_ArtifactProgressBar) == 0x000040, "Member 'PostGameArtifactsMenu_C_PresentArtifactsProgress::CallFunc_Get_Artifact_Progress_Bar_ArtifactProgressBar' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_PresentArtifactsProgress, CallFunc_Array_Get_Item) == 0x000048, "Member 'PostGameArtifactsMenu_C_PresentArtifactsProgress::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_PresentArtifactsProgress, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'PostGameArtifactsMenu_C_PresentArtifactsProgress::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_PresentArtifactsProgress, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'PostGameArtifactsMenu_C_PresentArtifactsProgress::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_PresentArtifactsProgress, CallFunc_Array_Length_ReturnValue_1) == 0x000080, "Member 'PostGameArtifactsMenu_C_PresentArtifactsProgress::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_PresentArtifactsProgress, CallFunc_Greater_IntInt_ReturnValue) == 0x000084, "Member 'PostGameArtifactsMenu_C_PresentArtifactsProgress::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function PostGameArtifactsMenu.PostGameArtifactsMenu_C.PresentArtifactUnlocked
// 0x0030 (0x0030 - 0x0000)
struct PostGameArtifactsMenu_C_PresentArtifactUnlocked final
{
public:
	bool                                          ArtifactPresented;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPostGameArtifact_C*                    CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PostGameArtifactsMenu_C_PresentArtifactUnlocked) == 0x000008, "Wrong alignment on PostGameArtifactsMenu_C_PresentArtifactUnlocked");
static_assert(sizeof(PostGameArtifactsMenu_C_PresentArtifactUnlocked) == 0x000030, "Wrong size on PostGameArtifactsMenu_C_PresentArtifactUnlocked");
static_assert(offsetof(PostGameArtifactsMenu_C_PresentArtifactUnlocked, ArtifactPresented) == 0x000000, "Member 'PostGameArtifactsMenu_C_PresentArtifactUnlocked::ArtifactPresented' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_PresentArtifactUnlocked, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'PostGameArtifactsMenu_C_PresentArtifactUnlocked::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_PresentArtifactUnlocked, CallFunc_Create_ReturnValue) == 0x000018, "Member 'PostGameArtifactsMenu_C_PresentArtifactUnlocked::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_PresentArtifactUnlocked, CallFunc_AddChild_ReturnValue) == 0x000020, "Member 'PostGameArtifactsMenu_C_PresentArtifactUnlocked::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_PresentArtifactUnlocked, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'PostGameArtifactsMenu_C_PresentArtifactUnlocked::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_PresentArtifactUnlocked, CallFunc_Greater_IntInt_ReturnValue) == 0x00002C, "Member 'PostGameArtifactsMenu_C_PresentArtifactUnlocked::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function PostGameArtifactsMenu.PostGameArtifactsMenu_C.Advance
// 0x0003 (0x0003 - 0x0000)
struct PostGameArtifactsMenu_C_Advance final
{
public:
	bool                                          CallFunc_RemoveSelf_ReturnValue;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PresentArtifactUnlocked_ArtifactPresented; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PresentArtifactsProgress_ArtifactPresented; // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PostGameArtifactsMenu_C_Advance) == 0x000001, "Wrong alignment on PostGameArtifactsMenu_C_Advance");
static_assert(sizeof(PostGameArtifactsMenu_C_Advance) == 0x000003, "Wrong size on PostGameArtifactsMenu_C_Advance");
static_assert(offsetof(PostGameArtifactsMenu_C_Advance, CallFunc_RemoveSelf_ReturnValue) == 0x000000, "Member 'PostGameArtifactsMenu_C_Advance::CallFunc_RemoveSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_Advance, CallFunc_PresentArtifactUnlocked_ArtifactPresented) == 0x000001, "Member 'PostGameArtifactsMenu_C_Advance::CallFunc_PresentArtifactUnlocked_ArtifactPresented' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_Advance, CallFunc_PresentArtifactsProgress_ArtifactPresented) == 0x000002, "Member 'PostGameArtifactsMenu_C_Advance::CallFunc_PresentArtifactsProgress_ArtifactPresented' has a wrong offset!");

// Function PostGameArtifactsMenu.PostGameArtifactsMenu_C.BuildArtifactData
// 0x03F0 (0x03F0 - 0x0000)
struct PostGameArtifactsMenu_C_BuildArtifactData final
{
public:
	class UMarinerPostGameSequence*               Sequence;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMarinerPostGameData                   CallFunc_GetLocalPlayerPostGameData_ReturnValue;   // 0x0008(0x0358)(ConstParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36D[0x3];                                      // 0x036D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMangoItemResult                       CallFunc_Array_Get_Item;                           // 0x0378(0x0030)()
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AA[0x2];                                      // 0x03AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x03B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B2[0x2];                                      // 0x03B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMangoLevelRewardItem                  CallFunc_Array_Get_Item_1;                         // 0x03C0(0x0028)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PostGameArtifactsMenu_C_BuildArtifactData) == 0x000008, "Wrong alignment on PostGameArtifactsMenu_C_BuildArtifactData");
static_assert(sizeof(PostGameArtifactsMenu_C_BuildArtifactData) == 0x0003F0, "Wrong size on PostGameArtifactsMenu_C_BuildArtifactData");
static_assert(offsetof(PostGameArtifactsMenu_C_BuildArtifactData, Sequence) == 0x000000, "Member 'PostGameArtifactsMenu_C_BuildArtifactData::Sequence' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_BuildArtifactData, CallFunc_GetLocalPlayerPostGameData_ReturnValue) == 0x000008, "Member 'PostGameArtifactsMenu_C_BuildArtifactData::CallFunc_GetLocalPlayerPostGameData_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_BuildArtifactData, Temp_int_Loop_Counter_Variable) == 0x000360, "Member 'PostGameArtifactsMenu_C_BuildArtifactData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_BuildArtifactData, CallFunc_Add_IntInt_ReturnValue) == 0x000364, "Member 'PostGameArtifactsMenu_C_BuildArtifactData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_BuildArtifactData, CallFunc_Array_Length_ReturnValue) == 0x000368, "Member 'PostGameArtifactsMenu_C_BuildArtifactData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_BuildArtifactData, CallFunc_Less_IntInt_ReturnValue) == 0x00036C, "Member 'PostGameArtifactsMenu_C_BuildArtifactData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_BuildArtifactData, CallFunc_Array_Length_ReturnValue_1) == 0x000370, "Member 'PostGameArtifactsMenu_C_BuildArtifactData::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_BuildArtifactData, Temp_int_Array_Index_Variable) == 0x000374, "Member 'PostGameArtifactsMenu_C_BuildArtifactData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_BuildArtifactData, CallFunc_Array_Get_Item) == 0x000378, "Member 'PostGameArtifactsMenu_C_BuildArtifactData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_BuildArtifactData, CallFunc_Less_FloatFloat_ReturnValue) == 0x0003A8, "Member 'PostGameArtifactsMenu_C_BuildArtifactData::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_BuildArtifactData, CallFunc_Less_IntInt_ReturnValue_1) == 0x0003A9, "Member 'PostGameArtifactsMenu_C_BuildArtifactData::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_BuildArtifactData, Temp_int_Loop_Counter_Variable_1) == 0x0003AC, "Member 'PostGameArtifactsMenu_C_BuildArtifactData::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_BuildArtifactData, CallFunc_BooleanOR_ReturnValue) == 0x0003B0, "Member 'PostGameArtifactsMenu_C_BuildArtifactData::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_BuildArtifactData, CallFunc_Less_IntInt_ReturnValue_2) == 0x0003B1, "Member 'PostGameArtifactsMenu_C_BuildArtifactData::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_BuildArtifactData, CallFunc_Add_IntInt_ReturnValue_1) == 0x0003B4, "Member 'PostGameArtifactsMenu_C_BuildArtifactData::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_BuildArtifactData, Temp_int_Array_Index_Variable_1) == 0x0003B8, "Member 'PostGameArtifactsMenu_C_BuildArtifactData::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_BuildArtifactData, CallFunc_Array_Get_Item_1) == 0x0003C0, "Member 'PostGameArtifactsMenu_C_BuildArtifactData::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_BuildArtifactData, CallFunc_Array_Add_ReturnValue) == 0x0003E8, "Member 'PostGameArtifactsMenu_C_BuildArtifactData::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_BuildArtifactData, CallFunc_Array_Add_ReturnValue_1) == 0x0003EC, "Member 'PostGameArtifactsMenu_C_BuildArtifactData::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function PostGameArtifactsMenu.PostGameArtifactsMenu_C.Complete Artifacts Progress
// 0x0040 (0x0040 - 0x0000)
struct PostGameArtifactsMenu_C_Complete_Artifacts_Progress final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPostGameArtifact_C*                    K2Node_DynamicCast_AsPost_Game_Artifact;           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PostGameArtifactsMenu_C_Complete_Artifacts_Progress) == 0x000008, "Wrong alignment on PostGameArtifactsMenu_C_Complete_Artifacts_Progress");
static_assert(sizeof(PostGameArtifactsMenu_C_Complete_Artifacts_Progress) == 0x000040, "Wrong size on PostGameArtifactsMenu_C_Complete_Artifacts_Progress");
static_assert(offsetof(PostGameArtifactsMenu_C_Complete_Artifacts_Progress, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'PostGameArtifactsMenu_C_Complete_Artifacts_Progress::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_Complete_Artifacts_Progress, Temp_int_Variable) == 0x000010, "Member 'PostGameArtifactsMenu_C_Complete_Artifacts_Progress::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_Complete_Artifacts_Progress, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'PostGameArtifactsMenu_C_Complete_Artifacts_Progress::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_Complete_Artifacts_Progress, CallFunc_GetChildAt_ReturnValue) == 0x000018, "Member 'PostGameArtifactsMenu_C_Complete_Artifacts_Progress::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_Complete_Artifacts_Progress, CallFunc_GetChildrenCount_ReturnValue) == 0x000020, "Member 'PostGameArtifactsMenu_C_Complete_Artifacts_Progress::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_Complete_Artifacts_Progress, K2Node_DynamicCast_AsPost_Game_Artifact) == 0x000028, "Member 'PostGameArtifactsMenu_C_Complete_Artifacts_Progress::K2Node_DynamicCast_AsPost_Game_Artifact' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_Complete_Artifacts_Progress, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'PostGameArtifactsMenu_C_Complete_Artifacts_Progress::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_Complete_Artifacts_Progress, CallFunc_Subtract_IntInt_ReturnValue) == 0x000034, "Member 'PostGameArtifactsMenu_C_Complete_Artifacts_Progress::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_Complete_Artifacts_Progress, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000038, "Member 'PostGameArtifactsMenu_C_Complete_Artifacts_Progress::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function PostGameArtifactsMenu.PostGameArtifactsMenu_C.CompleteArtifactUnlocked
// 0x0028 (0x0028 - 0x0000)
struct PostGameArtifactsMenu_C_CompleteArtifactUnlocked final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPostGameArtifact_C*                    K2Node_DynamicCast_AsPost_Game_Artifact;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PostGameArtifactsMenu_C_CompleteArtifactUnlocked) == 0x000008, "Wrong alignment on PostGameArtifactsMenu_C_CompleteArtifactUnlocked");
static_assert(sizeof(PostGameArtifactsMenu_C_CompleteArtifactUnlocked) == 0x000028, "Wrong size on PostGameArtifactsMenu_C_CompleteArtifactUnlocked");
static_assert(offsetof(PostGameArtifactsMenu_C_CompleteArtifactUnlocked, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'PostGameArtifactsMenu_C_CompleteArtifactUnlocked::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_CompleteArtifactUnlocked, CallFunc_GetChildAt_ReturnValue) == 0x000010, "Member 'PostGameArtifactsMenu_C_CompleteArtifactUnlocked::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_CompleteArtifactUnlocked, K2Node_DynamicCast_AsPost_Game_Artifact) == 0x000018, "Member 'PostGameArtifactsMenu_C_CompleteArtifactUnlocked::K2Node_DynamicCast_AsPost_Game_Artifact' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_CompleteArtifactUnlocked, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'PostGameArtifactsMenu_C_CompleteArtifactUnlocked::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function PostGameArtifactsMenu.PostGameArtifactsMenu_C.OnLevelChanged
// 0x0040 (0x0040 - 0x0000)
struct PostGameArtifactsMenu_C_OnLevelChanged final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0008(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0018(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PostGameArtifactsMenu_C_OnLevelChanged) == 0x000008, "Wrong alignment on PostGameArtifactsMenu_C_OnLevelChanged");
static_assert(sizeof(PostGameArtifactsMenu_C_OnLevelChanged) == 0x000040, "Wrong size on PostGameArtifactsMenu_C_OnLevelChanged");
static_assert(offsetof(PostGameArtifactsMenu_C_OnLevelChanged, Level) == 0x000000, "Member 'PostGameArtifactsMenu_C_OnLevelChanged::Level' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_OnLevelChanged, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000004, "Member 'PostGameArtifactsMenu_C_OnLevelChanged::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameArtifactsMenu_C_OnLevelChanged, Temp_delegate_Variable) == 0x000008, "Member 'PostGameArtifactsMenu_C_OnLevelChanged::Temp_delegate_Variable' has a wrong offset!");
