#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PostGameDefaultStackBase

#include "Basic.hpp"

#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function PostGameDefaultStackBase.PostGameDefaultStackBase_C.ExecuteUbergraph_PostGameDefaultStackBase
// 0x0008 (0x0008 - 0x0000)
struct PostGameDefaultStackBase_C_ExecuteUbergraph_PostGameDefaultStackBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDemoE3_18_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PostGameDefaultStackBase_C_ExecuteUbergraph_PostGameDefaultStackBase) == 0x000004, "Wrong alignment on PostGameDefaultStackBase_C_ExecuteUbergraph_PostGameDefaultStackBase");
static_assert(sizeof(PostGameDefaultStackBase_C_ExecuteUbergraph_PostGameDefaultStackBase) == 0x000008, "Wrong size on PostGameDefaultStackBase_C_ExecuteUbergraph_PostGameDefaultStackBase");
static_assert(offsetof(PostGameDefaultStackBase_C_ExecuteUbergraph_PostGameDefaultStackBase, EntryPoint) == 0x000000, "Member 'PostGameDefaultStackBase_C_ExecuteUbergraph_PostGameDefaultStackBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(PostGameDefaultStackBase_C_ExecuteUbergraph_PostGameDefaultStackBase, CallFunc_IsDemoE3_18_ReturnValue) == 0x000004, "Member 'PostGameDefaultStackBase_C_ExecuteUbergraph_PostGameDefaultStackBase::CallFunc_IsDemoE3_18_ReturnValue' has a wrong offset!");

// Function PostGameDefaultStackBase.PostGameDefaultStackBase_C.GetWidgetSetup
// 0x0020 (0x0020 - 0x0000)
struct PostGameDefaultStackBase_C_GetWidgetSetup final
{
public:
	struct FMarinerMenuStackBaseWidgetSetup       ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference)
	struct FMarinerMenuStackBaseWidgetSetup       K2Node_MakeStruct_MarinerMenuStackBaseWidgetSetup; // 0x0010(0x0010)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PostGameDefaultStackBase_C_GetWidgetSetup) == 0x000008, "Wrong alignment on PostGameDefaultStackBase_C_GetWidgetSetup");
static_assert(sizeof(PostGameDefaultStackBase_C_GetWidgetSetup) == 0x000020, "Wrong size on PostGameDefaultStackBase_C_GetWidgetSetup");
static_assert(offsetof(PostGameDefaultStackBase_C_GetWidgetSetup, ReturnValue) == 0x000000, "Member 'PostGameDefaultStackBase_C_GetWidgetSetup::ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameDefaultStackBase_C_GetWidgetSetup, K2Node_MakeStruct_MarinerMenuStackBaseWidgetSetup) == 0x000010, "Member 'PostGameDefaultStackBase_C_GetWidgetSetup::K2Node_MakeStruct_MarinerMenuStackBaseWidgetSetup' has a wrong offset!");

}

