#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PostGameCurrencyMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PostGameCurrencyMenu.PostGameCurrencyMenu_C
// 0x0040 (0x0520 - 0x04E0)
class UPostGameCurrencyMenu_C final : public UMarinerMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ResetAnim;                                         // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TransitionCurrencyOut;                             // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Flash;                                             // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Motionblur;                                        // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPostGameCurrencyLarge_C*               SummaryCurrency;                                   // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Wave;                                              // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         MatchSoftCurrency;                                 // 0x0518(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SoftCurrencyApplied;                               // 0x051C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_PostGameCurrencyMenu(int32 EntryPoint);
	void BP_OnExited(bool bToSubLayer);
	void WidgetAnimationEvt_TransitionCurrencyOut_K2Node_WidgetAnimationEvent_0();
	void CurrencyAnimationComplete();
	void BP_OnEntered(bool bFromSubMenu);
	void ApplySoftCurrency();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PostGameCurrencyMenu_C">();
	}
	static class UPostGameCurrencyMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPostGameCurrencyMenu_C>();
	}
};
static_assert(alignof(UPostGameCurrencyMenu_C) == 0x000008, "Wrong alignment on UPostGameCurrencyMenu_C");
static_assert(sizeof(UPostGameCurrencyMenu_C) == 0x000520, "Wrong size on UPostGameCurrencyMenu_C");
static_assert(offsetof(UPostGameCurrencyMenu_C, UberGraphFrame) == 0x0004E0, "Member 'UPostGameCurrencyMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPostGameCurrencyMenu_C, ResetAnim) == 0x0004E8, "Member 'UPostGameCurrencyMenu_C::ResetAnim' has a wrong offset!");
static_assert(offsetof(UPostGameCurrencyMenu_C, TransitionCurrencyOut) == 0x0004F0, "Member 'UPostGameCurrencyMenu_C::TransitionCurrencyOut' has a wrong offset!");
static_assert(offsetof(UPostGameCurrencyMenu_C, Flash) == 0x0004F8, "Member 'UPostGameCurrencyMenu_C::Flash' has a wrong offset!");
static_assert(offsetof(UPostGameCurrencyMenu_C, Motionblur) == 0x000500, "Member 'UPostGameCurrencyMenu_C::Motionblur' has a wrong offset!");
static_assert(offsetof(UPostGameCurrencyMenu_C, SummaryCurrency) == 0x000508, "Member 'UPostGameCurrencyMenu_C::SummaryCurrency' has a wrong offset!");
static_assert(offsetof(UPostGameCurrencyMenu_C, Wave) == 0x000510, "Member 'UPostGameCurrencyMenu_C::Wave' has a wrong offset!");
static_assert(offsetof(UPostGameCurrencyMenu_C, MatchSoftCurrency) == 0x000518, "Member 'UPostGameCurrencyMenu_C::MatchSoftCurrency' has a wrong offset!");
static_assert(offsetof(UPostGameCurrencyMenu_C, SoftCurrencyApplied) == 0x00051C, "Member 'UPostGameCurrencyMenu_C::SoftCurrencyApplied' has a wrong offset!");

}

