#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PostGameSequenceTitle

#include "Basic.hpp"


namespace SDK::Params
{

// Function PostGameSequenceTitle.PostGameSequenceTitle_C.SetTitle
// 0x0028 (0x0028 - 0x0000)
struct PostGameSequenceTitle_C_SetTitle final
{
public:
	class FText                                   Param_Title;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_GetWidgetActive_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2237[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PostGameSequenceTitle_C_SetTitle) == 0x000008, "Wrong alignment on PostGameSequenceTitle_C_SetTitle");
static_assert(sizeof(PostGameSequenceTitle_C_SetTitle) == 0x000028, "Wrong size on PostGameSequenceTitle_C_SetTitle");
static_assert(offsetof(PostGameSequenceTitle_C_SetTitle, Param_Title) == 0x000000, "Member 'PostGameSequenceTitle_C_SetTitle::Param_Title' has a wrong offset!");
static_assert(offsetof(PostGameSequenceTitle_C_SetTitle, CallFunc_GetWidgetActive_ReturnValue) == 0x000018, "Member 'PostGameSequenceTitle_C_SetTitle::CallFunc_GetWidgetActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameSequenceTitle_C_SetTitle, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'PostGameSequenceTitle_C_SetTitle::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function PostGameSequenceTitle.PostGameSequenceTitle_C.Populate
// 0x0001 (0x0001 - 0x0000)
struct PostGameSequenceTitle_C_Populate final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PostGameSequenceTitle_C_Populate) == 0x000001, "Wrong alignment on PostGameSequenceTitle_C_Populate");
static_assert(sizeof(PostGameSequenceTitle_C_Populate) == 0x000001, "Wrong size on PostGameSequenceTitle_C_Populate");
static_assert(offsetof(PostGameSequenceTitle_C_Populate, ReturnValue) == 0x000000, "Member 'PostGameSequenceTitle_C_Populate::ReturnValue' has a wrong offset!");

}

