#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PostGameSequence

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PostGameSequence.PostGameSequence_C
// 0x0028 (0x0B60 - 0x0B38)
class UPostGameSequence_C final : public UMarinerPostGameSequence
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B38(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStackManagerContentWidget_C*           MenuContent;                                       // 0x0B40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPromptBanner_C*                 SequencePrompts;                                   // 0x0B48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPostGameSequenceTitle_C*               SequenceTitle;                                     // 0x0B50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPostGameCurrencySmall_C*               SoftCurrency;                                      // 0x0B58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PostGameSequence(int32 EntryPoint);
	void OnStepReached(TSubclassOf<class UMarinerMenuStackLayer> Layer);
	void OnRequestComplete(bool bResultSuccess);
	void HasProgressionData(const struct FMangoMatchCharacterProgression& CharacterProgression, bool* Result);
	void ShowSequenceTitle(const class FText& Title);
	void HideSequenceTitle();
	void ShowSoftCurrency(int32 Delta, bool Animate);
	void HideSoftCurrency();
	void HasBlastPassData(const struct FMangoBattlePassProgress& MatchResult, bool* Result);
	bool IsStepAllowed(TSubclassOf<class UMarinerMenuStackLayer> Layer);
	void HasArtifactsData(bool* ShowArtifactMenu);

	struct FMarinerMenuSequenceAssets GetAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PostGameSequence_C">();
	}
	static class UPostGameSequence_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPostGameSequence_C>();
	}
};
static_assert(alignof(UPostGameSequence_C) == 0x000008, "Wrong alignment on UPostGameSequence_C");
static_assert(sizeof(UPostGameSequence_C) == 0x000B60, "Wrong size on UPostGameSequence_C");
static_assert(offsetof(UPostGameSequence_C, UberGraphFrame) == 0x000B38, "Member 'UPostGameSequence_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPostGameSequence_C, MenuContent) == 0x000B40, "Member 'UPostGameSequence_C::MenuContent' has a wrong offset!");
static_assert(offsetof(UPostGameSequence_C, SequencePrompts) == 0x000B48, "Member 'UPostGameSequence_C::SequencePrompts' has a wrong offset!");
static_assert(offsetof(UPostGameSequence_C, SequenceTitle) == 0x000B50, "Member 'UPostGameSequence_C::SequenceTitle' has a wrong offset!");
static_assert(offsetof(UPostGameSequence_C, SoftCurrency) == 0x000B58, "Member 'UPostGameSequence_C::SoftCurrency' has a wrong offset!");

}

