#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PostGameHeader

#include "Basic.hpp"

#include "MangoClient_structs.hpp"
#include "GameModeEnums_structs.hpp"


namespace SDK::Params
{

// Function PostGameHeader.PostGameHeader_C.ExecuteUbergraph_PostGameHeader
// 0x00C8 (0x00C8 - 0x0000)
struct PostGameHeader_C_ExecuteUbergraph_PostGameHeader final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMarinerGameOutcome                           Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMarinerGameOutcome                           Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMarinerGameOutcome                           Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21B0[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuSequence*                   CallFunc_GetActiveSequence_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerPostGameSequence*               K2Node_DynamicCast_AsMariner_Post_Game_Sequence;   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMarinerGameOutcome                           Temp_byte_Variable_3;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21B1[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchEnd                              CallFunc_GetMatchEndData_ReturnValue;              // 0x0028(0x0068)(ConstParm)
	EGameModeEnums                                CallFunc_GetGameModeViaMatchEnd_GameMode;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21B2[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21B3[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FormatTimeRemaining_ReturnValue;          // 0x00A0(0x0018)()
	int32                                         CallFunc_GetPlayerTeam_TeamIndex;                  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMarinerGameOutcome                           CallFunc_GetPlayerTeam_PlayerGameOutcome;          // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21B4[0x3];                                     // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetEnemyTeam_EnemyTeam;                   // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMarinerGameOutcome                           Temp_byte_Variable_4;                              // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMarinerGameOutcome                           Temp_byte_Variable_5;                              // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMarinerGameOutcome                           K2Node_Select_Default;                             // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PostGameHeader_C_ExecuteUbergraph_PostGameHeader) == 0x000008, "Wrong alignment on PostGameHeader_C_ExecuteUbergraph_PostGameHeader");
static_assert(sizeof(PostGameHeader_C_ExecuteUbergraph_PostGameHeader) == 0x0000C8, "Wrong size on PostGameHeader_C_ExecuteUbergraph_PostGameHeader");
static_assert(offsetof(PostGameHeader_C_ExecuteUbergraph_PostGameHeader, EntryPoint) == 0x000000, "Member 'PostGameHeader_C_ExecuteUbergraph_PostGameHeader::EntryPoint' has a wrong offset!");
static_assert(offsetof(PostGameHeader_C_ExecuteUbergraph_PostGameHeader, Temp_byte_Variable) == 0x000004, "Member 'PostGameHeader_C_ExecuteUbergraph_PostGameHeader::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PostGameHeader_C_ExecuteUbergraph_PostGameHeader, Temp_byte_Variable_1) == 0x000005, "Member 'PostGameHeader_C_ExecuteUbergraph_PostGameHeader::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(PostGameHeader_C_ExecuteUbergraph_PostGameHeader, Temp_byte_Variable_2) == 0x000006, "Member 'PostGameHeader_C_ExecuteUbergraph_PostGameHeader::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(PostGameHeader_C_ExecuteUbergraph_PostGameHeader, CallFunc_GetMenuManager_ReturnValue) == 0x000008, "Member 'PostGameHeader_C_ExecuteUbergraph_PostGameHeader::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameHeader_C_ExecuteUbergraph_PostGameHeader, CallFunc_GetActiveSequence_ReturnValue) == 0x000010, "Member 'PostGameHeader_C_ExecuteUbergraph_PostGameHeader::CallFunc_GetActiveSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameHeader_C_ExecuteUbergraph_PostGameHeader, K2Node_DynamicCast_AsMariner_Post_Game_Sequence) == 0x000018, "Member 'PostGameHeader_C_ExecuteUbergraph_PostGameHeader::K2Node_DynamicCast_AsMariner_Post_Game_Sequence' has a wrong offset!");
static_assert(offsetof(PostGameHeader_C_ExecuteUbergraph_PostGameHeader, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'PostGameHeader_C_ExecuteUbergraph_PostGameHeader::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PostGameHeader_C_ExecuteUbergraph_PostGameHeader, Temp_byte_Variable_3) == 0x000021, "Member 'PostGameHeader_C_ExecuteUbergraph_PostGameHeader::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(PostGameHeader_C_ExecuteUbergraph_PostGameHeader, CallFunc_GetMatchEndData_ReturnValue) == 0x000028, "Member 'PostGameHeader_C_ExecuteUbergraph_PostGameHeader::CallFunc_GetMatchEndData_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameHeader_C_ExecuteUbergraph_PostGameHeader, CallFunc_GetGameModeViaMatchEnd_GameMode) == 0x000090, "Member 'PostGameHeader_C_ExecuteUbergraph_PostGameHeader::CallFunc_GetGameModeViaMatchEnd_GameMode' has a wrong offset!");
static_assert(offsetof(PostGameHeader_C_ExecuteUbergraph_PostGameHeader, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000094, "Member 'PostGameHeader_C_ExecuteUbergraph_PostGameHeader::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameHeader_C_ExecuteUbergraph_PostGameHeader, K2Node_SwitchEnum_CmpSuccess) == 0x000098, "Member 'PostGameHeader_C_ExecuteUbergraph_PostGameHeader::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PostGameHeader_C_ExecuteUbergraph_PostGameHeader, CallFunc_FormatTimeRemaining_ReturnValue) == 0x0000A0, "Member 'PostGameHeader_C_ExecuteUbergraph_PostGameHeader::CallFunc_FormatTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostGameHeader_C_ExecuteUbergraph_PostGameHeader, CallFunc_GetPlayerTeam_TeamIndex) == 0x0000B8, "Member 'PostGameHeader_C_ExecuteUbergraph_PostGameHeader::CallFunc_GetPlayerTeam_TeamIndex' has a wrong offset!");
static_assert(offsetof(PostGameHeader_C_ExecuteUbergraph_PostGameHeader, CallFunc_GetPlayerTeam_PlayerGameOutcome) == 0x0000BC, "Member 'PostGameHeader_C_ExecuteUbergraph_PostGameHeader::CallFunc_GetPlayerTeam_PlayerGameOutcome' has a wrong offset!");
static_assert(offsetof(PostGameHeader_C_ExecuteUbergraph_PostGameHeader, CallFunc_GetEnemyTeam_EnemyTeam) == 0x0000C0, "Member 'PostGameHeader_C_ExecuteUbergraph_PostGameHeader::CallFunc_GetEnemyTeam_EnemyTeam' has a wrong offset!");
static_assert(offsetof(PostGameHeader_C_ExecuteUbergraph_PostGameHeader, Temp_byte_Variable_4) == 0x0000C4, "Member 'PostGameHeader_C_ExecuteUbergraph_PostGameHeader::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(PostGameHeader_C_ExecuteUbergraph_PostGameHeader, Temp_byte_Variable_5) == 0x0000C5, "Member 'PostGameHeader_C_ExecuteUbergraph_PostGameHeader::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(PostGameHeader_C_ExecuteUbergraph_PostGameHeader, K2Node_Select_Default) == 0x0000C6, "Member 'PostGameHeader_C_ExecuteUbergraph_PostGameHeader::K2Node_Select_Default' has a wrong offset!");

// Function PostGameHeader.PostGameHeader_C.HandleRocketBotAttackStates
// 0x0002 (0x0002 - 0x0000)
struct PostGameHeader_C_HandleRocketBotAttackStates final
{
public:
	EMarinerGameOutcome                           GameOutcome;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PostGameHeader_C_HandleRocketBotAttackStates) == 0x000001, "Wrong alignment on PostGameHeader_C_HandleRocketBotAttackStates");
static_assert(sizeof(PostGameHeader_C_HandleRocketBotAttackStates) == 0x000002, "Wrong size on PostGameHeader_C_HandleRocketBotAttackStates");
static_assert(offsetof(PostGameHeader_C_HandleRocketBotAttackStates, GameOutcome) == 0x000000, "Member 'PostGameHeader_C_HandleRocketBotAttackStates::GameOutcome' has a wrong offset!");
static_assert(offsetof(PostGameHeader_C_HandleRocketBotAttackStates, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'PostGameHeader_C_HandleRocketBotAttackStates::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function PostGameHeader.PostGameHeader_C.HandleStockStates
// 0x0002 (0x0002 - 0x0000)
struct PostGameHeader_C_HandleStockStates final
{
public:
	EMarinerGameOutcome                           GameOutcome;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PostGameHeader_C_HandleStockStates) == 0x000001, "Wrong alignment on PostGameHeader_C_HandleStockStates");
static_assert(sizeof(PostGameHeader_C_HandleStockStates) == 0x000002, "Wrong size on PostGameHeader_C_HandleStockStates");
static_assert(offsetof(PostGameHeader_C_HandleStockStates, GameOutcome) == 0x000000, "Member 'PostGameHeader_C_HandleStockStates::GameOutcome' has a wrong offset!");
static_assert(offsetof(PostGameHeader_C_HandleStockStates, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'PostGameHeader_C_HandleStockStates::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

