#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PracticeButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function PracticeButton.PracticeButton_C.ShouldBeEnabled
// 0x0040 (0x0040 - 0x0000)
struct PracticeButton_C_ShouldBeEnabled final
{
public:
	class FText                                   OutDisabledText;                                   // 0x0000(0x0018)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPracticeModeAllowed_ReturnValue;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_ShouldBeEnabled_OutDisabledText;          // 0x0020(0x0018)()
	bool                                          CallFunc_ShouldBeEnabled_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PracticeButton_C_ShouldBeEnabled) == 0x000008, "Wrong alignment on PracticeButton_C_ShouldBeEnabled");
static_assert(sizeof(PracticeButton_C_ShouldBeEnabled) == 0x000040, "Wrong size on PracticeButton_C_ShouldBeEnabled");
static_assert(offsetof(PracticeButton_C_ShouldBeEnabled, OutDisabledText) == 0x000000, "Member 'PracticeButton_C_ShouldBeEnabled::OutDisabledText' has a wrong offset!");
static_assert(offsetof(PracticeButton_C_ShouldBeEnabled, ReturnValue) == 0x000018, "Member 'PracticeButton_C_ShouldBeEnabled::ReturnValue' has a wrong offset!");
static_assert(offsetof(PracticeButton_C_ShouldBeEnabled, CallFunc_IsPracticeModeAllowed_ReturnValue) == 0x000019, "Member 'PracticeButton_C_ShouldBeEnabled::CallFunc_IsPracticeModeAllowed_ReturnValue' has a wrong offset!");
static_assert(offsetof(PracticeButton_C_ShouldBeEnabled, CallFunc_ShouldBeEnabled_OutDisabledText) == 0x000020, "Member 'PracticeButton_C_ShouldBeEnabled::CallFunc_ShouldBeEnabled_OutDisabledText' has a wrong offset!");
static_assert(offsetof(PracticeButton_C_ShouldBeEnabled, CallFunc_ShouldBeEnabled_ReturnValue) == 0x000038, "Member 'PracticeButton_C_ShouldBeEnabled::CallFunc_ShouldBeEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(PracticeButton_C_ShouldBeEnabled, CallFunc_BooleanAND_ReturnValue) == 0x000039, "Member 'PracticeButton_C_ShouldBeEnabled::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

