#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PregameManager

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PregameManager.PregameManager_C
// 0x0108 (0x0358 - 0x0250)
class APregameManager_C final : public AMarinerPregameManager
{
public:
	class USpotLightComponent*                    Totem_fill6;                                       // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Totem_fill5;                                       // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Totem_fill4;                                       // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Totem_fill3;                                       // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Totem_fill2;                                       // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Totem_fill1;                                       // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   FILL;                                              // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   Fill_Blue_L1;                                      // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   Fill_Blue_R1;                                      // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   Fill_Blue_R;                                       // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   Fill_Blue_M;                                       // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   Fill_Blue_L;                                       // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   Fill_Red_L1;                                       // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   Fill_Red_R1;                                       // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   Fill_Red_R;                                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   Fill_Red_M;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   Fill_Red_L;                                        // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   A1_WorldUI_Ground;                                 // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Enemy3Totem;                                       // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Enemy2Totem;                                       // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Enemy1Totem;                                       // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Teammate2Totem;                                    // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Teammate1Totem;                                    // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   LocalPlayerTotem;                                  // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Enemy3Spawner;                                     // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Enemy2Spawner;                                     // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Enemy1Spawner;                                     // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ShowdownCamera;                                    // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   CharacterSelectCamera;                             // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Teammate1Spawner;                                  // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Teammate2Spawner;                                  // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   LocalPlayerSpawner;                                // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PregameManager_C">();
	}
	static class APregameManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APregameManager_C>();
	}
};
static_assert(alignof(APregameManager_C) == 0x000008, "Wrong alignment on APregameManager_C");
static_assert(sizeof(APregameManager_C) == 0x000358, "Wrong size on APregameManager_C");
static_assert(offsetof(APregameManager_C, Totem_fill6) == 0x000250, "Member 'APregameManager_C::Totem_fill6' has a wrong offset!");
static_assert(offsetof(APregameManager_C, Totem_fill5) == 0x000258, "Member 'APregameManager_C::Totem_fill5' has a wrong offset!");
static_assert(offsetof(APregameManager_C, Totem_fill4) == 0x000260, "Member 'APregameManager_C::Totem_fill4' has a wrong offset!");
static_assert(offsetof(APregameManager_C, Totem_fill3) == 0x000268, "Member 'APregameManager_C::Totem_fill3' has a wrong offset!");
static_assert(offsetof(APregameManager_C, Totem_fill2) == 0x000270, "Member 'APregameManager_C::Totem_fill2' has a wrong offset!");
static_assert(offsetof(APregameManager_C, Totem_fill1) == 0x000278, "Member 'APregameManager_C::Totem_fill1' has a wrong offset!");
static_assert(offsetof(APregameManager_C, FILL) == 0x000280, "Member 'APregameManager_C::FILL' has a wrong offset!");
static_assert(offsetof(APregameManager_C, Fill_Blue_L1) == 0x000288, "Member 'APregameManager_C::Fill_Blue_L1' has a wrong offset!");
static_assert(offsetof(APregameManager_C, Fill_Blue_R1) == 0x000290, "Member 'APregameManager_C::Fill_Blue_R1' has a wrong offset!");
static_assert(offsetof(APregameManager_C, Fill_Blue_R) == 0x000298, "Member 'APregameManager_C::Fill_Blue_R' has a wrong offset!");
static_assert(offsetof(APregameManager_C, Fill_Blue_M) == 0x0002A0, "Member 'APregameManager_C::Fill_Blue_M' has a wrong offset!");
static_assert(offsetof(APregameManager_C, Fill_Blue_L) == 0x0002A8, "Member 'APregameManager_C::Fill_Blue_L' has a wrong offset!");
static_assert(offsetof(APregameManager_C, Fill_Red_L1) == 0x0002B0, "Member 'APregameManager_C::Fill_Red_L1' has a wrong offset!");
static_assert(offsetof(APregameManager_C, Fill_Red_R1) == 0x0002B8, "Member 'APregameManager_C::Fill_Red_R1' has a wrong offset!");
static_assert(offsetof(APregameManager_C, Fill_Red_R) == 0x0002C0, "Member 'APregameManager_C::Fill_Red_R' has a wrong offset!");
static_assert(offsetof(APregameManager_C, Fill_Red_M) == 0x0002C8, "Member 'APregameManager_C::Fill_Red_M' has a wrong offset!");
static_assert(offsetof(APregameManager_C, Fill_Red_L) == 0x0002D0, "Member 'APregameManager_C::Fill_Red_L' has a wrong offset!");
static_assert(offsetof(APregameManager_C, A1_WorldUI_Ground) == 0x0002D8, "Member 'APregameManager_C::A1_WorldUI_Ground' has a wrong offset!");
static_assert(offsetof(APregameManager_C, Enemy3Totem) == 0x0002E0, "Member 'APregameManager_C::Enemy3Totem' has a wrong offset!");
static_assert(offsetof(APregameManager_C, Enemy2Totem) == 0x0002E8, "Member 'APregameManager_C::Enemy2Totem' has a wrong offset!");
static_assert(offsetof(APregameManager_C, Enemy1Totem) == 0x0002F0, "Member 'APregameManager_C::Enemy1Totem' has a wrong offset!");
static_assert(offsetof(APregameManager_C, Teammate2Totem) == 0x0002F8, "Member 'APregameManager_C::Teammate2Totem' has a wrong offset!");
static_assert(offsetof(APregameManager_C, Teammate1Totem) == 0x000300, "Member 'APregameManager_C::Teammate1Totem' has a wrong offset!");
static_assert(offsetof(APregameManager_C, LocalPlayerTotem) == 0x000308, "Member 'APregameManager_C::LocalPlayerTotem' has a wrong offset!");
static_assert(offsetof(APregameManager_C, Enemy3Spawner) == 0x000310, "Member 'APregameManager_C::Enemy3Spawner' has a wrong offset!");
static_assert(offsetof(APregameManager_C, Enemy2Spawner) == 0x000318, "Member 'APregameManager_C::Enemy2Spawner' has a wrong offset!");
static_assert(offsetof(APregameManager_C, Enemy1Spawner) == 0x000320, "Member 'APregameManager_C::Enemy1Spawner' has a wrong offset!");
static_assert(offsetof(APregameManager_C, ShowdownCamera) == 0x000328, "Member 'APregameManager_C::ShowdownCamera' has a wrong offset!");
static_assert(offsetof(APregameManager_C, CharacterSelectCamera) == 0x000330, "Member 'APregameManager_C::CharacterSelectCamera' has a wrong offset!");
static_assert(offsetof(APregameManager_C, Teammate1Spawner) == 0x000338, "Member 'APregameManager_C::Teammate1Spawner' has a wrong offset!");
static_assert(offsetof(APregameManager_C, Teammate2Spawner) == 0x000340, "Member 'APregameManager_C::Teammate2Spawner' has a wrong offset!");
static_assert(offsetof(APregameManager_C, LocalPlayerSpawner) == 0x000348, "Member 'APregameManager_C::LocalPlayerSpawner' has a wrong offset!");
static_assert(offsetof(APregameManager_C, DefaultSceneRoot) == 0x000350, "Member 'APregameManager_C::DefaultSceneRoot' has a wrong offset!");

}

