#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrivateMatchMenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function PrivateMatchMenu.PrivateMatchMenu_C.ExecuteUbergraph_PrivateMatchMenu
// 0x0038 (0x0038 - 0x0000)
struct PrivateMatchMenu_C_ExecuteUbergraph_PrivateMatchMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2396[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerLayeredButton*                  K2Node_ComponentBoundEvent_Instance;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerSettingBase*                    K2Node_ComponentBoundEvent_Instance_1;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue_1;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuStackLayer*                 CallFunc_PushLayerToActiveStack_ReturnValue;       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuStackLayer*                 CallFunc_PushLayerToActiveStack_ReturnValue_1;     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrivateMatchMenu_C_ExecuteUbergraph_PrivateMatchMenu) == 0x000008, "Wrong alignment on PrivateMatchMenu_C_ExecuteUbergraph_PrivateMatchMenu");
static_assert(sizeof(PrivateMatchMenu_C_ExecuteUbergraph_PrivateMatchMenu) == 0x000038, "Wrong size on PrivateMatchMenu_C_ExecuteUbergraph_PrivateMatchMenu");
static_assert(offsetof(PrivateMatchMenu_C_ExecuteUbergraph_PrivateMatchMenu, EntryPoint) == 0x000000, "Member 'PrivateMatchMenu_C_ExecuteUbergraph_PrivateMatchMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(PrivateMatchMenu_C_ExecuteUbergraph_PrivateMatchMenu, K2Node_ComponentBoundEvent_Instance) == 0x000008, "Member 'PrivateMatchMenu_C_ExecuteUbergraph_PrivateMatchMenu::K2Node_ComponentBoundEvent_Instance' has a wrong offset!");
static_assert(offsetof(PrivateMatchMenu_C_ExecuteUbergraph_PrivateMatchMenu, K2Node_ComponentBoundEvent_Instance_1) == 0x000010, "Member 'PrivateMatchMenu_C_ExecuteUbergraph_PrivateMatchMenu::K2Node_ComponentBoundEvent_Instance_1' has a wrong offset!");
static_assert(offsetof(PrivateMatchMenu_C_ExecuteUbergraph_PrivateMatchMenu, CallFunc_GetMenuManager_ReturnValue) == 0x000018, "Member 'PrivateMatchMenu_C_ExecuteUbergraph_PrivateMatchMenu::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(PrivateMatchMenu_C_ExecuteUbergraph_PrivateMatchMenu, CallFunc_GetMenuManager_ReturnValue_1) == 0x000020, "Member 'PrivateMatchMenu_C_ExecuteUbergraph_PrivateMatchMenu::CallFunc_GetMenuManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PrivateMatchMenu_C_ExecuteUbergraph_PrivateMatchMenu, CallFunc_PushLayerToActiveStack_ReturnValue) == 0x000028, "Member 'PrivateMatchMenu_C_ExecuteUbergraph_PrivateMatchMenu::CallFunc_PushLayerToActiveStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(PrivateMatchMenu_C_ExecuteUbergraph_PrivateMatchMenu, CallFunc_PushLayerToActiveStack_ReturnValue_1) == 0x000030, "Member 'PrivateMatchMenu_C_ExecuteUbergraph_PrivateMatchMenu::CallFunc_PushLayerToActiveStack_ReturnValue_1' has a wrong offset!");

// Function PrivateMatchMenu.PrivateMatchMenu_C.BndEvt__MapButton_K2Node_ComponentBoundEvent_93_OnLayeredButtonEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PrivateMatchMenu_C_BndEvt__MapButton_K2Node_ComponentBoundEvent_93_OnLayeredButtonEvent__DelegateSignature final
{
public:
	class UMarinerLayeredButton*                  Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrivateMatchMenu_C_BndEvt__MapButton_K2Node_ComponentBoundEvent_93_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on PrivateMatchMenu_C_BndEvt__MapButton_K2Node_ComponentBoundEvent_93_OnLayeredButtonEvent__DelegateSignature");
static_assert(sizeof(PrivateMatchMenu_C_BndEvt__MapButton_K2Node_ComponentBoundEvent_93_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong size on PrivateMatchMenu_C_BndEvt__MapButton_K2Node_ComponentBoundEvent_93_OnLayeredButtonEvent__DelegateSignature");
static_assert(offsetof(PrivateMatchMenu_C_BndEvt__MapButton_K2Node_ComponentBoundEvent_93_OnLayeredButtonEvent__DelegateSignature, Instance) == 0x000000, "Member 'PrivateMatchMenu_C_BndEvt__MapButton_K2Node_ComponentBoundEvent_93_OnLayeredButtonEvent__DelegateSignature::Instance' has a wrong offset!");

// Function PrivateMatchMenu.PrivateMatchMenu_C.BndEvt__ModeWidget_K2Node_ComponentBoundEvent_15_OnButtonSettingSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PrivateMatchMenu_C_BndEvt__ModeWidget_K2Node_ComponentBoundEvent_15_OnButtonSettingSelected__DelegateSignature final
{
public:
	class UMarinerSettingBase*                    Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrivateMatchMenu_C_BndEvt__ModeWidget_K2Node_ComponentBoundEvent_15_OnButtonSettingSelected__DelegateSignature) == 0x000008, "Wrong alignment on PrivateMatchMenu_C_BndEvt__ModeWidget_K2Node_ComponentBoundEvent_15_OnButtonSettingSelected__DelegateSignature");
static_assert(sizeof(PrivateMatchMenu_C_BndEvt__ModeWidget_K2Node_ComponentBoundEvent_15_OnButtonSettingSelected__DelegateSignature) == 0x000008, "Wrong size on PrivateMatchMenu_C_BndEvt__ModeWidget_K2Node_ComponentBoundEvent_15_OnButtonSettingSelected__DelegateSignature");
static_assert(offsetof(PrivateMatchMenu_C_BndEvt__ModeWidget_K2Node_ComponentBoundEvent_15_OnButtonSettingSelected__DelegateSignature, Instance) == 0x000000, "Member 'PrivateMatchMenu_C_BndEvt__ModeWidget_K2Node_ComponentBoundEvent_15_OnButtonSettingSelected__DelegateSignature::Instance' has a wrong offset!");

}

