#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProfileWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ProfileWidget.ProfileWidget_C
// 0x0060 (0x04E8 - 0x0488)
class UProfileWidget_C final : public UMarinerProfileWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0488(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAvatarWidget_C*                        Avatar_C_0;                                        // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAvatarWidget_C*                        Avatar_C_1;                                        // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ExtraPlayerFrame;                                  // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_208;                                         // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPrompt_C*                       PartyPrompt;                                       // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PartyPromptFrame;                                  // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               QuitGamePanel;                                     // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuitGamePrompt_C*                      QuitGamePrompt;                                    // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHardCurrency01_C*                      RocketBucks;                                       // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoftCurrency01_C*                      RocketParts;                                       // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USettingsPrompt_C*                      SettingsPrompt;                                    // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ProfileWidget(int32 EntryPoint);
	void Construct();
	void Destruct();
	void RocketBucksChanged(const int32 PreviousValue, const int32 NewValue);
	void RocketPartsChanged(const int32 PreviousValue, const int32 NewValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ProfileWidget_C">();
	}
	static class UProfileWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProfileWidget_C>();
	}
};
static_assert(alignof(UProfileWidget_C) == 0x000008, "Wrong alignment on UProfileWidget_C");
static_assert(sizeof(UProfileWidget_C) == 0x0004E8, "Wrong size on UProfileWidget_C");
static_assert(offsetof(UProfileWidget_C, UberGraphFrame) == 0x000488, "Member 'UProfileWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UProfileWidget_C, Avatar_C_0) == 0x000490, "Member 'UProfileWidget_C::Avatar_C_0' has a wrong offset!");
static_assert(offsetof(UProfileWidget_C, Avatar_C_1) == 0x000498, "Member 'UProfileWidget_C::Avatar_C_1' has a wrong offset!");
static_assert(offsetof(UProfileWidget_C, ExtraPlayerFrame) == 0x0004A0, "Member 'UProfileWidget_C::ExtraPlayerFrame' has a wrong offset!");
static_assert(offsetof(UProfileWidget_C, Image_208) == 0x0004A8, "Member 'UProfileWidget_C::Image_208' has a wrong offset!");
static_assert(offsetof(UProfileWidget_C, PartyPrompt) == 0x0004B0, "Member 'UProfileWidget_C::PartyPrompt' has a wrong offset!");
static_assert(offsetof(UProfileWidget_C, PartyPromptFrame) == 0x0004B8, "Member 'UProfileWidget_C::PartyPromptFrame' has a wrong offset!");
static_assert(offsetof(UProfileWidget_C, QuitGamePanel) == 0x0004C0, "Member 'UProfileWidget_C::QuitGamePanel' has a wrong offset!");
static_assert(offsetof(UProfileWidget_C, QuitGamePrompt) == 0x0004C8, "Member 'UProfileWidget_C::QuitGamePrompt' has a wrong offset!");
static_assert(offsetof(UProfileWidget_C, RocketBucks) == 0x0004D0, "Member 'UProfileWidget_C::RocketBucks' has a wrong offset!");
static_assert(offsetof(UProfileWidget_C, RocketParts) == 0x0004D8, "Member 'UProfileWidget_C::RocketParts' has a wrong offset!");
static_assert(offsetof(UProfileWidget_C, SettingsPrompt) == 0x0004E0, "Member 'UProfileWidget_C::SettingsPrompt' has a wrong offset!");

}

