#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProfileMenu

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ProfileMenu.ProfileMenu_C
// 0x0088 (0x0570 - 0x04E8)
class ProfileMenu::UProfileMenu_C final : public UMarinerProfileMenu
{
public:
	class UImage*                                 BG;                                                // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG2;                                               // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Border;                                            // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Border_1;                                          // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBoxStatWidget_C*                       BoxStatWidget;                                     // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBoxStatWidget_C*                       BoxStatWidget_110;                                 // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBoxStatWidget_C*                       BoxStatWidget_389;                                 // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBoxStatWidget_C*                       BoxStatWidget_617;                                 // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBoxStatWidget_C*                       BoxStatWidget_707;                                 // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridStatWidget_C*                      GridStatWidget;                                    // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridStatWidget_C*                      GridStatWidget_104;                                // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridStatWidget_C*                      GridStatWidget_166;                                // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridStatWidget_C*                      GridStatWidget_492;                                // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridStatWidget_C*                      GridStatWidget_589;                                // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridStatWidget_C*                      GridStatWidget_682;                                // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_172;                                         // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_224;                                         // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WidgetBlueprintGeneratedClass ProfileMenu.ProfileMenu_C", true, "ProfileMenu_C">();
	}
	static class ProfileMenu::UProfileMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ProfileMenu::UProfileMenu_C>();
	}
};
static_assert(alignof(ProfileMenu::UProfileMenu_C) == 0x000008, "Wrong alignment on ProfileMenu::UProfileMenu_C");
static_assert(sizeof(ProfileMenu::UProfileMenu_C) == 0x000570, "Wrong size on ProfileMenu::UProfileMenu_C");
static_assert(offsetof(ProfileMenu::UProfileMenu_C, BG) == 0x0004E8, "Member 'ProfileMenu::UProfileMenu_C::BG' has a wrong offset!");
static_assert(offsetof(ProfileMenu::UProfileMenu_C, BG2) == 0x0004F0, "Member 'ProfileMenu::UProfileMenu_C::BG2' has a wrong offset!");
static_assert(offsetof(ProfileMenu::UProfileMenu_C, Border) == 0x0004F8, "Member 'ProfileMenu::UProfileMenu_C::Border' has a wrong offset!");
static_assert(offsetof(ProfileMenu::UProfileMenu_C, Border_1) == 0x000500, "Member 'ProfileMenu::UProfileMenu_C::Border_1' has a wrong offset!");
static_assert(offsetof(ProfileMenu::UProfileMenu_C, BoxStatWidget) == 0x000508, "Member 'ProfileMenu::UProfileMenu_C::BoxStatWidget' has a wrong offset!");
static_assert(offsetof(ProfileMenu::UProfileMenu_C, BoxStatWidget_110) == 0x000510, "Member 'ProfileMenu::UProfileMenu_C::BoxStatWidget_110' has a wrong offset!");
static_assert(offsetof(ProfileMenu::UProfileMenu_C, BoxStatWidget_389) == 0x000518, "Member 'ProfileMenu::UProfileMenu_C::BoxStatWidget_389' has a wrong offset!");
static_assert(offsetof(ProfileMenu::UProfileMenu_C, BoxStatWidget_617) == 0x000520, "Member 'ProfileMenu::UProfileMenu_C::BoxStatWidget_617' has a wrong offset!");
static_assert(offsetof(ProfileMenu::UProfileMenu_C, BoxStatWidget_707) == 0x000528, "Member 'ProfileMenu::UProfileMenu_C::BoxStatWidget_707' has a wrong offset!");
static_assert(offsetof(ProfileMenu::UProfileMenu_C, GridStatWidget) == 0x000530, "Member 'ProfileMenu::UProfileMenu_C::GridStatWidget' has a wrong offset!");
static_assert(offsetof(ProfileMenu::UProfileMenu_C, GridStatWidget_104) == 0x000538, "Member 'ProfileMenu::UProfileMenu_C::GridStatWidget_104' has a wrong offset!");
static_assert(offsetof(ProfileMenu::UProfileMenu_C, GridStatWidget_166) == 0x000540, "Member 'ProfileMenu::UProfileMenu_C::GridStatWidget_166' has a wrong offset!");
static_assert(offsetof(ProfileMenu::UProfileMenu_C, GridStatWidget_492) == 0x000548, "Member 'ProfileMenu::UProfileMenu_C::GridStatWidget_492' has a wrong offset!");
static_assert(offsetof(ProfileMenu::UProfileMenu_C, GridStatWidget_589) == 0x000550, "Member 'ProfileMenu::UProfileMenu_C::GridStatWidget_589' has a wrong offset!");
static_assert(offsetof(ProfileMenu::UProfileMenu_C, GridStatWidget_682) == 0x000558, "Member 'ProfileMenu::UProfileMenu_C::GridStatWidget_682' has a wrong offset!");
static_assert(offsetof(ProfileMenu::UProfileMenu_C, Image_172) == 0x000560, "Member 'ProfileMenu::UProfileMenu_C::Image_172' has a wrong offset!");
static_assert(offsetof(ProfileMenu::UProfileMenu_C, Image_224) == 0x000568, "Member 'ProfileMenu::UProfileMenu_C::Image_224' has a wrong offset!");

}

