#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProgressionBlastPassWidget

#include "Basic.hpp"

#include "Mariner_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ProgressionBlastPassWidget.ProgressionBlastPassWidget_C.ButtonSelectedEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ProgressionBlastPassWidget_C_ButtonSelectedEvent__DelegateSignature final
{
public:
	class UMiniRewardButton_C*                    ButtonInstance;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgressionBlastPassWidget_C_ButtonSelectedEvent__DelegateSignature) == 0x000008, "Wrong alignment on ProgressionBlastPassWidget_C_ButtonSelectedEvent__DelegateSignature");
static_assert(sizeof(ProgressionBlastPassWidget_C_ButtonSelectedEvent__DelegateSignature) == 0x000008, "Wrong size on ProgressionBlastPassWidget_C_ButtonSelectedEvent__DelegateSignature");
static_assert(offsetof(ProgressionBlastPassWidget_C_ButtonSelectedEvent__DelegateSignature, ButtonInstance) == 0x000000, "Member 'ProgressionBlastPassWidget_C_ButtonSelectedEvent__DelegateSignature::ButtonInstance' has a wrong offset!");

// Function ProgressionBlastPassWidget.ProgressionBlastPassWidget_C.ExecuteUbergraph_ProgressionBlastPassWidget
// 0x00D0 (0x00D0 - 0x0000)
struct ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerLayeredButton*                  K2Node_Event_ButtonInstance;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerLayeredButton*                  K2Node_Event_ButtonInstance_2;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMarinerUIItemButtonData               K2Node_Event_ItemData;                             // 0x0018(0x0070)(ConstParm)
	class UMiniRewardButton_C*                    K2Node_DynamicCast_AsMini_Reward_Button;           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMiniRewardButton_C*                    K2Node_DynamicCast_AsMini_Reward_Button_1;         // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerLayeredButton*                  K2Node_Event_ButtonInstance_3;                     // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFromKeyboard;                        // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bFromMouse;                           // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMiniRewardButton_C*                    K2Node_DynamicCast_AsMini_Reward_Button_2;         // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerLayeredButton*                  K2Node_Event_ButtonInstance_1;                     // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget) == 0x000008, "Wrong alignment on ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget");
static_assert(sizeof(ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget) == 0x0000D0, "Wrong size on ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget");
static_assert(offsetof(ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget, EntryPoint) == 0x000000, "Member 'ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget, K2Node_Event_ButtonInstance) == 0x000008, "Member 'ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget::K2Node_Event_ButtonInstance' has a wrong offset!");
static_assert(offsetof(ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget, K2Node_Event_ButtonInstance_2) == 0x000010, "Member 'ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget::K2Node_Event_ButtonInstance_2' has a wrong offset!");
static_assert(offsetof(ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget, K2Node_Event_ItemData) == 0x000018, "Member 'ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget::K2Node_Event_ItemData' has a wrong offset!");
static_assert(offsetof(ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget, K2Node_DynamicCast_AsMini_Reward_Button) == 0x000088, "Member 'ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget::K2Node_DynamicCast_AsMini_Reward_Button' has a wrong offset!");
static_assert(offsetof(ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget, K2Node_DynamicCast_AsMini_Reward_Button_1) == 0x000098, "Member 'ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget::K2Node_DynamicCast_AsMini_Reward_Button_1' has a wrong offset!");
static_assert(offsetof(ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget, K2Node_DynamicCast_bSuccess_1) == 0x0000A0, "Member 'ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget, K2Node_Event_ButtonInstance_3) == 0x0000A8, "Member 'ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget::K2Node_Event_ButtonInstance_3' has a wrong offset!");
static_assert(offsetof(ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget, K2Node_Event_bFromKeyboard) == 0x0000B0, "Member 'ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget::K2Node_Event_bFromKeyboard' has a wrong offset!");
static_assert(offsetof(ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget, K2Node_Event_bFromMouse) == 0x0000B1, "Member 'ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget::K2Node_Event_bFromMouse' has a wrong offset!");
static_assert(offsetof(ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget, K2Node_DynamicCast_AsMini_Reward_Button_2) == 0x0000B8, "Member 'ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget::K2Node_DynamicCast_AsMini_Reward_Button_2' has a wrong offset!");
static_assert(offsetof(ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget, K2Node_DynamicCast_bSuccess_2) == 0x0000C0, "Member 'ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget, K2Node_Event_ButtonInstance_1) == 0x0000C8, "Member 'ProgressionBlastPassWidget_C_ExecuteUbergraph_ProgressionBlastPassWidget::K2Node_Event_ButtonInstance_1' has a wrong offset!");

// Function ProgressionBlastPassWidget.ProgressionBlastPassWidget_C.OnButtonSelected
// 0x0008 (0x0008 - 0x0000)
struct ProgressionBlastPassWidget_C_OnButtonSelected final
{
public:
	class UMarinerLayeredButton*                  ButtonInstance;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgressionBlastPassWidget_C_OnButtonSelected) == 0x000008, "Wrong alignment on ProgressionBlastPassWidget_C_OnButtonSelected");
static_assert(sizeof(ProgressionBlastPassWidget_C_OnButtonSelected) == 0x000008, "Wrong size on ProgressionBlastPassWidget_C_OnButtonSelected");
static_assert(offsetof(ProgressionBlastPassWidget_C_OnButtonSelected, ButtonInstance) == 0x000000, "Member 'ProgressionBlastPassWidget_C_OnButtonSelected::ButtonInstance' has a wrong offset!");

// Function ProgressionBlastPassWidget.ProgressionBlastPassWidget_C.OnButtonUnhighlighted
// 0x0008 (0x0008 - 0x0000)
struct ProgressionBlastPassWidget_C_OnButtonUnhighlighted final
{
public:
	class UMarinerLayeredButton*                  ButtonInstance;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgressionBlastPassWidget_C_OnButtonUnhighlighted) == 0x000008, "Wrong alignment on ProgressionBlastPassWidget_C_OnButtonUnhighlighted");
static_assert(sizeof(ProgressionBlastPassWidget_C_OnButtonUnhighlighted) == 0x000008, "Wrong size on ProgressionBlastPassWidget_C_OnButtonUnhighlighted");
static_assert(offsetof(ProgressionBlastPassWidget_C_OnButtonUnhighlighted, ButtonInstance) == 0x000000, "Member 'ProgressionBlastPassWidget_C_OnButtonUnhighlighted::ButtonInstance' has a wrong offset!");

// Function ProgressionBlastPassWidget.ProgressionBlastPassWidget_C.OnButtonCreated
// 0x0078 (0x0078 - 0x0000)
struct ProgressionBlastPassWidget_C_OnButtonCreated final
{
public:
	class UMarinerLayeredButton*                  ButtonInstance;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMarinerUIItemButtonData               ItemData;                                          // 0x0008(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(ProgressionBlastPassWidget_C_OnButtonCreated) == 0x000008, "Wrong alignment on ProgressionBlastPassWidget_C_OnButtonCreated");
static_assert(sizeof(ProgressionBlastPassWidget_C_OnButtonCreated) == 0x000078, "Wrong size on ProgressionBlastPassWidget_C_OnButtonCreated");
static_assert(offsetof(ProgressionBlastPassWidget_C_OnButtonCreated, ButtonInstance) == 0x000000, "Member 'ProgressionBlastPassWidget_C_OnButtonCreated::ButtonInstance' has a wrong offset!");
static_assert(offsetof(ProgressionBlastPassWidget_C_OnButtonCreated, ItemData) == 0x000008, "Member 'ProgressionBlastPassWidget_C_OnButtonCreated::ItemData' has a wrong offset!");

// Function ProgressionBlastPassWidget.ProgressionBlastPassWidget_C.OnButtonHighlighted
// 0x0010 (0x0010 - 0x0000)
struct ProgressionBlastPassWidget_C_OnButtonHighlighted final
{
public:
	class UMarinerLayeredButton*                  ButtonInstance;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromKeyboard;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFromMouse;                                        // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProgressionBlastPassWidget_C_OnButtonHighlighted) == 0x000008, "Wrong alignment on ProgressionBlastPassWidget_C_OnButtonHighlighted");
static_assert(sizeof(ProgressionBlastPassWidget_C_OnButtonHighlighted) == 0x000010, "Wrong size on ProgressionBlastPassWidget_C_OnButtonHighlighted");
static_assert(offsetof(ProgressionBlastPassWidget_C_OnButtonHighlighted, ButtonInstance) == 0x000000, "Member 'ProgressionBlastPassWidget_C_OnButtonHighlighted::ButtonInstance' has a wrong offset!");
static_assert(offsetof(ProgressionBlastPassWidget_C_OnButtonHighlighted, bFromKeyboard) == 0x000008, "Member 'ProgressionBlastPassWidget_C_OnButtonHighlighted::bFromKeyboard' has a wrong offset!");
static_assert(offsetof(ProgressionBlastPassWidget_C_OnButtonHighlighted, bFromMouse) == 0x000009, "Member 'ProgressionBlastPassWidget_C_OnButtonHighlighted::bFromMouse' has a wrong offset!");

// Function ProgressionBlastPassWidget.ProgressionBlastPassWidget_C.HighlightButton
// 0x0370 (0x0370 - 0x0000)
struct ProgressionBlastPassWidget_C_HighlightButton final
{
public:
	class UMiniRewardButton_C*                    ButtonInstance;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMarinerUIItemButtonData               CallFunc_GetUIItemButtonData_ReturnValue;          // 0x0008(0x0070)(ConstParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0078(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00C8(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextFromStringTable_ReturnValue;          // 0x0100(0x0018)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0118(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x01A0(0x0088)()
	class UMarinerUIGlobals*                      CallFunc_GetUIGlobals_ReturnValue;                 // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetItemTypeName_ReturnValue;              // 0x0230(0x0018)()
	class UMarinerUIGlobals*                      CallFunc_GetUIGlobals_ReturnValue_1;               // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerCollectionDataAsset*            CallFunc_GetCollectionForItem_ReturnValue;         // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_2;                    // 0x0260(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_3;                    // 0x02E8(0x0088)()
};
static_assert(alignof(ProgressionBlastPassWidget_C_HighlightButton) == 0x000008, "Wrong alignment on ProgressionBlastPassWidget_C_HighlightButton");
static_assert(sizeof(ProgressionBlastPassWidget_C_HighlightButton) == 0x000370, "Wrong size on ProgressionBlastPassWidget_C_HighlightButton");
static_assert(offsetof(ProgressionBlastPassWidget_C_HighlightButton, ButtonInstance) == 0x000000, "Member 'ProgressionBlastPassWidget_C_HighlightButton::ButtonInstance' has a wrong offset!");
static_assert(offsetof(ProgressionBlastPassWidget_C_HighlightButton, CallFunc_GetUIItemButtonData_ReturnValue) == 0x000008, "Member 'ProgressionBlastPassWidget_C_HighlightButton::CallFunc_GetUIItemButtonData_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressionBlastPassWidget_C_HighlightButton, K2Node_MakeStruct_FormatArgumentData) == 0x000078, "Member 'ProgressionBlastPassWidget_C_HighlightButton::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(ProgressionBlastPassWidget_C_HighlightButton, K2Node_MakeArray_Array) == 0x0000B8, "Member 'ProgressionBlastPassWidget_C_HighlightButton::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ProgressionBlastPassWidget_C_HighlightButton, CallFunc_Conv_IntToText_ReturnValue) == 0x0000C8, "Member 'ProgressionBlastPassWidget_C_HighlightButton::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressionBlastPassWidget_C_HighlightButton, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'ProgressionBlastPassWidget_C_HighlightButton::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressionBlastPassWidget_C_HighlightButton, K2Node_SwitchEnum_CmpSuccess) == 0x0000F8, "Member 'ProgressionBlastPassWidget_C_HighlightButton::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ProgressionBlastPassWidget_C_HighlightButton, CallFunc_TextFromStringTable_ReturnValue) == 0x000100, "Member 'ProgressionBlastPassWidget_C_HighlightButton::CallFunc_TextFromStringTable_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressionBlastPassWidget_C_HighlightButton, K2Node_MakeStruct_SlateBrush) == 0x000118, "Member 'ProgressionBlastPassWidget_C_HighlightButton::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(ProgressionBlastPassWidget_C_HighlightButton, K2Node_MakeStruct_SlateBrush_1) == 0x0001A0, "Member 'ProgressionBlastPassWidget_C_HighlightButton::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");
static_assert(offsetof(ProgressionBlastPassWidget_C_HighlightButton, CallFunc_GetUIGlobals_ReturnValue) == 0x000228, "Member 'ProgressionBlastPassWidget_C_HighlightButton::CallFunc_GetUIGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressionBlastPassWidget_C_HighlightButton, CallFunc_GetItemTypeName_ReturnValue) == 0x000230, "Member 'ProgressionBlastPassWidget_C_HighlightButton::CallFunc_GetItemTypeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressionBlastPassWidget_C_HighlightButton, CallFunc_GetUIGlobals_ReturnValue_1) == 0x000248, "Member 'ProgressionBlastPassWidget_C_HighlightButton::CallFunc_GetUIGlobals_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProgressionBlastPassWidget_C_HighlightButton, CallFunc_GetCollectionForItem_ReturnValue) == 0x000250, "Member 'ProgressionBlastPassWidget_C_HighlightButton::CallFunc_GetCollectionForItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressionBlastPassWidget_C_HighlightButton, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000258, "Member 'ProgressionBlastPassWidget_C_HighlightButton::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgressionBlastPassWidget_C_HighlightButton, K2Node_MakeStruct_SlateBrush_2) == 0x000260, "Member 'ProgressionBlastPassWidget_C_HighlightButton::K2Node_MakeStruct_SlateBrush_2' has a wrong offset!");
static_assert(offsetof(ProgressionBlastPassWidget_C_HighlightButton, K2Node_MakeStruct_SlateBrush_3) == 0x0002E8, "Member 'ProgressionBlastPassWidget_C_HighlightButton::K2Node_MakeStruct_SlateBrush_3' has a wrong offset!");

// Function ProgressionBlastPassWidget.ProgressionBlastPassWidget_C.SelectButton
// 0x0008 (0x0008 - 0x0000)
struct ProgressionBlastPassWidget_C_SelectButton final
{
public:
	class UMiniRewardButton_C*                    ButtonInstance;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgressionBlastPassWidget_C_SelectButton) == 0x000008, "Wrong alignment on ProgressionBlastPassWidget_C_SelectButton");
static_assert(sizeof(ProgressionBlastPassWidget_C_SelectButton) == 0x000008, "Wrong size on ProgressionBlastPassWidget_C_SelectButton");
static_assert(offsetof(ProgressionBlastPassWidget_C_SelectButton, ButtonInstance) == 0x000000, "Member 'ProgressionBlastPassWidget_C_SelectButton::ButtonInstance' has a wrong offset!");

}

