#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProgressionCharacterWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ProgressionCharacterWidget.ProgressionCharacterWidget_C
// 0x0058 (0x0500 - 0x04A8)
class UProgressionCharacterWidget_C final : public UMarinerCharacterProgressionWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             CurrencyDesc;                                      // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CurrencyIcon;                                      // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           CurrencyRoot;                                      // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CurrencyValue;                                     // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        HighlightSwitcher;                                 // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_91;                                          // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_195;                                         // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ItemName;                                          // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ItemRoot;                                          // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ItemType;                                          // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ProgressionCharacterWidget(int32 EntryPoint);
	void OnButtonHighlighted(class UMarinerLayeredButton* ButtonInstance, bool bFromKeyboard, bool bFromMouse);
	void Construct();
	void OnButtonCreated(class UMarinerLayeredButton* ButtonInstance, const struct FMarinerUIItemButtonData& ItemData);
	void OnButtonUnhighlighted(class UMarinerLayeredButton* ButtonInstance);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ProgressionCharacterWidget_C">();
	}
	static class UProgressionCharacterWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProgressionCharacterWidget_C>();
	}
};
static_assert(alignof(UProgressionCharacterWidget_C) == 0x000008, "Wrong alignment on UProgressionCharacterWidget_C");
static_assert(sizeof(UProgressionCharacterWidget_C) == 0x000500, "Wrong size on UProgressionCharacterWidget_C");
static_assert(offsetof(UProgressionCharacterWidget_C, UberGraphFrame) == 0x0004A8, "Member 'UProgressionCharacterWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UProgressionCharacterWidget_C, CurrencyDesc) == 0x0004B0, "Member 'UProgressionCharacterWidget_C::CurrencyDesc' has a wrong offset!");
static_assert(offsetof(UProgressionCharacterWidget_C, CurrencyIcon) == 0x0004B8, "Member 'UProgressionCharacterWidget_C::CurrencyIcon' has a wrong offset!");
static_assert(offsetof(UProgressionCharacterWidget_C, CurrencyRoot) == 0x0004C0, "Member 'UProgressionCharacterWidget_C::CurrencyRoot' has a wrong offset!");
static_assert(offsetof(UProgressionCharacterWidget_C, CurrencyValue) == 0x0004C8, "Member 'UProgressionCharacterWidget_C::CurrencyValue' has a wrong offset!");
static_assert(offsetof(UProgressionCharacterWidget_C, HighlightSwitcher) == 0x0004D0, "Member 'UProgressionCharacterWidget_C::HighlightSwitcher' has a wrong offset!");
static_assert(offsetof(UProgressionCharacterWidget_C, Image_91) == 0x0004D8, "Member 'UProgressionCharacterWidget_C::Image_91' has a wrong offset!");
static_assert(offsetof(UProgressionCharacterWidget_C, Image_195) == 0x0004E0, "Member 'UProgressionCharacterWidget_C::Image_195' has a wrong offset!");
static_assert(offsetof(UProgressionCharacterWidget_C, ItemName) == 0x0004E8, "Member 'UProgressionCharacterWidget_C::ItemName' has a wrong offset!");
static_assert(offsetof(UProgressionCharacterWidget_C, ItemRoot) == 0x0004F0, "Member 'UProgressionCharacterWidget_C::ItemRoot' has a wrong offset!");
static_assert(offsetof(UProgressionCharacterWidget_C, ItemType) == 0x0004F8, "Member 'UProgressionCharacterWidget_C::ItemType' has a wrong offset!");

}

