#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProgressionBlastPassWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ProgressionBlastPassWidget.ProgressionBlastPassWidget_C
// 0x0070 (0x0590 - 0x0520)
class UProgressionBlastPassWidget_C final : public UMarinerBlastPassProgressionWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0520(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             CurrencyDesc;                                      // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CurrencyIcon;                                      // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           CurrencyRoot;                                      // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CurrencyValue;                                     // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        HighlightSwitcher;                                 // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ItemName;                                          // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ItemRoot;                                          // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ItemType;                                          // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPrompt_C*                       PageLeftPrompt;                                    // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPrompt_C*                       PageRightPrompt;                                   // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBlastPassRarityWidget_C*               RarityWidget;                                      // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastInlineDelegateProperty_             ButtonSelectedEvent;                               // 0x0580(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ButtonSelectedEvent__DelegateSignature(class UMiniRewardButton_C* ButtonInstance);
	void ExecuteUbergraph_ProgressionBlastPassWidget(int32 EntryPoint);
	void OnButtonSelected(class UMarinerLayeredButton* ButtonInstance);
	void Construct();
	void OnButtonUnhighlighted(class UMarinerLayeredButton* ButtonInstance);
	void OnButtonCreated(class UMarinerLayeredButton* ButtonInstance, const struct FMarinerUIItemButtonData& ItemData);
	void OnButtonHighlighted(class UMarinerLayeredButton* ButtonInstance, bool bFromKeyboard, bool bFromMouse);
	void HighlightButton(class UMiniRewardButton_C* ButtonInstance);
	void SelectButton(class UMiniRewardButton_C* ButtonInstance);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ProgressionBlastPassWidget_C">();
	}
	static class UProgressionBlastPassWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProgressionBlastPassWidget_C>();
	}
};
static_assert(alignof(UProgressionBlastPassWidget_C) == 0x000008, "Wrong alignment on UProgressionBlastPassWidget_C");
static_assert(sizeof(UProgressionBlastPassWidget_C) == 0x000590, "Wrong size on UProgressionBlastPassWidget_C");
static_assert(offsetof(UProgressionBlastPassWidget_C, UberGraphFrame) == 0x000520, "Member 'UProgressionBlastPassWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UProgressionBlastPassWidget_C, CurrencyDesc) == 0x000528, "Member 'UProgressionBlastPassWidget_C::CurrencyDesc' has a wrong offset!");
static_assert(offsetof(UProgressionBlastPassWidget_C, CurrencyIcon) == 0x000530, "Member 'UProgressionBlastPassWidget_C::CurrencyIcon' has a wrong offset!");
static_assert(offsetof(UProgressionBlastPassWidget_C, CurrencyRoot) == 0x000538, "Member 'UProgressionBlastPassWidget_C::CurrencyRoot' has a wrong offset!");
static_assert(offsetof(UProgressionBlastPassWidget_C, CurrencyValue) == 0x000540, "Member 'UProgressionBlastPassWidget_C::CurrencyValue' has a wrong offset!");
static_assert(offsetof(UProgressionBlastPassWidget_C, HighlightSwitcher) == 0x000548, "Member 'UProgressionBlastPassWidget_C::HighlightSwitcher' has a wrong offset!");
static_assert(offsetof(UProgressionBlastPassWidget_C, ItemName) == 0x000550, "Member 'UProgressionBlastPassWidget_C::ItemName' has a wrong offset!");
static_assert(offsetof(UProgressionBlastPassWidget_C, ItemRoot) == 0x000558, "Member 'UProgressionBlastPassWidget_C::ItemRoot' has a wrong offset!");
static_assert(offsetof(UProgressionBlastPassWidget_C, ItemType) == 0x000560, "Member 'UProgressionBlastPassWidget_C::ItemType' has a wrong offset!");
static_assert(offsetof(UProgressionBlastPassWidget_C, PageLeftPrompt) == 0x000568, "Member 'UProgressionBlastPassWidget_C::PageLeftPrompt' has a wrong offset!");
static_assert(offsetof(UProgressionBlastPassWidget_C, PageRightPrompt) == 0x000570, "Member 'UProgressionBlastPassWidget_C::PageRightPrompt' has a wrong offset!");
static_assert(offsetof(UProgressionBlastPassWidget_C, RarityWidget) == 0x000578, "Member 'UProgressionBlastPassWidget_C::RarityWidget' has a wrong offset!");
static_assert(offsetof(UProgressionBlastPassWidget_C, ButtonSelectedEvent) == 0x000580, "Member 'UProgressionBlastPassWidget_C::ButtonSelectedEvent' has a wrong offset!");

}

