#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PurchaseMessageBox

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PurchaseMessageBox.PurchaseMessageBox_C
// 0x0040 (0x05F0 - 0x05B0)
class UPurchaseMessageBox_C final : public UMarinerPurchaseMessageBox
{
public:
	class UTextBlock*                             Bound_Header;                                      // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Center;                                            // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_228;                                         // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_313;                                         // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_349;                                         // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Material;                                          // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OpacityBacker;                                     // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopBar;                                            // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PurchaseMessageBox_C">();
	}
	static class UPurchaseMessageBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPurchaseMessageBox_C>();
	}
};
static_assert(alignof(UPurchaseMessageBox_C) == 0x000008, "Wrong alignment on UPurchaseMessageBox_C");
static_assert(sizeof(UPurchaseMessageBox_C) == 0x0005F0, "Wrong size on UPurchaseMessageBox_C");
static_assert(offsetof(UPurchaseMessageBox_C, Bound_Header) == 0x0005B0, "Member 'UPurchaseMessageBox_C::Bound_Header' has a wrong offset!");
static_assert(offsetof(UPurchaseMessageBox_C, Center) == 0x0005B8, "Member 'UPurchaseMessageBox_C::Center' has a wrong offset!");
static_assert(offsetof(UPurchaseMessageBox_C, Image_228) == 0x0005C0, "Member 'UPurchaseMessageBox_C::Image_228' has a wrong offset!");
static_assert(offsetof(UPurchaseMessageBox_C, Image_313) == 0x0005C8, "Member 'UPurchaseMessageBox_C::Image_313' has a wrong offset!");
static_assert(offsetof(UPurchaseMessageBox_C, Image_349) == 0x0005D0, "Member 'UPurchaseMessageBox_C::Image_349' has a wrong offset!");
static_assert(offsetof(UPurchaseMessageBox_C, Material) == 0x0005D8, "Member 'UPurchaseMessageBox_C::Material' has a wrong offset!");
static_assert(offsetof(UPurchaseMessageBox_C, OpacityBacker) == 0x0005E0, "Member 'UPurchaseMessageBox_C::OpacityBacker' has a wrong offset!");
static_assert(offsetof(UPurchaseMessageBox_C, TopBar) == 0x0005E8, "Member 'UPurchaseMessageBox_C::TopBar' has a wrong offset!");

}

