#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PurchasePreviewWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PurchasePreviewWidget.PurchasePreviewWidget_C
// 0x00D8 (0x04F0 - 0x0418)
class UPurchasePreviewWidget_C final : public UMarinerAnimatedWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BlastPassIcon;                                     // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               BlastPassPanel;                                    // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BlastPassUnlockTier;                               // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               CollectionPurchasePanel;                           // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPrompt_C*                       CollectionPurchasePrompt;                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DirectPurchasePanel;                               // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPrompt_C*                       DirectPurchasePrompt;                              // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DirectUnlockHeaderText_1;                          // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               GenericPurchasePanel;                              // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPrompt_C*                       GenericPurchasePrompt;                             // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           LimitedTimePanel;                                  // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             OfferRemainingTime;                                // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGenericPurchaseButton_C*               PurchaseCollectionButton;                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGenericPurchaseButton_C*               PurchaseGenericButton;                             // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOfferPurchaseButton_C*                 PurchaseHardButton;                                // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOfferPurchaseButton_C*                 PurchaseSoftButton;                                // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        PurchaseTypeSwitcher;                              // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RarityBarColor;                                    // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaritySymbol;                                      // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RarityText;                                        // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          UseDirectPurchase;                                 // 0x04C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C9[0x7];                                      // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastInlineDelegateProperty_             OnPurchaseGenericSelected;                         // 0x04D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UMarinerPlayableCharacter*              Character;                                         // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemLoadResponse*                      ItemLoadResponse;                                  // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnPurchaseGenericSelected__DelegateSignature();
	void ExecuteUbergraph_PurchasePreviewWidget(int32 EntryPoint);
	void BndEvt__PurchaseCollectionButton_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature(class UMarinerLayeredButton* Instance);
	void Destruct();
	void BndEvt__PurchaseGeneric_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature(class UMarinerLayeredButton* Instance);
	void SetOfferAndTier(class UItemLoadResponse* ItemLoadResponse_0, bool UseDirectPurchase_0, class UMarinerPlayableCharacter* Character_0);
	bool Populate();
	void GetOfferItemFullName(const struct FMangoPurchaseOffer& MangoPurchaseOffer, class FText* Result);
	void UpdateLimitedTimeWidgets();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PurchasePreviewWidget_C">();
	}
	static class UPurchasePreviewWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPurchasePreviewWidget_C>();
	}
};
static_assert(alignof(UPurchasePreviewWidget_C) == 0x000008, "Wrong alignment on UPurchasePreviewWidget_C");
static_assert(sizeof(UPurchasePreviewWidget_C) == 0x0004F0, "Wrong size on UPurchasePreviewWidget_C");
static_assert(offsetof(UPurchasePreviewWidget_C, UberGraphFrame) == 0x000418, "Member 'UPurchasePreviewWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPurchasePreviewWidget_C, BlastPassIcon) == 0x000420, "Member 'UPurchasePreviewWidget_C::BlastPassIcon' has a wrong offset!");
static_assert(offsetof(UPurchasePreviewWidget_C, BlastPassPanel) == 0x000428, "Member 'UPurchasePreviewWidget_C::BlastPassPanel' has a wrong offset!");
static_assert(offsetof(UPurchasePreviewWidget_C, BlastPassUnlockTier) == 0x000430, "Member 'UPurchasePreviewWidget_C::BlastPassUnlockTier' has a wrong offset!");
static_assert(offsetof(UPurchasePreviewWidget_C, CollectionPurchasePanel) == 0x000438, "Member 'UPurchasePreviewWidget_C::CollectionPurchasePanel' has a wrong offset!");
static_assert(offsetof(UPurchasePreviewWidget_C, CollectionPurchasePrompt) == 0x000440, "Member 'UPurchasePreviewWidget_C::CollectionPurchasePrompt' has a wrong offset!");
static_assert(offsetof(UPurchasePreviewWidget_C, DirectPurchasePanel) == 0x000448, "Member 'UPurchasePreviewWidget_C::DirectPurchasePanel' has a wrong offset!");
static_assert(offsetof(UPurchasePreviewWidget_C, DirectPurchasePrompt) == 0x000450, "Member 'UPurchasePreviewWidget_C::DirectPurchasePrompt' has a wrong offset!");
static_assert(offsetof(UPurchasePreviewWidget_C, DirectUnlockHeaderText_1) == 0x000458, "Member 'UPurchasePreviewWidget_C::DirectUnlockHeaderText_1' has a wrong offset!");
static_assert(offsetof(UPurchasePreviewWidget_C, GenericPurchasePanel) == 0x000460, "Member 'UPurchasePreviewWidget_C::GenericPurchasePanel' has a wrong offset!");
static_assert(offsetof(UPurchasePreviewWidget_C, GenericPurchasePrompt) == 0x000468, "Member 'UPurchasePreviewWidget_C::GenericPurchasePrompt' has a wrong offset!");
static_assert(offsetof(UPurchasePreviewWidget_C, Image_2) == 0x000470, "Member 'UPurchasePreviewWidget_C::Image_2' has a wrong offset!");
static_assert(offsetof(UPurchasePreviewWidget_C, LimitedTimePanel) == 0x000478, "Member 'UPurchasePreviewWidget_C::LimitedTimePanel' has a wrong offset!");
static_assert(offsetof(UPurchasePreviewWidget_C, OfferRemainingTime) == 0x000480, "Member 'UPurchasePreviewWidget_C::OfferRemainingTime' has a wrong offset!");
static_assert(offsetof(UPurchasePreviewWidget_C, PurchaseCollectionButton) == 0x000488, "Member 'UPurchasePreviewWidget_C::PurchaseCollectionButton' has a wrong offset!");
static_assert(offsetof(UPurchasePreviewWidget_C, PurchaseGenericButton) == 0x000490, "Member 'UPurchasePreviewWidget_C::PurchaseGenericButton' has a wrong offset!");
static_assert(offsetof(UPurchasePreviewWidget_C, PurchaseHardButton) == 0x000498, "Member 'UPurchasePreviewWidget_C::PurchaseHardButton' has a wrong offset!");
static_assert(offsetof(UPurchasePreviewWidget_C, PurchaseSoftButton) == 0x0004A0, "Member 'UPurchasePreviewWidget_C::PurchaseSoftButton' has a wrong offset!");
static_assert(offsetof(UPurchasePreviewWidget_C, PurchaseTypeSwitcher) == 0x0004A8, "Member 'UPurchasePreviewWidget_C::PurchaseTypeSwitcher' has a wrong offset!");
static_assert(offsetof(UPurchasePreviewWidget_C, RarityBarColor) == 0x0004B0, "Member 'UPurchasePreviewWidget_C::RarityBarColor' has a wrong offset!");
static_assert(offsetof(UPurchasePreviewWidget_C, RaritySymbol) == 0x0004B8, "Member 'UPurchasePreviewWidget_C::RaritySymbol' has a wrong offset!");
static_assert(offsetof(UPurchasePreviewWidget_C, RarityText) == 0x0004C0, "Member 'UPurchasePreviewWidget_C::RarityText' has a wrong offset!");
static_assert(offsetof(UPurchasePreviewWidget_C, UseDirectPurchase) == 0x0004C8, "Member 'UPurchasePreviewWidget_C::UseDirectPurchase' has a wrong offset!");
static_assert(offsetof(UPurchasePreviewWidget_C, OnPurchaseGenericSelected) == 0x0004D0, "Member 'UPurchasePreviewWidget_C::OnPurchaseGenericSelected' has a wrong offset!");
static_assert(offsetof(UPurchasePreviewWidget_C, Character) == 0x0004E0, "Member 'UPurchasePreviewWidget_C::Character' has a wrong offset!");
static_assert(offsetof(UPurchasePreviewWidget_C, ItemLoadResponse) == 0x0004E8, "Member 'UPurchasePreviewWidget_C::ItemLoadResponse' has a wrong offset!");

}

