#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuitPenaltyWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function QuitPenaltyWidget.QuitPenaltyWidget_C.ExecuteUbergraph_QuitPenaltyWidget
// 0x0090 (0x0090 - 0x0000)
struct QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoMatchmakingManager*               CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	struct FDateTime                              CallFunc_GetAbandonmentPenaltyExpirationTime_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAbandonmentPenaltyActive_ReturnValue;   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_UtcNow_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue;    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FormatTimeRemaining_ReturnValue;          // 0x0050(0x0018)()
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoMatchmakingManager*               CallFunc_Get_ReturnValue_1;                        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	class UMangoMatchmakingManager*               CallFunc_Get_ReturnValue_2;                        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget) == 0x000008, "Wrong alignment on QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget");
static_assert(sizeof(QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget) == 0x000090, "Wrong size on QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget");
static_assert(offsetof(QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget, EntryPoint) == 0x000000, "Member 'QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget, CallFunc_Get_ReturnValue) == 0x000008, "Member 'QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget, CallFunc_GetAbandonmentPenaltyExpirationTime_ReturnValue) == 0x000020, "Member 'QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget::CallFunc_GetAbandonmentPenaltyExpirationTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget, CallFunc_IsAbandonmentPenaltyActive_ReturnValue) == 0x000030, "Member 'QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget::CallFunc_IsAbandonmentPenaltyActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget, CallFunc_UtcNow_ReturnValue) == 0x000038, "Member 'QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget::CallFunc_UtcNow_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget, CallFunc_Subtract_DateTimeDateTime_ReturnValue) == 0x000040, "Member 'QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget::CallFunc_Subtract_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget, CallFunc_GetTotalSeconds_ReturnValue) == 0x000048, "Member 'QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget::CallFunc_GetTotalSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget, CallFunc_FormatTimeRemaining_ReturnValue) == 0x000050, "Member 'QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget::CallFunc_FormatTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000068, "Member 'QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget, CallFunc_Get_ReturnValue_1) == 0x000070, "Member 'QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000078, "Member 'QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget, CallFunc_Get_ReturnValue_2) == 0x000088, "Member 'QuitPenaltyWidget_C_ExecuteUbergraph_QuitPenaltyWidget::CallFunc_Get_ReturnValue_2' has a wrong offset!");

}

