#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RadialFillProgressBar

#include "Basic.hpp"


namespace SDK::Params
{

// Function RadialFillProgressBar.RadialFillProgressBar_C.ExecuteUbergraph_RadialFillProgressBar
// 0x0010 (0x0010 - 0x0000)
struct RadialFillProgressBar_C_ExecuteUbergraph_RadialFillProgressBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2059[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RadialFillProgressBar_C_ExecuteUbergraph_RadialFillProgressBar) == 0x000008, "Wrong alignment on RadialFillProgressBar_C_ExecuteUbergraph_RadialFillProgressBar");
static_assert(sizeof(RadialFillProgressBar_C_ExecuteUbergraph_RadialFillProgressBar) == 0x000010, "Wrong size on RadialFillProgressBar_C_ExecuteUbergraph_RadialFillProgressBar");
static_assert(offsetof(RadialFillProgressBar_C_ExecuteUbergraph_RadialFillProgressBar, EntryPoint) == 0x000000, "Member 'RadialFillProgressBar_C_ExecuteUbergraph_RadialFillProgressBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(RadialFillProgressBar_C_ExecuteUbergraph_RadialFillProgressBar, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'RadialFillProgressBar_C_ExecuteUbergraph_RadialFillProgressBar::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadialFillProgressBar_C_ExecuteUbergraph_RadialFillProgressBar, K2Node_Event_IsDesignTime) == 0x000005, "Member 'RadialFillProgressBar_C_ExecuteUbergraph_RadialFillProgressBar::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(RadialFillProgressBar_C_ExecuteUbergraph_RadialFillProgressBar, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'RadialFillProgressBar_C_ExecuteUbergraph_RadialFillProgressBar::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function RadialFillProgressBar.RadialFillProgressBar_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct RadialFillProgressBar_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RadialFillProgressBar_C_PreConstruct) == 0x000001, "Wrong alignment on RadialFillProgressBar_C_PreConstruct");
static_assert(sizeof(RadialFillProgressBar_C_PreConstruct) == 0x000001, "Wrong size on RadialFillProgressBar_C_PreConstruct");
static_assert(offsetof(RadialFillProgressBar_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'RadialFillProgressBar_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function RadialFillProgressBar.RadialFillProgressBar_C.Set Progress
// 0x0010 (0x0010 - 0x0000)
struct RadialFillProgressBar_C_Set_Progress final
{
public:
	float                                         Param_Progress;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_205A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RadialFillProgressBar_C_Set_Progress) == 0x000008, "Wrong alignment on RadialFillProgressBar_C_Set_Progress");
static_assert(sizeof(RadialFillProgressBar_C_Set_Progress) == 0x000010, "Wrong size on RadialFillProgressBar_C_Set_Progress");
static_assert(offsetof(RadialFillProgressBar_C_Set_Progress, Param_Progress) == 0x000000, "Member 'RadialFillProgressBar_C_Set_Progress::Param_Progress' has a wrong offset!");
static_assert(offsetof(RadialFillProgressBar_C_Set_Progress, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'RadialFillProgressBar_C_Set_Progress::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function RadialFillProgressBar.RadialFillProgressBar_C.Get Progress
// 0x0004 (0x0004 - 0x0000)
struct RadialFillProgressBar_C_Get_Progress final
{
public:
	float                                         Param_Progress;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RadialFillProgressBar_C_Get_Progress) == 0x000004, "Wrong alignment on RadialFillProgressBar_C_Get_Progress");
static_assert(sizeof(RadialFillProgressBar_C_Get_Progress) == 0x000004, "Wrong size on RadialFillProgressBar_C_Get_Progress");
static_assert(offsetof(RadialFillProgressBar_C_Get_Progress, Param_Progress) == 0x000000, "Member 'RadialFillProgressBar_C_Get_Progress::Param_Progress' has a wrong offset!");

}

