#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RadialFillProgressBar

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RadialFillProgressBar.RadialFillProgressBar_C
// 0x00B0 (0x02E0 - 0x0230)
class URadialFillProgressBar_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ProgressBarImage;                                  // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateBrush                            Brush;                                             // 0x0240(0x0088)(Edit, BlueprintVisible, ExposeOnSpawn)
	float                                         Progress;                                          // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Image_Override;                                    // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Material_Base;                                     // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_RadialFillProgressBar(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Set_Progress(float Progress_0);
	void Get_Progress(float* Progress_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RadialFillProgressBar_C">();
	}
	static class URadialFillProgressBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URadialFillProgressBar_C>();
	}
};
static_assert(alignof(URadialFillProgressBar_C) == 0x000008, "Wrong alignment on URadialFillProgressBar_C");
static_assert(sizeof(URadialFillProgressBar_C) == 0x0002E0, "Wrong size on URadialFillProgressBar_C");
static_assert(offsetof(URadialFillProgressBar_C, UberGraphFrame) == 0x000230, "Member 'URadialFillProgressBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URadialFillProgressBar_C, ProgressBarImage) == 0x000238, "Member 'URadialFillProgressBar_C::ProgressBarImage' has a wrong offset!");
static_assert(offsetof(URadialFillProgressBar_C, Brush) == 0x000240, "Member 'URadialFillProgressBar_C::Brush' has a wrong offset!");
static_assert(offsetof(URadialFillProgressBar_C, Progress) == 0x0002C8, "Member 'URadialFillProgressBar_C::Progress' has a wrong offset!");
static_assert(offsetof(URadialFillProgressBar_C, Image_Override) == 0x0002D0, "Member 'URadialFillProgressBar_C::Image_Override' has a wrong offset!");
static_assert(offsetof(URadialFillProgressBar_C, Material_Base) == 0x0002D8, "Member 'URadialFillProgressBar_C::Material_Base' has a wrong offset!");

}

