#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RegionDropdownOption

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RegionDropdownOption.RegionDropdownOption_C
// 0x0028 (0x2FA0 - 0x2F78)
class URegionDropdownOption_C final : public UMarinerLayeredButton
{
public:
	class UWidgetAnimation*                       HoverAnim;                                         // 0x2F78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x2F80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerButton*                         HitArea;                                           // 0x2F88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             OptionText;                                        // 0x2F90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PingText;                                          // 0x2F98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FMarinerLayeredButtonAssets GetAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RegionDropdownOption_C">();
	}
	static class URegionDropdownOption_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URegionDropdownOption_C>();
	}
};
static_assert(alignof(URegionDropdownOption_C) == 0x000008, "Wrong alignment on URegionDropdownOption_C");
static_assert(sizeof(URegionDropdownOption_C) == 0x002FA0, "Wrong size on URegionDropdownOption_C");
static_assert(offsetof(URegionDropdownOption_C, HoverAnim) == 0x002F78, "Member 'URegionDropdownOption_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(URegionDropdownOption_C, BG) == 0x002F80, "Member 'URegionDropdownOption_C::BG' has a wrong offset!");
static_assert(offsetof(URegionDropdownOption_C, HitArea) == 0x002F88, "Member 'URegionDropdownOption_C::HitArea' has a wrong offset!");
static_assert(offsetof(URegionDropdownOption_C, OptionText) == 0x002F90, "Member 'URegionDropdownOption_C::OptionText' has a wrong offset!");
static_assert(offsetof(URegionDropdownOption_C, PingText) == 0x002F98, "Member 'URegionDropdownOption_C::PingText' has a wrong offset!");

}

