#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReturnTrailCutomizationHandler

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass ReturnTrailCutomizationHandler.ReturnTrailCutomizationHandler_C
// 0x0050 (0x0268 - 0x0218)
class AReturnTrailCutomizationHandler_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0218(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   WindChildActor;                                    // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CharacterLiteLocation;                             // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ReturnTrailParticleComponent;                      // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          ReturnToArenaAnim;                                 // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMarinerCharacterSpawner*               CharacterSpawner;                                  // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerPlayableCharacter*              CurrentPlayableCharacter;                          // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWindDirectionalSource*                 WindActor;                                         // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ReturnTrailCutomizationHandler(int32 EntryPoint);
	void OnSkinApplied(class UMarinerSkinCollectionDataAsset* SkinCollection);
	void MenuExited();
	void ApplyProfileSkinToCharacter();
	void MenuEntered(class UMarinerPlayableCharacter* CurrentPlayableCharacter_0);
	void ReceiveBeginPlay();
	void BndEvt__MegaBlastEmitterComponent_K2Node_ComponentBoundEvent_0_ParticleSpawnSignature__DelegateSignature(class FName EventName, float EmitterTime, const struct FVector& Location, const struct FVector& Velocity);
	void LoadFinished_08E36DDD420F8510B865A6ADA5E99471(const TArray<class UAssetLoadResponse*>& LoadedAssetResponse);
	void LoadFailed_08E36DDD420F8510B865A6ADA5E99471();
	void OnLoaded_7773F34D4513F01AA76E1FBF1E2DCD42(class UObject* Loaded);
	void SetEmitter(class UParticleSystem* NewEmitter);
	void ClearEmitter();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ReturnTrailCutomizationHandler_C">();
	}
	static class AReturnTrailCutomizationHandler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AReturnTrailCutomizationHandler_C>();
	}
};
static_assert(alignof(AReturnTrailCutomizationHandler_C) == 0x000008, "Wrong alignment on AReturnTrailCutomizationHandler_C");
static_assert(sizeof(AReturnTrailCutomizationHandler_C) == 0x000268, "Wrong size on AReturnTrailCutomizationHandler_C");
static_assert(offsetof(AReturnTrailCutomizationHandler_C, UberGraphFrame) == 0x000218, "Member 'AReturnTrailCutomizationHandler_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AReturnTrailCutomizationHandler_C, WindChildActor) == 0x000220, "Member 'AReturnTrailCutomizationHandler_C::WindChildActor' has a wrong offset!");
static_assert(offsetof(AReturnTrailCutomizationHandler_C, CharacterLiteLocation) == 0x000228, "Member 'AReturnTrailCutomizationHandler_C::CharacterLiteLocation' has a wrong offset!");
static_assert(offsetof(AReturnTrailCutomizationHandler_C, Ak) == 0x000230, "Member 'AReturnTrailCutomizationHandler_C::Ak' has a wrong offset!");
static_assert(offsetof(AReturnTrailCutomizationHandler_C, ReturnTrailParticleComponent) == 0x000238, "Member 'AReturnTrailCutomizationHandler_C::ReturnTrailParticleComponent' has a wrong offset!");
static_assert(offsetof(AReturnTrailCutomizationHandler_C, DefaultSceneRoot) == 0x000240, "Member 'AReturnTrailCutomizationHandler_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AReturnTrailCutomizationHandler_C, ReturnToArenaAnim) == 0x000248, "Member 'AReturnTrailCutomizationHandler_C::ReturnToArenaAnim' has a wrong offset!");
static_assert(offsetof(AReturnTrailCutomizationHandler_C, CharacterSpawner) == 0x000250, "Member 'AReturnTrailCutomizationHandler_C::CharacterSpawner' has a wrong offset!");
static_assert(offsetof(AReturnTrailCutomizationHandler_C, CurrentPlayableCharacter) == 0x000258, "Member 'AReturnTrailCutomizationHandler_C::CurrentPlayableCharacter' has a wrong offset!");
static_assert(offsetof(AReturnTrailCutomizationHandler_C, WindActor) == 0x000260, "Member 'AReturnTrailCutomizationHandler_C::WindActor' has a wrong offset!");

}

