#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RewardPreviewWidget

#include "Basic.hpp"

#include "MangoClient_structs.hpp"
#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RewardPreviewWidget.RewardPreviewWidget_C
// 0x00E8 (0x3140 - 0x3058)
class URewardPreviewWidget_C final : public UMarinerRewardPreview
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x3058(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DuplicateItemAnim;                                 // 0x3060(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoveredAnim;                                       // 0x3068(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x3070(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background_1;                                      // 0x3078(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x3080(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CollectionIcon;                                    // 0x3088(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CurrencyIcon;                                      // 0x3090(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DuplicateFrame1;                                   // 0x3098(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DuplicateFrame2;                                   // 0x30A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           DuplicatePanel;                                    // 0x30A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_116;                                         // 0x30B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageBacker;                                       // 0x30B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ItemAuxDescription;                                // 0x30C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ItemDescription;                                   // 0x30C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemFrame;                                         // 0x30D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemIcon;                                          // 0x30D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemImage;                                         // 0x30E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ItemName;                                          // 0x30E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemRarityPanel;                                   // 0x30F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULoadingSpinner_C*                      LoadingSpinner;                                    // 0x30F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NameIcon;                                          // 0x3100(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OfferTypeGroup;                                    // 0x3108(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             OfferTypeText;                                     // 0x3110(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PartsValue;                                        // 0x3118(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RarityImage;                                       // 0x3120(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RarityText;                                        // 0x3128(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               RootSizeBox;                                       // 0x3130(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           TeaserPanel;                                       // 0x3138(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_RewardPreviewWidget(int32 EntryPoint);
	void PopulateRewardPreview(const struct FMangoReward& Reward);
	void PopulateQuestReward(const struct FMangoQuestReward& Reward);
	void PopulateXP(int32 Xp);
	void PopulateRocketbucks(int32 RocketBucks);
	void PopulateRocketparts(int32 RocketParts);
	void PopulateItem(const struct FMangoItem& Item, int32 DupRocketpartsValue);
	void PopulateNativeOffer(const struct FMangoNativeOffer& Nativeoffer);
	void PopulateDuplicateAssets(int32 Param_PartsValue);
	void PopulateItemType(const struct FMangoItem& Item);
	void PopulateProgressionReward(const struct FMangoRewards& Reward);
	void PopulateBlastPassReward(int32 BlastBarProgress);
	void PopulateBlastPass(const class FString& OfferId, const struct FMangoOrderBlastpass& BlastPassOrder);
	void PopulateXPBonus(EMangoBlastPassXPBonusType Type, int32 Percent);
	void Populate_Mango_Reward(const struct FMangoReward& Reward);
	void GetRocketbucksIcon(int32 RocketBucks, struct FSlateBrush* Icon);
	void CalculateBlastPassPips();

	struct FMarinerLayeredButtonAssets GetAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RewardPreviewWidget_C">();
	}
	static class URewardPreviewWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URewardPreviewWidget_C>();
	}
};
static_assert(alignof(URewardPreviewWidget_C) == 0x000008, "Wrong alignment on URewardPreviewWidget_C");
static_assert(sizeof(URewardPreviewWidget_C) == 0x003140, "Wrong size on URewardPreviewWidget_C");
static_assert(offsetof(URewardPreviewWidget_C, UberGraphFrame) == 0x003058, "Member 'URewardPreviewWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URewardPreviewWidget_C, DuplicateItemAnim) == 0x003060, "Member 'URewardPreviewWidget_C::DuplicateItemAnim' has a wrong offset!");
static_assert(offsetof(URewardPreviewWidget_C, HoveredAnim) == 0x003068, "Member 'URewardPreviewWidget_C::HoveredAnim' has a wrong offset!");
static_assert(offsetof(URewardPreviewWidget_C, Background) == 0x003070, "Member 'URewardPreviewWidget_C::Background' has a wrong offset!");
static_assert(offsetof(URewardPreviewWidget_C, Background_1) == 0x003078, "Member 'URewardPreviewWidget_C::Background_1' has a wrong offset!");
static_assert(offsetof(URewardPreviewWidget_C, Button) == 0x003080, "Member 'URewardPreviewWidget_C::Button' has a wrong offset!");
static_assert(offsetof(URewardPreviewWidget_C, CollectionIcon) == 0x003088, "Member 'URewardPreviewWidget_C::CollectionIcon' has a wrong offset!");
static_assert(offsetof(URewardPreviewWidget_C, CurrencyIcon) == 0x003090, "Member 'URewardPreviewWidget_C::CurrencyIcon' has a wrong offset!");
static_assert(offsetof(URewardPreviewWidget_C, DuplicateFrame1) == 0x003098, "Member 'URewardPreviewWidget_C::DuplicateFrame1' has a wrong offset!");
static_assert(offsetof(URewardPreviewWidget_C, DuplicateFrame2) == 0x0030A0, "Member 'URewardPreviewWidget_C::DuplicateFrame2' has a wrong offset!");
static_assert(offsetof(URewardPreviewWidget_C, DuplicatePanel) == 0x0030A8, "Member 'URewardPreviewWidget_C::DuplicatePanel' has a wrong offset!");
static_assert(offsetof(URewardPreviewWidget_C, Image_116) == 0x0030B0, "Member 'URewardPreviewWidget_C::Image_116' has a wrong offset!");
static_assert(offsetof(URewardPreviewWidget_C, ImageBacker) == 0x0030B8, "Member 'URewardPreviewWidget_C::ImageBacker' has a wrong offset!");
static_assert(offsetof(URewardPreviewWidget_C, ItemAuxDescription) == 0x0030C0, "Member 'URewardPreviewWidget_C::ItemAuxDescription' has a wrong offset!");
static_assert(offsetof(URewardPreviewWidget_C, ItemDescription) == 0x0030C8, "Member 'URewardPreviewWidget_C::ItemDescription' has a wrong offset!");
static_assert(offsetof(URewardPreviewWidget_C, ItemFrame) == 0x0030D0, "Member 'URewardPreviewWidget_C::ItemFrame' has a wrong offset!");
static_assert(offsetof(URewardPreviewWidget_C, ItemIcon) == 0x0030D8, "Member 'URewardPreviewWidget_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(URewardPreviewWidget_C, ItemImage) == 0x0030E0, "Member 'URewardPreviewWidget_C::ItemImage' has a wrong offset!");
static_assert(offsetof(URewardPreviewWidget_C, ItemName) == 0x0030E8, "Member 'URewardPreviewWidget_C::ItemName' has a wrong offset!");
static_assert(offsetof(URewardPreviewWidget_C, ItemRarityPanel) == 0x0030F0, "Member 'URewardPreviewWidget_C::ItemRarityPanel' has a wrong offset!");
static_assert(offsetof(URewardPreviewWidget_C, LoadingSpinner) == 0x0030F8, "Member 'URewardPreviewWidget_C::LoadingSpinner' has a wrong offset!");
static_assert(offsetof(URewardPreviewWidget_C, NameIcon) == 0x003100, "Member 'URewardPreviewWidget_C::NameIcon' has a wrong offset!");
static_assert(offsetof(URewardPreviewWidget_C, OfferTypeGroup) == 0x003108, "Member 'URewardPreviewWidget_C::OfferTypeGroup' has a wrong offset!");
static_assert(offsetof(URewardPreviewWidget_C, OfferTypeText) == 0x003110, "Member 'URewardPreviewWidget_C::OfferTypeText' has a wrong offset!");
static_assert(offsetof(URewardPreviewWidget_C, PartsValue) == 0x003118, "Member 'URewardPreviewWidget_C::PartsValue' has a wrong offset!");
static_assert(offsetof(URewardPreviewWidget_C, RarityImage) == 0x003120, "Member 'URewardPreviewWidget_C::RarityImage' has a wrong offset!");
static_assert(offsetof(URewardPreviewWidget_C, RarityText) == 0x003128, "Member 'URewardPreviewWidget_C::RarityText' has a wrong offset!");
static_assert(offsetof(URewardPreviewWidget_C, RootSizeBox) == 0x003130, "Member 'URewardPreviewWidget_C::RootSizeBox' has a wrong offset!");
static_assert(offsetof(URewardPreviewWidget_C, TeaserPanel) == 0x003138, "Member 'URewardPreviewWidget_C::TeaserPanel' has a wrong offset!");

}

