#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RewardMessageBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RewardMessageBox.RewardMessageBox_C
// 0x0080 (0x04D8 - 0x0458)
class URewardMessageBox_C final : public UMarinerQuestRewardMessageBox
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0458(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ClaimSuccess;                                      // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             Bound_Body;                                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Bound_Header;                                      // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Center;                                            // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fuelparticles;                                     // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow;                                              // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_228;                                         // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_313;                                         // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_349;                                         // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Material;                                          // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OpacityBacker;                                     // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RadialLightRays;                                   // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultRewardButton_C*                 RewardButton;                                      // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shockwave;                                         // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopBar;                                            // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_RewardMessageBox(int32 EntryPoint);
	void BP_Populate();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RewardMessageBox_C">();
	}
	static class URewardMessageBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URewardMessageBox_C>();
	}
};
static_assert(alignof(URewardMessageBox_C) == 0x000008, "Wrong alignment on URewardMessageBox_C");
static_assert(sizeof(URewardMessageBox_C) == 0x0004D8, "Wrong size on URewardMessageBox_C");
static_assert(offsetof(URewardMessageBox_C, UberGraphFrame) == 0x000458, "Member 'URewardMessageBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URewardMessageBox_C, ClaimSuccess) == 0x000460, "Member 'URewardMessageBox_C::ClaimSuccess' has a wrong offset!");
static_assert(offsetof(URewardMessageBox_C, Bound_Body) == 0x000468, "Member 'URewardMessageBox_C::Bound_Body' has a wrong offset!");
static_assert(offsetof(URewardMessageBox_C, Bound_Header) == 0x000470, "Member 'URewardMessageBox_C::Bound_Header' has a wrong offset!");
static_assert(offsetof(URewardMessageBox_C, Center) == 0x000478, "Member 'URewardMessageBox_C::Center' has a wrong offset!");
static_assert(offsetof(URewardMessageBox_C, Fuelparticles) == 0x000480, "Member 'URewardMessageBox_C::Fuelparticles' has a wrong offset!");
static_assert(offsetof(URewardMessageBox_C, Glow) == 0x000488, "Member 'URewardMessageBox_C::Glow' has a wrong offset!");
static_assert(offsetof(URewardMessageBox_C, Image_228) == 0x000490, "Member 'URewardMessageBox_C::Image_228' has a wrong offset!");
static_assert(offsetof(URewardMessageBox_C, Image_313) == 0x000498, "Member 'URewardMessageBox_C::Image_313' has a wrong offset!");
static_assert(offsetof(URewardMessageBox_C, Image_349) == 0x0004A0, "Member 'URewardMessageBox_C::Image_349' has a wrong offset!");
static_assert(offsetof(URewardMessageBox_C, Material) == 0x0004A8, "Member 'URewardMessageBox_C::Material' has a wrong offset!");
static_assert(offsetof(URewardMessageBox_C, OpacityBacker) == 0x0004B0, "Member 'URewardMessageBox_C::OpacityBacker' has a wrong offset!");
static_assert(offsetof(URewardMessageBox_C, RadialLightRays) == 0x0004B8, "Member 'URewardMessageBox_C::RadialLightRays' has a wrong offset!");
static_assert(offsetof(URewardMessageBox_C, RewardButton) == 0x0004C0, "Member 'URewardMessageBox_C::RewardButton' has a wrong offset!");
static_assert(offsetof(URewardMessageBox_C, Shockwave) == 0x0004C8, "Member 'URewardMessageBox_C::Shockwave' has a wrong offset!");
static_assert(offsetof(URewardMessageBox_C, TopBar) == 0x0004D0, "Member 'URewardMessageBox_C::TopBar' has a wrong offset!");

}

