#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RewardMessageBox

#include "Basic.hpp"

#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function RewardMessageBox.RewardMessageBox_C.ExecuteUbergraph_RewardMessageBox
// 0x0190 (0x0190 - 0x0000)
struct RewardMessageBox_C_ExecuteUbergraph_RewardMessageBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMarinerMessageBoxQuestRewardData      CallFunc_GetData_ReturnValue;                      // 0x0010(0x0180)(ConstParm, ContainsInstancedReference)
};
static_assert(alignof(RewardMessageBox_C_ExecuteUbergraph_RewardMessageBox) == 0x000008, "Wrong alignment on RewardMessageBox_C_ExecuteUbergraph_RewardMessageBox");
static_assert(sizeof(RewardMessageBox_C_ExecuteUbergraph_RewardMessageBox) == 0x000190, "Wrong size on RewardMessageBox_C_ExecuteUbergraph_RewardMessageBox");
static_assert(offsetof(RewardMessageBox_C_ExecuteUbergraph_RewardMessageBox, EntryPoint) == 0x000000, "Member 'RewardMessageBox_C_ExecuteUbergraph_RewardMessageBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(RewardMessageBox_C_ExecuteUbergraph_RewardMessageBox, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'RewardMessageBox_C_ExecuteUbergraph_RewardMessageBox::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMessageBox_C_ExecuteUbergraph_RewardMessageBox, CallFunc_GetData_ReturnValue) == 0x000010, "Member 'RewardMessageBox_C_ExecuteUbergraph_RewardMessageBox::CallFunc_GetData_ReturnValue' has a wrong offset!");

}

