#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RocketTotem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function RocketTotem.RocketTotem_C.ExecuteUbergraph_RocketTotem
// 0x0020 (0x0020 - 0x0000)
struct RocketTotem_C_ExecuteUbergraph_RocketTotem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27B6[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_TotemLabel_C*                      K2Node_DynamicCast_AsWBP_Totem_Label;              // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RocketTotem_C_ExecuteUbergraph_RocketTotem) == 0x000008, "Wrong alignment on RocketTotem_C_ExecuteUbergraph_RocketTotem");
static_assert(sizeof(RocketTotem_C_ExecuteUbergraph_RocketTotem) == 0x000020, "Wrong size on RocketTotem_C_ExecuteUbergraph_RocketTotem");
static_assert(offsetof(RocketTotem_C_ExecuteUbergraph_RocketTotem, EntryPoint) == 0x000000, "Member 'RocketTotem_C_ExecuteUbergraph_RocketTotem::EntryPoint' has a wrong offset!");
static_assert(offsetof(RocketTotem_C_ExecuteUbergraph_RocketTotem, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000008, "Member 'RocketTotem_C_ExecuteUbergraph_RocketTotem::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketTotem_C_ExecuteUbergraph_RocketTotem, K2Node_DynamicCast_AsWBP_Totem_Label) == 0x000010, "Member 'RocketTotem_C_ExecuteUbergraph_RocketTotem::K2Node_DynamicCast_AsWBP_Totem_Label' has a wrong offset!");
static_assert(offsetof(RocketTotem_C_ExecuteUbergraph_RocketTotem, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'RocketTotem_C_ExecuteUbergraph_RocketTotem::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function RocketTotem.RocketTotem_C.CheckViewAngle
// 0x0050 (0x0050 - 0x0000)
struct RocketTotem_C_CheckViewAngle final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetMaterialInstance_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_1;      // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAcos_ReturnValue;                      // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27B7[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RocketTotem_C_CheckViewAngle) == 0x000008, "Wrong alignment on RocketTotem_C_CheckViewAngle");
static_assert(sizeof(RocketTotem_C_CheckViewAngle) == 0x000050, "Wrong size on RocketTotem_C_CheckViewAngle");
static_assert(offsetof(RocketTotem_C_CheckViewAngle, CallFunc_GetMaterialInstance_ReturnValue) == 0x000000, "Member 'RocketTotem_C_CheckViewAngle::CallFunc_GetMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketTotem_C_CheckViewAngle, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'RocketTotem_C_CheckViewAngle::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketTotem_C_CheckViewAngle, CallFunc_GetActorForwardVector_ReturnValue) == 0x000010, "Member 'RocketTotem_C_CheckViewAngle::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketTotem_C_CheckViewAngle, CallFunc_Normal_ReturnValue) == 0x00001C, "Member 'RocketTotem_C_CheckViewAngle::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketTotem_C_CheckViewAngle, CallFunc_GetActorForwardVector_ReturnValue_1) == 0x000028, "Member 'RocketTotem_C_CheckViewAngle::CallFunc_GetActorForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RocketTotem_C_CheckViewAngle, CallFunc_Normal_ReturnValue_1) == 0x000034, "Member 'RocketTotem_C_CheckViewAngle::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RocketTotem_C_CheckViewAngle, CallFunc_Dot_VectorVector_ReturnValue) == 0x000040, "Member 'RocketTotem_C_CheckViewAngle::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketTotem_C_CheckViewAngle, CallFunc_DegAcos_ReturnValue) == 0x000044, "Member 'RocketTotem_C_CheckViewAngle::CallFunc_DegAcos_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketTotem_C_CheckViewAngle, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000048, "Member 'RocketTotem_C_CheckViewAngle::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RocketTotem_C_CheckViewAngle, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x00004C, "Member 'RocketTotem_C_CheckViewAngle::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");

}

