#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScreenWipeWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ScreenWipeWidget.ScreenWipeWidget_C
// 0x0028 (0x0278 - 0x0250)
class UScreenWipeWidget_C final : public UMarinerScreenWipeWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0250(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Transitionblue;                                    // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TransitionGrey;                                    // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TransitionWhite;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WhiteOut;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ScreenWipeWidget(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ScreenWipeWidget_C">();
	}
	static class UScreenWipeWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScreenWipeWidget_C>();
	}
};
static_assert(alignof(UScreenWipeWidget_C) == 0x000008, "Wrong alignment on UScreenWipeWidget_C");
static_assert(sizeof(UScreenWipeWidget_C) == 0x000278, "Wrong size on UScreenWipeWidget_C");
static_assert(offsetof(UScreenWipeWidget_C, UberGraphFrame) == 0x000250, "Member 'UScreenWipeWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UScreenWipeWidget_C, Transitionblue) == 0x000258, "Member 'UScreenWipeWidget_C::Transitionblue' has a wrong offset!");
static_assert(offsetof(UScreenWipeWidget_C, TransitionGrey) == 0x000260, "Member 'UScreenWipeWidget_C::TransitionGrey' has a wrong offset!");
static_assert(offsetof(UScreenWipeWidget_C, TransitionWhite) == 0x000268, "Member 'UScreenWipeWidget_C::TransitionWhite' has a wrong offset!");
static_assert(offsetof(UScreenWipeWidget_C, WhiteOut) == 0x000270, "Member 'UScreenWipeWidget_C::WhiteOut' has a wrong offset!");

}

