#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SensitivityControls

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function SensitivityControls.SensitivityControls_C.ExecuteUbergraph_SensitivityControls
// 0x01B8 (0x01B8 - 0x0000)
struct SensitivityControls_C_ExecuteUbergraph_SensitivityControls final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMarinerCharacter*                      K2Node_DynamicCast_AsMariner_Character;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_3;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_2;           // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_1;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_1;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsChecked_ReturnValue;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsChecked_ReturnValue_1;                  // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue_2;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameInstance*                   K2Node_DynamicCast_AsMariner_Game_Instance;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameInstance*                   K2Node_DynamicCast_AsMariner_Game_Instance_1;      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_1;            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_3;            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameInstance*                   K2Node_DynamicCast_AsMariner_Game_Instance_2;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameInstance*                   K2Node_DynamicCast_AsMariner_Game_Instance_3;      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_2;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_3;            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_4;            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameInstance*                   K2Node_DynamicCast_AsMariner_Game_Instance_4;      // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameInstance*                   K2Node_DynamicCast_AsMariner_Game_Instance_5;      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_4;            // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_5;            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetControllerInversionVertical_ReturnValue; // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetControllerInversionVertical_ReturnValue_1; // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetControllerInversionHorizontal_ReturnValue; // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11B[0x1];                                      // 0x011B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMouseLookUpSensitivity_ReturnValue;    // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMouseLookUpSensitivity_ReturnValue_1;  // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetControllerInversionHorizontal_ReturnValue_1; // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetMarinerGlobals_IsValid;                // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_126[0x2];                                      // 0x0126(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGlobals*                        CallFunc_GetMarinerGlobals_ReturnValue;            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerInputGlobals*                   CallFunc_GetInputGlobals_ReturnValue;              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_5;            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameInstance*                   K2Node_DynamicCast_AsMariner_Game_Instance_6;      // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0150(0x0010)(ZeroConstructor, ReferenceParm)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_6;            // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSensitivitySpecification_ReturnValue;  // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_6;            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameInstance*                   K2Node_DynamicCast_AsMariner_Game_Instance_7;      // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_7;            // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls) == 0x000008, "Wrong alignment on SensitivityControls_C_ExecuteUbergraph_SensitivityControls");
static_assert(sizeof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls) == 0x0001B8, "Wrong size on SensitivityControls_C_ExecuteUbergraph_SensitivityControls");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, EntryPoint) == 0x000000, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::EntryPoint' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000008, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, K2Node_DynamicCast_AsMariner_Character) == 0x000010, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::K2Node_DynamicCast_AsMariner_Character' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, K2Node_ComponentBoundEvent_bIsChecked_3) == 0x000019, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::K2Node_ComponentBoundEvent_bIsChecked_3' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, K2Node_ComponentBoundEvent_bIsChecked_2) == 0x00001A, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::K2Node_ComponentBoundEvent_bIsChecked_2' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_Not_PreBool_ReturnValue) == 0x00001B, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_Not_PreBool_ReturnValue_1) == 0x00001C, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, Temp_int_Array_Index_Variable) == 0x000020, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, K2Node_ComponentBoundEvent_Value_1) == 0x000024, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::K2Node_ComponentBoundEvent_Value_1' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, K2Node_ComponentBoundEvent_bIsChecked_1) == 0x000028, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::K2Node_ComponentBoundEvent_bIsChecked_1' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, K2Node_ComponentBoundEvent_bIsChecked) == 0x000029, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_IsChecked_ReturnValue) == 0x00002A, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_IsChecked_ReturnValue' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_IsChecked_ReturnValue_1) == 0x00002B, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_IsChecked_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, K2Node_ComponentBoundEvent_Value) == 0x00002C, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_GetPlatformName_ReturnValue) == 0x000048, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_IsChecked_ReturnValue_2) == 0x000058, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_IsChecked_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000059, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_GetGameInstance_ReturnValue) == 0x000060, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_GetGameInstance_ReturnValue_1) == 0x000068, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, K2Node_DynamicCast_AsMariner_Game_Instance) == 0x000070, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::K2Node_DynamicCast_AsMariner_Game_Instance' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, K2Node_DynamicCast_AsMariner_Game_Instance_1) == 0x000080, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::K2Node_DynamicCast_AsMariner_Game_Instance_1' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, K2Node_DynamicCast_bSuccess_2) == 0x000088, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_GetUserSettings_ReturnValue) == 0x000090, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_GetUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_GetUserSettings_ReturnValue_1) == 0x000098, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_GetUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_GetGameInstance_ReturnValue_2) == 0x0000A0, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_GetGameInstance_ReturnValue_3) == 0x0000A8, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_GetGameInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, K2Node_DynamicCast_AsMariner_Game_Instance_2) == 0x0000B0, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::K2Node_DynamicCast_AsMariner_Game_Instance_2' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, K2Node_DynamicCast_bSuccess_3) == 0x0000B8, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, K2Node_DynamicCast_AsMariner_Game_Instance_3) == 0x0000C0, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::K2Node_DynamicCast_AsMariner_Game_Instance_3' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, K2Node_DynamicCast_bSuccess_4) == 0x0000C8, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_GetUserSettings_ReturnValue_2) == 0x0000D0, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_GetUserSettings_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_GetUserSettings_ReturnValue_3) == 0x0000D8, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_GetUserSettings_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_GetGameInstance_ReturnValue_4) == 0x0000E0, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_GetGameInstance_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, K2Node_DynamicCast_AsMariner_Game_Instance_4) == 0x0000E8, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::K2Node_DynamicCast_AsMariner_Game_Instance_4' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, K2Node_DynamicCast_bSuccess_5) == 0x0000F0, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, K2Node_DynamicCast_AsMariner_Game_Instance_5) == 0x0000F8, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::K2Node_DynamicCast_AsMariner_Game_Instance_5' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, K2Node_DynamicCast_bSuccess_6) == 0x000100, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_GetUserSettings_ReturnValue_4) == 0x000108, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_GetUserSettings_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_GetUserSettings_ReturnValue_5) == 0x000110, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_GetUserSettings_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_GetControllerInversionVertical_ReturnValue) == 0x000118, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_GetControllerInversionVertical_ReturnValue' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_GetControllerInversionVertical_ReturnValue_1) == 0x000119, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_GetControllerInversionVertical_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_GetControllerInversionHorizontal_ReturnValue) == 0x00011A, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_GetControllerInversionHorizontal_ReturnValue' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_GetMouseLookUpSensitivity_ReturnValue) == 0x00011C, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_GetMouseLookUpSensitivity_ReturnValue' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_GetMouseLookUpSensitivity_ReturnValue_1) == 0x000120, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_GetMouseLookUpSensitivity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_GetControllerInversionHorizontal_ReturnValue_1) == 0x000124, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_GetControllerInversionHorizontal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_GetMarinerGlobals_IsValid) == 0x000125, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_GetMarinerGlobals_IsValid' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_GetMarinerGlobals_ReturnValue) == 0x000128, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_GetMarinerGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_GetInputGlobals_ReturnValue) == 0x000130, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_GetInputGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_GetGameInstance_ReturnValue_5) == 0x000138, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_GetGameInstance_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, K2Node_DynamicCast_AsMariner_Game_Instance_6) == 0x000140, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::K2Node_DynamicCast_AsMariner_Game_Instance_6' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, K2Node_DynamicCast_bSuccess_7) == 0x000148, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000150, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_GetUserSettings_ReturnValue_6) == 0x000160, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_GetUserSettings_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_Array_Get_Item) == 0x000168, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_GetSensitivitySpecification_ReturnValue) == 0x000170, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_GetSensitivitySpecification_ReturnValue' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_Conv_NameToString_ReturnValue) == 0x000178, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_Array_Length_ReturnValue) == 0x000188, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_Array_Add_ReturnValue) == 0x00018C, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_Less_IntInt_ReturnValue) == 0x000190, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_GetGameInstance_ReturnValue_6) == 0x000198, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_GetGameInstance_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, K2Node_DynamicCast_AsMariner_Game_Instance_7) == 0x0001A0, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::K2Node_DynamicCast_AsMariner_Game_Instance_7' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, K2Node_DynamicCast_bSuccess_8) == 0x0001A8, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ExecuteUbergraph_SensitivityControls, CallFunc_GetUserSettings_ReturnValue_7) == 0x0001B0, "Member 'SensitivityControls_C_ExecuteUbergraph_SensitivityControls::CallFunc_GetUserSettings_ReturnValue_7' has a wrong offset!");

// Function SensitivityControls.SensitivityControls_C.BndEvt__HorizontalSlider_K2Node_ComponentBoundEvent_473_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct SensitivityControls_C_BndEvt__HorizontalSlider_K2Node_ComponentBoundEvent_473_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SensitivityControls_C_BndEvt__HorizontalSlider_K2Node_ComponentBoundEvent_473_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on SensitivityControls_C_BndEvt__HorizontalSlider_K2Node_ComponentBoundEvent_473_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(SensitivityControls_C_BndEvt__HorizontalSlider_K2Node_ComponentBoundEvent_473_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on SensitivityControls_C_BndEvt__HorizontalSlider_K2Node_ComponentBoundEvent_473_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(SensitivityControls_C_BndEvt__HorizontalSlider_K2Node_ComponentBoundEvent_473_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'SensitivityControls_C_BndEvt__HorizontalSlider_K2Node_ComponentBoundEvent_473_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function SensitivityControls.SensitivityControls_C.BndEvt__InvertY_K2Node_ComponentBoundEvent_617_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct SensitivityControls_C_BndEvt__InvertY_K2Node_ComponentBoundEvent_617_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SensitivityControls_C_BndEvt__InvertY_K2Node_ComponentBoundEvent_617_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on SensitivityControls_C_BndEvt__InvertY_K2Node_ComponentBoundEvent_617_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(SensitivityControls_C_BndEvt__InvertY_K2Node_ComponentBoundEvent_617_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on SensitivityControls_C_BndEvt__InvertY_K2Node_ComponentBoundEvent_617_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(SensitivityControls_C_BndEvt__InvertY_K2Node_ComponentBoundEvent_617_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'SensitivityControls_C_BndEvt__InvertY_K2Node_ComponentBoundEvent_617_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function SensitivityControls.SensitivityControls_C.BndEvt__InvertX_K2Node_ComponentBoundEvent_605_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct SensitivityControls_C_BndEvt__InvertX_K2Node_ComponentBoundEvent_605_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SensitivityControls_C_BndEvt__InvertX_K2Node_ComponentBoundEvent_605_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on SensitivityControls_C_BndEvt__InvertX_K2Node_ComponentBoundEvent_605_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(SensitivityControls_C_BndEvt__InvertX_K2Node_ComponentBoundEvent_605_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on SensitivityControls_C_BndEvt__InvertX_K2Node_ComponentBoundEvent_605_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(SensitivityControls_C_BndEvt__InvertX_K2Node_ComponentBoundEvent_605_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'SensitivityControls_C_BndEvt__InvertX_K2Node_ComponentBoundEvent_605_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function SensitivityControls.SensitivityControls_C.BndEvt__VerticalSlider_K2Node_ComponentBoundEvent_505_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct SensitivityControls_C_BndEvt__VerticalSlider_K2Node_ComponentBoundEvent_505_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SensitivityControls_C_BndEvt__VerticalSlider_K2Node_ComponentBoundEvent_505_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on SensitivityControls_C_BndEvt__VerticalSlider_K2Node_ComponentBoundEvent_505_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(SensitivityControls_C_BndEvt__VerticalSlider_K2Node_ComponentBoundEvent_505_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on SensitivityControls_C_BndEvt__VerticalSlider_K2Node_ComponentBoundEvent_505_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(SensitivityControls_C_BndEvt__VerticalSlider_K2Node_ComponentBoundEvent_505_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'SensitivityControls_C_BndEvt__VerticalSlider_K2Node_ComponentBoundEvent_505_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function SensitivityControls.SensitivityControls_C.BndEvt__GamepadToggle_K2Node_ComponentBoundEvent_38_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct SensitivityControls_C_BndEvt__GamepadToggle_K2Node_ComponentBoundEvent_38_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SensitivityControls_C_BndEvt__GamepadToggle_K2Node_ComponentBoundEvent_38_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on SensitivityControls_C_BndEvt__GamepadToggle_K2Node_ComponentBoundEvent_38_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(SensitivityControls_C_BndEvt__GamepadToggle_K2Node_ComponentBoundEvent_38_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on SensitivityControls_C_BndEvt__GamepadToggle_K2Node_ComponentBoundEvent_38_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(SensitivityControls_C_BndEvt__GamepadToggle_K2Node_ComponentBoundEvent_38_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'SensitivityControls_C_BndEvt__GamepadToggle_K2Node_ComponentBoundEvent_38_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function SensitivityControls.SensitivityControls_C.BndEvt__MouseToggle_K2Node_ComponentBoundEvent_37_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct SensitivityControls_C_BndEvt__MouseToggle_K2Node_ComponentBoundEvent_37_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SensitivityControls_C_BndEvt__MouseToggle_K2Node_ComponentBoundEvent_37_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on SensitivityControls_C_BndEvt__MouseToggle_K2Node_ComponentBoundEvent_37_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(SensitivityControls_C_BndEvt__MouseToggle_K2Node_ComponentBoundEvent_37_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on SensitivityControls_C_BndEvt__MouseToggle_K2Node_ComponentBoundEvent_37_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(SensitivityControls_C_BndEvt__MouseToggle_K2Node_ComponentBoundEvent_37_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'SensitivityControls_C_BndEvt__MouseToggle_K2Node_ComponentBoundEvent_37_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function SensitivityControls.SensitivityControls_C.PlayClickSound
// 0x0030 (0x0030 - 0x0000)
struct SensitivityControls_C_PlayClickSound final
{
public:
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0000(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0010(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SensitivityControls_C_PlayClickSound) == 0x000008, "Wrong alignment on SensitivityControls_C_PlayClickSound");
static_assert(sizeof(SensitivityControls_C_PlayClickSound) == 0x000030, "Wrong size on SensitivityControls_C_PlayClickSound");
static_assert(offsetof(SensitivityControls_C_PlayClickSound, Temp_struct_Variable) == 0x000000, "Member 'SensitivityControls_C_PlayClickSound::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_PlayClickSound, Temp_delegate_Variable) == 0x000010, "Member 'SensitivityControls_C_PlayClickSound::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_PlayClickSound, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'SensitivityControls_C_PlayClickSound::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_PlayClickSound, CallFunc_PostEvent_ReturnValue) == 0x000028, "Member 'SensitivityControls_C_PlayClickSound::CallFunc_PostEvent_ReturnValue' has a wrong offset!");

// Function SensitivityControls.SensitivityControls_C.ShowGamepadSensitivity
// 0x0030 (0x0030 - 0x0000)
struct SensitivityControls_C_ShowGamepadSensitivity final
{
public:
	class UObject*                                PersistentUser;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameInstance*                   K2Node_DynamicCast_AsMariner_Game_Instance;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetControllerInversionVertical_ReturnValue; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetControllerInversionHorizontal_ReturnValue; // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SensitivityControls_C_ShowGamepadSensitivity) == 0x000008, "Wrong alignment on SensitivityControls_C_ShowGamepadSensitivity");
static_assert(sizeof(SensitivityControls_C_ShowGamepadSensitivity) == 0x000030, "Wrong size on SensitivityControls_C_ShowGamepadSensitivity");
static_assert(offsetof(SensitivityControls_C_ShowGamepadSensitivity, PersistentUser) == 0x000000, "Member 'SensitivityControls_C_ShowGamepadSensitivity::PersistentUser' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ShowGamepadSensitivity, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'SensitivityControls_C_ShowGamepadSensitivity::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ShowGamepadSensitivity, K2Node_DynamicCast_AsMariner_Game_Instance) == 0x000010, "Member 'SensitivityControls_C_ShowGamepadSensitivity::K2Node_DynamicCast_AsMariner_Game_Instance' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ShowGamepadSensitivity, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'SensitivityControls_C_ShowGamepadSensitivity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ShowGamepadSensitivity, CallFunc_GetUserSettings_ReturnValue) == 0x000020, "Member 'SensitivityControls_C_ShowGamepadSensitivity::CallFunc_GetUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ShowGamepadSensitivity, CallFunc_GetControllerInversionVertical_ReturnValue) == 0x000028, "Member 'SensitivityControls_C_ShowGamepadSensitivity::CallFunc_GetControllerInversionVertical_ReturnValue' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ShowGamepadSensitivity, CallFunc_GetControllerInversionHorizontal_ReturnValue) == 0x000029, "Member 'SensitivityControls_C_ShowGamepadSensitivity::CallFunc_GetControllerInversionHorizontal_ReturnValue' has a wrong offset!");

// Function SensitivityControls.SensitivityControls_C.ShowMouseSensitivity
// 0x0030 (0x0030 - 0x0000)
struct SensitivityControls_C_ShowMouseSensitivity final
{
public:
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameInstance*                   K2Node_DynamicCast_AsMariner_Game_Instance;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetControllerInversionVertical_ReturnValue; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetControllerInversionHorizontal_ReturnValue; // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMouseLookUpSensitivity_ReturnValue;    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMouseTurnSensitivity_ReturnValue;      // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SensitivityControls_C_ShowMouseSensitivity) == 0x000008, "Wrong alignment on SensitivityControls_C_ShowMouseSensitivity");
static_assert(sizeof(SensitivityControls_C_ShowMouseSensitivity) == 0x000030, "Wrong size on SensitivityControls_C_ShowMouseSensitivity");
static_assert(offsetof(SensitivityControls_C_ShowMouseSensitivity, CallFunc_GetGameInstance_ReturnValue) == 0x000000, "Member 'SensitivityControls_C_ShowMouseSensitivity::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(SensitivityControls_C_ShowMouseSensitivity, K2Node_DynamicCast_AsMariner_Game_Instance) == 0x000008, "Member 'SensitivityControls_C_ShowMouseSensitivity::K2Node_DynamicCast_AsMariner_Game_Instance' has a wrong offset!");
