#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ServerListElement

#include "Basic.hpp"

#include "Mariner_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function ServerListElement.ServerListElement_C.ExecuteUbergraph_ServerListElement
// 0x0090 (0x0090 - 0x0000)
struct ServerListElement_C_ExecuteUbergraph_ServerListElement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TScriptInterface<class IMarinerInputInterface> CallFunc_SetActiveInputWidget_InputWidget_CastInput; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0028(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_Name;                                 // 0x0040(0x0018)(ConstParm)
	class FText                                   K2Node_Event_Ping;                                 // 0x0058(0x0018)(ConstParm)
	class FText                                   K2Node_Event_PlayerCount;                          // 0x0070(0x0018)(ConstParm)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ServerListElement_C_ExecuteUbergraph_ServerListElement) == 0x000008, "Wrong alignment on ServerListElement_C_ExecuteUbergraph_ServerListElement");
static_assert(sizeof(ServerListElement_C_ExecuteUbergraph_ServerListElement) == 0x000090, "Wrong size on ServerListElement_C_ExecuteUbergraph_ServerListElement");
static_assert(offsetof(ServerListElement_C_ExecuteUbergraph_ServerListElement, EntryPoint) == 0x000000, "Member 'ServerListElement_C_ExecuteUbergraph_ServerListElement::EntryPoint' has a wrong offset!");
static_assert(offsetof(ServerListElement_C_ExecuteUbergraph_ServerListElement, Temp_struct_Variable) == 0x000008, "Member 'ServerListElement_C_ExecuteUbergraph_ServerListElement::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(ServerListElement_C_ExecuteUbergraph_ServerListElement, CallFunc_SetActiveInputWidget_InputWidget_CastInput) == 0x000018, "Member 'ServerListElement_C_ExecuteUbergraph_ServerListElement::CallFunc_SetActiveInputWidget_InputWidget_CastInput' has a wrong offset!");
static_assert(offsetof(ServerListElement_C_ExecuteUbergraph_ServerListElement, Temp_delegate_Variable) == 0x000028, "Member 'ServerListElement_C_ExecuteUbergraph_ServerListElement::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(ServerListElement_C_ExecuteUbergraph_ServerListElement, CallFunc_GetOwningPlayer_ReturnValue) == 0x000038, "Member 'ServerListElement_C_ExecuteUbergraph_ServerListElement::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerListElement_C_ExecuteUbergraph_ServerListElement, K2Node_Event_Name) == 0x000040, "Member 'ServerListElement_C_ExecuteUbergraph_ServerListElement::K2Node_Event_Name' has a wrong offset!");
static_assert(offsetof(ServerListElement_C_ExecuteUbergraph_ServerListElement, K2Node_Event_Ping) == 0x000058, "Member 'ServerListElement_C_ExecuteUbergraph_ServerListElement::K2Node_Event_Ping' has a wrong offset!");
static_assert(offsetof(ServerListElement_C_ExecuteUbergraph_ServerListElement, K2Node_Event_PlayerCount) == 0x000070, "Member 'ServerListElement_C_ExecuteUbergraph_ServerListElement::K2Node_Event_PlayerCount' has a wrong offset!");
static_assert(offsetof(ServerListElement_C_ExecuteUbergraph_ServerListElement, CallFunc_PostEvent_ReturnValue) == 0x000088, "Member 'ServerListElement_C_ExecuteUbergraph_ServerListElement::CallFunc_PostEvent_ReturnValue' has a wrong offset!");

// Function ServerListElement.ServerListElement_C.OnServerWidgetCreated
// 0x0048 (0x0048 - 0x0000)
struct ServerListElement_C_OnServerWidgetCreated final
{
public:
	class FText                                   Name_0;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   Ping;                                              // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   PlayerCount_0;                                     // 0x0030(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(ServerListElement_C_OnServerWidgetCreated) == 0x000008, "Wrong alignment on ServerListElement_C_OnServerWidgetCreated");
static_assert(sizeof(ServerListElement_C_OnServerWidgetCreated) == 0x000048, "Wrong size on ServerListElement_C_OnServerWidgetCreated");
static_assert(offsetof(ServerListElement_C_OnServerWidgetCreated, Name_0) == 0x000000, "Member 'ServerListElement_C_OnServerWidgetCreated::Name_0' has a wrong offset!");
static_assert(offsetof(ServerListElement_C_OnServerWidgetCreated, Ping) == 0x000018, "Member 'ServerListElement_C_OnServerWidgetCreated::Ping' has a wrong offset!");
static_assert(offsetof(ServerListElement_C_OnServerWidgetCreated, PlayerCount_0) == 0x000030, "Member 'ServerListElement_C_OnServerWidgetCreated::PlayerCount_0' has a wrong offset!");

// Function ServerListElement.ServerListElement_C.HandleInput
// 0x0003 (0x0003 - 0x0000)
struct ServerListElement_C_HandleInput final
{
public:
	EMarinerInputActions                          InInput;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ServerListElement_C_HandleInput) == 0x000001, "Wrong alignment on ServerListElement_C_HandleInput");
static_assert(sizeof(ServerListElement_C_HandleInput) == 0x000003, "Wrong size on ServerListElement_C_HandleInput");
static_assert(offsetof(ServerListElement_C_HandleInput, InInput) == 0x000000, "Member 'ServerListElement_C_HandleInput::InInput' has a wrong offset!");
static_assert(offsetof(ServerListElement_C_HandleInput, ReturnValue) == 0x000001, "Member 'ServerListElement_C_HandleInput::ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerListElement_C_HandleInput, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'ServerListElement_C_HandleInput::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

}

