#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ServerList

#include "Basic.hpp"

#include "Mariner_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function ServerList.ServerList_C.ExecuteUbergraph_ServerList
// 0x0150 (0x0150 - 0x0000)
struct ServerList_C_ExecuteUbergraph_ServerList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22EF[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMarinerPromptData                     K2Node_MakeStruct_MarinerPromptData;               // 0x0008(0x0118)()
	bool                                          CallFunc_AddHostPrompt_ReturnValue;                // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22F0[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0130(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bFromSubMenu;                         // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoveSelf_ReturnValue;                   // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ClearHostPrompts_ReturnValue;             // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22F1[0x4];                                     // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMarinerInputInterface> CallFunc_SetActiveInputWidget_InputWidget_CastInput; // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ServerList_C_ExecuteUbergraph_ServerList) == 0x000008, "Wrong alignment on ServerList_C_ExecuteUbergraph_ServerList");
static_assert(sizeof(ServerList_C_ExecuteUbergraph_ServerList) == 0x000150, "Wrong size on ServerList_C_ExecuteUbergraph_ServerList");
static_assert(offsetof(ServerList_C_ExecuteUbergraph_ServerList, EntryPoint) == 0x000000, "Member 'ServerList_C_ExecuteUbergraph_ServerList::EntryPoint' has a wrong offset!");
static_assert(offsetof(ServerList_C_ExecuteUbergraph_ServerList, K2Node_MakeStruct_MarinerPromptData) == 0x000008, "Member 'ServerList_C_ExecuteUbergraph_ServerList::K2Node_MakeStruct_MarinerPromptData' has a wrong offset!");
static_assert(offsetof(ServerList_C_ExecuteUbergraph_ServerList, CallFunc_AddHostPrompt_ReturnValue) == 0x000120, "Member 'ServerList_C_ExecuteUbergraph_ServerList::CallFunc_AddHostPrompt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerList_C_ExecuteUbergraph_ServerList, CallFunc_PlayAnimation_ReturnValue) == 0x000128, "Member 'ServerList_C_ExecuteUbergraph_ServerList::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerList_C_ExecuteUbergraph_ServerList, K2Node_Event_Animation) == 0x000130, "Member 'ServerList_C_ExecuteUbergraph_ServerList::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(ServerList_C_ExecuteUbergraph_ServerList, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000138, "Member 'ServerList_C_ExecuteUbergraph_ServerList::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerList_C_ExecuteUbergraph_ServerList, K2Node_Event_bFromSubMenu) == 0x000139, "Member 'ServerList_C_ExecuteUbergraph_ServerList::K2Node_Event_bFromSubMenu' has a wrong offset!");
static_assert(offsetof(ServerList_C_ExecuteUbergraph_ServerList, CallFunc_RemoveSelf_ReturnValue) == 0x00013A, "Member 'ServerList_C_ExecuteUbergraph_ServerList::CallFunc_RemoveSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerList_C_ExecuteUbergraph_ServerList, CallFunc_ClearHostPrompts_ReturnValue) == 0x00013B, "Member 'ServerList_C_ExecuteUbergraph_ServerList::CallFunc_ClearHostPrompts_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerList_C_ExecuteUbergraph_ServerList, CallFunc_SetActiveInputWidget_InputWidget_CastInput) == 0x000140, "Member 'ServerList_C_ExecuteUbergraph_ServerList::CallFunc_SetActiveInputWidget_InputWidget_CastInput' has a wrong offset!");

// Function ServerList.ServerList_C.BP_OnEntered
// 0x0001 (0x0001 - 0x0000)
struct ServerList_C_BP_OnEntered final
{
public:
	bool                                          bFromSubMenu;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ServerList_C_BP_OnEntered) == 0x000001, "Wrong alignment on ServerList_C_BP_OnEntered");
static_assert(sizeof(ServerList_C_BP_OnEntered) == 0x000001, "Wrong size on ServerList_C_BP_OnEntered");
static_assert(offsetof(ServerList_C_BP_OnEntered, bFromSubMenu) == 0x000000, "Member 'ServerList_C_BP_OnEntered::bFromSubMenu' has a wrong offset!");

// Function ServerList.ServerList_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct ServerList_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ServerList_C_OnAnimationFinished) == 0x000008, "Wrong alignment on ServerList_C_OnAnimationFinished");
static_assert(sizeof(ServerList_C_OnAnimationFinished) == 0x000008, "Wrong size on ServerList_C_OnAnimationFinished");
static_assert(offsetof(ServerList_C_OnAnimationFinished, Animation) == 0x000000, "Member 'ServerList_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function ServerList.ServerList_C.PlayClickSound
// 0x0030 (0x0030 - 0x0000)
struct ServerList_C_PlayClickSound final
{
public:
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0000(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0010(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ServerList_C_PlayClickSound) == 0x000008, "Wrong alignment on ServerList_C_PlayClickSound");
static_assert(sizeof(ServerList_C_PlayClickSound) == 0x000030, "Wrong size on ServerList_C_PlayClickSound");
static_assert(offsetof(ServerList_C_PlayClickSound, Temp_struct_Variable) == 0x000000, "Member 'ServerList_C_PlayClickSound::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(ServerList_C_PlayClickSound, Temp_delegate_Variable) == 0x000010, "Member 'ServerList_C_PlayClickSound::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(ServerList_C_PlayClickSound, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'ServerList_C_PlayClickSound::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerList_C_PlayClickSound, CallFunc_PostEvent_ReturnValue) == 0x000028, "Member 'ServerList_C_PlayClickSound::CallFunc_PostEvent_ReturnValue' has a wrong offset!");

// Function ServerList.ServerList_C.InitiateMenuBackOut
// 0x0010 (0x0010 - 0x0000)
struct ServerList_C_InitiateMenuBackOut final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ServerList_C_InitiateMenuBackOut) == 0x000008, "Wrong alignment on ServerList_C_InitiateMenuBackOut");
static_assert(sizeof(ServerList_C_InitiateMenuBackOut) == 0x000010, "Wrong size on ServerList_C_InitiateMenuBackOut");
static_assert(offsetof(ServerList_C_InitiateMenuBackOut, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'ServerList_C_InitiateMenuBackOut::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerList_C_InitiateMenuBackOut, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000008, "Member 'ServerList_C_InitiateMenuBackOut::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerList_C_InitiateMenuBackOut, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'ServerList_C_InitiateMenuBackOut::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function ServerList.ServerList_C.HandleInput
// 0x0005 (0x0005 - 0x0000)
struct ServerList_C_HandleInput final
{
public:
	EMarinerInputActions                          InInput;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HandleInput_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ServerList_C_HandleInput) == 0x000001, "Wrong alignment on ServerList_C_HandleInput");
static_assert(sizeof(ServerList_C_HandleInput) == 0x000005, "Wrong size on ServerList_C_HandleInput");
static_assert(offsetof(ServerList_C_HandleInput, InInput) == 0x000000, "Member 'ServerList_C_HandleInput::InInput' has a wrong offset!");
static_assert(offsetof(ServerList_C_HandleInput, ReturnValue) == 0x000001, "Member 'ServerList_C_HandleInput::ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerList_C_HandleInput, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'ServerList_C_HandleInput::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerList_C_HandleInput, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000003, "Member 'ServerList_C_HandleInput::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ServerList_C_HandleInput, CallFunc_HandleInput_ReturnValue) == 0x000004, "Member 'ServerList_C_HandleInput::CallFunc_HandleInput_ReturnValue' has a wrong offset!");

}

