#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ServerListElement

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_structs.hpp"
#include "Mariner_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ServerListElement.ServerListElement_C
// 0x0028 (0x0330 - 0x0308)
class UServerListElement_C final : public UMarinerServerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMarinerButton*                         Button;                                            // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PingText;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerCount;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SeverName;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ServerListElement(int32 EntryPoint);
	void OnServerWidgetCreated(const class FText& Name_0, const class FText& Ping, const class FText& PlayerCount_0);
	void BndEvt__Button_79_K2Node_ComponentBoundEvent_51_OnButtonClickedEvent__DelegateSignature();
	bool HandleInput(EMarinerInputActions InInput);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ServerListElement_C">();
	}
	static class UServerListElement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UServerListElement_C>();
	}
};
static_assert(alignof(UServerListElement_C) == 0x000008, "Wrong alignment on UServerListElement_C");
static_assert(sizeof(UServerListElement_C) == 0x000330, "Wrong size on UServerListElement_C");
static_assert(offsetof(UServerListElement_C, UberGraphFrame) == 0x000308, "Member 'UServerListElement_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UServerListElement_C, Button) == 0x000310, "Member 'UServerListElement_C::Button' has a wrong offset!");
static_assert(offsetof(UServerListElement_C, PingText) == 0x000318, "Member 'UServerListElement_C::PingText' has a wrong offset!");
static_assert(offsetof(UServerListElement_C, PlayerCount) == 0x000320, "Member 'UServerListElement_C::PlayerCount' has a wrong offset!");
static_assert(offsetof(UServerListElement_C, SeverName) == 0x000328, "Member 'UServerListElement_C::SeverName' has a wrong offset!");

}

