#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ServerBrowserWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ServerBrowserWidget.ServerBrowserWidget_C
// 0x0020 (0x0300 - 0x02E0)
class UServerBrowserWidget_C final : public UMarinerServerBrowser
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMarinerScrollBox*                      ContentPane;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NoServersFoundText;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UThrobber*                              RefreshingThrobber;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ServerBrowserWidget(int32 EntryPoint);
	void Construct();
	void GetNumSessions(int32* Sessions);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ServerBrowserWidget_C">();
	}
	static class UServerBrowserWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UServerBrowserWidget_C>();
	}
};
static_assert(alignof(UServerBrowserWidget_C) == 0x000008, "Wrong alignment on UServerBrowserWidget_C");
static_assert(sizeof(UServerBrowserWidget_C) == 0x000300, "Wrong size on UServerBrowserWidget_C");
static_assert(offsetof(UServerBrowserWidget_C, UberGraphFrame) == 0x0002E0, "Member 'UServerBrowserWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UServerBrowserWidget_C, ContentPane) == 0x0002E8, "Member 'UServerBrowserWidget_C::ContentPane' has a wrong offset!");
static_assert(offsetof(UServerBrowserWidget_C, NoServersFoundText) == 0x0002F0, "Member 'UServerBrowserWidget_C::NoServersFoundText' has a wrong offset!");
static_assert(offsetof(UServerBrowserWidget_C, RefreshingThrobber) == 0x0002F8, "Member 'UServerBrowserWidget_C::RefreshingThrobber' has a wrong offset!");

}

