#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ServerBrowserWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function ServerBrowserWidget.ServerBrowserWidget_C.ExecuteUbergraph_ServerBrowserWidget
// 0x0018 (0x0018 - 0x0000)
struct ServerBrowserWidget_C_ExecuteUbergraph_ServerBrowserWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMarinerInputInterface> CallFunc_SetActiveInputWidget_InputWidget_CastInput; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ServerBrowserWidget_C_ExecuteUbergraph_ServerBrowserWidget) == 0x000008, "Wrong alignment on ServerBrowserWidget_C_ExecuteUbergraph_ServerBrowserWidget");
static_assert(sizeof(ServerBrowserWidget_C_ExecuteUbergraph_ServerBrowserWidget) == 0x000018, "Wrong size on ServerBrowserWidget_C_ExecuteUbergraph_ServerBrowserWidget");
static_assert(offsetof(ServerBrowserWidget_C_ExecuteUbergraph_ServerBrowserWidget, EntryPoint) == 0x000000, "Member 'ServerBrowserWidget_C_ExecuteUbergraph_ServerBrowserWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(ServerBrowserWidget_C_ExecuteUbergraph_ServerBrowserWidget, CallFunc_SetActiveInputWidget_InputWidget_CastInput) == 0x000008, "Member 'ServerBrowserWidget_C_ExecuteUbergraph_ServerBrowserWidget::CallFunc_SetActiveInputWidget_InputWidget_CastInput' has a wrong offset!");

// Function ServerBrowserWidget.ServerBrowserWidget_C.GetNumSessions
// 0x000C (0x000C - 0x0000)
struct ServerBrowserWidget_C_GetNumSessions final
{
public:
	int32                                         Sessions;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ServerBrowserWidget_C_GetNumSessions) == 0x000004, "Wrong alignment on ServerBrowserWidget_C_GetNumSessions");
static_assert(sizeof(ServerBrowserWidget_C_GetNumSessions) == 0x00000C, "Wrong size on ServerBrowserWidget_C_GetNumSessions");
static_assert(offsetof(ServerBrowserWidget_C_GetNumSessions, Sessions) == 0x000000, "Member 'ServerBrowserWidget_C_GetNumSessions::Sessions' has a wrong offset!");
static_assert(offsetof(ServerBrowserWidget_C_GetNumSessions, CallFunc_IsVisible_ReturnValue) == 0x000004, "Member 'ServerBrowserWidget_C_GetNumSessions::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerBrowserWidget_C_GetNumSessions, CallFunc_IsVisible_ReturnValue_1) == 0x000005, "Member 'ServerBrowserWidget_C_GetNumSessions::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ServerBrowserWidget_C_GetNumSessions, CallFunc_BooleanOR_ReturnValue) == 0x000006, "Member 'ServerBrowserWidget_C_GetNumSessions::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerBrowserWidget_C_GetNumSessions, CallFunc_GetChildrenCount_ReturnValue) == 0x000008, "Member 'ServerBrowserWidget_C_GetNumSessions::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");

}

