#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsMenuStack

#include "Basic.hpp"

#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function SettingsMenuStack.SettingsMenuStack_C.ExecuteUbergraph_SettingsMenuStack
// 0x0068 (0x0068 - 0x0000)
struct SettingsMenuStack_C_ExecuteUbergraph_SettingsMenuStack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bToSubLayer;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameInstance*                   CallFunc_GetMarinerGameInstance_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMarinerMenuStackManagerSetup          K2Node_MakeStruct_MarinerMenuStackManagerSetup;    // 0x0010(0x0028)(NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsInMainMenu_ReturnValue;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue_1;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActivateStackManager_ReturnValue;         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerMenuStackLayer*                 CallFunc_GetPendingRootLayer_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsMenuStack_C_ExecuteUbergraph_SettingsMenuStack) == 0x000008, "Wrong alignment on SettingsMenuStack_C_ExecuteUbergraph_SettingsMenuStack");
static_assert(sizeof(SettingsMenuStack_C_ExecuteUbergraph_SettingsMenuStack) == 0x000068, "Wrong size on SettingsMenuStack_C_ExecuteUbergraph_SettingsMenuStack");
static_assert(offsetof(SettingsMenuStack_C_ExecuteUbergraph_SettingsMenuStack, EntryPoint) == 0x000000, "Member 'SettingsMenuStack_C_ExecuteUbergraph_SettingsMenuStack::EntryPoint' has a wrong offset!");
static_assert(offsetof(SettingsMenuStack_C_ExecuteUbergraph_SettingsMenuStack, K2Node_Event_bToSubLayer) == 0x000004, "Member 'SettingsMenuStack_C_ExecuteUbergraph_SettingsMenuStack::K2Node_Event_bToSubLayer' has a wrong offset!");
static_assert(offsetof(SettingsMenuStack_C_ExecuteUbergraph_SettingsMenuStack, CallFunc_GetMarinerGameInstance_ReturnValue) == 0x000008, "Member 'SettingsMenuStack_C_ExecuteUbergraph_SettingsMenuStack::CallFunc_GetMarinerGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsMenuStack_C_ExecuteUbergraph_SettingsMenuStack, K2Node_MakeStruct_MarinerMenuStackManagerSetup) == 0x000010, "Member 'SettingsMenuStack_C_ExecuteUbergraph_SettingsMenuStack::K2Node_MakeStruct_MarinerMenuStackManagerSetup' has a wrong offset!");
static_assert(offsetof(SettingsMenuStack_C_ExecuteUbergraph_SettingsMenuStack, CallFunc_IsInMainMenu_ReturnValue) == 0x000038, "Member 'SettingsMenuStack_C_ExecuteUbergraph_SettingsMenuStack::CallFunc_IsInMainMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsMenuStack_C_ExecuteUbergraph_SettingsMenuStack, CallFunc_GetMenuManager_ReturnValue) == 0x000040, "Member 'SettingsMenuStack_C_ExecuteUbergraph_SettingsMenuStack::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsMenuStack_C_ExecuteUbergraph_SettingsMenuStack, CallFunc_GetMenuManager_ReturnValue_1) == 0x000048, "Member 'SettingsMenuStack_C_ExecuteUbergraph_SettingsMenuStack::CallFunc_GetMenuManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingsMenuStack_C_ExecuteUbergraph_SettingsMenuStack, CallFunc_ActivateStackManager_ReturnValue) == 0x000050, "Member 'SettingsMenuStack_C_ExecuteUbergraph_SettingsMenuStack::CallFunc_ActivateStackManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsMenuStack_C_ExecuteUbergraph_SettingsMenuStack, CallFunc_GetPendingRootLayer_ReturnValue) == 0x000058, "Member 'SettingsMenuStack_C_ExecuteUbergraph_SettingsMenuStack::CallFunc_GetPendingRootLayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsMenuStack_C_ExecuteUbergraph_SettingsMenuStack, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'SettingsMenuStack_C_ExecuteUbergraph_SettingsMenuStack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsMenuStack_C_ExecuteUbergraph_SettingsMenuStack, CallFunc_Not_PreBool_ReturnValue) == 0x000061, "Member 'SettingsMenuStack_C_ExecuteUbergraph_SettingsMenuStack::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsMenuStack_C_ExecuteUbergraph_SettingsMenuStack, CallFunc_BooleanAND_ReturnValue) == 0x000062, "Member 'SettingsMenuStack_C_ExecuteUbergraph_SettingsMenuStack::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function SettingsMenuStack.SettingsMenuStack_C.BP_OnExited
// 0x0001 (0x0001 - 0x0000)
struct SettingsMenuStack_C_BP_OnExited final
{
public:
	bool                                          bToSubLayer;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsMenuStack_C_BP_OnExited) == 0x000001, "Wrong alignment on SettingsMenuStack_C_BP_OnExited");
static_assert(sizeof(SettingsMenuStack_C_BP_OnExited) == 0x000001, "Wrong size on SettingsMenuStack_C_BP_OnExited");
static_assert(offsetof(SettingsMenuStack_C_BP_OnExited, bToSubLayer) == 0x000000, "Member 'SettingsMenuStack_C_BP_OnExited::bToSubLayer' has a wrong offset!");

// Function SettingsMenuStack.SettingsMenuStack_C.HandleInput
// 0x0005 (0x0005 - 0x0000)
struct SettingsMenuStack_C_HandleInput final
{
public:
	EMarinerInputActions                          InInput;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoveSelf_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HandleInput_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsMenuStack_C_HandleInput) == 0x000001, "Wrong alignment on SettingsMenuStack_C_HandleInput");
static_assert(sizeof(SettingsMenuStack_C_HandleInput) == 0x000005, "Wrong size on SettingsMenuStack_C_HandleInput");
static_assert(offsetof(SettingsMenuStack_C_HandleInput, InInput) == 0x000000, "Member 'SettingsMenuStack_C_HandleInput::InInput' has a wrong offset!");
static_assert(offsetof(SettingsMenuStack_C_HandleInput, ReturnValue) == 0x000001, "Member 'SettingsMenuStack_C_HandleInput::ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsMenuStack_C_HandleInput, CallFunc_RemoveSelf_ReturnValue) == 0x000002, "Member 'SettingsMenuStack_C_HandleInput::CallFunc_RemoveSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsMenuStack_C_HandleInput, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000003, "Member 'SettingsMenuStack_C_HandleInput::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsMenuStack_C_HandleInput, CallFunc_HandleInput_ReturnValue) == 0x000004, "Member 'SettingsMenuStack_C_HandleInput::CallFunc_HandleInput_ReturnValue' has a wrong offset!");

// Function SettingsMenuStack.SettingsMenuStack_C.UpdatePlayerHeaderIsOnGameTabs
// 0x0010 (0x0010 - 0x0000)
struct SettingsMenuStack_C_UpdatePlayerHeaderIsOnGameTabs final
{
public:
	bool                                          bGameTabs;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsMenuStack_C_UpdatePlayerHeaderIsOnGameTabs) == 0x000008, "Wrong alignment on SettingsMenuStack_C_UpdatePlayerHeaderIsOnGameTabs");
static_assert(sizeof(SettingsMenuStack_C_UpdatePlayerHeaderIsOnGameTabs) == 0x000010, "Wrong size on SettingsMenuStack_C_UpdatePlayerHeaderIsOnGameTabs");
static_assert(offsetof(SettingsMenuStack_C_UpdatePlayerHeaderIsOnGameTabs, bGameTabs) == 0x000000, "Member 'SettingsMenuStack_C_UpdatePlayerHeaderIsOnGameTabs::bGameTabs' has a wrong offset!");
static_assert(offsetof(SettingsMenuStack_C_UpdatePlayerHeaderIsOnGameTabs, CallFunc_GetMenuManager_ReturnValue) == 0x000008, "Member 'SettingsMenuStack_C_UpdatePlayerHeaderIsOnGameTabs::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");

}

