#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsKeyboardMenu

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function SettingsKeyboardMenu.SettingsKeyboardMenu_C.ExecuteUbergraph_SettingsKeyboardMenu
// 0x00C0 (0x00C0 - 0x0000)
struct SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerSettingSlider*                  K2Node_ComponentBoundEvent_Slider_1;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMarinerInputInterface> CallFunc_SetActiveInputWidget_InputWidget_CastInput; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMarinerSettingSlider*                  K2Node_ComponentBoundEvent_Slider;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_1;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMouseTurnSensitivity_ReturnValue;      // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMouseLookUpSensitivity_ReturnValue;    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_2;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_3;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerSettingCheckBox*                K2Node_ComponentBoundEvent_CheckBox_3;             // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFromSubMenu;                         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_4;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_1;                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMouseInvertedXAxis_ReturnValue;         // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetChecked_ReturnValue;                   // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerSettingCheckBox*                K2Node_ComponentBoundEvent_CheckBox_2;             // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_1;           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerSettingCheckBox*                K2Node_ComponentBoundEvent_CheckBox_1;             // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerSettingCheckBox*                K2Node_ComponentBoundEvent_CheckBox;               // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_5;            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_6;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMouseInvertedYAxis_ReturnValue;         // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_7;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetChecked_ReturnValue_1;                 // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu) == 0x000008, "Wrong alignment on SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu");
static_assert(sizeof(SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu) == 0x0000C0, "Wrong size on SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu");
static_assert(offsetof(SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu, EntryPoint) == 0x000000, "Member 'SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu, K2Node_ComponentBoundEvent_Slider_1) == 0x000008, "Member 'SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu::K2Node_ComponentBoundEvent_Slider_1' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu, CallFunc_SetActiveInputWidget_InputWidget_CastInput) == 0x000010, "Member 'SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu::CallFunc_SetActiveInputWidget_InputWidget_CastInput' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu, K2Node_ComponentBoundEvent_Slider) == 0x000020, "Member 'SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu::K2Node_ComponentBoundEvent_Slider' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu, CallFunc_GetUserSettings_ReturnValue) == 0x000028, "Member 'SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu::CallFunc_GetUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu, CallFunc_GetUserSettings_ReturnValue_1) == 0x000030, "Member 'SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu::CallFunc_GetUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu, CallFunc_GetMouseTurnSensitivity_ReturnValue) == 0x000038, "Member 'SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu::CallFunc_GetMouseTurnSensitivity_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu, CallFunc_GetMouseLookUpSensitivity_ReturnValue) == 0x00003C, "Member 'SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu::CallFunc_GetMouseLookUpSensitivity_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu, CallFunc_GetUserSettings_ReturnValue_2) == 0x000040, "Member 'SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu::CallFunc_GetUserSettings_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu, CallFunc_GetUserSettings_ReturnValue_3) == 0x000048, "Member 'SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu::CallFunc_GetUserSettings_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu, K2Node_ComponentBoundEvent_CheckBox_3) == 0x000050, "Member 'SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu::K2Node_ComponentBoundEvent_CheckBox_3' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu, K2Node_Event_bFromSubMenu) == 0x000058, "Member 'SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu::K2Node_Event_bFromSubMenu' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu, CallFunc_GetUserSettings_ReturnValue_4) == 0x000060, "Member 'SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu::CallFunc_GetUserSettings_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu, K2Node_ComponentBoundEvent_Value_1) == 0x000068, "Member 'SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu::K2Node_ComponentBoundEvent_Value_1' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu, CallFunc_IsMouseInvertedXAxis_ReturnValue) == 0x00006C, "Member 'SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu::CallFunc_IsMouseInvertedXAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu, CallFunc_SetChecked_ReturnValue) == 0x00006D, "Member 'SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu::CallFunc_SetChecked_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu, K2Node_ComponentBoundEvent_CheckBox_2) == 0x000070, "Member 'SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu::K2Node_ComponentBoundEvent_CheckBox_2' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu, K2Node_ComponentBoundEvent_bIsChecked_1) == 0x000078, "Member 'SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu::K2Node_ComponentBoundEvent_bIsChecked_1' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu, K2Node_ComponentBoundEvent_Value) == 0x00007C, "Member 'SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu, K2Node_ComponentBoundEvent_CheckBox_1) == 0x000080, "Member 'SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu::K2Node_ComponentBoundEvent_CheckBox_1' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu, K2Node_ComponentBoundEvent_CheckBox) == 0x000088, "Member 'SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu::K2Node_ComponentBoundEvent_CheckBox' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu, K2Node_ComponentBoundEvent_bIsChecked) == 0x000090, "Member 'SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu, CallFunc_GetUserSettings_ReturnValue_5) == 0x000098, "Member 'SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu::CallFunc_GetUserSettings_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu, CallFunc_GetUserSettings_ReturnValue_6) == 0x0000A0, "Member 'SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu::CallFunc_GetUserSettings_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu, CallFunc_IsMouseInvertedYAxis_ReturnValue) == 0x0000A8, "Member 'SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu::CallFunc_IsMouseInvertedYAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu, CallFunc_GetUserSettings_ReturnValue_7) == 0x0000B0, "Member 'SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu::CallFunc_GetUserSettings_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu, CallFunc_SetChecked_ReturnValue_1) == 0x0000B8, "Member 'SettingsKeyboardMenu_C_ExecuteUbergraph_SettingsKeyboardMenu::CallFunc_SetChecked_ReturnValue_1' has a wrong offset!");

// Function SettingsKeyboardMenu.SettingsKeyboardMenu_C.BndEvt__InvertY_K2Node_ComponentBoundEvent_5_OnCheckBoxSettingChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct SettingsKeyboardMenu_C_BndEvt__InvertY_K2Node_ComponentBoundEvent_5_OnCheckBoxSettingChanged__DelegateSignature final
{
public:
	class UMarinerSettingCheckBox*                CheckBox;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsChecked;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsKeyboardMenu_C_BndEvt__InvertY_K2Node_ComponentBoundEvent_5_OnCheckBoxSettingChanged__DelegateSignature) == 0x000008, "Wrong alignment on SettingsKeyboardMenu_C_BndEvt__InvertY_K2Node_ComponentBoundEvent_5_OnCheckBoxSettingChanged__DelegateSignature");
static_assert(sizeof(SettingsKeyboardMenu_C_BndEvt__InvertY_K2Node_ComponentBoundEvent_5_OnCheckBoxSettingChanged__DelegateSignature) == 0x000010, "Wrong size on SettingsKeyboardMenu_C_BndEvt__InvertY_K2Node_ComponentBoundEvent_5_OnCheckBoxSettingChanged__DelegateSignature");
static_assert(offsetof(SettingsKeyboardMenu_C_BndEvt__InvertY_K2Node_ComponentBoundEvent_5_OnCheckBoxSettingChanged__DelegateSignature, CheckBox) == 0x000000, "Member 'SettingsKeyboardMenu_C_BndEvt__InvertY_K2Node_ComponentBoundEvent_5_OnCheckBoxSettingChanged__DelegateSignature::CheckBox' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_BndEvt__InvertY_K2Node_ComponentBoundEvent_5_OnCheckBoxSettingChanged__DelegateSignature, bIsChecked) == 0x000008, "Member 'SettingsKeyboardMenu_C_BndEvt__InvertY_K2Node_ComponentBoundEvent_5_OnCheckBoxSettingChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function SettingsKeyboardMenu.SettingsKeyboardMenu_C.BndEvt__InvertY_K2Node_ComponentBoundEvent_4_OnCheckBoxSettingInit__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SettingsKeyboardMenu_C_BndEvt__InvertY_K2Node_ComponentBoundEvent_4_OnCheckBoxSettingInit__DelegateSignature final
{
public:
	class UMarinerSettingCheckBox*                CheckBox;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsKeyboardMenu_C_BndEvt__InvertY_K2Node_ComponentBoundEvent_4_OnCheckBoxSettingInit__DelegateSignature) == 0x000008, "Wrong alignment on SettingsKeyboardMenu_C_BndEvt__InvertY_K2Node_ComponentBoundEvent_4_OnCheckBoxSettingInit__DelegateSignature");
static_assert(sizeof(SettingsKeyboardMenu_C_BndEvt__InvertY_K2Node_ComponentBoundEvent_4_OnCheckBoxSettingInit__DelegateSignature) == 0x000008, "Wrong size on SettingsKeyboardMenu_C_BndEvt__InvertY_K2Node_ComponentBoundEvent_4_OnCheckBoxSettingInit__DelegateSignature");
static_assert(offsetof(SettingsKeyboardMenu_C_BndEvt__InvertY_K2Node_ComponentBoundEvent_4_OnCheckBoxSettingInit__DelegateSignature, CheckBox) == 0x000000, "Member 'SettingsKeyboardMenu_C_BndEvt__InvertY_K2Node_ComponentBoundEvent_4_OnCheckBoxSettingInit__DelegateSignature::CheckBox' has a wrong offset!");

// Function SettingsKeyboardMenu.SettingsKeyboardMenu_C.BndEvt__MouseSensitivityX_K2Node_ComponentBoundEvent_37_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct SettingsKeyboardMenu_C_BndEvt__MouseSensitivityX_K2Node_ComponentBoundEvent_37_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsKeyboardMenu_C_BndEvt__MouseSensitivityX_K2Node_ComponentBoundEvent_37_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on SettingsKeyboardMenu_C_BndEvt__MouseSensitivityX_K2Node_ComponentBoundEvent_37_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(SettingsKeyboardMenu_C_BndEvt__MouseSensitivityX_K2Node_ComponentBoundEvent_37_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on SettingsKeyboardMenu_C_BndEvt__MouseSensitivityX_K2Node_ComponentBoundEvent_37_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(SettingsKeyboardMenu_C_BndEvt__MouseSensitivityX_K2Node_ComponentBoundEvent_37_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'SettingsKeyboardMenu_C_BndEvt__MouseSensitivityX_K2Node_ComponentBoundEvent_37_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function SettingsKeyboardMenu.SettingsKeyboardMenu_C.BndEvt__InvertX_K2Node_ComponentBoundEvent_1_OnCheckBoxSettingChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct SettingsKeyboardMenu_C_BndEvt__InvertX_K2Node_ComponentBoundEvent_1_OnCheckBoxSettingChanged__DelegateSignature final
{
public:
	class UMarinerSettingCheckBox*                CheckBox;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsChecked;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsKeyboardMenu_C_BndEvt__InvertX_K2Node_ComponentBoundEvent_1_OnCheckBoxSettingChanged__DelegateSignature) == 0x000008, "Wrong alignment on SettingsKeyboardMenu_C_BndEvt__InvertX_K2Node_ComponentBoundEvent_1_OnCheckBoxSettingChanged__DelegateSignature");
static_assert(sizeof(SettingsKeyboardMenu_C_BndEvt__InvertX_K2Node_ComponentBoundEvent_1_OnCheckBoxSettingChanged__DelegateSignature) == 0x000010, "Wrong size on SettingsKeyboardMenu_C_BndEvt__InvertX_K2Node_ComponentBoundEvent_1_OnCheckBoxSettingChanged__DelegateSignature");
static_assert(offsetof(SettingsKeyboardMenu_C_BndEvt__InvertX_K2Node_ComponentBoundEvent_1_OnCheckBoxSettingChanged__DelegateSignature, CheckBox) == 0x000000, "Member 'SettingsKeyboardMenu_C_BndEvt__InvertX_K2Node_ComponentBoundEvent_1_OnCheckBoxSettingChanged__DelegateSignature::CheckBox' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_BndEvt__InvertX_K2Node_ComponentBoundEvent_1_OnCheckBoxSettingChanged__DelegateSignature, bIsChecked) == 0x000008, "Member 'SettingsKeyboardMenu_C_BndEvt__InvertX_K2Node_ComponentBoundEvent_1_OnCheckBoxSettingChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function SettingsKeyboardMenu.SettingsKeyboardMenu_C.BndEvt__MouseSensitivityY_K2Node_ComponentBoundEvent_38_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct SettingsKeyboardMenu_C_BndEvt__MouseSensitivityY_K2Node_ComponentBoundEvent_38_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsKeyboardMenu_C_BndEvt__MouseSensitivityY_K2Node_ComponentBoundEvent_38_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on SettingsKeyboardMenu_C_BndEvt__MouseSensitivityY_K2Node_ComponentBoundEvent_38_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(SettingsKeyboardMenu_C_BndEvt__MouseSensitivityY_K2Node_ComponentBoundEvent_38_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on SettingsKeyboardMenu_C_BndEvt__MouseSensitivityY_K2Node_ComponentBoundEvent_38_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(SettingsKeyboardMenu_C_BndEvt__MouseSensitivityY_K2Node_ComponentBoundEvent_38_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'SettingsKeyboardMenu_C_BndEvt__MouseSensitivityY_K2Node_ComponentBoundEvent_38_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function SettingsKeyboardMenu.SettingsKeyboardMenu_C.BP_OnEntered
// 0x0001 (0x0001 - 0x0000)
struct SettingsKeyboardMenu_C_BP_OnEntered final
{
public:
	bool                                          bFromSubMenu;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsKeyboardMenu_C_BP_OnEntered) == 0x000001, "Wrong alignment on SettingsKeyboardMenu_C_BP_OnEntered");
static_assert(sizeof(SettingsKeyboardMenu_C_BP_OnEntered) == 0x000001, "Wrong size on SettingsKeyboardMenu_C_BP_OnEntered");
static_assert(offsetof(SettingsKeyboardMenu_C_BP_OnEntered, bFromSubMenu) == 0x000000, "Member 'SettingsKeyboardMenu_C_BP_OnEntered::bFromSubMenu' has a wrong offset!");

// Function SettingsKeyboardMenu.SettingsKeyboardMenu_C.BndEvt__InvertX_K2Node_ComponentBoundEvent_0_OnCheckBoxSettingInit__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SettingsKeyboardMenu_C_BndEvt__InvertX_K2Node_ComponentBoundEvent_0_OnCheckBoxSettingInit__DelegateSignature final
{
public:
	class UMarinerSettingCheckBox*                CheckBox;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsKeyboardMenu_C_BndEvt__InvertX_K2Node_ComponentBoundEvent_0_OnCheckBoxSettingInit__DelegateSignature) == 0x000008, "Wrong alignment on SettingsKeyboardMenu_C_BndEvt__InvertX_K2Node_ComponentBoundEvent_0_OnCheckBoxSettingInit__DelegateSignature");
static_assert(sizeof(SettingsKeyboardMenu_C_BndEvt__InvertX_K2Node_ComponentBoundEvent_0_OnCheckBoxSettingInit__DelegateSignature) == 0x000008, "Wrong size on SettingsKeyboardMenu_C_BndEvt__InvertX_K2Node_ComponentBoundEvent_0_OnCheckBoxSettingInit__DelegateSignature");
static_assert(offsetof(SettingsKeyboardMenu_C_BndEvt__InvertX_K2Node_ComponentBoundEvent_0_OnCheckBoxSettingInit__DelegateSignature, CheckBox) == 0x000000, "Member 'SettingsKeyboardMenu_C_BndEvt__InvertX_K2Node_ComponentBoundEvent_0_OnCheckBoxSettingInit__DelegateSignature::CheckBox' has a wrong offset!");

// Function SettingsKeyboardMenu.SettingsKeyboardMenu_C.BndEvt__MouseSensitivityY_K2Node_ComponentBoundEvent_3_OnSliderSettingInit__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SettingsKeyboardMenu_C_BndEvt__MouseSensitivityY_K2Node_ComponentBoundEvent_3_OnSliderSettingInit__DelegateSignature final
{
public:
	class UMarinerSettingSlider*                  Slider;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsKeyboardMenu_C_BndEvt__MouseSensitivityY_K2Node_ComponentBoundEvent_3_OnSliderSettingInit__DelegateSignature) == 0x000008, "Wrong alignment on SettingsKeyboardMenu_C_BndEvt__MouseSensitivityY_K2Node_ComponentBoundEvent_3_OnSliderSettingInit__DelegateSignature");
static_assert(sizeof(SettingsKeyboardMenu_C_BndEvt__MouseSensitivityY_K2Node_ComponentBoundEvent_3_OnSliderSettingInit__DelegateSignature) == 0x000008, "Wrong size on SettingsKeyboardMenu_C_BndEvt__MouseSensitivityY_K2Node_ComponentBoundEvent_3_OnSliderSettingInit__DelegateSignature");
static_assert(offsetof(SettingsKeyboardMenu_C_BndEvt__MouseSensitivityY_K2Node_ComponentBoundEvent_3_OnSliderSettingInit__DelegateSignature, Slider) == 0x000000, "Member 'SettingsKeyboardMenu_C_BndEvt__MouseSensitivityY_K2Node_ComponentBoundEvent_3_OnSliderSettingInit__DelegateSignature::Slider' has a wrong offset!");

// Function SettingsKeyboardMenu.SettingsKeyboardMenu_C.BndEvt__MouseSensitivityX_K2Node_ComponentBoundEvent_2_OnSliderSettingInit__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SettingsKeyboardMenu_C_BndEvt__MouseSensitivityX_K2Node_ComponentBoundEvent_2_OnSliderSettingInit__DelegateSignature final
{
public:
	class UMarinerSettingSlider*                  Slider;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsKeyboardMenu_C_BndEvt__MouseSensitivityX_K2Node_ComponentBoundEvent_2_OnSliderSettingInit__DelegateSignature) == 0x000008, "Wrong alignment on SettingsKeyboardMenu_C_BndEvt__MouseSensitivityX_K2Node_ComponentBoundEvent_2_OnSliderSettingInit__DelegateSignature");
static_assert(sizeof(SettingsKeyboardMenu_C_BndEvt__MouseSensitivityX_K2Node_ComponentBoundEvent_2_OnSliderSettingInit__DelegateSignature) == 0x000008, "Wrong size on SettingsKeyboardMenu_C_BndEvt__MouseSensitivityX_K2Node_ComponentBoundEvent_2_OnSliderSettingInit__DelegateSignature");
static_assert(offsetof(SettingsKeyboardMenu_C_BndEvt__MouseSensitivityX_K2Node_ComponentBoundEvent_2_OnSliderSettingInit__DelegateSignature, Slider) == 0x000000, "Member 'SettingsKeyboardMenu_C_BndEvt__MouseSensitivityX_K2Node_ComponentBoundEvent_2_OnSliderSettingInit__DelegateSignature::Slider' has a wrong offset!");

// Function SettingsKeyboardMenu.SettingsKeyboardMenu_C.HandleInput
// 0x01B0 (0x01B0 - 0x0000)
struct SettingsKeyboardMenu_C_HandleInput final
{
public:
	EMarinerInputActions                          InInput;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameInstance*                   CallFunc_GetMarinerGameInstance_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FKey& KeyPressed)>      K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(struct FKey& KeyPressed)>      K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMarinerMessageBoxData                 K2Node_MakeStruct_MarinerMessageBoxData;           // 0x0038(0x0170)(ContainsInstancedReference)
	bool                                          CallFunc_HandleInput_ReturnValue;                  // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsKeyboardMenu_C_HandleInput) == 0x000008, "Wrong alignment on SettingsKeyboardMenu_C_HandleInput");
static_assert(sizeof(SettingsKeyboardMenu_C_HandleInput) == 0x0001B0, "Wrong size on SettingsKeyboardMenu_C_HandleInput");
static_assert(offsetof(SettingsKeyboardMenu_C_HandleInput, InInput) == 0x000000, "Member 'SettingsKeyboardMenu_C_HandleInput::InInput' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_HandleInput, ReturnValue) == 0x000001, "Member 'SettingsKeyboardMenu_C_HandleInput::ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_HandleInput, CallFunc_GetMarinerGameInstance_ReturnValue) == 0x000008, "Member 'SettingsKeyboardMenu_C_HandleInput::CallFunc_GetMarinerGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_HandleInput, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'SettingsKeyboardMenu_C_HandleInput::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_HandleInput, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'SettingsKeyboardMenu_C_HandleInput::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_HandleInput, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'SettingsKeyboardMenu_C_HandleInput::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_HandleInput, K2Node_MakeStruct_MarinerMessageBoxData) == 0x000038, "Member 'SettingsKeyboardMenu_C_HandleInput::K2Node_MakeStruct_MarinerMessageBoxData' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_HandleInput, CallFunc_HandleInput_ReturnValue) == 0x0001A8, "Member 'SettingsKeyboardMenu_C_HandleInput::CallFunc_HandleInput_ReturnValue' has a wrong offset!");

// Function SettingsKeyboardMenu.SettingsKeyboardMenu_C.RestoreDefaultsConfirm
// 0x0048 (0x0048 - 0x0000)
struct SettingsKeyboardMenu_C_RestoreDefaultsConfirm final
{
public:
	struct FKey                                   KeyPressed;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	class UMarinerInputGlobals*                   CallFunc_GetInputGlobals_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameInstance*                   K2Node_DynamicCast_AsMariner_Game_Instance;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerInputOverlay*                   CallFunc_GetInputOverlay_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsKeyboardMenu_C_RestoreDefaultsConfirm) == 0x000008, "Wrong alignment on SettingsKeyboardMenu_C_RestoreDefaultsConfirm");
static_assert(sizeof(SettingsKeyboardMenu_C_RestoreDefaultsConfirm) == 0x000048, "Wrong size on SettingsKeyboardMenu_C_RestoreDefaultsConfirm");
static_assert(offsetof(SettingsKeyboardMenu_C_RestoreDefaultsConfirm, KeyPressed) == 0x000000, "Member 'SettingsKeyboardMenu_C_RestoreDefaultsConfirm::KeyPressed' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_RestoreDefaultsConfirm, CallFunc_GetInputGlobals_ReturnValue) == 0x000018, "Member 'SettingsKeyboardMenu_C_RestoreDefaultsConfirm::CallFunc_GetInputGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_RestoreDefaultsConfirm, CallFunc_GetGameInstance_ReturnValue) == 0x000020, "Member 'SettingsKeyboardMenu_C_RestoreDefaultsConfirm::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_RestoreDefaultsConfirm, CallFunc_GetUserSettings_ReturnValue) == 0x000028, "Member 'SettingsKeyboardMenu_C_RestoreDefaultsConfirm::CallFunc_GetUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_RestoreDefaultsConfirm, K2Node_DynamicCast_AsMariner_Game_Instance) == 0x000030, "Member 'SettingsKeyboardMenu_C_RestoreDefaultsConfirm::K2Node_DynamicCast_AsMariner_Game_Instance' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_RestoreDefaultsConfirm, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'SettingsKeyboardMenu_C_RestoreDefaultsConfirm::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SettingsKeyboardMenu_C_RestoreDefaultsConfirm, CallFunc_GetInputOverlay_ReturnValue) == 0x000040, "Member 'SettingsKeyboardMenu_C_RestoreDefaultsConfirm::CallFunc_GetInputOverlay_ReturnValue' has a wrong offset!");

// Function SettingsKeyboardMenu.SettingsKeyboardMenu_C.DummyCallback
// 0x0018 (0x0018 - 0x0000)
struct SettingsKeyboardMenu_C_DummyCallback final
{
public:
	struct FKey                                   KeyPressed;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(SettingsKeyboardMenu_C_DummyCallback) == 0x000008, "Wrong alignment on SettingsKeyboardMenu_C_DummyCallback");
static_assert(sizeof(SettingsKeyboardMenu_C_DummyCallback) == 0x000018, "Wrong size on SettingsKeyboardMenu_C_DummyCallback");
static_assert(offsetof(SettingsKeyboardMenu_C_DummyCallback, KeyPressed) == 0x000000, "Member 'SettingsKeyboardMenu_C_DummyCallback::KeyPressed' has a wrong offset!");

}

