#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsVideoMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "InputCore_structs.hpp"
#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function SettingsVideoMenu.SettingsVideoMenu_C.ExecuteUbergraph_SettingsVideoMenu
// 0x02B0 (0x02B0 - 0x0000)
struct SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerSettingCheckBox*                K2Node_ComponentBoundEvent_CheckBox;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerSettingComboBox*                K2Node_ComponentBoundEvent_ComboBox_9;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerSettingComboBox*                K2Node_ComponentBoundEvent_ComboBox_8;             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerSettingComboBox*                K2Node_ComponentBoundEvent_ComboBox_7;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerSettingComboBox*                K2Node_ComponentBoundEvent_ComboBox_6;             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerSettingComboBox*                K2Node_ComponentBoundEvent_ComboBox_5;             // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerSettingComboBox*                K2Node_ComponentBoundEvent_ComboBox_4;             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerSettingComboBox*                K2Node_ComponentBoundEvent_ComboBox_3;             // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FIntPoint>                      CallFunc_GetSupportedFullscreenResolutions_Resolutions; // 0x0050(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_GetSupportedFullscreenResolutions_ReturnValue; // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_SelectedIndex_9;        // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_SelectedIndex_8;        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_SelectedIndex_7;        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_SelectedIndex_6;        // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_SelectedIndex_5;        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_1;            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWindowMode                                   CallFunc_GetFullscreenMode_ReturnValue;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVSyncEnabled_ReturnValue;               // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_2;            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPostProcessingQuality_ReturnValue;     // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_3;            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAntiAliasingQuality_ReturnValue;       // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_4;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_5;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFrameRateLimit_ReturnValue;            // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FIntPoint& NewSize)> K2Node_CreateDelegate_OutputDelegate;              // 0x00CC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_2;       // 0x00DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_3;       // 0x00DF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_4;       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_5;       // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_6;            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_7;            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_8;            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_9;            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameScreenPercentage_ReturnValue;      // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerSettingComboBox*                K2Node_ComponentBoundEvent_ComboBox_2;             // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_6;       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_7;       // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_8;       // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_9;       // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_10;      // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0120(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0130(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	int32                                         K2Node_ComponentBoundEvent_SelectedIndex_4;        // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerSettingComboBox*                K2Node_ComponentBoundEvent_ComboBox_1;             // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_SelectedIndex_3;        // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerSettingComboBox*                K2Node_ComponentBoundEvent_ComboBox;               // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_SelectedIndex_2;        // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_SelectedIndex_1;        // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_10;           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTextureQuality_ReturnValue;            // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_11;           // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_12;           // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShadowQuality_ReturnValue;             // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_13;           // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_14;           // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_15;           // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVisualEffectQuality_ReturnValue;       // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_16;           // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x01C8(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x01D8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_17;           // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_18;           // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSSRQuality_ReturnValue;                // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerSettingSlider*                  K2Node_ComponentBoundEvent_Slider;                 // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_19;           // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHorizontalFOV_ReturnValue;             // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_20;           // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeUnclamped_ReturnValue;            // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMarinerInputInterface> CallFunc_SetActiveInputWidget_InputWidget_CastInput; // 0x0258(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bFullScreen;                          // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_21;           // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWindowMode                                   CallFunc_GetFullscreenMode_ReturnValue_1;          // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameInstance*                   CallFunc_GetMarinerGameInstance_ReturnValue;       // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameInstance*                   CallFunc_GetMarinerGameInstance_ReturnValue_1;     // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_CustomEvent_NewSize;                        // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_SelectedIndex;          // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFromSubMenu;                         // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29D[0x3];                                      // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerSettingCheckBox*                K2Node_ComponentBoundEvent_CheckBox_1;             // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetChecked_ReturnValue;                   // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu) == 0x000008, "Wrong alignment on SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu");
static_assert(sizeof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu) == 0x0002B0, "Wrong size on SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, EntryPoint) == 0x000000, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, K2Node_ComponentBoundEvent_CheckBox) == 0x000008, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::K2Node_ComponentBoundEvent_CheckBox' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, K2Node_ComponentBoundEvent_bIsChecked) == 0x000010, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, K2Node_ComponentBoundEvent_ComboBox_9) == 0x000018, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::K2Node_ComponentBoundEvent_ComboBox_9' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, K2Node_ComponentBoundEvent_ComboBox_8) == 0x000020, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::K2Node_ComponentBoundEvent_ComboBox_8' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, K2Node_ComponentBoundEvent_ComboBox_7) == 0x000028, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::K2Node_ComponentBoundEvent_ComboBox_7' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, K2Node_ComponentBoundEvent_ComboBox_6) == 0x000030, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::K2Node_ComponentBoundEvent_ComboBox_6' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, K2Node_ComponentBoundEvent_ComboBox_5) == 0x000038, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::K2Node_ComponentBoundEvent_ComboBox_5' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, K2Node_ComponentBoundEvent_ComboBox_4) == 0x000040, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::K2Node_ComponentBoundEvent_ComboBox_4' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, K2Node_ComponentBoundEvent_ComboBox_3) == 0x000048, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::K2Node_ComponentBoundEvent_ComboBox_3' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetSupportedFullscreenResolutions_Resolutions) == 0x000050, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetSupportedFullscreenResolutions_Resolutions' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetSupportedFullscreenResolutions_ReturnValue) == 0x000060, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetSupportedFullscreenResolutions_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, K2Node_ComponentBoundEvent_SelectedIndex_9) == 0x000064, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::K2Node_ComponentBoundEvent_SelectedIndex_9' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, K2Node_ComponentBoundEvent_SelectedIndex_8) == 0x000068, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::K2Node_ComponentBoundEvent_SelectedIndex_8' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, K2Node_ComponentBoundEvent_SelectedIndex_7) == 0x00006C, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::K2Node_ComponentBoundEvent_SelectedIndex_7' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, K2Node_ComponentBoundEvent_SelectedIndex_6) == 0x000070, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::K2Node_ComponentBoundEvent_SelectedIndex_6' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, K2Node_SwitchInteger_CmpSuccess) == 0x000074, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, K2Node_SwitchInteger_CmpSuccess_1) == 0x000075, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, K2Node_ComponentBoundEvent_SelectedIndex_5) == 0x000078, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::K2Node_ComponentBoundEvent_SelectedIndex_5' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetUserSettings_ReturnValue) == 0x000080, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetUserSettings_ReturnValue_1) == 0x000088, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetFullscreenMode_ReturnValue) == 0x000090, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetFullscreenMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_IsVSyncEnabled_ReturnValue) == 0x000091, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_IsVSyncEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000094, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetUserSettings_ReturnValue_2) == 0x000098, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetUserSettings_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetPostProcessingQuality_ReturnValue) == 0x0000A0, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetPostProcessingQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetUserSettings_ReturnValue_3) == 0x0000A8, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetUserSettings_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetAntiAliasingQuality_ReturnValue) == 0x0000B0, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetAntiAliasingQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetUserSettings_ReturnValue_4) == 0x0000B8, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetUserSettings_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetUserSettings_ReturnValue_5) == 0x0000C0, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetUserSettings_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetFrameRateLimit_ReturnValue) == 0x0000C8, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetFrameRateLimit_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, K2Node_CreateDelegate_OutputDelegate) == 0x0000CC, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0000DC, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x0000DD, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_LessEqual_FloatFloat_ReturnValue_2) == 0x0000DE, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_LessEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_LessEqual_FloatFloat_ReturnValue_3) == 0x0000DF, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_LessEqual_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_LessEqual_FloatFloat_ReturnValue_4) == 0x0000E0, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_LessEqual_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_LessEqual_FloatFloat_ReturnValue_5) == 0x0000E1, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_LessEqual_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetUserSettings_ReturnValue_6) == 0x0000E8, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetUserSettings_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetUserSettings_ReturnValue_7) == 0x0000F0, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetUserSettings_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetUserSettings_ReturnValue_8) == 0x0000F8, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetUserSettings_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetUserSettings_ReturnValue_9) == 0x000100, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetUserSettings_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetGameScreenPercentage_ReturnValue) == 0x000108, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetGameScreenPercentage_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, K2Node_ComponentBoundEvent_ComboBox_2) == 0x000110, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::K2Node_ComponentBoundEvent_ComboBox_2' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_LessEqual_FloatFloat_ReturnValue_6) == 0x000118, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_LessEqual_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_LessEqual_FloatFloat_ReturnValue_7) == 0x000119, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_LessEqual_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_LessEqual_FloatFloat_ReturnValue_8) == 0x00011A, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_LessEqual_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_LessEqual_FloatFloat_ReturnValue_9) == 0x00011B, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_LessEqual_FloatFloat_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_LessEqual_FloatFloat_ReturnValue_10) == 0x00011C, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_LessEqual_FloatFloat_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, Temp_delegate_Variable) == 0x000120, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, Temp_struct_Variable) == 0x000130, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, K2Node_ComponentBoundEvent_SelectedIndex_4) == 0x000140, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::K2Node_ComponentBoundEvent_SelectedIndex_4' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, K2Node_ComponentBoundEvent_ComboBox_1) == 0x000148, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::K2Node_ComponentBoundEvent_ComboBox_1' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, K2Node_ComponentBoundEvent_SelectedIndex_3) == 0x000150, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::K2Node_ComponentBoundEvent_SelectedIndex_3' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, K2Node_ComponentBoundEvent_ComboBox) == 0x000158, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::K2Node_ComponentBoundEvent_ComboBox' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetGameUserSettings_ReturnValue) == 0x000160, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, K2Node_ComponentBoundEvent_SelectedIndex_2) == 0x000168, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::K2Node_ComponentBoundEvent_SelectedIndex_2' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_Conv_IntToByte_ReturnValue) == 0x00016C, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, K2Node_ComponentBoundEvent_SelectedIndex_1) == 0x000170, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::K2Node_ComponentBoundEvent_SelectedIndex_1' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetValidValue_ReturnValue) == 0x000174, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetUserSettings_ReturnValue_10) == 0x000178, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetUserSettings_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetTextureQuality_ReturnValue) == 0x000180, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetTextureQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetUserSettings_ReturnValue_11) == 0x000188, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetUserSettings_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetUserSettings_ReturnValue_12) == 0x000190, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetUserSettings_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetShadowQuality_ReturnValue) == 0x000198, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetShadowQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetUserSettings_ReturnValue_13) == 0x0001A0, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetUserSettings_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetUserSettings_ReturnValue_14) == 0x0001A8, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetUserSettings_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetUserSettings_ReturnValue_15) == 0x0001B0, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetUserSettings_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetVisualEffectQuality_ReturnValue) == 0x0001B8, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetVisualEffectQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetUserSettings_ReturnValue_16) == 0x0001C0, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetUserSettings_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, Temp_delegate_Variable_1) == 0x0001C8, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, Temp_struct_Variable_1) == 0x0001D8, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetUserSettings_ReturnValue_17) == 0x0001E8, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetUserSettings_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetUserSettings_ReturnValue_18) == 0x0001F0, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetUserSettings_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetSSRQuality_ReturnValue) == 0x0001F8, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetSSRQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, K2Node_ComponentBoundEvent_Slider) == 0x000200, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::K2Node_ComponentBoundEvent_Slider' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, K2Node_ComponentBoundEvent_Value) == 0x000208, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetUserSettings_ReturnValue_19) == 0x000210, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetUserSettings_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetHorizontalFOV_ReturnValue) == 0x000218, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetHorizontalFOV_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_BreakVector2D_X) == 0x00021C, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_BreakVector2D_Y) == 0x000220, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetUserSettings_ReturnValue_20) == 0x000228, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetUserSettings_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_MapRangeUnclamped_ReturnValue) == 0x000230, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_MapRangeUnclamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetOwningPlayer_ReturnValue) == 0x000238, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_PostEvent_ReturnValue) == 0x000240, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000248, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_PostEvent_ReturnValue_1) == 0x000250, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_SetActiveInputWidget_InputWidget_CastInput) == 0x000258, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_SetActiveInputWidget_InputWidget_CastInput' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, K2Node_Event_bFullScreen) == 0x000268, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::K2Node_Event_bFullScreen' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetUserSettings_ReturnValue_21) == 0x000270, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetUserSettings_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetFullscreenMode_ReturnValue_1) == 0x000278, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetFullscreenMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00027C, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetMarinerGameInstance_ReturnValue) == 0x000280, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetMarinerGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_GetMarinerGameInstance_ReturnValue_1) == 0x000288, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_GetMarinerGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, K2Node_CustomEvent_NewSize) == 0x000290, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::K2Node_CustomEvent_NewSize' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, K2Node_ComponentBoundEvent_SelectedIndex) == 0x000298, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::K2Node_ComponentBoundEvent_SelectedIndex' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, K2Node_Event_bFromSubMenu) == 0x00029C, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::K2Node_Event_bFromSubMenu' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, K2Node_ComponentBoundEvent_CheckBox_1) == 0x0002A0, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::K2Node_ComponentBoundEvent_CheckBox_1' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu, CallFunc_SetChecked_ReturnValue) == 0x0002A8, "Member 'SettingsVideoMenu_C_ExecuteUbergraph_SettingsVideoMenu::CallFunc_SetChecked_ReturnValue' has a wrong offset!");

// Function SettingsVideoMenu.SettingsVideoMenu_C.BndEvt__VSyncSettingNew_K2Node_ComponentBoundEvent_8_OnCheckBoxSettingChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct SettingsVideoMenu_C_BndEvt__VSyncSettingNew_K2Node_ComponentBoundEvent_8_OnCheckBoxSettingChanged__DelegateSignature final
{
public:
	class UMarinerSettingCheckBox*                CheckBox;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsChecked;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsVideoMenu_C_BndEvt__VSyncSettingNew_K2Node_ComponentBoundEvent_8_OnCheckBoxSettingChanged__DelegateSignature) == 0x000008, "Wrong alignment on SettingsVideoMenu_C_BndEvt__VSyncSettingNew_K2Node_ComponentBoundEvent_8_OnCheckBoxSettingChanged__DelegateSignature");
static_assert(sizeof(SettingsVideoMenu_C_BndEvt__VSyncSettingNew_K2Node_ComponentBoundEvent_8_OnCheckBoxSettingChanged__DelegateSignature) == 0x000010, "Wrong size on SettingsVideoMenu_C_BndEvt__VSyncSettingNew_K2Node_ComponentBoundEvent_8_OnCheckBoxSettingChanged__DelegateSignature");
static_assert(offsetof(SettingsVideoMenu_C_BndEvt__VSyncSettingNew_K2Node_ComponentBoundEvent_8_OnCheckBoxSettingChanged__DelegateSignature, CheckBox) == 0x000000, "Member 'SettingsVideoMenu_C_BndEvt__VSyncSettingNew_K2Node_ComponentBoundEvent_8_OnCheckBoxSettingChanged__DelegateSignature::CheckBox' has a wrong offset!");
static_assert(offsetof(SettingsVideoMenu_C_BndEvt__VSyncSettingNew_K2Node_ComponentBoundEvent_8_OnCheckBoxSettingChanged__DelegateSignature, bIsChecked) == 0x000008, "Member 'SettingsVideoMenu_C_BndEvt__VSyncSettingNew_K2Node_ComponentBoundEvent_8_OnCheckBoxSettingChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function SettingsVideoMenu.SettingsVideoMenu_C.BndEvt__VSyncSettingNew_K2Node_ComponentBoundEvent_7_OnCheckBoxSettingInit__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SettingsVideoMenu_C_BndEvt__VSyncSettingNew_K2Node_ComponentBoundEvent_7_OnCheckBoxSettingInit__DelegateSignature final
{
public:
	class UMarinerSettingCheckBox*                CheckBox;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsVideoMenu_C_BndEvt__VSyncSettingNew_K2Node_ComponentBoundEvent_7_OnCheckBoxSettingInit__DelegateSignature) == 0x000008, "Wrong alignment on SettingsVideoMenu_C_BndEvt__VSyncSettingNew_K2Node_ComponentBoundEvent_7_OnCheckBoxSettingInit__DelegateSignature");
static_assert(sizeof(SettingsVideoMenu_C_BndEvt__VSyncSettingNew_K2Node_ComponentBoundEvent_7_OnCheckBoxSettingInit__DelegateSignature) == 0x000008, "Wrong size on SettingsVideoMenu_C_BndEvt__VSyncSettingNew_K2Node_ComponentBoundEvent_7_OnCheckBoxSettingInit__DelegateSignature");
static_assert(offsetof(SettingsVideoMenu_C_BndEvt__VSyncSettingNew_K2Node_ComponentBoundEvent_7_OnCheckBoxSettingInit__DelegateSignature, CheckBox) == 0x000000, "Member 'SettingsVideoMenu_C_BndEvt__VSyncSettingNew_K2Node_ComponentBoundEvent_7_OnCheckBoxSettingInit__DelegateSignature::CheckBox' has a wrong offset!");

// Function SettingsVideoMenu.SettingsVideoMenu_C.BP_OnEntered
// 0x0001 (0x0001 - 0x0000)
struct SettingsVideoMenu_C_BP_OnEntered final
{
public:
	bool                                          bFromSubMenu;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsVideoMenu_C_BP_OnEntered) == 0x000001, "Wrong alignment on SettingsVideoMenu_C_BP_OnEntered");
static_assert(sizeof(SettingsVideoMenu_C_BP_OnEntered) == 0x000001, "Wrong size on SettingsVideoMenu_C_BP_OnEntered");
static_assert(offsetof(SettingsVideoMenu_C_BP_OnEntered, bFromSubMenu) == 0x000000, "Member 'SettingsVideoMenu_C_BP_OnEntered::bFromSubMenu' has a wrong offset!");

// Function SettingsVideoMenu.SettingsVideoMenu_C.BndEvt__ResolutionSetting_K2Node_ComponentBoundEvent_0_OnSelectionIndexChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct SettingsVideoMenu_C_BndEvt__ResolutionSetting_K2Node_ComponentBoundEvent_0_OnSelectionIndexChangedEvent__DelegateSignature final
{
public:
	int32                                         SelectedIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsVideoMenu_C_BndEvt__ResolutionSetting_K2Node_ComponentBoundEvent_0_OnSelectionIndexChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on SettingsVideoMenu_C_BndEvt__ResolutionSetting_K2Node_ComponentBoundEvent_0_OnSelectionIndexChangedEvent__DelegateSignature");
static_assert(sizeof(SettingsVideoMenu_C_BndEvt__ResolutionSetting_K2Node_ComponentBoundEvent_0_OnSelectionIndexChangedEvent__DelegateSignature) == 0x000004, "Wrong size on SettingsVideoMenu_C_BndEvt__ResolutionSetting_K2Node_ComponentBoundEvent_0_OnSelectionIndexChangedEvent__DelegateSignature");
static_assert(offsetof(SettingsVideoMenu_C_BndEvt__ResolutionSetting_K2Node_ComponentBoundEvent_0_OnSelectionIndexChangedEvent__DelegateSignature, SelectedIndex) == 0x000000, "Member 'SettingsVideoMenu_C_BndEvt__ResolutionSetting_K2Node_ComponentBoundEvent_0_OnSelectionIndexChangedEvent__DelegateSignature::SelectedIndex' has a wrong offset!");

// Function SettingsVideoMenu.SettingsVideoMenu_C.DisplayMetricChanged
// 0x0008 (0x0008 - 0x0000)
struct SettingsVideoMenu_C_DisplayMetricChanged final
{
public:
	struct FIntPoint                              NewSize;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsVideoMenu_C_DisplayMetricChanged) == 0x000004, "Wrong alignment on SettingsVideoMenu_C_DisplayMetricChanged");
static_assert(sizeof(SettingsVideoMenu_C_DisplayMetricChanged) == 0x000008, "Wrong size on SettingsVideoMenu_C_DisplayMetricChanged");
static_assert(offsetof(SettingsVideoMenu_C_DisplayMetricChanged, NewSize) == 0x000000, "Member 'SettingsVideoMenu_C_DisplayMetricChanged::NewSize' has a wrong offset!");

// Function SettingsVideoMenu.SettingsVideoMenu_C.OnFullScreenToggled
// 0x0001 (0x0001 - 0x0000)
struct SettingsVideoMenu_C_OnFullScreenToggled final
{
public:
	bool                                          bFullScreen;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsVideoMenu_C_OnFullScreenToggled) == 0x000001, "Wrong alignment on SettingsVideoMenu_C_OnFullScreenToggled");
static_assert(sizeof(SettingsVideoMenu_C_OnFullScreenToggled) == 0x000001, "Wrong size on SettingsVideoMenu_C_OnFullScreenToggled");
static_assert(offsetof(SettingsVideoMenu_C_OnFullScreenToggled, bFullScreen) == 0x000000, "Member 'SettingsVideoMenu_C_OnFullScreenToggled::bFullScreen' has a wrong offset!");

// Function SettingsVideoMenu.SettingsVideoMenu_C.BndEvt__FieldOfView_K2Node_ComponentBoundEvent_5_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct SettingsVideoMenu_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_5_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsVideoMenu_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_5_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on SettingsVideoMenu_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_5_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(SettingsVideoMenu_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_5_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on SettingsVideoMenu_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_5_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(SettingsVideoMenu_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_5_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'SettingsVideoMenu_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_5_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function SettingsVideoMenu.SettingsVideoMenu_C.BndEvt__FieldOfView_K2Node_ComponentBoundEvent_4_OnSliderSettingInit__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SettingsVideoMenu_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_4_OnSliderSettingInit__DelegateSignature final
{
public:
	class UMarinerSettingSlider*                  Slider;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsVideoMenu_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_4_OnSliderSettingInit__DelegateSignature) == 0x000008, "Wrong alignment on SettingsVideoMenu_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_4_OnSliderSettingInit__DelegateSignature");
static_assert(sizeof(SettingsVideoMenu_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_4_OnSliderSettingInit__DelegateSignature) == 0x000008, "Wrong size on SettingsVideoMenu_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_4_OnSliderSettingInit__DelegateSignature");
static_assert(offsetof(SettingsVideoMenu_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_4_OnSliderSettingInit__DelegateSignature, Slider) == 0x000000, "Member 'SettingsVideoMenu_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_4_OnSliderSettingInit__DelegateSignature::Slider' has a wrong offset!");

// Function SettingsVideoMenu.SettingsVideoMenu_C.BndEvt__SSRQuality_K2Node_ComponentBoundEvent_509_OnSelectionIndexChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct SettingsVideoMenu_C_BndEvt__SSRQuality_K2Node_ComponentBoundEvent_509_OnSelectionIndexChangedEvent__DelegateSignature final
{
public:
	int32                                         SelectedIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsVideoMenu_C_BndEvt__SSRQuality_K2Node_ComponentBoundEvent_509_OnSelectionIndexChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on SettingsVideoMenu_C_BndEvt__SSRQuality_K2Node_ComponentBoundEvent_509_OnSelectionIndexChangedEvent__DelegateSignature");
