#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsMenuStack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SettingsMenuStack.SettingsMenuStack_C
// 0x0078 (0x0710 - 0x0698)
class USettingsMenuStack_C final : public UMarinerMenuStackManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0698(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPrimaryStackButtonWidget_C*            Accessibility;                                     // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPrimaryStackButtonWidget_C*            Account;                                           // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPrimaryStackButtonWidget_C*            Audio;                                             // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPrimaryStackButtonWidget_C*            Controller;                                        // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USettingsDefaultStackBase_C*            DefaultStackBase;                                  // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPrimaryStackButtonWidget_C*            Game;                                              // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPrimaryStackButtonWidget_C*            Keyboard;                                          // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPrompt_C*                       LTPrompt;                                          // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerGridPanel*                      NavRibbon;                                         // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPrompt_C*                       RTPrompt;                                          // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTabBackground_C*                       TabBackground;                                     // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuTooltipBase_C*                     ToolTip;                                           // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPrimaryStackButtonWidget_C*            Video;                                             // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerHeader_C*                        ProfileElementRef;                                 // 0x0708(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SettingsMenuStack(int32 EntryPoint);
	void BP_OnExited(bool bToSubLayer);
	void Construct();
	bool HandleInput(EMarinerInputActions InInput);
	void UpdatePlayerHeaderIsOnGameTabs(bool bGameTabs);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SettingsMenuStack_C">();
	}
	static class USettingsMenuStack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USettingsMenuStack_C>();
	}
};
static_assert(alignof(USettingsMenuStack_C) == 0x000008, "Wrong alignment on USettingsMenuStack_C");
static_assert(sizeof(USettingsMenuStack_C) == 0x000710, "Wrong size on USettingsMenuStack_C");
static_assert(offsetof(USettingsMenuStack_C, UberGraphFrame) == 0x000698, "Member 'USettingsMenuStack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USettingsMenuStack_C, Accessibility) == 0x0006A0, "Member 'USettingsMenuStack_C::Accessibility' has a wrong offset!");
static_assert(offsetof(USettingsMenuStack_C, Account) == 0x0006A8, "Member 'USettingsMenuStack_C::Account' has a wrong offset!");
static_assert(offsetof(USettingsMenuStack_C, Audio) == 0x0006B0, "Member 'USettingsMenuStack_C::Audio' has a wrong offset!");
static_assert(offsetof(USettingsMenuStack_C, Controller) == 0x0006B8, "Member 'USettingsMenuStack_C::Controller' has a wrong offset!");
static_assert(offsetof(USettingsMenuStack_C, DefaultStackBase) == 0x0006C0, "Member 'USettingsMenuStack_C::DefaultStackBase' has a wrong offset!");
static_assert(offsetof(USettingsMenuStack_C, Game) == 0x0006C8, "Member 'USettingsMenuStack_C::Game' has a wrong offset!");
static_assert(offsetof(USettingsMenuStack_C, Keyboard) == 0x0006D0, "Member 'USettingsMenuStack_C::Keyboard' has a wrong offset!");
static_assert(offsetof(USettingsMenuStack_C, LTPrompt) == 0x0006D8, "Member 'USettingsMenuStack_C::LTPrompt' has a wrong offset!");
static_assert(offsetof(USettingsMenuStack_C, NavRibbon) == 0x0006E0, "Member 'USettingsMenuStack_C::NavRibbon' has a wrong offset!");
static_assert(offsetof(USettingsMenuStack_C, RTPrompt) == 0x0006E8, "Member 'USettingsMenuStack_C::RTPrompt' has a wrong offset!");
static_assert(offsetof(USettingsMenuStack_C, TabBackground) == 0x0006F0, "Member 'USettingsMenuStack_C::TabBackground' has a wrong offset!");
static_assert(offsetof(USettingsMenuStack_C, ToolTip) == 0x0006F8, "Member 'USettingsMenuStack_C::ToolTip' has a wrong offset!");
static_assert(offsetof(USettingsMenuStack_C, Video) == 0x000700, "Member 'USettingsMenuStack_C::Video' has a wrong offset!");
static_assert(offsetof(USettingsMenuStack_C, ProfileElementRef) == 0x000708, "Member 'USettingsMenuStack_C::ProfileElementRef' has a wrong offset!");

}

