#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsVideoMenu

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Mariner_structs.hpp"
#include "Mariner_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SettingsVideoMenu.SettingsVideoMenu_C
// 0x0078 (0x0570 - 0x04F8)
class USettingsVideoMenu_C final : public UMarinerSettingMenuBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UComboBoxSetting_C*                     AntiAliasing;                                      // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxSetting_C*                     EffectsQuality;                                    // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USliderSetting_C*                       FieldOfView;                                       // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxSetting_C*                     FrameRate;                                         // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxSetting_C*                     PostProcessing;                                    // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxSetting_C*                     Resolution;                                        // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxSetting_C*                     ScreenPercentage;                                  // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerVerticalBox*                    SettingsPanel;                                     // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxSetting_C*                     ShadowQuality;                                     // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxSetting_C*                     SSRQuality;                                        // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxSetting_C*                     TextureQuality;                                    // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBoxSetting_C*                     VSyncSetting;                                      // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxSetting_C*                     WindowMode;                                        // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FIntPoint                              LastResolution;                                    // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SettingsVideoMenu(int32 EntryPoint);
	void BndEvt__VSyncSettingNew_K2Node_ComponentBoundEvent_8_OnCheckBoxSettingChanged__DelegateSignature(class UMarinerSettingCheckBox* CheckBox, bool bIsChecked);
	void BndEvt__VSyncSettingNew_K2Node_ComponentBoundEvent_7_OnCheckBoxSettingInit__DelegateSignature(class UMarinerSettingCheckBox* CheckBox);
	void BP_OnEntered(bool bFromSubMenu);
	void BndEvt__ResolutionSetting_K2Node_ComponentBoundEvent_0_OnSelectionIndexChangedEvent__DelegateSignature(int32 SelectedIndex);
	void DisplayMetricChanged(const struct FIntPoint& NewSize);
	void Destruct();
	void Construct();
	void OnFullScreenToggled(bool bFullScreen);
	void BndEvt__FieldOfView_K2Node_ComponentBoundEvent_5_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__FieldOfView_K2Node_ComponentBoundEvent_4_OnSliderSettingInit__DelegateSignature(class UMarinerSettingSlider* Slider);
	void BndEvt__SSRQuality_K2Node_ComponentBoundEvent_509_OnSelectionIndexChangedEvent__DelegateSignature(int32 SelectedIndex);
	void BndEvt__WindowModeSetting_K2Node_ComponentBoundEvent_0_OnSelectionIndexChangedEvent__DelegateSignature(int32 SelectedIndex);
	void BndEvt__SSRQuality_K2Node_ComponentBoundEvent_463_OnComboBoxSettingInit__DelegateSignature(class UMarinerSettingComboBox* ComboBox);
	void BndEvt__ShadowQuality_K2Node_ComponentBoundEvent_419_OnSelectionIndexChangedEvent__DelegateSignature(int32 SelectedIndex);
	void BndEvt__ShadowQuality_K2Node_ComponentBoundEvent_358_OnComboBoxSettingInit__DelegateSignature(class UMarinerSettingComboBox* ComboBox);
	void BndEvt__TextureQuality_K2Node_ComponentBoundEvent_340_OnSelectionIndexChangedEvent__DelegateSignature(int32 SelectedIndex);
	void BndEvt__TextureQuality_K2Node_ComponentBoundEvent_284_OnComboBoxSettingInit__DelegateSignature(class UMarinerSettingComboBox* ComboBox);
	void BndEvt__GraphicsQuality_K2Node_ComponentBoundEvent_6_OnSelectionIndexChangedEvent__DelegateSignature(int32 SelectedIndex);
	void BndEvt__FrameRate_K2Node_ComponentBoundEvent_28_OnSelectionIndexChangedEvent__DelegateSignature(int32 SelectedIndex);
	void BndEvt__ComboBoxSetting_C_0_K2Node_ComponentBoundEvent_9_OnSelectionIndexChangedEvent__DelegateSignature(int32 SelectedIndex);
	void BndEvt__PostProcessing_K2Node_ComponentBoundEvent_12_OnSelectionIndexChangedEvent__DelegateSignature(int32 SelectedIndex);
	void BndEvt__AntiAliasing_K2Node_ComponentBoundEvent_14_OnSelectionIndexChangedEvent__DelegateSignature(int32 SelectedIndex);
	void BndEvt__AntiAliasing_K2Node_ComponentBoundEvent_84_OnComboBoxSettingInit__DelegateSignature(class UMarinerSettingComboBox* ComboBox);
	void BndEvt__PostProcessing_K2Node_ComponentBoundEvent_69_OnComboBoxSettingInit__DelegateSignature(class UMarinerSettingComboBox* ComboBox);
	void BndEvt__ScreenQuality_K2Node_ComponentBoundEvent_55_OnComboBoxSettingInit__DelegateSignature(class UMarinerSettingComboBox* ComboBox);
	void BndEvt__FrameRate_K2Node_ComponentBoundEvent_30_OnComboBoxSettingInit__DelegateSignature(class UMarinerSettingComboBox* ComboBox);
	void BndEvt__GraphicsQuality_K2Node_ComponentBoundEvent_18_OnComboBoxSettingInit__DelegateSignature(class UMarinerSettingComboBox* ComboBox);
	void BndEvt__WindowMode_K2Node_ComponentBoundEvent_3_OnComboBoxSettingInit__DelegateSignature(class UMarinerSettingComboBox* ComboBox);
	void BndEvt__Resolution_K2Node_ComponentBoundEvent_0_OnComboBoxSettingInit__DelegateSignature(class UMarinerSettingComboBox* ComboBox);
	void ApplyResolution(int32 Width, int32 Height);
	bool HandleInput(EMarinerInputActions InInput);
	void RestoreDefaultsConfirm(struct FKey& KeyPressed);
	void DummyCallback(struct FKey& KeyPressed);
	void ApplyResolutionCancel(struct FKey& KeyPressed);
	void UpdateResolutionEnabled();
	void BuildResolutionOptions();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SettingsVideoMenu_C">();
	}
	static class USettingsVideoMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USettingsVideoMenu_C>();
	}
};
static_assert(alignof(USettingsVideoMenu_C) == 0x000008, "Wrong alignment on USettingsVideoMenu_C");
static_assert(sizeof(USettingsVideoMenu_C) == 0x000570, "Wrong size on USettingsVideoMenu_C");
static_assert(offsetof(USettingsVideoMenu_C, UberGraphFrame) == 0x0004F8, "Member 'USettingsVideoMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USettingsVideoMenu_C, AntiAliasing) == 0x000500, "Member 'USettingsVideoMenu_C::AntiAliasing' has a wrong offset!");
static_assert(offsetof(USettingsVideoMenu_C, EffectsQuality) == 0x000508, "Member 'USettingsVideoMenu_C::EffectsQuality' has a wrong offset!");
static_assert(offsetof(USettingsVideoMenu_C, FieldOfView) == 0x000510, "Member 'USettingsVideoMenu_C::FieldOfView' has a wrong offset!");
static_assert(offsetof(USettingsVideoMenu_C, FrameRate) == 0x000518, "Member 'USettingsVideoMenu_C::FrameRate' has a wrong offset!");
static_assert(offsetof(USettingsVideoMenu_C, PostProcessing) == 0x000520, "Member 'USettingsVideoMenu_C::PostProcessing' has a wrong offset!");
static_assert(offsetof(USettingsVideoMenu_C, Resolution) == 0x000528, "Member 'USettingsVideoMenu_C::Resolution' has a wrong offset!");
static_assert(offsetof(USettingsVideoMenu_C, ScreenPercentage) == 0x000530, "Member 'USettingsVideoMenu_C::ScreenPercentage' has a wrong offset!");
static_assert(offsetof(USettingsVideoMenu_C, SettingsPanel) == 0x000538, "Member 'USettingsVideoMenu_C::SettingsPanel' has a wrong offset!");
static_assert(offsetof(USettingsVideoMenu_C, ShadowQuality) == 0x000540, "Member 'USettingsVideoMenu_C::ShadowQuality' has a wrong offset!");
static_assert(offsetof(USettingsVideoMenu_C, SSRQuality) == 0x000548, "Member 'USettingsVideoMenu_C::SSRQuality' has a wrong offset!");
static_assert(offsetof(USettingsVideoMenu_C, TextureQuality) == 0x000550, "Member 'USettingsVideoMenu_C::TextureQuality' has a wrong offset!");
static_assert(offsetof(USettingsVideoMenu_C, VSyncSetting) == 0x000558, "Member 'USettingsVideoMenu_C::VSyncSetting' has a wrong offset!");
static_assert(offsetof(USettingsVideoMenu_C, WindowMode) == 0x000560, "Member 'USettingsVideoMenu_C::WindowMode' has a wrong offset!");
static_assert(offsetof(USettingsVideoMenu_C, LastResolution) == 0x000568, "Member 'USettingsVideoMenu_C::LastResolution' has a wrong offset!");

}

