#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsControllerMenu

#include "Basic.hpp"

#include "Mariner_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SettingsControllerMenu.SettingsControllerMenu_C.ExecuteUbergraph_SettingsControllerMenu
// 0x0250 (0x0250 - 0x0000)
struct SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMarinerGlobals_IsValid;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGlobals*                        CallFunc_GetMarinerGlobals_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_SelectedIndex_1;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerInputGlobals*                   CallFunc_GetInputGlobals_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerSettingCheckBox*                K2Node_ComponentBoundEvent_CheckBox_4;             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	class UMarinerSettingCheckBox*                K2Node_ComponentBoundEvent_CheckBox_3;             // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerSettingCheckBox*                K2Node_ComponentBoundEvent_CheckBox_2;             // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMarinerControllerConfigurationLocalization CallFunc_GetDataTableRowFromName_OutRow;           // 0x0070(0x0028)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_1;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_2;            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_3;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetControllerInversionVertical_ReturnValue; // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_4;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetChecked_ReturnValue;                   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetControllerInversionHorizontal_ReturnValue; // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_5;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetChecked_ReturnValue_1;                 // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_6;            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_7;            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetVibrationEnabled_ReturnValue;          // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerSettingComboBox*                K2Node_ComponentBoundEvent_ComboBox_1;             // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetChecked_ReturnValue_2;                 // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_8;            // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetControllerConfiguration_ReturnValue;   // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_9;            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_10;           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerSettingCheckBox*                K2Node_ComponentBoundEvent_CheckBox_1;             // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetStickAccelerationEnabled_ReturnValue;  // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerSettingCheckBox*                K2Node_ComponentBoundEvent_CheckBox;               // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetChecked_ReturnValue_3;                 // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerSettingSlider*                  K2Node_ComponentBoundEvent_Slider;                 // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMarinerCharacter*                      K2Node_DynamicCast_AsMariner_Character;            // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetMarinerGlobals_IsValid_1;              // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGlobals*                        CallFunc_GetMarinerGlobals_ReturnValue_1;          // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerInputGlobals*                   CallFunc_GetInputGlobals_ReturnValue_1;            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_11;           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             CallFunc_GetSensitivitySettings_ReturnValue;       // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSensitivitySpecification_ReturnValue;  // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames_1;       // 0x0190(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_12;           // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFromSubMenu;                         // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerSettingCheckBox*                K2Node_ComponentBoundEvent_CheckBox_5;             // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_1;           // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X;                          // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerSettingCheckBox*                K2Node_ComponentBoundEvent_CheckBox_6;             // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_2;           // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bToSubLayer;                          // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerInputType                              K2Node_Event_InputType;                            // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FE[0x2];                                      // 0x01FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMarinerInputInterface> CallFunc_SetActiveInputWidget_InputWidget_CastInput; // 0x0200(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMarinerSettingCheckBox*                K2Node_ComponentBoundEvent_CheckBox_7;             // 0x0210(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_3;           // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerSettingComboBox*                K2Node_ComponentBoundEvent_ComboBox;               // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_13;           // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMarinerAimAssistState                        CallFunc_GetAimAssistState_ReturnValue;            // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AimAssistStateToIndex_Index;              // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_SelectedIndex;          // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMarinerAimAssistState                        CallFunc_IndexToAimAssistState_AimAssistState;     // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu) == 0x000008, "Wrong alignment on SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu");
static_assert(sizeof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu) == 0x000250, "Wrong size on SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, EntryPoint) == 0x000000, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetUserSettings_ReturnValue) == 0x000008, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetMarinerGlobals_IsValid) == 0x000010, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetMarinerGlobals_IsValid' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetMarinerGlobals_ReturnValue) == 0x000018, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetMarinerGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, K2Node_ComponentBoundEvent_SelectedIndex_1) == 0x000020, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::K2Node_ComponentBoundEvent_SelectedIndex_1' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetInputGlobals_ReturnValue) == 0x000028, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetInputGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, K2Node_ComponentBoundEvent_CheckBox_4) == 0x000030, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::K2Node_ComponentBoundEvent_CheckBox_4' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000038, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, K2Node_ComponentBoundEvent_CheckBox_3) == 0x000048, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::K2Node_ComponentBoundEvent_CheckBox_3' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, K2Node_ComponentBoundEvent_CheckBox_2) == 0x000058, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::K2Node_ComponentBoundEvent_CheckBox_2' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, Temp_int_Array_Index_Variable) == 0x000060, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_Array_Get_Item) == 0x000064, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetDataTableRowFromName_OutRow) == 0x000070, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000098, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetUserSettings_ReturnValue_1) == 0x0000A0, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetUserSettings_ReturnValue_2) == 0x0000A8, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetUserSettings_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetUserSettings_ReturnValue_3) == 0x0000B0, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetUserSettings_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetControllerInversionVertical_ReturnValue) == 0x0000B8, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetControllerInversionVertical_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetUserSettings_ReturnValue_4) == 0x0000C0, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetUserSettings_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_SetChecked_ReturnValue) == 0x0000C8, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_SetChecked_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetControllerInversionHorizontal_ReturnValue) == 0x0000C9, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetControllerInversionHorizontal_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetUserSettings_ReturnValue_5) == 0x0000D0, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetUserSettings_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_SetChecked_ReturnValue_1) == 0x0000D8, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_SetChecked_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetUserSettings_ReturnValue_6) == 0x0000E0, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetUserSettings_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetUserSettings_ReturnValue_7) == 0x0000E8, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetUserSettings_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetVibrationEnabled_ReturnValue) == 0x0000F0, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetVibrationEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, K2Node_ComponentBoundEvent_ComboBox_1) == 0x0000F8, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::K2Node_ComponentBoundEvent_ComboBox_1' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_SetChecked_ReturnValue_2) == 0x000100, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_SetChecked_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetUserSettings_ReturnValue_8) == 0x000108, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetUserSettings_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetControllerConfiguration_ReturnValue) == 0x000110, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetControllerConfiguration_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetUserSettings_ReturnValue_9) == 0x000118, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetUserSettings_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetUserSettings_ReturnValue_10) == 0x000120, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetUserSettings_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, K2Node_ComponentBoundEvent_CheckBox_1) == 0x000128, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::K2Node_ComponentBoundEvent_CheckBox_1' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetStickAccelerationEnabled_ReturnValue) == 0x000130, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetStickAccelerationEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, K2Node_ComponentBoundEvent_CheckBox) == 0x000138, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::K2Node_ComponentBoundEvent_CheckBox' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, K2Node_ComponentBoundEvent_bIsChecked) == 0x000140, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_SetChecked_ReturnValue_3) == 0x000141, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_SetChecked_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000148, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, K2Node_ComponentBoundEvent_Slider) == 0x000150, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::K2Node_ComponentBoundEvent_Slider' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, K2Node_DynamicCast_AsMariner_Character) == 0x000158, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::K2Node_DynamicCast_AsMariner_Character' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, K2Node_DynamicCast_bSuccess) == 0x000160, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetMarinerGlobals_IsValid_1) == 0x000161, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetMarinerGlobals_IsValid_1' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetMarinerGlobals_ReturnValue_1) == 0x000168, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetMarinerGlobals_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetInputGlobals_ReturnValue_1) == 0x000170, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetInputGlobals_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetUserSettings_ReturnValue_11) == 0x000178, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetUserSettings_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetSensitivitySettings_ReturnValue) == 0x000180, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetSensitivitySettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetSensitivitySpecification_ReturnValue) == 0x000188, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetSensitivitySpecification_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetDataTableRowNames_OutRowNames_1) == 0x000190, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetDataTableRowNames_OutRowNames_1' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_Add_IntInt_ReturnValue) == 0x0001A0, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_Array_Length_ReturnValue_1) == 0x0001A4, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0001A8, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x0001AC, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_MakeVector2D_ReturnValue) == 0x0001B0, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, K2Node_ComponentBoundEvent_Value) == 0x0001B8, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetUserSettings_ReturnValue_12) == 0x0001C0, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetUserSettings_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, K2Node_Event_bFromSubMenu) == 0x0001C8, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::K2Node_Event_bFromSubMenu' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, K2Node_ComponentBoundEvent_CheckBox_5) == 0x0001D0, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::K2Node_ComponentBoundEvent_CheckBox_5' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, K2Node_ComponentBoundEvent_bIsChecked_1) == 0x0001D8, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::K2Node_ComponentBoundEvent_bIsChecked_1' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_BreakVector2D_X) == 0x0001DC, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_BreakVector2D_Y) == 0x0001E0, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0001E4, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, K2Node_ComponentBoundEvent_CheckBox_6) == 0x0001E8, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::K2Node_ComponentBoundEvent_CheckBox_6' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, K2Node_ComponentBoundEvent_bIsChecked_2) == 0x0001F0, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::K2Node_ComponentBoundEvent_bIsChecked_2' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0001F4, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_Round_ReturnValue) == 0x0001F8, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, K2Node_Event_bToSubLayer) == 0x0001FC, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::K2Node_Event_bToSubLayer' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, K2Node_Event_InputType) == 0x0001FD, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::K2Node_Event_InputType' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_SetActiveInputWidget_InputWidget_CastInput) == 0x000200, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_SetActiveInputWidget_InputWidget_CastInput' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, K2Node_ComponentBoundEvent_CheckBox_7) == 0x000210, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::K2Node_ComponentBoundEvent_CheckBox_7' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, K2Node_ComponentBoundEvent_bIsChecked_3) == 0x000218, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::K2Node_ComponentBoundEvent_bIsChecked_3' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, K2Node_ComponentBoundEvent_ComboBox) == 0x000220, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::K2Node_ComponentBoundEvent_ComboBox' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetUserSettings_ReturnValue_13) == 0x000228, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetUserSettings_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, Temp_int_Loop_Counter_Variable) == 0x000230, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_GetAimAssistState_ReturnValue) == 0x000234, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_GetAimAssistState_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_AimAssistStateToIndex_Index) == 0x000238, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_AimAssistStateToIndex_Index' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_Less_IntInt_ReturnValue) == 0x00023C, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_Add_IntInt_ReturnValue_1) == 0x000240, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, K2Node_ComponentBoundEvent_SelectedIndex) == 0x000244, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::K2Node_ComponentBoundEvent_SelectedIndex' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu, CallFunc_IndexToAimAssistState_AimAssistState) == 0x000248, "Member 'SettingsControllerMenu_C_ExecuteUbergraph_SettingsControllerMenu::CallFunc_IndexToAimAssistState_AimAssistState' has a wrong offset!");

// Function SettingsControllerMenu.SettingsControllerMenu_C.BndEvt__AimAssist_K2Node_ComponentBoundEvent_4_SelectionIndexChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct SettingsControllerMenu_C_BndEvt__AimAssist_K2Node_ComponentBoundEvent_4_SelectionIndexChangedEvent__DelegateSignature final
{
public:
	int32                                         SelectedIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsControllerMenu_C_BndEvt__AimAssist_K2Node_ComponentBoundEvent_4_SelectionIndexChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on SettingsControllerMenu_C_BndEvt__AimAssist_K2Node_ComponentBoundEvent_4_SelectionIndexChangedEvent__DelegateSignature");
static_assert(sizeof(SettingsControllerMenu_C_BndEvt__AimAssist_K2Node_ComponentBoundEvent_4_SelectionIndexChangedEvent__DelegateSignature) == 0x000004, "Wrong size on SettingsControllerMenu_C_BndEvt__AimAssist_K2Node_ComponentBoundEvent_4_SelectionIndexChangedEvent__DelegateSignature");
static_assert(offsetof(SettingsControllerMenu_C_BndEvt__AimAssist_K2Node_ComponentBoundEvent_4_SelectionIndexChangedEvent__DelegateSignature, SelectedIndex) == 0x000000, "Member 'SettingsControllerMenu_C_BndEvt__AimAssist_K2Node_ComponentBoundEvent_4_SelectionIndexChangedEvent__DelegateSignature::SelectedIndex' has a wrong offset!");

// Function SettingsControllerMenu.SettingsControllerMenu_C.BndEvt__AimAssist_K2Node_ComponentBoundEvent_0_OnComboBoxSettingInit__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SettingsControllerMenu_C_BndEvt__AimAssist_K2Node_ComponentBoundEvent_0_OnComboBoxSettingInit__DelegateSignature final
{
public:
	class UMarinerSettingComboBox*                ComboBox;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsControllerMenu_C_BndEvt__AimAssist_K2Node_ComponentBoundEvent_0_OnComboBoxSettingInit__DelegateSignature) == 0x000008, "Wrong alignment on SettingsControllerMenu_C_BndEvt__AimAssist_K2Node_ComponentBoundEvent_0_OnComboBoxSettingInit__DelegateSignature");
static_assert(sizeof(SettingsControllerMenu_C_BndEvt__AimAssist_K2Node_ComponentBoundEvent_0_OnComboBoxSettingInit__DelegateSignature) == 0x000008, "Wrong size on SettingsControllerMenu_C_BndEvt__AimAssist_K2Node_ComponentBoundEvent_0_OnComboBoxSettingInit__DelegateSignature");
static_assert(offsetof(SettingsControllerMenu_C_BndEvt__AimAssist_K2Node_ComponentBoundEvent_0_OnComboBoxSettingInit__DelegateSignature, ComboBox) == 0x000000, "Member 'SettingsControllerMenu_C_BndEvt__AimAssist_K2Node_ComponentBoundEvent_0_OnComboBoxSettingInit__DelegateSignature::ComboBox' has a wrong offset!");

// Function SettingsControllerMenu.SettingsControllerMenu_C.HandleInputDeviceChanged
// 0x0001 (0x0001 - 0x0000)
struct SettingsControllerMenu_C_HandleInputDeviceChanged final
{
public:
	EPlayerInputType                              InputType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsControllerMenu_C_HandleInputDeviceChanged) == 0x000001, "Wrong alignment on SettingsControllerMenu_C_HandleInputDeviceChanged");
static_assert(sizeof(SettingsControllerMenu_C_HandleInputDeviceChanged) == 0x000001, "Wrong size on SettingsControllerMenu_C_HandleInputDeviceChanged");
static_assert(offsetof(SettingsControllerMenu_C_HandleInputDeviceChanged, InputType) == 0x000000, "Member 'SettingsControllerMenu_C_HandleInputDeviceChanged::InputType' has a wrong offset!");

// Function SettingsControllerMenu.SettingsControllerMenu_C.BndEvt__ControllerSensitivity_K2Node_ComponentBoundEvent_7_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct SettingsControllerMenu_C_BndEvt__ControllerSensitivity_K2Node_ComponentBoundEvent_7_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsControllerMenu_C_BndEvt__ControllerSensitivity_K2Node_ComponentBoundEvent_7_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on SettingsControllerMenu_C_BndEvt__ControllerSensitivity_K2Node_ComponentBoundEvent_7_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(SettingsControllerMenu_C_BndEvt__ControllerSensitivity_K2Node_ComponentBoundEvent_7_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on SettingsControllerMenu_C_BndEvt__ControllerSensitivity_K2Node_ComponentBoundEvent_7_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(SettingsControllerMenu_C_BndEvt__ControllerSensitivity_K2Node_ComponentBoundEvent_7_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'SettingsControllerMenu_C_BndEvt__ControllerSensitivity_K2Node_ComponentBoundEvent_7_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function SettingsControllerMenu.SettingsControllerMenu_C.BndEvt__ControllerSensitivity_K2Node_ComponentBoundEvent_3_OnSliderSettingInit__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SettingsControllerMenu_C_BndEvt__ControllerSensitivity_K2Node_ComponentBoundEvent_3_OnSliderSettingInit__DelegateSignature final
{
public:
	class UMarinerSettingSlider*                  Slider;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsControllerMenu_C_BndEvt__ControllerSensitivity_K2Node_ComponentBoundEvent_3_OnSliderSettingInit__DelegateSignature) == 0x000008, "Wrong alignment on SettingsControllerMenu_C_BndEvt__ControllerSensitivity_K2Node_ComponentBoundEvent_3_OnSliderSettingInit__DelegateSignature");
static_assert(sizeof(SettingsControllerMenu_C_BndEvt__ControllerSensitivity_K2Node_ComponentBoundEvent_3_OnSliderSettingInit__DelegateSignature) == 0x000008, "Wrong size on SettingsControllerMenu_C_BndEvt__ControllerSensitivity_K2Node_ComponentBoundEvent_3_OnSliderSettingInit__DelegateSignature");
static_assert(offsetof(SettingsControllerMenu_C_BndEvt__ControllerSensitivity_K2Node_ComponentBoundEvent_3_OnSliderSettingInit__DelegateSignature, Slider) == 0x000000, "Member 'SettingsControllerMenu_C_BndEvt__ControllerSensitivity_K2Node_ComponentBoundEvent_3_OnSliderSettingInit__DelegateSignature::Slider' has a wrong offset!");

// Function SettingsControllerMenu.SettingsControllerMenu_C.BndEvt__EnableAcceleration_K2Node_ComponentBoundEvent_6_OnCheckBoxSettingChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct SettingsControllerMenu_C_BndEvt__EnableAcceleration_K2Node_ComponentBoundEvent_6_OnCheckBoxSettingChanged__DelegateSignature final
{
public:
	class UMarinerSettingCheckBox*                CheckBox;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsChecked;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsControllerMenu_C_BndEvt__EnableAcceleration_K2Node_ComponentBoundEvent_6_OnCheckBoxSettingChanged__DelegateSignature) == 0x000008, "Wrong alignment on SettingsControllerMenu_C_BndEvt__EnableAcceleration_K2Node_ComponentBoundEvent_6_OnCheckBoxSettingChanged__DelegateSignature");
static_assert(sizeof(SettingsControllerMenu_C_BndEvt__EnableAcceleration_K2Node_ComponentBoundEvent_6_OnCheckBoxSettingChanged__DelegateSignature) == 0x000010, "Wrong size on SettingsControllerMenu_C_BndEvt__EnableAcceleration_K2Node_ComponentBoundEvent_6_OnCheckBoxSettingChanged__DelegateSignature");
static_assert(offsetof(SettingsControllerMenu_C_BndEvt__EnableAcceleration_K2Node_ComponentBoundEvent_6_OnCheckBoxSettingChanged__DelegateSignature, CheckBox) == 0x000000, "Member 'SettingsControllerMenu_C_BndEvt__EnableAcceleration_K2Node_ComponentBoundEvent_6_OnCheckBoxSettingChanged__DelegateSignature::CheckBox' has a wrong offset!");
static_assert(offsetof(SettingsControllerMenu_C_BndEvt__EnableAcceleration_K2Node_ComponentBoundEvent_6_OnCheckBoxSettingChanged__DelegateSignature, bIsChecked) == 0x000008, "Member 'SettingsControllerMenu_C_BndEvt__EnableAcceleration_K2Node_ComponentBoundEvent_6_OnCheckBoxSettingChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function SettingsControllerMenu.SettingsControllerMenu_C.BndEvt__EnableAcceleration_K2Node_ComponentBoundEvent_5_OnCheckBoxSettingInit__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SettingsControllerMenu_C_BndEvt__EnableAcceleration_K2Node_ComponentBoundEvent_5_OnCheckBoxSettingInit__DelegateSignature final
{
public:
	class UMarinerSettingCheckBox*                CheckBox;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsControllerMenu_C_BndEvt__EnableAcceleration_K2Node_ComponentBoundEvent_5_OnCheckBoxSettingInit__DelegateSignature) == 0x000008, "Wrong alignment on SettingsControllerMenu_C_BndEvt__EnableAcceleration_K2Node_ComponentBoundEvent_5_OnCheckBoxSettingInit__DelegateSignature");
static_assert(sizeof(SettingsControllerMenu_C_BndEvt__EnableAcceleration_K2Node_ComponentBoundEvent_5_OnCheckBoxSettingInit__DelegateSignature) == 0x000008, "Wrong size on SettingsControllerMenu_C_BndEvt__EnableAcceleration_K2Node_ComponentBoundEvent_5_OnCheckBoxSettingInit__DelegateSignature");
static_assert(offsetof(SettingsControllerMenu_C_BndEvt__EnableAcceleration_K2Node_ComponentBoundEvent_5_OnCheckBoxSettingInit__DelegateSignature, CheckBox) == 0x000000, "Member 'SettingsControllerMenu_C_BndEvt__EnableAcceleration_K2Node_ComponentBoundEvent_5_OnCheckBoxSettingInit__DelegateSignature::CheckBox' has a wrong offset!");

// Function SettingsControllerMenu.SettingsControllerMenu_C.BndEvt__InputLayout_K2Node_ComponentBoundEvent_46_OnComboBoxSettingInit__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SettingsControllerMenu_C_BndEvt__InputLayout_K2Node_ComponentBoundEvent_46_OnComboBoxSettingInit__DelegateSignature final
{
public:
	class UMarinerSettingComboBox*                ComboBox;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsControllerMenu_C_BndEvt__InputLayout_K2Node_ComponentBoundEvent_46_OnComboBoxSettingInit__DelegateSignature) == 0x000008, "Wrong alignment on SettingsControllerMenu_C_BndEvt__InputLayout_K2Node_ComponentBoundEvent_46_OnComboBoxSettingInit__DelegateSignature");
static_assert(sizeof(SettingsControllerMenu_C_BndEvt__InputLayout_K2Node_ComponentBoundEvent_46_OnComboBoxSettingInit__DelegateSignature) == 0x000008, "Wrong size on SettingsControllerMenu_C_BndEvt__InputLayout_K2Node_ComponentBoundEvent_46_OnComboBoxSettingInit__DelegateSignature");
static_assert(offsetof(SettingsControllerMenu_C_BndEvt__InputLayout_K2Node_ComponentBoundEvent_46_OnComboBoxSettingInit__DelegateSignature, ComboBox) == 0x000000, "Member 'SettingsControllerMenu_C_BndEvt__InputLayout_K2Node_ComponentBoundEvent_46_OnComboBoxSettingInit__DelegateSignature::ComboBox' has a wrong offset!");

// Function SettingsControllerMenu.SettingsControllerMenu_C.BndEvt__InvertY_K2Node_ComponentBoundEvent_33_OnCheckBoxSettingInit__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SettingsControllerMenu_C_BndEvt__InvertY_K2Node_ComponentBoundEvent_33_OnCheckBoxSettingInit__DelegateSignature final
{
public:
	class UMarinerSettingCheckBox*                CheckBox;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsControllerMenu_C_BndEvt__InvertY_K2Node_ComponentBoundEvent_33_OnCheckBoxSettingInit__DelegateSignature) == 0x000008, "Wrong alignment on SettingsControllerMenu_C_BndEvt__InvertY_K2Node_ComponentBoundEvent_33_OnCheckBoxSettingInit__DelegateSignature");
static_assert(sizeof(SettingsControllerMenu_C_BndEvt__InvertY_K2Node_ComponentBoundEvent_33_OnCheckBoxSettingInit__DelegateSignature) == 0x000008, "Wrong size on SettingsControllerMenu_C_BndEvt__InvertY_K2Node_ComponentBoundEvent_33_OnCheckBoxSettingInit__DelegateSignature");
static_assert(offsetof(SettingsControllerMenu_C_BndEvt__InvertY_K2Node_ComponentBoundEvent_33_OnCheckBoxSettingInit__DelegateSignature, CheckBox) == 0x000000, "Member 'SettingsControllerMenu_C_BndEvt__InvertY_K2Node_ComponentBoundEvent_33_OnCheckBoxSettingInit__DelegateSignature::CheckBox' has a wrong offset!");

// Function SettingsControllerMenu.SettingsControllerMenu_C.BndEvt__InvertX_K2Node_ComponentBoundEvent_19_OnCheckBoxSettingInit__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SettingsControllerMenu_C_BndEvt__InvertX_K2Node_ComponentBoundEvent_19_OnCheckBoxSettingInit__DelegateSignature final
{
public:
	class UMarinerSettingCheckBox*                CheckBox;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsControllerMenu_C_BndEvt__InvertX_K2Node_ComponentBoundEvent_19_OnCheckBoxSettingInit__DelegateSignature) == 0x000008, "Wrong alignment on SettingsControllerMenu_C_BndEvt__InvertX_K2Node_ComponentBoundEvent_19_OnCheckBoxSettingInit__DelegateSignature");
static_assert(sizeof(SettingsControllerMenu_C_BndEvt__InvertX_K2Node_ComponentBoundEvent_19_OnCheckBoxSettingInit__DelegateSignature) == 0x000008, "Wrong size on SettingsControllerMenu_C_BndEvt__InvertX_K2Node_ComponentBoundEvent_19_OnCheckBoxSettingInit__DelegateSignature");
static_assert(offsetof(SettingsControllerMenu_C_BndEvt__InvertX_K2Node_ComponentBoundEvent_19_OnCheckBoxSettingInit__DelegateSignature, CheckBox) == 0x000000, "Member 'SettingsControllerMenu_C_BndEvt__InvertX_K2Node_ComponentBoundEvent_19_OnCheckBoxSettingInit__DelegateSignature::CheckBox' has a wrong offset!");

// Function SettingsControllerMenu.SettingsControllerMenu_C.BndEvt__Vibration_K2Node_ComponentBoundEvent_10_OnCheckBoxSettingInit__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SettingsControllerMenu_C_BndEvt__Vibration_K2Node_ComponentBoundEvent_10_OnCheckBoxSettingInit__DelegateSignature final
{
public:
	class UMarinerSettingCheckBox*                CheckBox;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsControllerMenu_C_BndEvt__Vibration_K2Node_ComponentBoundEvent_10_OnCheckBoxSettingInit__DelegateSignature) == 0x000008, "Wrong alignment on SettingsControllerMenu_C_BndEvt__Vibration_K2Node_ComponentBoundEvent_10_OnCheckBoxSettingInit__DelegateSignature");
static_assert(sizeof(SettingsControllerMenu_C_BndEvt__Vibration_K2Node_ComponentBoundEvent_10_OnCheckBoxSettingInit__DelegateSignature) == 0x000008, "Wrong size on SettingsControllerMenu_C_BndEvt__Vibration_K2Node_ComponentBoundEvent_10_OnCheckBoxSettingInit__DelegateSignature");
static_assert(offsetof(SettingsControllerMenu_C_BndEvt__Vibration_K2Node_ComponentBoundEvent_10_OnCheckBoxSettingInit__DelegateSignature, CheckBox) == 0x000000, "Member 'SettingsControllerMenu_C_BndEvt__Vibration_K2Node_ComponentBoundEvent_10_OnCheckBoxSettingInit__DelegateSignature::CheckBox' has a wrong offset!");

// Function SettingsControllerMenu.SettingsControllerMenu_C.BndEvt__InputLayout_K2Node_ComponentBoundEvent_76_OnSelectionIndexChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct SettingsControllerMenu_C_BndEvt__InputLayout_K2Node_ComponentBoundEvent_76_OnSelectionIndexChangedEvent__DelegateSignature final
{
public:
	int32                                         SelectedIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsControllerMenu_C_BndEvt__InputLayout_K2Node_ComponentBoundEvent_76_OnSelectionIndexChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on SettingsControllerMenu_C_BndEvt__InputLayout_K2Node_ComponentBoundEvent_76_OnSelectionIndexChangedEvent__DelegateSignature");
static_assert(sizeof(SettingsControllerMenu_C_BndEvt__InputLayout_K2Node_ComponentBoundEvent_76_OnSelectionIndexChangedEvent__DelegateSignature) == 0x000004, "Wrong size on SettingsControllerMenu_C_BndEvt__InputLayout_K2Node_ComponentBoundEvent_76_OnSelectionIndexChangedEvent__DelegateSignature");
static_assert(offsetof(SettingsControllerMenu_C_BndEvt__InputLayout_K2Node_ComponentBoundEvent_76_OnSelectionIndexChangedEvent__DelegateSignature, SelectedIndex) == 0x000000, "Member 'SettingsControllerMenu_C_BndEvt__InputLayout_K2Node_ComponentBoundEvent_76_OnSelectionIndexChangedEvent__DelegateSignature::SelectedIndex' has a wrong offset!");

// Function SettingsControllerMenu.SettingsControllerMenu_C.BP_OnEntered
// 0x0001 (0x0001 - 0x0000)
struct SettingsControllerMenu_C_BP_OnEntered final
{
public:
	bool                                          bFromSubMenu;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsControllerMenu_C_BP_OnEntered) == 0x000001, "Wrong alignment on SettingsControllerMenu_C_BP_OnEntered");
static_assert(sizeof(SettingsControllerMenu_C_BP_OnEntered) == 0x000001, "Wrong size on SettingsControllerMenu_C_BP_OnEntered");
static_assert(offsetof(SettingsControllerMenu_C_BP_OnEntered, bFromSubMenu) == 0x000000, "Member 'SettingsControllerMenu_C_BP_OnEntered::bFromSubMenu' has a wrong offset!");

