#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsAccessibilityMenu

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Mariner_structs.hpp"
#include "Mariner_classes.hpp"
#include "AkAudio_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SettingsAccessibilityMenu.SettingsAccessibilityMenu_C
// 0x0048 (0x0540 - 0x04F8)
class USettingsAccessibilityMenu_C final : public UMarinerSettingMenuBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UComboBoxSetting_C*                     ColorDeficiency;                                   // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USliderSetting_C*                       ColorDeficiencySeverity;                           // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBoxSetting_C*                     Narration;                                         // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USliderSetting_C*                       NarrationVolume;                                   // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerVerticalBox*                    SettingsPanel;                                     // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBoxSetting_C*                     SpeechToText;                                      // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBoxSetting_C*                     Subtitles;                                         // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBoxSetting_C*                     TextToSpeech;                                      // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SettingsAccessibilityMenu(int32 EntryPoint);
	void BndEvt__NarrationVolume_K2Node_ComponentBoundEvent_19_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__NarrationVolume_K2Node_ComponentBoundEvent_18_OnSliderSettingInit__DelegateSignature(class UMarinerSettingSlider* Slider);
	void BndEvt__Subtitles_K2Node_ComponentBoundEvent_3_OnCheckBoxSettingInit__DelegateSignature(class UMarinerSettingCheckBox* CheckBox);
	void BndEvt__Narration_K2Node_ComponentBoundEvent_1_OnCheckBoxSettingChanged__DelegateSignature(class UMarinerSettingCheckBox* CheckBox, bool bIsChecked);
	void BndEvt__Narration_K2Node_ComponentBoundEvent_0_OnCheckBoxSettingInit__DelegateSignature(class UMarinerSettingCheckBox* CheckBox);
	void BndEvt__Subtitles_K2Node_ComponentBoundEvent_4_OnCheckBoxSettingChanged__DelegateSignature(class UMarinerSettingCheckBox* CheckBox, bool bIsChecked);
	void BP_OnEntered(bool bFromSubMenu);
	void BndEvt__ColorDeficiencySeverity_K2Node_ComponentBoundEvent_8_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__ColorDeficiencySeverity_K2Node_ComponentBoundEvent_7_OnSliderSettingInit__DelegateSignature(class UMarinerSettingSlider* Slider);
	void BndEvt__TextToSpeech_K2Node_ComponentBoundEvent_10_OnCheckBoxSettingInit__DelegateSignature(class UMarinerSettingCheckBox* CheckBox);
	void BndEvt__ComboBoxSetting_K2Node_ComponentBoundEvent_6_SelectionIndexChangedEvent__DelegateSignature(int32 SelectedIndex);
	void BndEvt__ComboBoxSetting_K2Node_ComponentBoundEvent_2_OnComboBoxSettingInit__DelegateSignature(class UMarinerSettingComboBox* ComboBox);
	void BndEvt__SpeechToText_K2Node_ComponentBoundEvent_13_OnCheckBoxSettingChanged__DelegateSignature(class UMarinerSettingCheckBox* CheckBox, bool bIsChecked);
	void BndEvt__SpeechToText_K2Node_ComponentBoundEvent_12_OnCheckBoxSettingInit__DelegateSignature(class UMarinerSettingCheckBox* CheckBox);
	void BndEvt__TextToSpeech_K2Node_ComponentBoundEvent_11_OnCheckBoxSettingChanged__DelegateSignature(class UMarinerSettingCheckBox* CheckBox, bool bIsChecked);
	void PlayClickSound();
	bool HandleInput(EMarinerInputActions InInput);
	void DummyCallback(struct FKey& KeyPressed);
	void RestoreDefaultsConfirm(struct FKey& KeyPressed);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SettingsAccessibilityMenu_C">();
	}
	static class USettingsAccessibilityMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USettingsAccessibilityMenu_C>();
	}
};
static_assert(alignof(USettingsAccessibilityMenu_C) == 0x000008, "Wrong alignment on USettingsAccessibilityMenu_C");
static_assert(sizeof(USettingsAccessibilityMenu_C) == 0x000540, "Wrong size on USettingsAccessibilityMenu_C");
static_assert(offsetof(USettingsAccessibilityMenu_C, UberGraphFrame) == 0x0004F8, "Member 'USettingsAccessibilityMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USettingsAccessibilityMenu_C, ColorDeficiency) == 0x000500, "Member 'USettingsAccessibilityMenu_C::ColorDeficiency' has a wrong offset!");
static_assert(offsetof(USettingsAccessibilityMenu_C, ColorDeficiencySeverity) == 0x000508, "Member 'USettingsAccessibilityMenu_C::ColorDeficiencySeverity' has a wrong offset!");
static_assert(offsetof(USettingsAccessibilityMenu_C, Narration) == 0x000510, "Member 'USettingsAccessibilityMenu_C::Narration' has a wrong offset!");
static_assert(offsetof(USettingsAccessibilityMenu_C, NarrationVolume) == 0x000518, "Member 'USettingsAccessibilityMenu_C::NarrationVolume' has a wrong offset!");
static_assert(offsetof(USettingsAccessibilityMenu_C, SettingsPanel) == 0x000520, "Member 'USettingsAccessibilityMenu_C::SettingsPanel' has a wrong offset!");
static_assert(offsetof(USettingsAccessibilityMenu_C, SpeechToText) == 0x000528, "Member 'USettingsAccessibilityMenu_C::SpeechToText' has a wrong offset!");
static_assert(offsetof(USettingsAccessibilityMenu_C, Subtitles) == 0x000530, "Member 'USettingsAccessibilityMenu_C::Subtitles' has a wrong offset!");
static_assert(offsetof(USettingsAccessibilityMenu_C, TextToSpeech) == 0x000538, "Member 'USettingsAccessibilityMenu_C::TextToSpeech' has a wrong offset!");

}

