#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsGameMenu

#include "Basic.hpp"

#include "Mariner_structs.hpp"
#include "UMG_structs.hpp"
#include "AkAudio_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function SettingsGameMenu.SettingsGameMenu_C.ExecuteUbergraph_SettingsGameMenu
// 0x02F8 (0x02F8 - 0x0000)
struct SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoPlayerManager*                    CallFunc_Get_ReturnValue;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerSettingBase*                    K2Node_ComponentBoundEvent_Instance;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMangoId                               CallFunc_GetMangoId_ReturnValue;                   // 0x0038(0x0010)(ConstParm, HasGetValueTypeHash)
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MangoIdToString_ReturnValue;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UMarinerMenuStackLayer*                 CallFunc_PushLayerToActiveStack_ReturnValue;       // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0068(0x0018)()
	class UMarinerSettingCheckBox*                K2Node_ComponentBoundEvent_CheckBox_5;             // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_2;           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerSettingCheckBox*                K2Node_ComponentBoundEvent_CheckBox_4;             // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_1;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetBuildNumber_ReturnValue;               // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetShowNetworkInformation_ReturnValue;    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetChecked_ReturnValue;                   // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_2;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerSettingCheckBox*                K2Node_ComponentBoundEvent_CheckBox_3;             // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_1;           // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_3;            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMarinerCrossplayState                        CallFunc_GetCrossplayState_ReturnValue;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetP4Changelist_ReturnValue;              // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_CrossplayStateToComboIndex_Index;         // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0130(0x0018)()
	EPlayerInputType                              K2Node_Event_InputType;                            // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UMangoCMSManager*                       CallFunc_Get_ReturnValue_1;                        // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCMSVersion_ReturnValue;                // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0178(0x0018)()
	TScriptInterface<class IMarinerInputInterface> CallFunc_SetActiveInputWidget_InputWidget_CastInput; // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMangoPlayerManager*                    CallFunc_Get_ReturnValue_2;                        // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerSettingCheckBox*                K2Node_ComponentBoundEvent_CheckBox_2;             // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetLinkedOriginAccountName_ReturnValue;   // 0x01B0(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x01C0(0x0018)()
	class UMangoMatchmakingManager*               CallFunc_Get_ReturnValue_3;                        // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_4;            // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetMangoRealm_ReturnValue;                // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UMarinerSettingCheckBox*                K2Node_ComponentBoundEvent_CheckBox_1;             // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_5;            // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPartyIsPrivate_ReturnValue;            // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0238(0x0018)()
	bool                                          CallFunc_SetChecked_ReturnValue_1;                 // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerSettingCheckBox*                K2Node_ComponentBoundEvent_CheckBox;               // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerSettingComboBox*                K2Node_ComponentBoundEvent_ComboBox_2;             // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_6;            // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_7;            // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetShowInGameIcons_ReturnValue;           // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerSettingSlider*                  K2Node_ComponentBoundEvent_Slider;                 // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetChecked_ReturnValue_2;                 // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_8;            // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_SelectedIndex_2;        // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHorizontalFOV_ReturnValue;             // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_9;            // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerSettingComboBox*                K2Node_ComponentBoundEvent_ComboBox_1;             // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeUnclamped_ReturnValue;            // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_SelectedIndex_1;        // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFromSubMenu;                         // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMarinerCrossplayState                        CallFunc_ComboIndexToCrossplayState_CrossplayState; // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C2[0x6];                                      // 0x02C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_10;           // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue_11;           // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMarinerCrossplayState                        CallFunc_GetCrossplayState_ReturnValue_1;          // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerSettingComboBox*                K2Node_ComponentBoundEvent_ComboBox;               // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CrossplayStateToComboIndex_Index_1;       // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_SelectedIndex;          // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMarinerCrossplayState                        CallFunc_ComboIndexToCrossplayState_CrossplayState_1; // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bOpened;                // 0x02F1(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu) == 0x000008, "Wrong alignment on SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu");
static_assert(sizeof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu) == 0x0002F8, "Wrong size on SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, EntryPoint) == 0x000000, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_Get_ReturnValue) == 0x000028, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, K2Node_ComponentBoundEvent_Instance) == 0x000030, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::K2Node_ComponentBoundEvent_Instance' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_GetMangoId_ReturnValue) == 0x000038, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_GetMangoId_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_GetMenuManager_ReturnValue) == 0x000048, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_MangoIdToString_ReturnValue) == 0x000050, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_MangoIdToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_PushLayerToActiveStack_ReturnValue) == 0x000060, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_PushLayerToActiveStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_Conv_StringToText_ReturnValue) == 0x000068, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, K2Node_ComponentBoundEvent_CheckBox_5) == 0x000080, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::K2Node_ComponentBoundEvent_CheckBox_5' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, K2Node_ComponentBoundEvent_bIsChecked_2) == 0x000088, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::K2Node_ComponentBoundEvent_bIsChecked_2' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_GetUserSettings_ReturnValue) == 0x000090, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_GetUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, K2Node_ComponentBoundEvent_CheckBox_4) == 0x000098, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::K2Node_ComponentBoundEvent_CheckBox_4' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_GetUserSettings_ReturnValue_1) == 0x0000A0, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_GetUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_GetBuildNumber_ReturnValue) == 0x0000A8, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_GetBuildNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_GetShowNetworkInformation_ReturnValue) == 0x0000B8, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_GetShowNetworkInformation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_SetChecked_ReturnValue) == 0x0000B9, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_SetChecked_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_GetUserSettings_ReturnValue_2) == 0x0000C0, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_GetUserSettings_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, K2Node_ComponentBoundEvent_CheckBox_3) == 0x0000C8, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::K2Node_ComponentBoundEvent_CheckBox_3' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, K2Node_ComponentBoundEvent_bIsChecked_1) == 0x0000D0, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::K2Node_ComponentBoundEvent_bIsChecked_1' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_GetUserSettings_ReturnValue_3) == 0x0000D8, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_GetUserSettings_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_GetCrossplayState_ReturnValue) == 0x0000E0, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_GetCrossplayState_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_GetP4Changelist_ReturnValue) == 0x0000E8, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_GetP4Changelist_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_CrossplayStateToComboIndex_Index) == 0x0000F8, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_CrossplayStateToComboIndex_Index' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_Concat_StrStr_ReturnValue) == 0x000100, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000110, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000120, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_GetText_ReturnValue) == 0x000130, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, K2Node_Event_InputType) == 0x000148, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::K2Node_Event_InputType' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_Conv_TextToString_ReturnValue) == 0x000150, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_Get_ReturnValue_1) == 0x000160, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_GetCMSVersion_ReturnValue) == 0x000168, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_GetCMSVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000178, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_SetActiveInputWidget_InputWidget_CastInput) == 0x000190, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_SetActiveInputWidget_InputWidget_CastInput' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_Get_ReturnValue_2) == 0x0001A0, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_Get_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, K2Node_ComponentBoundEvent_CheckBox_2) == 0x0001A8, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::K2Node_ComponentBoundEvent_CheckBox_2' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_GetLinkedOriginAccountName_ReturnValue) == 0x0001B0, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_GetLinkedOriginAccountName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0001C0, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_Get_ReturnValue_3) == 0x0001D8, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_Get_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_GetUserSettings_ReturnValue_4) == 0x0001E0, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_GetUserSettings_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_GetMangoRealm_ReturnValue) == 0x0001E8, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_GetMangoRealm_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, K2Node_ComponentBoundEvent_CheckBox_1) == 0x0001F8, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::K2Node_ComponentBoundEvent_CheckBox_1' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, K2Node_ComponentBoundEvent_bIsChecked) == 0x000200, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000208, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_GetUserSettings_ReturnValue_5) == 0x000218, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_GetUserSettings_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000220, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_GetPartyIsPrivate_ReturnValue) == 0x000230, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_GetPartyIsPrivate_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000238, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_SetChecked_ReturnValue_1) == 0x000250, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_SetChecked_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, K2Node_ComponentBoundEvent_CheckBox) == 0x000258, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::K2Node_ComponentBoundEvent_CheckBox' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, K2Node_ComponentBoundEvent_ComboBox_2) == 0x000260, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::K2Node_ComponentBoundEvent_ComboBox_2' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_GetUserSettings_ReturnValue_6) == 0x000268, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_GetUserSettings_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_GetUserSettings_ReturnValue_7) == 0x000270, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_GetUserSettings_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_GetShowInGameIcons_ReturnValue) == 0x000278, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_GetShowInGameIcons_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, K2Node_ComponentBoundEvent_Slider) == 0x000280, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::K2Node_ComponentBoundEvent_Slider' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_SetChecked_ReturnValue_2) == 0x000288, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_SetChecked_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, K2Node_ComponentBoundEvent_Value) == 0x00028C, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_GetUserSettings_ReturnValue_8) == 0x000290, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_GetUserSettings_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, K2Node_ComponentBoundEvent_SelectedIndex_2) == 0x000298, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::K2Node_ComponentBoundEvent_SelectedIndex_2' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_GetHorizontalFOV_ReturnValue) == 0x00029C, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_GetHorizontalFOV_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_GetUserSettings_ReturnValue_9) == 0x0002A0, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_GetUserSettings_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_BreakVector2D_X) == 0x0002A8, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_BreakVector2D_Y) == 0x0002AC, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, K2Node_ComponentBoundEvent_ComboBox_1) == 0x0002B0, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::K2Node_ComponentBoundEvent_ComboBox_1' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_MapRangeUnclamped_ReturnValue) == 0x0002B8, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_MapRangeUnclamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, K2Node_ComponentBoundEvent_SelectedIndex_1) == 0x0002BC, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::K2Node_ComponentBoundEvent_SelectedIndex_1' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, K2Node_Event_bFromSubMenu) == 0x0002C0, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::K2Node_Event_bFromSubMenu' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_ComboIndexToCrossplayState_CrossplayState) == 0x0002C1, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_ComboIndexToCrossplayState_CrossplayState' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_GetUserSettings_ReturnValue_10) == 0x0002C8, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_GetUserSettings_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_GetUserSettings_ReturnValue_11) == 0x0002D0, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_GetUserSettings_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_GetCrossplayState_ReturnValue_1) == 0x0002D8, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_GetCrossplayState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, K2Node_ComponentBoundEvent_ComboBox) == 0x0002E0, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::K2Node_ComponentBoundEvent_ComboBox' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_CrossplayStateToComboIndex_Index_1) == 0x0002E8, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_CrossplayStateToComboIndex_Index_1' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, K2Node_ComponentBoundEvent_SelectedIndex) == 0x0002EC, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::K2Node_ComponentBoundEvent_SelectedIndex' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, CallFunc_ComboIndexToCrossplayState_CrossplayState_1) == 0x0002F0, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::CallFunc_ComboIndexToCrossplayState_CrossplayState_1' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu, K2Node_ComponentBoundEvent_bOpened) == 0x0002F1, "Member 'SettingsGameMenu_C_ExecuteUbergraph_SettingsGameMenu::K2Node_ComponentBoundEvent_bOpened' has a wrong offset!");

// Function SettingsGameMenu.SettingsGameMenu_C.BndEvt__Region_K2Node_ComponentBoundEvent_4_OnSettingComboBoxOpened__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct SettingsGameMenu_C_BndEvt__Region_K2Node_ComponentBoundEvent_4_OnSettingComboBoxOpened__DelegateSignature final
{
public:
	bool                                          bOpened;                                           // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsGameMenu_C_BndEvt__Region_K2Node_ComponentBoundEvent_4_OnSettingComboBoxOpened__DelegateSignature) == 0x000001, "Wrong alignment on SettingsGameMenu_C_BndEvt__Region_K2Node_ComponentBoundEvent_4_OnSettingComboBoxOpened__DelegateSignature");
static_assert(sizeof(SettingsGameMenu_C_BndEvt__Region_K2Node_ComponentBoundEvent_4_OnSettingComboBoxOpened__DelegateSignature) == 0x000001, "Wrong size on SettingsGameMenu_C_BndEvt__Region_K2Node_ComponentBoundEvent_4_OnSettingComboBoxOpened__DelegateSignature");
static_assert(offsetof(SettingsGameMenu_C_BndEvt__Region_K2Node_ComponentBoundEvent_4_OnSettingComboBoxOpened__DelegateSignature, bOpened) == 0x000000, "Member 'SettingsGameMenu_C_BndEvt__Region_K2Node_ComponentBoundEvent_4_OnSettingComboBoxOpened__DelegateSignature::bOpened' has a wrong offset!");

// Function SettingsGameMenu.SettingsGameMenu_C.BndEvt__CrossplayConsole_K2Node_ComponentBoundEvent_18_SelectionIndexChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct SettingsGameMenu_C_BndEvt__CrossplayConsole_K2Node_ComponentBoundEvent_18_SelectionIndexChangedEvent__DelegateSignature final
{
public:
	int32                                         SelectedIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsGameMenu_C_BndEvt__CrossplayConsole_K2Node_ComponentBoundEvent_18_SelectionIndexChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on SettingsGameMenu_C_BndEvt__CrossplayConsole_K2Node_ComponentBoundEvent_18_SelectionIndexChangedEvent__DelegateSignature");
static_assert(sizeof(SettingsGameMenu_C_BndEvt__CrossplayConsole_K2Node_ComponentBoundEvent_18_SelectionIndexChangedEvent__DelegateSignature) == 0x000004, "Wrong size on SettingsGameMenu_C_BndEvt__CrossplayConsole_K2Node_ComponentBoundEvent_18_SelectionIndexChangedEvent__DelegateSignature");
static_assert(offsetof(SettingsGameMenu_C_BndEvt__CrossplayConsole_K2Node_ComponentBoundEvent_18_SelectionIndexChangedEvent__DelegateSignature, SelectedIndex) == 0x000000, "Member 'SettingsGameMenu_C_BndEvt__CrossplayConsole_K2Node_ComponentBoundEvent_18_SelectionIndexChangedEvent__DelegateSignature::SelectedIndex' has a wrong offset!");

// Function SettingsGameMenu.SettingsGameMenu_C.BndEvt__CrossplayConsole_K2Node_ComponentBoundEvent_17_OnComboBoxSettingInit__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SettingsGameMenu_C_BndEvt__CrossplayConsole_K2Node_ComponentBoundEvent_17_OnComboBoxSettingInit__DelegateSignature final
{
public:
	class UMarinerSettingComboBox*                ComboBox;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsGameMenu_C_BndEvt__CrossplayConsole_K2Node_ComponentBoundEvent_17_OnComboBoxSettingInit__DelegateSignature) == 0x000008, "Wrong alignment on SettingsGameMenu_C_BndEvt__CrossplayConsole_K2Node_ComponentBoundEvent_17_OnComboBoxSettingInit__DelegateSignature");
static_assert(sizeof(SettingsGameMenu_C_BndEvt__CrossplayConsole_K2Node_ComponentBoundEvent_17_OnComboBoxSettingInit__DelegateSignature) == 0x000008, "Wrong size on SettingsGameMenu_C_BndEvt__CrossplayConsole_K2Node_ComponentBoundEvent_17_OnComboBoxSettingInit__DelegateSignature");
static_assert(offsetof(SettingsGameMenu_C_BndEvt__CrossplayConsole_K2Node_ComponentBoundEvent_17_OnComboBoxSettingInit__DelegateSignature, ComboBox) == 0x000000, "Member 'SettingsGameMenu_C_BndEvt__CrossplayConsole_K2Node_ComponentBoundEvent_17_OnComboBoxSettingInit__DelegateSignature::ComboBox' has a wrong offset!");

// Function SettingsGameMenu.SettingsGameMenu_C.BP_OnEntered
// 0x0001 (0x0001 - 0x0000)
struct SettingsGameMenu_C_BP_OnEntered final
{
public:
	bool                                          bFromSubMenu;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsGameMenu_C_BP_OnEntered) == 0x000001, "Wrong alignment on SettingsGameMenu_C_BP_OnEntered");
static_assert(sizeof(SettingsGameMenu_C_BP_OnEntered) == 0x000001, "Wrong size on SettingsGameMenu_C_BP_OnEntered");
static_assert(offsetof(SettingsGameMenu_C_BP_OnEntered, bFromSubMenu) == 0x000000, "Member 'SettingsGameMenu_C_BP_OnEntered::bFromSubMenu' has a wrong offset!");

// Function SettingsGameMenu.SettingsGameMenu_C.BndEvt__CrossplayKBM_K2Node_ComponentBoundEvent_11_SelectionIndexChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct SettingsGameMenu_C_BndEvt__CrossplayKBM_K2Node_ComponentBoundEvent_11_SelectionIndexChangedEvent__DelegateSignature final
{
public:
	int32                                         SelectedIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsGameMenu_C_BndEvt__CrossplayKBM_K2Node_ComponentBoundEvent_11_SelectionIndexChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on SettingsGameMenu_C_BndEvt__CrossplayKBM_K2Node_ComponentBoundEvent_11_SelectionIndexChangedEvent__DelegateSignature");
static_assert(sizeof(SettingsGameMenu_C_BndEvt__CrossplayKBM_K2Node_ComponentBoundEvent_11_SelectionIndexChangedEvent__DelegateSignature) == 0x000004, "Wrong size on SettingsGameMenu_C_BndEvt__CrossplayKBM_K2Node_ComponentBoundEvent_11_SelectionIndexChangedEvent__DelegateSignature");
static_assert(offsetof(SettingsGameMenu_C_BndEvt__CrossplayKBM_K2Node_ComponentBoundEvent_11_SelectionIndexChangedEvent__DelegateSignature, SelectedIndex) == 0x000000, "Member 'SettingsGameMenu_C_BndEvt__CrossplayKBM_K2Node_ComponentBoundEvent_11_SelectionIndexChangedEvent__DelegateSignature::SelectedIndex' has a wrong offset!");

// Function SettingsGameMenu.SettingsGameMenu_C.BndEvt__CrossplayKBM_K2Node_ComponentBoundEvent_9_OnComboBoxSettingInit__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SettingsGameMenu_C_BndEvt__CrossplayKBM_K2Node_ComponentBoundEvent_9_OnComboBoxSettingInit__DelegateSignature final
{
public:
	class UMarinerSettingComboBox*                ComboBox;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsGameMenu_C_BndEvt__CrossplayKBM_K2Node_ComponentBoundEvent_9_OnComboBoxSettingInit__DelegateSignature) == 0x000008, "Wrong alignment on SettingsGameMenu_C_BndEvt__CrossplayKBM_K2Node_ComponentBoundEvent_9_OnComboBoxSettingInit__DelegateSignature");
static_assert(sizeof(SettingsGameMenu_C_BndEvt__CrossplayKBM_K2Node_ComponentBoundEvent_9_OnComboBoxSettingInit__DelegateSignature) == 0x000008, "Wrong size on SettingsGameMenu_C_BndEvt__CrossplayKBM_K2Node_ComponentBoundEvent_9_OnComboBoxSettingInit__DelegateSignature");
static_assert(offsetof(SettingsGameMenu_C_BndEvt__CrossplayKBM_K2Node_ComponentBoundEvent_9_OnComboBoxSettingInit__DelegateSignature, ComboBox) == 0x000000, "Member 'SettingsGameMenu_C_BndEvt__CrossplayKBM_K2Node_ComponentBoundEvent_9_OnComboBoxSettingInit__DelegateSignature::ComboBox' has a wrong offset!");

// Function SettingsGameMenu.SettingsGameMenu_C.BndEvt__LanguageSetting_K2Node_ComponentBoundEvent_67_OnSelectionIndexChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct SettingsGameMenu_C_BndEvt__LanguageSetting_K2Node_ComponentBoundEvent_67_OnSelectionIndexChangedEvent__DelegateSignature final
{
public:
	int32                                         SelectedIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsGameMenu_C_BndEvt__LanguageSetting_K2Node_ComponentBoundEvent_67_OnSelectionIndexChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on SettingsGameMenu_C_BndEvt__LanguageSetting_K2Node_ComponentBoundEvent_67_OnSelectionIndexChangedEvent__DelegateSignature");
static_assert(sizeof(SettingsGameMenu_C_BndEvt__LanguageSetting_K2Node_ComponentBoundEvent_67_OnSelectionIndexChangedEvent__DelegateSignature) == 0x000004, "Wrong size on SettingsGameMenu_C_BndEvt__LanguageSetting_K2Node_ComponentBoundEvent_67_OnSelectionIndexChangedEvent__DelegateSignature");
static_assert(offsetof(SettingsGameMenu_C_BndEvt__LanguageSetting_K2Node_ComponentBoundEvent_67_OnSelectionIndexChangedEvent__DelegateSignature, SelectedIndex) == 0x000000, "Member 'SettingsGameMenu_C_BndEvt__LanguageSetting_K2Node_ComponentBoundEvent_67_OnSelectionIndexChangedEvent__DelegateSignature::SelectedIndex' has a wrong offset!");

// Function SettingsGameMenu.SettingsGameMenu_C.BndEvt__FieldOfView_K2Node_ComponentBoundEvent_8_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct SettingsGameMenu_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_8_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsGameMenu_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_8_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on SettingsGameMenu_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_8_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(SettingsGameMenu_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_8_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on SettingsGameMenu_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_8_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(SettingsGameMenu_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_8_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'SettingsGameMenu_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_8_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function SettingsGameMenu.SettingsGameMenu_C.BndEvt__FieldOfView_K2Node_ComponentBoundEvent_7_OnSliderSettingInit__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SettingsGameMenu_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_7_OnSliderSettingInit__DelegateSignature final
{
public:
	class UMarinerSettingSlider*                  Slider;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsGameMenu_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_7_OnSliderSettingInit__DelegateSignature) == 0x000008, "Wrong alignment on SettingsGameMenu_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_7_OnSliderSettingInit__DelegateSignature");
static_assert(sizeof(SettingsGameMenu_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_7_OnSliderSettingInit__DelegateSignature) == 0x000008, "Wrong size on SettingsGameMenu_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_7_OnSliderSettingInit__DelegateSignature");
static_assert(offsetof(SettingsGameMenu_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_7_OnSliderSettingInit__DelegateSignature, Slider) == 0x000000, "Member 'SettingsGameMenu_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_7_OnSliderSettingInit__DelegateSignature::Slider' has a wrong offset!");

// Function SettingsGameMenu.SettingsGameMenu_C.BndEvt__Language_K2Node_ComponentBoundEvent_10_OnComboBoxSettingInit__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SettingsGameMenu_C_BndEvt__Language_K2Node_ComponentBoundEvent_10_OnComboBoxSettingInit__DelegateSignature final
{
public:
	class UMarinerSettingComboBox*                ComboBox;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsGameMenu_C_BndEvt__Language_K2Node_ComponentBoundEvent_10_OnComboBoxSettingInit__DelegateSignature) == 0x000008, "Wrong alignment on SettingsGameMenu_C_BndEvt__Language_K2Node_ComponentBoundEvent_10_OnComboBoxSettingInit__DelegateSignature");
static_assert(sizeof(SettingsGameMenu_C_BndEvt__Language_K2Node_ComponentBoundEvent_10_OnComboBoxSettingInit__DelegateSignature) == 0x000008, "Wrong size on SettingsGameMenu_C_BndEvt__Language_K2Node_ComponentBoundEvent_10_OnComboBoxSettingInit__DelegateSignature");
static_assert(offsetof(SettingsGameMenu_C_BndEvt__Language_K2Node_ComponentBoundEvent_10_OnComboBoxSettingInit__DelegateSignature, ComboBox) == 0x000000, "Member 'SettingsGameMenu_C_BndEvt__Language_K2Node_ComponentBoundEvent_10_OnComboBoxSettingInit__DelegateSignature::ComboBox' has a wrong offset!");

// Function SettingsGameMenu.SettingsGameMenu_C.BndEvt__ShowInGameIcons_K2Node_ComponentBoundEvent_13_OnCheckBoxSettingInit__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SettingsGameMenu_C_BndEvt__ShowInGameIcons_K2Node_ComponentBoundEvent_13_OnCheckBoxSettingInit__DelegateSignature final
{
public:
	class UMarinerSettingCheckBox*                CheckBox;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsGameMenu_C_BndEvt__ShowInGameIcons_K2Node_ComponentBoundEvent_13_OnCheckBoxSettingInit__DelegateSignature) == 0x000008, "Wrong alignment on SettingsGameMenu_C_BndEvt__ShowInGameIcons_K2Node_ComponentBoundEvent_13_OnCheckBoxSettingInit__DelegateSignature");
static_assert(sizeof(SettingsGameMenu_C_BndEvt__ShowInGameIcons_K2Node_ComponentBoundEvent_13_OnCheckBoxSettingInit__DelegateSignature) == 0x000008, "Wrong size on SettingsGameMenu_C_BndEvt__ShowInGameIcons_K2Node_ComponentBoundEvent_13_OnCheckBoxSettingInit__DelegateSignature");
static_assert(offsetof(SettingsGameMenu_C_BndEvt__ShowInGameIcons_K2Node_ComponentBoundEvent_13_OnCheckBoxSettingInit__DelegateSignature, CheckBox) == 0x000000, "Member 'SettingsGameMenu_C_BndEvt__ShowInGameIcons_K2Node_ComponentBoundEvent_13_OnCheckBoxSettingInit__DelegateSignature::CheckBox' has a wrong offset!");

// Function SettingsGameMenu.SettingsGameMenu_C.BndEvt__CheckBoxSetting_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct SettingsGameMenu_C_BndEvt__CheckBoxSetting_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	class UMarinerSettingCheckBox*                CheckBox;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsChecked;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsGameMenu_C_BndEvt__CheckBoxSetting_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on SettingsGameMenu_C_BndEvt__CheckBoxSetting_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(SettingsGameMenu_C_BndEvt__CheckBoxSetting_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000010, "Wrong size on SettingsGameMenu_C_BndEvt__CheckBoxSetting_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(SettingsGameMenu_C_BndEvt__CheckBoxSetting_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature, CheckBox) == 0x000000, "Member 'SettingsGameMenu_C_BndEvt__CheckBoxSetting_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature::CheckBox' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_BndEvt__CheckBoxSetting_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000008, "Member 'SettingsGameMenu_C_BndEvt__CheckBoxSetting_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function SettingsGameMenu.SettingsGameMenu_C.BndEvt__PartyIsPrivate_K2Node_ComponentBoundEvent_26_OnCheckBoxSettingInit__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SettingsGameMenu_C_BndEvt__PartyIsPrivate_K2Node_ComponentBoundEvent_26_OnCheckBoxSettingInit__DelegateSignature final
{
public:
	class UMarinerSettingCheckBox*                CheckBox;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsGameMenu_C_BndEvt__PartyIsPrivate_K2Node_ComponentBoundEvent_26_OnCheckBoxSettingInit__DelegateSignature) == 0x000008, "Wrong alignment on SettingsGameMenu_C_BndEvt__PartyIsPrivate_K2Node_ComponentBoundEvent_26_OnCheckBoxSettingInit__DelegateSignature");
static_assert(sizeof(SettingsGameMenu_C_BndEvt__PartyIsPrivate_K2Node_ComponentBoundEvent_26_OnCheckBoxSettingInit__DelegateSignature) == 0x000008, "Wrong size on SettingsGameMenu_C_BndEvt__PartyIsPrivate_K2Node_ComponentBoundEvent_26_OnCheckBoxSettingInit__DelegateSignature");
static_assert(offsetof(SettingsGameMenu_C_BndEvt__PartyIsPrivate_K2Node_ComponentBoundEvent_26_OnCheckBoxSettingInit__DelegateSignature, CheckBox) == 0x000000, "Member 'SettingsGameMenu_C_BndEvt__PartyIsPrivate_K2Node_ComponentBoundEvent_26_OnCheckBoxSettingInit__DelegateSignature::CheckBox' has a wrong offset!");

// Function SettingsGameMenu.SettingsGameMenu_C.HandleInputDeviceChanged
// 0x0001 (0x0001 - 0x0000)
struct SettingsGameMenu_C_HandleInputDeviceChanged final
{
public:
	EPlayerInputType                              InputType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsGameMenu_C_HandleInputDeviceChanged) == 0x000001, "Wrong alignment on SettingsGameMenu_C_HandleInputDeviceChanged");
static_assert(sizeof(SettingsGameMenu_C_HandleInputDeviceChanged) == 0x000001, "Wrong size on SettingsGameMenu_C_HandleInputDeviceChanged");
static_assert(offsetof(SettingsGameMenu_C_HandleInputDeviceChanged, InputType) == 0x000000, "Member 'SettingsGameMenu_C_HandleInputDeviceChanged::InputType' has a wrong offset!");

// Function SettingsGameMenu.SettingsGameMenu_C.BndEvt__PartyIsPrivate_K2Node_ComponentBoundEvent_34_OnCheckBoxSettingChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct SettingsGameMenu_C_BndEvt__PartyIsPrivate_K2Node_ComponentBoundEvent_34_OnCheckBoxSettingChanged__DelegateSignature final
{
public:
	class UMarinerSettingCheckBox*                CheckBox;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsChecked;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsGameMenu_C_BndEvt__PartyIsPrivate_K2Node_ComponentBoundEvent_34_OnCheckBoxSettingChanged__DelegateSignature) == 0x000008, "Wrong alignment on SettingsGameMenu_C_BndEvt__PartyIsPrivate_K2Node_ComponentBoundEvent_34_OnCheckBoxSettingChanged__DelegateSignature");
static_assert(sizeof(SettingsGameMenu_C_BndEvt__PartyIsPrivate_K2Node_ComponentBoundEvent_34_OnCheckBoxSettingChanged__DelegateSignature) == 0x000010, "Wrong size on SettingsGameMenu_C_BndEvt__PartyIsPrivate_K2Node_ComponentBoundEvent_34_OnCheckBoxSettingChanged__DelegateSignature");
static_assert(offsetof(SettingsGameMenu_C_BndEvt__PartyIsPrivate_K2Node_ComponentBoundEvent_34_OnCheckBoxSettingChanged__DelegateSignature, CheckBox) == 0x000000, "Member 'SettingsGameMenu_C_BndEvt__PartyIsPrivate_K2Node_ComponentBoundEvent_34_OnCheckBoxSettingChanged__DelegateSignature::CheckBox' has a wrong offset!");
static_assert(offsetof(SettingsGameMenu_C_BndEvt__PartyIsPrivate_K2Node_ComponentBoundEvent_34_OnCheckBoxSettingChanged__DelegateSignature, bIsChecked) == 0x000008, "Member 'SettingsGameMenu_C_BndEvt__PartyIsPrivate_K2Node_ComponentBoundEvent_34_OnCheckBoxSettingChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function SettingsGameMenu.SettingsGameMenu_C.BndEvt__ShowNetworkInformation_K2Node_ComponentBoundEvent_2_OnCheckBoxSettingInit__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SettingsGameMenu_C_BndEvt__ShowNetworkInformation_K2Node_ComponentBoundEvent_2_OnCheckBoxSettingInit__DelegateSignature final
{
public:
	class UMarinerSettingCheckBox*                CheckBox;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsGameMenu_C_BndEvt__ShowNetworkInformation_K2Node_ComponentBoundEvent_2_OnCheckBoxSettingInit__DelegateSignature) == 0x000008, "Wrong alignment on SettingsGameMenu_C_BndEvt__ShowNetworkInformation_K2Node_ComponentBoundEvent_2_OnCheckBoxSettingInit__DelegateSignature");
static_assert(sizeof(SettingsGameMenu_C_BndEvt__ShowNetworkInformation_K2Node_ComponentBoundEvent_2_OnCheckBoxSettingInit__DelegateSignature) == 0x000008, "Wrong size on SettingsGameMenu_C_BndEvt__ShowNetworkInformation_K2Node_ComponentBoundEvent_2_OnCheckBoxSettingInit__DelegateSignature");
static_assert(offsetof(SettingsGameMenu_C_BndEvt__ShowNetworkInformation_K2Node_ComponentBoundEvent_2_OnCheckBoxSettingInit__DelegateSignature, CheckBox) == 0x000000, "Member 'SettingsGameMenu_C_BndEvt__ShowNetworkInformation_K2Node_ComponentBoundEvent_2_OnCheckBoxSettingInit__DelegateSignature::CheckBox' has a wrong offset!");

// Function SettingsGameMenu.SettingsGameMenu_C.BndEvt__ShowNetworkInformation_K2Node_ComponentBoundEvent_3_OnCheckBoxSettingChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct SettingsGameMenu_C_BndEvt__ShowNetworkInformation_K2Node_ComponentBoundEvent_3_OnCheckBoxSettingChanged__DelegateSignature final
{
public:
	class UMarinerSettingCheckBox*                CheckBox;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsChecked;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsGameMenu_C_BndEvt__ShowNetworkInformation_K2Node_ComponentBoundEvent_3_OnCheckBoxSettingChanged__DelegateSignature) == 0x000008, "Wrong alignment on SettingsGameMenu_C_BndEvt__ShowNetworkInformation_K2Node_ComponentBoundEvent_3_OnCheckBoxSettingChanged__DelegateSignature");
