#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsGamepadPrompt

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SettingsGamepadPrompt.SettingsGamepadPrompt_C
// 0x0020 (0x03F8 - 0x03D8)
class USettingsGamepadPrompt_C final : public UMarinerGamepadPrompt
{
public:
	class UImage*                                 GamepadIcon;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             OutputText;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PromptImage;                                       // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SettingsBackFrame;                                 // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FMarinerGamepadPromptAssets GetPromptAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SettingsGamepadPrompt_C">();
	}
	static class USettingsGamepadPrompt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USettingsGamepadPrompt_C>();
	}
};
static_assert(alignof(USettingsGamepadPrompt_C) == 0x000008, "Wrong alignment on USettingsGamepadPrompt_C");
static_assert(sizeof(USettingsGamepadPrompt_C) == 0x0003F8, "Wrong size on USettingsGamepadPrompt_C");
static_assert(offsetof(USettingsGamepadPrompt_C, GamepadIcon) == 0x0003D8, "Member 'USettingsGamepadPrompt_C::GamepadIcon' has a wrong offset!");
static_assert(offsetof(USettingsGamepadPrompt_C, OutputText) == 0x0003E0, "Member 'USettingsGamepadPrompt_C::OutputText' has a wrong offset!");
static_assert(offsetof(USettingsGamepadPrompt_C, PromptImage) == 0x0003E8, "Member 'USettingsGamepadPrompt_C::PromptImage' has a wrong offset!");
static_assert(offsetof(USettingsGamepadPrompt_C, SettingsBackFrame) == 0x0003F0, "Member 'USettingsGamepadPrompt_C::SettingsBackFrame' has a wrong offset!");

}

