#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsMousePrompt

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SettingsMousePrompt.SettingsMousePrompt_C
// 0x0030 (0x0440 - 0x0410)
class USettingsMousePrompt_C final : public UMarinerMousePrompt
{
public:
	class UWidgetAnimation*                       HoveredAnim;                                       // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackgroundFrame;                                   // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonOverlay;                                     // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerButton*                         ButtonText;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PromptImage;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FMarinerMousePromptAssets GetPromptAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SettingsMousePrompt_C">();
	}
	static class USettingsMousePrompt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USettingsMousePrompt_C>();
	}
};
static_assert(alignof(USettingsMousePrompt_C) == 0x000008, "Wrong alignment on USettingsMousePrompt_C");
static_assert(sizeof(USettingsMousePrompt_C) == 0x000440, "Wrong size on USettingsMousePrompt_C");
static_assert(offsetof(USettingsMousePrompt_C, HoveredAnim) == 0x000410, "Member 'USettingsMousePrompt_C::HoveredAnim' has a wrong offset!");
static_assert(offsetof(USettingsMousePrompt_C, Background) == 0x000418, "Member 'USettingsMousePrompt_C::Background' has a wrong offset!");
static_assert(offsetof(USettingsMousePrompt_C, BackgroundFrame) == 0x000420, "Member 'USettingsMousePrompt_C::BackgroundFrame' has a wrong offset!");
static_assert(offsetof(USettingsMousePrompt_C, ButtonOverlay) == 0x000428, "Member 'USettingsMousePrompt_C::ButtonOverlay' has a wrong offset!");
static_assert(offsetof(USettingsMousePrompt_C, ButtonText) == 0x000430, "Member 'USettingsMousePrompt_C::ButtonText' has a wrong offset!");
static_assert(offsetof(USettingsMousePrompt_C, PromptImage) == 0x000438, "Member 'USettingsMousePrompt_C::PromptImage' has a wrong offset!");

}

