#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsKeyboardMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Mariner_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SettingsKeyboardMenu.SettingsKeyboardMenu_C
// 0x00D0 (0x05C8 - 0x04F8)
class USettingsKeyboardMenu_C final : public UMarinerSettingMenuBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UKeyBindingSetting_C*                   ChatWheelCancelBinding;                            // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeyBindingSetting_C*                   ChatWheelLeftBinding;                              // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeyBindingSetting_C*                   ChatWheelRightBinding;                             // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeyBindingSetting_C*                   ChatWheelUpBinding;                                // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeyBindingSetting_C*                   DescendBinding;                                    // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeyBindingSetting_C*                   DodgeBinding;                                      // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeyBindingSetting_C*                   JumpAscendBinding;                                 // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBoxSetting_C*                     MouseInvertX;                                      // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBoxSetting_C*                     MouseInvertY;                                      // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USliderSetting_C*                       MouseSensitivityX;                                 // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USliderSetting_C*                       MouseSensitivityY;                                 // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeyBindingSetting_C*                   MoveBackwardBinding;                               // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeyBindingSetting_C*                   MoveForwardBinding;                                // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeyBindingSetting_C*                   MoveLeftBinding;                                   // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeyBindingSetting_C*                   MoveRightBinding;                                  // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeyBindingSetting_C*                   PrimaryFireBinding;                                // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeyBindingSetting_C*                   PushToTalkBinding;                                 // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeyBindingSetting_C*                   ReloadBinding;                                     // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeyBindingSetting_C*                   SecondaryFireBinding;                              // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerVerticalBox*                    SettingsPanel;                                     // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeyBindingSetting_C*                   SpecialAbilityBinding;                             // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeyBindingSetting_C*                   TextToSpeechBinding;                               // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeyBindingSetting_C*                   ThrowBallBinding;                                  // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeyBindingSetting_C*                   UseItemBinding;                                    // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              MouseRange;                                        // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SettingsKeyboardMenu(int32 EntryPoint);
	void BndEvt__InvertY_K2Node_ComponentBoundEvent_5_OnCheckBoxSettingChanged__DelegateSignature(class UMarinerSettingCheckBox* CheckBox, bool bIsChecked);
	void BndEvt__InvertY_K2Node_ComponentBoundEvent_4_OnCheckBoxSettingInit__DelegateSignature(class UMarinerSettingCheckBox* CheckBox);
	void BndEvt__MouseSensitivityX_K2Node_ComponentBoundEvent_37_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__InvertX_K2Node_ComponentBoundEvent_1_OnCheckBoxSettingChanged__DelegateSignature(class UMarinerSettingCheckBox* CheckBox, bool bIsChecked);
	void BndEvt__MouseSensitivityY_K2Node_ComponentBoundEvent_38_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BP_OnEntered(bool bFromSubMenu);
	void BndEvt__InvertX_K2Node_ComponentBoundEvent_0_OnCheckBoxSettingInit__DelegateSignature(class UMarinerSettingCheckBox* CheckBox);
	void BndEvt__MouseSensitivityY_K2Node_ComponentBoundEvent_3_OnSliderSettingInit__DelegateSignature(class UMarinerSettingSlider* Slider);
	void BndEvt__MouseSensitivityX_K2Node_ComponentBoundEvent_2_OnSliderSettingInit__DelegateSignature(class UMarinerSettingSlider* Slider);
	bool HandleInput(EMarinerInputActions InInput);
	void RestoreDefaultsConfirm(struct FKey& KeyPressed);
	void DummyCallback(struct FKey& KeyPressed);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SettingsKeyboardMenu_C">();
	}
	static class USettingsKeyboardMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USettingsKeyboardMenu_C>();
	}
};
static_assert(alignof(USettingsKeyboardMenu_C) == 0x000008, "Wrong alignment on USettingsKeyboardMenu_C");
static_assert(sizeof(USettingsKeyboardMenu_C) == 0x0005C8, "Wrong size on USettingsKeyboardMenu_C");
static_assert(offsetof(USettingsKeyboardMenu_C, UberGraphFrame) == 0x0004F8, "Member 'USettingsKeyboardMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USettingsKeyboardMenu_C, ChatWheelCancelBinding) == 0x000500, "Member 'USettingsKeyboardMenu_C::ChatWheelCancelBinding' has a wrong offset!");
static_assert(offsetof(USettingsKeyboardMenu_C, ChatWheelLeftBinding) == 0x000508, "Member 'USettingsKeyboardMenu_C::ChatWheelLeftBinding' has a wrong offset!");
static_assert(offsetof(USettingsKeyboardMenu_C, ChatWheelRightBinding) == 0x000510, "Member 'USettingsKeyboardMenu_C::ChatWheelRightBinding' has a wrong offset!");
static_assert(offsetof(USettingsKeyboardMenu_C, ChatWheelUpBinding) == 0x000518, "Member 'USettingsKeyboardMenu_C::ChatWheelUpBinding' has a wrong offset!");
static_assert(offsetof(USettingsKeyboardMenu_C, DescendBinding) == 0x000520, "Member 'USettingsKeyboardMenu_C::DescendBinding' has a wrong offset!");
static_assert(offsetof(USettingsKeyboardMenu_C, DodgeBinding) == 0x000528, "Member 'USettingsKeyboardMenu_C::DodgeBinding' has a wrong offset!");
static_assert(offsetof(USettingsKeyboardMenu_C, JumpAscendBinding) == 0x000530, "Member 'USettingsKeyboardMenu_C::JumpAscendBinding' has a wrong offset!");
static_assert(offsetof(USettingsKeyboardMenu_C, MouseInvertX) == 0x000538, "Member 'USettingsKeyboardMenu_C::MouseInvertX' has a wrong offset!");
static_assert(offsetof(USettingsKeyboardMenu_C, MouseInvertY) == 0x000540, "Member 'USettingsKeyboardMenu_C::MouseInvertY' has a wrong offset!");
static_assert(offsetof(USettingsKeyboardMenu_C, MouseSensitivityX) == 0x000548, "Member 'USettingsKeyboardMenu_C::MouseSensitivityX' has a wrong offset!");
static_assert(offsetof(USettingsKeyboardMenu_C, MouseSensitivityY) == 0x000550, "Member 'USettingsKeyboardMenu_C::MouseSensitivityY' has a wrong offset!");
static_assert(offsetof(USettingsKeyboardMenu_C, MoveBackwardBinding) == 0x000558, "Member 'USettingsKeyboardMenu_C::MoveBackwardBinding' has a wrong offset!");
static_assert(offsetof(USettingsKeyboardMenu_C, MoveForwardBinding) == 0x000560, "Member 'USettingsKeyboardMenu_C::MoveForwardBinding' has a wrong offset!");
static_assert(offsetof(USettingsKeyboardMenu_C, MoveLeftBinding) == 0x000568, "Member 'USettingsKeyboardMenu_C::MoveLeftBinding' has a wrong offset!");
static_assert(offsetof(USettingsKeyboardMenu_C, MoveRightBinding) == 0x000570, "Member 'USettingsKeyboardMenu_C::MoveRightBinding' has a wrong offset!");
static_assert(offsetof(USettingsKeyboardMenu_C, PrimaryFireBinding) == 0x000578, "Member 'USettingsKeyboardMenu_C::PrimaryFireBinding' has a wrong offset!");
static_assert(offsetof(USettingsKeyboardMenu_C, PushToTalkBinding) == 0x000580, "Member 'USettingsKeyboardMenu_C::PushToTalkBinding' has a wrong offset!");
static_assert(offsetof(USettingsKeyboardMenu_C, ReloadBinding) == 0x000588, "Member 'USettingsKeyboardMenu_C::ReloadBinding' has a wrong offset!");
static_assert(offsetof(USettingsKeyboardMenu_C, SecondaryFireBinding) == 0x000590, "Member 'USettingsKeyboardMenu_C::SecondaryFireBinding' has a wrong offset!");
static_assert(offsetof(USettingsKeyboardMenu_C, SettingsPanel) == 0x000598, "Member 'USettingsKeyboardMenu_C::SettingsPanel' has a wrong offset!");
static_assert(offsetof(USettingsKeyboardMenu_C, SpecialAbilityBinding) == 0x0005A0, "Member 'USettingsKeyboardMenu_C::SpecialAbilityBinding' has a wrong offset!");
static_assert(offsetof(USettingsKeyboardMenu_C, TextToSpeechBinding) == 0x0005A8, "Member 'USettingsKeyboardMenu_C::TextToSpeechBinding' has a wrong offset!");
static_assert(offsetof(USettingsKeyboardMenu_C, ThrowBallBinding) == 0x0005B0, "Member 'USettingsKeyboardMenu_C::ThrowBallBinding' has a wrong offset!");
static_assert(offsetof(USettingsKeyboardMenu_C, UseItemBinding) == 0x0005B8, "Member 'USettingsKeyboardMenu_C::UseItemBinding' has a wrong offset!");
static_assert(offsetof(USettingsKeyboardMenu_C, MouseRange) == 0x0005C0, "Member 'USettingsKeyboardMenu_C::MouseRange' has a wrong offset!");

}

