#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsControllerMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SettingsControllerMenu.SettingsControllerMenu_C
// 0x0050 (0x0548 - 0x04F8)
class USettingsControllerMenu_C final : public UMarinerSettingMenuBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UComboBoxSetting_C*                     AimAssist;                                         // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxSetting_C*                     ButtonLayout;                                      // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButtonLayout_C*                        ButtonLayoutWidget;                                // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USliderSetting_C*                       ControllerSensitivity;                             // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBoxSetting_C*                     EnableAcceleration;                                // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBoxSetting_C*                     InvertX;                                           // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBoxSetting_C*                     InvertY;                                           // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerVerticalBox*                    SettingsPanel;                                     // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBoxSetting_C*                     Vibration;                                         // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SettingsControllerMenu(int32 EntryPoint);
	void BndEvt__AimAssist_K2Node_ComponentBoundEvent_4_SelectionIndexChangedEvent__DelegateSignature(int32 SelectedIndex);
	void BndEvt__AimAssist_K2Node_ComponentBoundEvent_0_OnComboBoxSettingInit__DelegateSignature(class UMarinerSettingComboBox* ComboBox);
	void HandleInputDeviceChanged(EPlayerInputType InputType);
	void BndEvt__ControllerSensitivity_K2Node_ComponentBoundEvent_7_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__ControllerSensitivity_K2Node_ComponentBoundEvent_3_OnSliderSettingInit__DelegateSignature(class UMarinerSettingSlider* Slider);
	void BndEvt__EnableAcceleration_K2Node_ComponentBoundEvent_6_OnCheckBoxSettingChanged__DelegateSignature(class UMarinerSettingCheckBox* CheckBox, bool bIsChecked);
	void BndEvt__EnableAcceleration_K2Node_ComponentBoundEvent_5_OnCheckBoxSettingInit__DelegateSignature(class UMarinerSettingCheckBox* CheckBox);
	void BndEvt__InputLayout_K2Node_ComponentBoundEvent_46_OnComboBoxSettingInit__DelegateSignature(class UMarinerSettingComboBox* ComboBox);
	void BndEvt__InvertY_K2Node_ComponentBoundEvent_33_OnCheckBoxSettingInit__DelegateSignature(class UMarinerSettingCheckBox* CheckBox);
	void BndEvt__InvertX_K2Node_ComponentBoundEvent_19_OnCheckBoxSettingInit__DelegateSignature(class UMarinerSettingCheckBox* CheckBox);
	void BndEvt__Vibration_K2Node_ComponentBoundEvent_10_OnCheckBoxSettingInit__DelegateSignature(class UMarinerSettingCheckBox* CheckBox);
	void BndEvt__InputLayout_K2Node_ComponentBoundEvent_76_OnSelectionIndexChangedEvent__DelegateSignature(int32 SelectedIndex);
	void BP_OnEntered(bool bFromSubMenu);
	void BndEvt__InvertY_K2Node_ComponentBoundEvent_20_OnCheckBoxComponentStateChanged__DelegateSignature(class UMarinerSettingCheckBox* CheckBox, bool bIsChecked);
	void BndEvt__InvertX_K2Node_ComponentBoundEvent_19_OnCheckBoxComponentStateChanged__DelegateSignature(class UMarinerSettingCheckBox* CheckBox, bool bIsChecked);
	void BP_OnExited(bool bToSubLayer);
	void BndEvt__Vibration_K2Node_ComponentBoundEvent_20_OnCheckBoxComponentStateChanged__DelegateSignature(class UMarinerSettingCheckBox* CheckBox, bool bIsChecked);
	bool HandleInput(EMarinerInputActions InInput);
	void RestoreDefaultsConfirm(struct FKey& KeyPressed);
	void DummyCallback(struct FKey& KeyPressed);
	void AimAssistStateToIndex(EMarinerAimAssistState AimAssistState, int32* Param_Index);
	void IndexToAimAssistState(int32 Param_Index, EMarinerAimAssistState* AimAssistState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SettingsControllerMenu_C">();
	}
	static class USettingsControllerMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USettingsControllerMenu_C>();
	}
};
static_assert(alignof(USettingsControllerMenu_C) == 0x000008, "Wrong alignment on USettingsControllerMenu_C");
static_assert(sizeof(USettingsControllerMenu_C) == 0x000548, "Wrong size on USettingsControllerMenu_C");
static_assert(offsetof(USettingsControllerMenu_C, UberGraphFrame) == 0x0004F8, "Member 'USettingsControllerMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USettingsControllerMenu_C, AimAssist) == 0x000500, "Member 'USettingsControllerMenu_C::AimAssist' has a wrong offset!");
static_assert(offsetof(USettingsControllerMenu_C, ButtonLayout) == 0x000508, "Member 'USettingsControllerMenu_C::ButtonLayout' has a wrong offset!");
static_assert(offsetof(USettingsControllerMenu_C, ButtonLayoutWidget) == 0x000510, "Member 'USettingsControllerMenu_C::ButtonLayoutWidget' has a wrong offset!");
static_assert(offsetof(USettingsControllerMenu_C, ControllerSensitivity) == 0x000518, "Member 'USettingsControllerMenu_C::ControllerSensitivity' has a wrong offset!");
static_assert(offsetof(USettingsControllerMenu_C, EnableAcceleration) == 0x000520, "Member 'USettingsControllerMenu_C::EnableAcceleration' has a wrong offset!");
static_assert(offsetof(USettingsControllerMenu_C, InvertX) == 0x000528, "Member 'USettingsControllerMenu_C::InvertX' has a wrong offset!");
static_assert(offsetof(USettingsControllerMenu_C, InvertY) == 0x000530, "Member 'USettingsControllerMenu_C::InvertY' has a wrong offset!");
static_assert(offsetof(USettingsControllerMenu_C, SettingsPanel) == 0x000538, "Member 'USettingsControllerMenu_C::SettingsPanel' has a wrong offset!");
static_assert(offsetof(USettingsControllerMenu_C, Vibration) == 0x000540, "Member 'USettingsControllerMenu_C::Vibration' has a wrong offset!");

}

