#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shared_Artifact_Ability_27

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"
#include "ItemBoxTypes_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Shared_Artifact_Ability_27.Shared_Artifact_Ability_27_C
// 0x0020 (0x06F8 - 0x06D8)
class UShared_Artifact_Ability_27_C final : public UMarinerAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FCurveTableRowHandle                   ArtifactDataTable;                                 // 0x06E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         ItemGrantDelay;                                    // 0x06F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Shared_Artifact_Ability_27(int32 EntryPoint);
	void KnockedOutOtherPlayer();
	void BP_OnOwningControllerSet();
	void GrantItemAfterKO();
	void BP_OnAbilityActivated_Authority(const struct FGameplayAbilityActorInfo& ActorInfo);
	void GetChanceByLevel(float* NormalizedChance);
	void GetRandomItem(TSoftClassPtr<class UClass>* RandomItem);
	void Is_Allowed_by_Game_Mode(bool* IsAllowed);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Shared_Artifact_Ability_27_C">();
	}
	static class UShared_Artifact_Ability_27_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShared_Artifact_Ability_27_C>();
	}
};
static_assert(alignof(UShared_Artifact_Ability_27_C) == 0x000008, "Wrong alignment on UShared_Artifact_Ability_27_C");
static_assert(sizeof(UShared_Artifact_Ability_27_C) == 0x0006F8, "Wrong size on UShared_Artifact_Ability_27_C");
static_assert(offsetof(UShared_Artifact_Ability_27_C, UberGraphFrame) == 0x0006D8, "Member 'UShared_Artifact_Ability_27_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UShared_Artifact_Ability_27_C, ArtifactDataTable) == 0x0006E0, "Member 'UShared_Artifact_Ability_27_C::ArtifactDataTable' has a wrong offset!");
static_assert(offsetof(UShared_Artifact_Ability_27_C, ItemGrantDelay) == 0x0006F0, "Member 'UShared_Artifact_Ability_27_C::ItemGrantDelay' has a wrong offset!");

}

