#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shared_Artifact_Ability_27

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ItemBoxTypes_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function Shared_Artifact_Ability_27.Shared_Artifact_Ability_27_C.ExecuteUbergraph_Shared_Artifact_Ability_27
// 0x0130 (0x0130 - 0x0000)
struct Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Allowed_by_Game_Mode_IsAllowed;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279E[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_279F[0x8];                                     // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityActorInfo              K2Node_Event_ActorInfo;                            // 0x0060(0x0040)(ContainsInstancedReference)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetChanceByLevel_NormalizedChance;        // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMarinerCharacter*                      CallFunc_GetAvatarCharacterFromActorInfo_ReturnValue; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesSlotContainItem_ReturnValue;          // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27A0[0x6];                                     // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   CallFunc_GetRandomItem_RandomItem;                 // 0x00B8(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27A1[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_Conv_SoftClassReferenceToClass_ReturnValue; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsBP_Consumable_Item;      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27A2[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ConsumableItem_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AuthorityTryReceiveItem_ReturnValue;      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27A3[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0118(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AMarinerCharacter*                      CallFunc_GetAvatarCharacterFromActorInfo_ReturnValue_1; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27) == 0x000010, "Wrong alignment on Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27");
static_assert(sizeof(Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27) == 0x000130, "Wrong size on Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27");
static_assert(offsetof(Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27, EntryPoint) == 0x000000, "Member 'Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27::EntryPoint' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27, CallFunc_Is_Allowed_by_Game_Mode_IsAllowed) == 0x000004, "Member 'Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27::CallFunc_Is_Allowed_by_Game_Mode_IsAllowed' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27, K2Node_CreateDelegate_OutputDelegate_1) == 0x000050, "Member 'Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27, K2Node_Event_ActorInfo) == 0x000060, "Member 'Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27::K2Node_Event_ActorInfo' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000A0, "Member 'Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27, CallFunc_GetChanceByLevel_NormalizedChance) == 0x0000A4, "Member 'Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27::CallFunc_GetChanceByLevel_NormalizedChance' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27, CallFunc_GetAvatarCharacterFromActorInfo_ReturnValue) == 0x0000A8, "Member 'Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27::CallFunc_GetAvatarCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0000B0, "Member 'Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27, CallFunc_DoesSlotContainItem_ReturnValue) == 0x0000B1, "Member 'Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27::CallFunc_DoesSlotContainItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27, CallFunc_GetRandomItem_RandomItem) == 0x0000B8, "Member 'Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27::CallFunc_GetRandomItem_RandomItem' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27, CallFunc_Not_PreBool_ReturnValue) == 0x0000E0, "Member 'Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27, CallFunc_Conv_SoftClassReferenceToClass_ReturnValue) == 0x0000E8, "Member 'Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27::CallFunc_Conv_SoftClassReferenceToClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27, K2Node_ClassDynamicCast_AsBP_Consumable_Item) == 0x0000F0, "Member 'Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27::K2Node_ClassDynamicCast_AsBP_Consumable_Item' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27, K2Node_ClassDynamicCast_bSuccess) == 0x0000F8, "Member 'Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000100, "Member 'Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27, CallFunc_FinishSpawningActor_ReturnValue) == 0x000108, "Member 'Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27, CallFunc_AuthorityTryReceiveItem_ReturnValue) == 0x000110, "Member 'Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27::CallFunc_AuthorityTryReceiveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000118, "Member 'Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27, CallFunc_GetAvatarCharacterFromActorInfo_ReturnValue_1) == 0x000120, "Member 'Shared_Artifact_Ability_27_C_ExecuteUbergraph_Shared_Artifact_Ability_27::CallFunc_GetAvatarCharacterFromActorInfo_ReturnValue_1' has a wrong offset!");

// Function Shared_Artifact_Ability_27.Shared_Artifact_Ability_27_C.BP_OnAbilityActivated_Authority
// 0x0040 (0x0040 - 0x0000)
struct Shared_Artifact_Ability_27_C_BP_OnAbilityActivated_Authority final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(Shared_Artifact_Ability_27_C_BP_OnAbilityActivated_Authority) == 0x000008, "Wrong alignment on Shared_Artifact_Ability_27_C_BP_OnAbilityActivated_Authority");
static_assert(sizeof(Shared_Artifact_Ability_27_C_BP_OnAbilityActivated_Authority) == 0x000040, "Wrong size on Shared_Artifact_Ability_27_C_BP_OnAbilityActivated_Authority");
static_assert(offsetof(Shared_Artifact_Ability_27_C_BP_OnAbilityActivated_Authority, ActorInfo) == 0x000000, "Member 'Shared_Artifact_Ability_27_C_BP_OnAbilityActivated_Authority::ActorInfo' has a wrong offset!");

// Function Shared_Artifact_Ability_27.Shared_Artifact_Ability_27_C.GetChanceByLevel
// 0x0018 (0x0018 - 0x0000)
struct Shared_Artifact_Ability_27_C_GetChanceByLevel final
{
public:
	float                                         NormalizedChance;                                  // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27A4[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Shared_Artifact_Ability_27_C_GetChanceByLevel) == 0x000004, "Wrong alignment on Shared_Artifact_Ability_27_C_GetChanceByLevel");
static_assert(sizeof(Shared_Artifact_Ability_27_C_GetChanceByLevel) == 0x000018, "Wrong size on Shared_Artifact_Ability_27_C_GetChanceByLevel");
static_assert(offsetof(Shared_Artifact_Ability_27_C_GetChanceByLevel, NormalizedChance) == 0x000000, "Member 'Shared_Artifact_Ability_27_C_GetChanceByLevel::NormalizedChance' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_GetChanceByLevel, CallFunc_GetAbilityLevel_ReturnValue) == 0x000004, "Member 'Shared_Artifact_Ability_27_C_GetChanceByLevel::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_GetChanceByLevel, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000008, "Member 'Shared_Artifact_Ability_27_C_GetChanceByLevel::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_GetChanceByLevel, CallFunc_EvaluateCurveTableRow_OutResult) == 0x00000C, "Member 'Shared_Artifact_Ability_27_C_GetChanceByLevel::CallFunc_EvaluateCurveTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_GetChanceByLevel, CallFunc_EvaluateCurveTableRow_OutXY) == 0x000010, "Member 'Shared_Artifact_Ability_27_C_GetChanceByLevel::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_GetChanceByLevel, K2Node_SwitchEnum_CmpSuccess) == 0x000014, "Member 'Shared_Artifact_Ability_27_C_GetChanceByLevel::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function Shared_Artifact_Ability_27.Shared_Artifact_Ability_27_C.GetRandomItem
// 0x0170 (0x0170 - 0x0000)
struct Shared_Artifact_Ability_27_C_GetRandomItem final
{
public:
	TSoftClassPtr<class UClass>                   RandomItem;                                        // 0x0000(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	TMap<EItemBoxTypes, TSoftClassPtr<class UClass>> CallFunc_GetItemUseRankedArtifactItemMap_ItemMap;  // 0x0028(0x0050)(ZeroConstructor)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftClassPtr<class UClass>>           CallFunc_Map_Values_Values;                        // 0x0080(0x0010)(ZeroConstructor, ReferenceParm)
	class AMarinerGameState*                      K2Node_DynamicCast_AsMariner_Game_State;           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27A5[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRanked_ReturnValue;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27A6[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27A7[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EItemBoxTypes, TSoftClassPtr<class UClass>> CallFunc_GetGlobalItemMap_ItemMap;                 // 0x00B0(0x0050)(ZeroConstructor)
	TSoftClassPtr<class UClass>                   CallFunc_Array_Get_Item;                           // 0x0100(0x0028)(HasGetValueTypeHash)
	TArray<TSoftClassPtr<class UClass>>           CallFunc_Map_Values_Values_1;                      // 0x0128(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue_1;       // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27A8[0x4];                                     // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   CallFunc_Array_Get_Item_1;                         // 0x0148(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(Shared_Artifact_Ability_27_C_GetRandomItem) == 0x000008, "Wrong alignment on Shared_Artifact_Ability_27_C_GetRandomItem");
static_assert(sizeof(Shared_Artifact_Ability_27_C_GetRandomItem) == 0x000170, "Wrong size on Shared_Artifact_Ability_27_C_GetRandomItem");
static_assert(offsetof(Shared_Artifact_Ability_27_C_GetRandomItem, RandomItem) == 0x000000, "Member 'Shared_Artifact_Ability_27_C_GetRandomItem::RandomItem' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_GetRandomItem, CallFunc_GetItemUseRankedArtifactItemMap_ItemMap) == 0x000028, "Member 'Shared_Artifact_Ability_27_C_GetRandomItem::CallFunc_GetItemUseRankedArtifactItemMap_ItemMap' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_GetRandomItem, CallFunc_GetGameState_ReturnValue) == 0x000078, "Member 'Shared_Artifact_Ability_27_C_GetRandomItem::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_GetRandomItem, CallFunc_Map_Values_Values) == 0x000080, "Member 'Shared_Artifact_Ability_27_C_GetRandomItem::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_GetRandomItem, K2Node_DynamicCast_AsMariner_Game_State) == 0x000090, "Member 'Shared_Artifact_Ability_27_C_GetRandomItem::K2Node_DynamicCast_AsMariner_Game_State' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_GetRandomItem, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'Shared_Artifact_Ability_27_C_GetRandomItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_GetRandomItem, CallFunc_Array_Length_ReturnValue) == 0x00009C, "Member 'Shared_Artifact_Ability_27_C_GetRandomItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_GetRandomItem, CallFunc_IsRanked_ReturnValue) == 0x0000A0, "Member 'Shared_Artifact_Ability_27_C_GetRandomItem::CallFunc_IsRanked_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_GetRandomItem, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000A4, "Member 'Shared_Artifact_Ability_27_C_GetRandomItem::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_GetRandomItem, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0000A8, "Member 'Shared_Artifact_Ability_27_C_GetRandomItem::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_GetRandomItem, CallFunc_GetGlobalItemMap_ItemMap) == 0x0000B0, "Member 'Shared_Artifact_Ability_27_C_GetRandomItem::CallFunc_GetGlobalItemMap_ItemMap' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_GetRandomItem, CallFunc_Array_Get_Item) == 0x000100, "Member 'Shared_Artifact_Ability_27_C_GetRandomItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_GetRandomItem, CallFunc_Map_Values_Values_1) == 0x000128, "Member 'Shared_Artifact_Ability_27_C_GetRandomItem::CallFunc_Map_Values_Values_1' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_GetRandomItem, CallFunc_Array_Length_ReturnValue_1) == 0x000138, "Member 'Shared_Artifact_Ability_27_C_GetRandomItem::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_GetRandomItem, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00013C, "Member 'Shared_Artifact_Ability_27_C_GetRandomItem::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_GetRandomItem, CallFunc_RandomIntegerInRange_ReturnValue_1) == 0x000140, "Member 'Shared_Artifact_Ability_27_C_GetRandomItem::CallFunc_RandomIntegerInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_GetRandomItem, CallFunc_Array_Get_Item_1) == 0x000148, "Member 'Shared_Artifact_Ability_27_C_GetRandomItem::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function Shared_Artifact_Ability_27.Shared_Artifact_Ability_27_C.Is Allowed by Game Mode
// 0x0020 (0x0020 - 0x0000)
struct Shared_Artifact_Ability_27_C_Is_Allowed_by_Game_Mode final
{
public:
	bool                                          IsAllowed;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27A9[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MarinerGameState_C*                 K2Node_DynamicCast_AsBP_Mariner_Game_State;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Shared_Artifact_Ability_27_C_Is_Allowed_by_Game_Mode) == 0x000008, "Wrong alignment on Shared_Artifact_Ability_27_C_Is_Allowed_by_Game_Mode");
static_assert(sizeof(Shared_Artifact_Ability_27_C_Is_Allowed_by_Game_Mode) == 0x000020, "Wrong size on Shared_Artifact_Ability_27_C_Is_Allowed_by_Game_Mode");
static_assert(offsetof(Shared_Artifact_Ability_27_C_Is_Allowed_by_Game_Mode, IsAllowed) == 0x000000, "Member 'Shared_Artifact_Ability_27_C_Is_Allowed_by_Game_Mode::IsAllowed' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_Is_Allowed_by_Game_Mode, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'Shared_Artifact_Ability_27_C_Is_Allowed_by_Game_Mode::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_Is_Allowed_by_Game_Mode, K2Node_DynamicCast_AsBP_Mariner_Game_State) == 0x000010, "Member 'Shared_Artifact_Ability_27_C_Is_Allowed_by_Game_Mode::K2Node_DynamicCast_AsBP_Mariner_Game_State' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_Is_Allowed_by_Game_Mode, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Shared_Artifact_Ability_27_C_Is_Allowed_by_Game_Mode::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_27_C_Is_Allowed_by_Game_Mode, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'Shared_Artifact_Ability_27_C_Is_Allowed_by_Game_Mode::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

