#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shared_Artifact_Ability_28

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_structs.hpp"
#include "Mariner_classes.hpp"
#include "GameplayAwardTypes_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Shared_Artifact_Ability_28.Shared_Artifact_Ability_28_C
// 0x0020 (0x06F8 - 0x06D8)
class UShared_Artifact_Ability_28_C final : public UMarinerAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 BuffEffect;                                        // 0x06E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCurveTableRowHandle                   DurationQuery;                                     // 0x06E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Shared_Artifact_Ability_28(int32 EntryPoint);
	void RemoveEffect();
	void OnKnockedOut(EMarinerArenaReturnState PreviousState, EMarinerArenaReturnState NewState);
	void BP_OnOwningControllerSet();
	void OnGameplayAwardGiven(EGameplayAwardTypes AwardType, int32 Value, int32 StatTotal);
	void BP_OnAbilityActivated_Authority(const struct FGameplayAbilityActorInfo& ActorInfo);
	void GetDurationByLevel(float* Duration);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Shared_Artifact_Ability_28_C">();
	}
	static class UShared_Artifact_Ability_28_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShared_Artifact_Ability_28_C>();
	}
};
static_assert(alignof(UShared_Artifact_Ability_28_C) == 0x000008, "Wrong alignment on UShared_Artifact_Ability_28_C");
static_assert(sizeof(UShared_Artifact_Ability_28_C) == 0x0006F8, "Wrong size on UShared_Artifact_Ability_28_C");
static_assert(offsetof(UShared_Artifact_Ability_28_C, UberGraphFrame) == 0x0006D8, "Member 'UShared_Artifact_Ability_28_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UShared_Artifact_Ability_28_C, BuffEffect) == 0x0006E0, "Member 'UShared_Artifact_Ability_28_C::BuffEffect' has a wrong offset!");
static_assert(offsetof(UShared_Artifact_Ability_28_C, DurationQuery) == 0x0006E8, "Member 'UShared_Artifact_Ability_28_C::DurationQuery' has a wrong offset!");

}

