#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shared_Artifact_Ability_28

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAwardTypes_structs.hpp"
#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function Shared_Artifact_Ability_28.Shared_Artifact_Ability_28_C.ExecuteUbergraph_Shared_Artifact_Ability_28
// 0x00D0 (0x00D0 - 0x0000)
struct Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27AA[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMarinerCharacter*                      CallFunc_GetAvatarCharacterFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class ABaseCharacter_C*                       K2Node_DynamicCast_AsBase_Character;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27AB[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              K2Node_Event_ActorInfo;                            // 0x0030(0x0040)(ContainsInstancedReference)
	EGameplayAwardTypes                           K2Node_CustomEvent_AwardType;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27AC[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Value;                          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_StatTotal;                      // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27AD[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMarinerCharacter*                      CallFunc_GetAvatarCharacterFromActorInfo_ReturnValue_1; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMarinerArenaReturnState                      K2Node_CustomEvent_PreviousState;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMarinerArenaReturnState                      K2Node_CustomEvent_NewState;                       // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27AE[0x2];                                     // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EMarinerArenaReturnState PreviousState, EMarinerArenaReturnState NewState)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27AF[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EGameplayAwardTypes AwardType, int32 Value, int32 StatTotal)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetDurationByLevel_Duration;              // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27B0[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerAbilitySystemComponent*         CallFunc_GetOwningAbilitySystemComponent_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00C8(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28) == 0x000008, "Wrong alignment on Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28");
static_assert(sizeof(Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28) == 0x0000D0, "Wrong size on Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28");
static_assert(offsetof(Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28, EntryPoint) == 0x000000, "Member 'Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28::EntryPoint' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28, CallFunc_GetAvatarCharacterFromActorInfo_ReturnValue) == 0x000008, "Member 'Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28::CallFunc_GetAvatarCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28, K2Node_DynamicCast_AsBase_Character) == 0x000020, "Member 'Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28::K2Node_DynamicCast_AsBase_Character' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28, CallFunc_HasAuthority_ReturnValue) == 0x000029, "Member 'Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28, K2Node_Event_ActorInfo) == 0x000030, "Member 'Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28::K2Node_Event_ActorInfo' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28, K2Node_CustomEvent_AwardType) == 0x000070, "Member 'Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28::K2Node_CustomEvent_AwardType' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28, K2Node_CustomEvent_Value) == 0x000074, "Member 'Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28::K2Node_CustomEvent_Value' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28, K2Node_CustomEvent_StatTotal) == 0x000078, "Member 'Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28::K2Node_CustomEvent_StatTotal' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28, CallFunc_GetAbilityLevel_ReturnValue) == 0x00007C, "Member 'Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000080, "Member 'Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28, CallFunc_GetAvatarCharacterFromActorInfo_ReturnValue_1) == 0x000088, "Member 'Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28::CallFunc_GetAvatarCharacterFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28, K2Node_CustomEvent_PreviousState) == 0x000090, "Member 'Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28::K2Node_CustomEvent_PreviousState' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28, K2Node_CustomEvent_NewState) == 0x000091, "Member 'Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28::K2Node_CustomEvent_NewState' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28, K2Node_CreateDelegate_OutputDelegate_1) == 0x000094, "Member 'Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000A4, "Member 'Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000A8, "Member 'Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28, CallFunc_GetDurationByLevel_Duration) == 0x0000B8, "Member 'Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28::CallFunc_GetDurationByLevel_Duration' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28, CallFunc_GetOwningAbilitySystemComponent_ReturnValue) == 0x0000C0, "Member 'Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28::CallFunc_GetOwningAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000C8, "Member 'Shared_Artifact_Ability_28_C_ExecuteUbergraph_Shared_Artifact_Ability_28::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function Shared_Artifact_Ability_28.Shared_Artifact_Ability_28_C.OnKnockedOut
// 0x0002 (0x0002 - 0x0000)
struct Shared_Artifact_Ability_28_C_OnKnockedOut final
{
public:
	EMarinerArenaReturnState                      PreviousState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMarinerArenaReturnState                      NewState;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shared_Artifact_Ability_28_C_OnKnockedOut) == 0x000001, "Wrong alignment on Shared_Artifact_Ability_28_C_OnKnockedOut");
static_assert(sizeof(Shared_Artifact_Ability_28_C_OnKnockedOut) == 0x000002, "Wrong size on Shared_Artifact_Ability_28_C_OnKnockedOut");
static_assert(offsetof(Shared_Artifact_Ability_28_C_OnKnockedOut, PreviousState) == 0x000000, "Member 'Shared_Artifact_Ability_28_C_OnKnockedOut::PreviousState' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_28_C_OnKnockedOut, NewState) == 0x000001, "Member 'Shared_Artifact_Ability_28_C_OnKnockedOut::NewState' has a wrong offset!");

// Function Shared_Artifact_Ability_28.Shared_Artifact_Ability_28_C.OnGameplayAwardGiven
// 0x000C (0x000C - 0x0000)
struct Shared_Artifact_Ability_28_C_OnGameplayAwardGiven final
{
public:
	EGameplayAwardTypes                           AwardType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27B1[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Value;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StatTotal;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shared_Artifact_Ability_28_C_OnGameplayAwardGiven) == 0x000004, "Wrong alignment on Shared_Artifact_Ability_28_C_OnGameplayAwardGiven");
static_assert(sizeof(Shared_Artifact_Ability_28_C_OnGameplayAwardGiven) == 0x00000C, "Wrong size on Shared_Artifact_Ability_28_C_OnGameplayAwardGiven");
static_assert(offsetof(Shared_Artifact_Ability_28_C_OnGameplayAwardGiven, AwardType) == 0x000000, "Member 'Shared_Artifact_Ability_28_C_OnGameplayAwardGiven::AwardType' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_28_C_OnGameplayAwardGiven, Value) == 0x000004, "Member 'Shared_Artifact_Ability_28_C_OnGameplayAwardGiven::Value' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_28_C_OnGameplayAwardGiven, StatTotal) == 0x000008, "Member 'Shared_Artifact_Ability_28_C_OnGameplayAwardGiven::StatTotal' has a wrong offset!");

// Function Shared_Artifact_Ability_28.Shared_Artifact_Ability_28_C.BP_OnAbilityActivated_Authority
// 0x0040 (0x0040 - 0x0000)
struct Shared_Artifact_Ability_28_C_BP_OnAbilityActivated_Authority final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(Shared_Artifact_Ability_28_C_BP_OnAbilityActivated_Authority) == 0x000008, "Wrong alignment on Shared_Artifact_Ability_28_C_BP_OnAbilityActivated_Authority");
static_assert(sizeof(Shared_Artifact_Ability_28_C_BP_OnAbilityActivated_Authority) == 0x000040, "Wrong size on Shared_Artifact_Ability_28_C_BP_OnAbilityActivated_Authority");
static_assert(offsetof(Shared_Artifact_Ability_28_C_BP_OnAbilityActivated_Authority, ActorInfo) == 0x000000, "Member 'Shared_Artifact_Ability_28_C_BP_OnAbilityActivated_Authority::ActorInfo' has a wrong offset!");

// Function Shared_Artifact_Ability_28.Shared_Artifact_Ability_28_C.GetDurationByLevel
// 0x0018 (0x0018 - 0x0000)
struct Shared_Artifact_Ability_28_C_GetDurationByLevel final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27B2[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Shared_Artifact_Ability_28_C_GetDurationByLevel) == 0x000004, "Wrong alignment on Shared_Artifact_Ability_28_C_GetDurationByLevel");
static_assert(sizeof(Shared_Artifact_Ability_28_C_GetDurationByLevel) == 0x000018, "Wrong size on Shared_Artifact_Ability_28_C_GetDurationByLevel");
static_assert(offsetof(Shared_Artifact_Ability_28_C_GetDurationByLevel, Duration) == 0x000000, "Member 'Shared_Artifact_Ability_28_C_GetDurationByLevel::Duration' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_28_C_GetDurationByLevel, CallFunc_GetAbilityLevel_ReturnValue) == 0x000004, "Member 'Shared_Artifact_Ability_28_C_GetDurationByLevel::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_28_C_GetDurationByLevel, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000008, "Member 'Shared_Artifact_Ability_28_C_GetDurationByLevel::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_28_C_GetDurationByLevel, CallFunc_EvaluateCurveTableRow_OutResult) == 0x00000C, "Member 'Shared_Artifact_Ability_28_C_GetDurationByLevel::CallFunc_EvaluateCurveTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_28_C_GetDurationByLevel, CallFunc_EvaluateCurveTableRow_OutXY) == 0x000010, "Member 'Shared_Artifact_Ability_28_C_GetDurationByLevel::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(Shared_Artifact_Ability_28_C_GetDurationByLevel, K2Node_SwitchEnum_CmpSuccess) == 0x000014, "Member 'Shared_Artifact_Ability_28_C_GetDurationByLevel::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

