#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shielded_CameraEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Shielded_CameraEffect.Shielded_CameraEffect_C
// 0x0040 (0x0310 - 0x02D0)
class AShielded_CameraEffect_C final : public AMarinerCameraLensEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               FX_Shielded_Screen_Loop02;                         // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               FX_Shielded_Screen_Loop03;                         // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               FX_Shielded_Screen_Out;                            // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               FX_Shielded_Screen_Loop;                           // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                AbilitySystemComponent;                            // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ShieldLevel;                                       // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Shielded_CameraEffect(int32 EntryPoint);
	void ShieldActivate02();
	void ShieldActivate01();
	void DeactivateAll();
	void ShieldActivate();
	void SetShieldLevel(int32 Level);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Shielded_CameraEffect_C">();
	}
	static class AShielded_CameraEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AShielded_CameraEffect_C>();
	}
};
static_assert(alignof(AShielded_CameraEffect_C) == 0x000010, "Wrong alignment on AShielded_CameraEffect_C");
static_assert(sizeof(AShielded_CameraEffect_C) == 0x000310, "Wrong size on AShielded_CameraEffect_C");
static_assert(offsetof(AShielded_CameraEffect_C, UberGraphFrame) == 0x0002D0, "Member 'AShielded_CameraEffect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AShielded_CameraEffect_C, FX_Shielded_Screen_Loop02) == 0x0002D8, "Member 'AShielded_CameraEffect_C::FX_Shielded_Screen_Loop02' has a wrong offset!");
static_assert(offsetof(AShielded_CameraEffect_C, FX_Shielded_Screen_Loop03) == 0x0002E0, "Member 'AShielded_CameraEffect_C::FX_Shielded_Screen_Loop03' has a wrong offset!");
static_assert(offsetof(AShielded_CameraEffect_C, FX_Shielded_Screen_Out) == 0x0002E8, "Member 'AShielded_CameraEffect_C::FX_Shielded_Screen_Out' has a wrong offset!");
static_assert(offsetof(AShielded_CameraEffect_C, FX_Shielded_Screen_Loop) == 0x0002F0, "Member 'AShielded_CameraEffect_C::FX_Shielded_Screen_Loop' has a wrong offset!");
static_assert(offsetof(AShielded_CameraEffect_C, AbilitySystemComponent) == 0x0002F8, "Member 'AShielded_CameraEffect_C::AbilitySystemComponent' has a wrong offset!");
static_assert(offsetof(AShielded_CameraEffect_C, ShieldLevel) == 0x000300, "Member 'AShielded_CameraEffect_C::ShieldLevel' has a wrong offset!");

}

