#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shielded_CameraEffect

#include "Basic.hpp"


namespace SDK::Params
{

// Function Shielded_CameraEffect.Shielded_CameraEffect_C.ExecuteUbergraph_Shielded_CameraEffect
// 0x0004 (0x0004 - 0x0000)
struct Shielded_CameraEffect_C_ExecuteUbergraph_Shielded_CameraEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shielded_CameraEffect_C_ExecuteUbergraph_Shielded_CameraEffect) == 0x000004, "Wrong alignment on Shielded_CameraEffect_C_ExecuteUbergraph_Shielded_CameraEffect");
static_assert(sizeof(Shielded_CameraEffect_C_ExecuteUbergraph_Shielded_CameraEffect) == 0x000004, "Wrong size on Shielded_CameraEffect_C_ExecuteUbergraph_Shielded_CameraEffect");
static_assert(offsetof(Shielded_CameraEffect_C_ExecuteUbergraph_Shielded_CameraEffect, EntryPoint) == 0x000000, "Member 'Shielded_CameraEffect_C_ExecuteUbergraph_Shielded_CameraEffect::EntryPoint' has a wrong offset!");

// Function Shielded_CameraEffect.Shielded_CameraEffect_C.SetShieldLevel
// 0x0010 (0x0010 - 0x0000)
struct Shielded_CameraEffect_C_SetShieldLevel final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_3;               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_3;                     // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Shielded_CameraEffect_C_SetShieldLevel) == 0x000004, "Wrong alignment on Shielded_CameraEffect_C_SetShieldLevel");
static_assert(sizeof(Shielded_CameraEffect_C_SetShieldLevel) == 0x000010, "Wrong size on Shielded_CameraEffect_C_SetShieldLevel");
static_assert(offsetof(Shielded_CameraEffect_C_SetShieldLevel, Level) == 0x000000, "Member 'Shielded_CameraEffect_C_SetShieldLevel::Level' has a wrong offset!");
static_assert(offsetof(Shielded_CameraEffect_C_SetShieldLevel, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'Shielded_CameraEffect_C_SetShieldLevel::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Shielded_CameraEffect_C_SetShieldLevel, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'Shielded_CameraEffect_C_SetShieldLevel::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Shielded_CameraEffect_C_SetShieldLevel, Temp_bool_Has_Been_Initd_Variable_1) == 0x000006, "Member 'Shielded_CameraEffect_C_SetShieldLevel::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(Shielded_CameraEffect_C_SetShieldLevel, Temp_bool_IsClosed_Variable_1) == 0x000007, "Member 'Shielded_CameraEffect_C_SetShieldLevel::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(Shielded_CameraEffect_C_SetShieldLevel, Temp_bool_Has_Been_Initd_Variable_2) == 0x000008, "Member 'Shielded_CameraEffect_C_SetShieldLevel::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(Shielded_CameraEffect_C_SetShieldLevel, Temp_bool_IsClosed_Variable_2) == 0x000009, "Member 'Shielded_CameraEffect_C_SetShieldLevel::Temp_bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(Shielded_CameraEffect_C_SetShieldLevel, Temp_bool_Has_Been_Initd_Variable_3) == 0x00000A, "Member 'Shielded_CameraEffect_C_SetShieldLevel::Temp_bool_Has_Been_Initd_Variable_3' has a wrong offset!");
static_assert(offsetof(Shielded_CameraEffect_C_SetShieldLevel, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00000B, "Member 'Shielded_CameraEffect_C_SetShieldLevel::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shielded_CameraEffect_C_SetShieldLevel, Temp_bool_IsClosed_Variable_3) == 0x00000C, "Member 'Shielded_CameraEffect_C_SetShieldLevel::Temp_bool_IsClosed_Variable_3' has a wrong offset!");
static_assert(offsetof(Shielded_CameraEffect_C_SetShieldLevel, K2Node_SwitchInteger_CmpSuccess) == 0x00000D, "Member 'Shielded_CameraEffect_C_SetShieldLevel::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

}

