#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ShowdownWidget.ShowdownWidget_C
// 0x0048 (0x0528 - 0x04E0)
class UShowdownWidget_C final : public UMarinerMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SlideOut;                                          // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SlideIn;                                           // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             GameModeName;                                      // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LineMaterial;                                      // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OpponentNameFrame;                                 // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TeamPlayerNameFrame;                               // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WhiteFadeIn;                                       // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ShowdownWidget(int32 EntryPoint);
	void Destruct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ShowdownWidget_C">();
	}
	static class UShowdownWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShowdownWidget_C>();
	}
};
static_assert(alignof(UShowdownWidget_C) == 0x000008, "Wrong alignment on UShowdownWidget_C");
static_assert(sizeof(UShowdownWidget_C) == 0x000528, "Wrong size on UShowdownWidget_C");
static_assert(offsetof(UShowdownWidget_C, UberGraphFrame) == 0x0004E0, "Member 'UShowdownWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UShowdownWidget_C, SlideOut) == 0x0004E8, "Member 'UShowdownWidget_C::SlideOut' has a wrong offset!");
static_assert(offsetof(UShowdownWidget_C, SlideIn) == 0x0004F0, "Member 'UShowdownWidget_C::SlideIn' has a wrong offset!");
static_assert(offsetof(UShowdownWidget_C, GameModeName) == 0x0004F8, "Member 'UShowdownWidget_C::GameModeName' has a wrong offset!");
static_assert(offsetof(UShowdownWidget_C, LineMaterial) == 0x000500, "Member 'UShowdownWidget_C::LineMaterial' has a wrong offset!");
static_assert(offsetof(UShowdownWidget_C, OpponentNameFrame) == 0x000508, "Member 'UShowdownWidget_C::OpponentNameFrame' has a wrong offset!");
static_assert(offsetof(UShowdownWidget_C, TeamPlayerNameFrame) == 0x000510, "Member 'UShowdownWidget_C::TeamPlayerNameFrame' has a wrong offset!");
static_assert(offsetof(UShowdownWidget_C, TextBlock_0) == 0x000518, "Member 'UShowdownWidget_C::TextBlock_0' has a wrong offset!");
static_assert(offsetof(UShowdownWidget_C, WhiteFadeIn) == 0x000520, "Member 'UShowdownWidget_C::WhiteFadeIn' has a wrong offset!");

}

