#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SK_TotemPet_SpaceShip_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass SK_TotemPet_SpaceShip_AnimBP.SK_TotemPet_SpaceShip_AnimBP_C
// 0x0330 (0x05B0 - 0x0280)
class USK_TotemPet_SpaceShip_AnimBP_C final : public UMarinerRocketTotemCompanionAnim
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_79CEE90B4C8F5F01C677489695C713F2; // 0x0288(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_93F6B42D43879004F71B71AEDE942521; // 0x02B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_56F7CE0C4BE52536C5940A91A46823D6; // 0x02E0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A3B0CA91408DDB06B45B74B246271FDE; // 0x0308(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1AF1B7FF4C825A337C34FFA9DE1104C9; // 0x0380(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_746D890B4C492CE0402D7C96703DE04D; // 0x03B0(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6EA2439F43D9C544C59BD6B7ADFC68C8; // 0x0428(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_02ADF8374ECEF0152E465BA7C51BAAEC; // 0x0458(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_C756BCFC4DAE5C184A84D48E79724A3F; // 0x04D0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_61E6536345A1B2F6DF82FCA0F27DB5C0; // 0x0500(0x00B0)()

public:
	void ExecuteUbergraph_SK_TotemPet_SpaceShip_AnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SK_TotemPet_SpaceShip_AnimBP_C">();
	}
	static class USK_TotemPet_SpaceShip_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USK_TotemPet_SpaceShip_AnimBP_C>();
	}
};
static_assert(alignof(USK_TotemPet_SpaceShip_AnimBP_C) == 0x000010, "Wrong alignment on USK_TotemPet_SpaceShip_AnimBP_C");
static_assert(sizeof(USK_TotemPet_SpaceShip_AnimBP_C) == 0x0005B0, "Wrong size on USK_TotemPet_SpaceShip_AnimBP_C");
static_assert(offsetof(USK_TotemPet_SpaceShip_AnimBP_C, UberGraphFrame) == 0x000280, "Member 'USK_TotemPet_SpaceShip_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USK_TotemPet_SpaceShip_AnimBP_C, AnimGraphNode_Root_79CEE90B4C8F5F01C677489695C713F2) == 0x000288, "Member 'USK_TotemPet_SpaceShip_AnimBP_C::AnimGraphNode_Root_79CEE90B4C8F5F01C677489695C713F2' has a wrong offset!");
static_assert(offsetof(USK_TotemPet_SpaceShip_AnimBP_C, AnimGraphNode_TransitionResult_93F6B42D43879004F71B71AEDE942521) == 0x0002B8, "Member 'USK_TotemPet_SpaceShip_AnimBP_C::AnimGraphNode_TransitionResult_93F6B42D43879004F71B71AEDE942521' has a wrong offset!");
static_assert(offsetof(USK_TotemPet_SpaceShip_AnimBP_C, AnimGraphNode_TransitionResult_56F7CE0C4BE52536C5940A91A46823D6) == 0x0002E0, "Member 'USK_TotemPet_SpaceShip_AnimBP_C::AnimGraphNode_TransitionResult_56F7CE0C4BE52536C5940A91A46823D6' has a wrong offset!");
static_assert(offsetof(USK_TotemPet_SpaceShip_AnimBP_C, AnimGraphNode_SequencePlayer_A3B0CA91408DDB06B45B74B246271FDE) == 0x000308, "Member 'USK_TotemPet_SpaceShip_AnimBP_C::AnimGraphNode_SequencePlayer_A3B0CA91408DDB06B45B74B246271FDE' has a wrong offset!");
static_assert(offsetof(USK_TotemPet_SpaceShip_AnimBP_C, AnimGraphNode_StateResult_1AF1B7FF4C825A337C34FFA9DE1104C9) == 0x000380, "Member 'USK_TotemPet_SpaceShip_AnimBP_C::AnimGraphNode_StateResult_1AF1B7FF4C825A337C34FFA9DE1104C9' has a wrong offset!");
static_assert(offsetof(USK_TotemPet_SpaceShip_AnimBP_C, AnimGraphNode_SequencePlayer_746D890B4C492CE0402D7C96703DE04D) == 0x0003B0, "Member 'USK_TotemPet_SpaceShip_AnimBP_C::AnimGraphNode_SequencePlayer_746D890B4C492CE0402D7C96703DE04D' has a wrong offset!");
static_assert(offsetof(USK_TotemPet_SpaceShip_AnimBP_C, AnimGraphNode_StateResult_6EA2439F43D9C544C59BD6B7ADFC68C8) == 0x000428, "Member 'USK_TotemPet_SpaceShip_AnimBP_C::AnimGraphNode_StateResult_6EA2439F43D9C544C59BD6B7ADFC68C8' has a wrong offset!");
static_assert(offsetof(USK_TotemPet_SpaceShip_AnimBP_C, AnimGraphNode_SequencePlayer_02ADF8374ECEF0152E465BA7C51BAAEC) == 0x000458, "Member 'USK_TotemPet_SpaceShip_AnimBP_C::AnimGraphNode_SequencePlayer_02ADF8374ECEF0152E465BA7C51BAAEC' has a wrong offset!");
static_assert(offsetof(USK_TotemPet_SpaceShip_AnimBP_C, AnimGraphNode_StateResult_C756BCFC4DAE5C184A84D48E79724A3F) == 0x0004D0, "Member 'USK_TotemPet_SpaceShip_AnimBP_C::AnimGraphNode_StateResult_C756BCFC4DAE5C184A84D48E79724A3F' has a wrong offset!");
static_assert(offsetof(USK_TotemPet_SpaceShip_AnimBP_C, AnimGraphNode_StateMachine_61E6536345A1B2F6DF82FCA0F27DB5C0) == 0x000500, "Member 'USK_TotemPet_SpaceShip_AnimBP_C::AnimGraphNode_StateMachine_61E6536345A1B2F6DF82FCA0F27DB5C0' has a wrong offset!");

}

