#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SliderSetting

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SliderSetting.SliderSetting_C
// 0x0040 (0x0520 - 0x04E0)
class USliderSetting_C final : public UMarinerSettingSlider
{
public:
	class UWidgetAnimation*                       HoveredAnim;                                       // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerButton*                         ClickableArea;                                     // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Highlight;                                         // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LabelText;                                         // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Material;                                          // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerSlider*                         Slider;                                            // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SliderValue;                                       // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FMarinerSettingSliderAssets GetAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SliderSetting_C">();
	}
	static class USliderSetting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USliderSetting_C>();
	}
};
static_assert(alignof(USliderSetting_C) == 0x000008, "Wrong alignment on USliderSetting_C");
static_assert(sizeof(USliderSetting_C) == 0x000520, "Wrong size on USliderSetting_C");
static_assert(offsetof(USliderSetting_C, HoveredAnim) == 0x0004E0, "Member 'USliderSetting_C::HoveredAnim' has a wrong offset!");
static_assert(offsetof(USliderSetting_C, Background) == 0x0004E8, "Member 'USliderSetting_C::Background' has a wrong offset!");
static_assert(offsetof(USliderSetting_C, ClickableArea) == 0x0004F0, "Member 'USliderSetting_C::ClickableArea' has a wrong offset!");
static_assert(offsetof(USliderSetting_C, Highlight) == 0x0004F8, "Member 'USliderSetting_C::Highlight' has a wrong offset!");
static_assert(offsetof(USliderSetting_C, LabelText) == 0x000500, "Member 'USliderSetting_C::LabelText' has a wrong offset!");
static_assert(offsetof(USliderSetting_C, Material) == 0x000508, "Member 'USliderSetting_C::Material' has a wrong offset!");
static_assert(offsetof(USliderSetting_C, Slider) == 0x000510, "Member 'USliderSetting_C::Slider' has a wrong offset!");
static_assert(offsetof(USliderSetting_C, SliderValue) == 0x000518, "Member 'USliderSetting_C::SliderValue' has a wrong offset!");

}

