#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Slider_00_PostAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Slider_00_PostAnimBP.Slider_00_PostAnimBP_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct Slider_00_PostAnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Slider_00_PostAnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on Slider_00_PostAnimBP_C_AnimGraph");
static_assert(sizeof(Slider_00_PostAnimBP_C_AnimGraph) == 0x000020, "Wrong size on Slider_00_PostAnimBP_C_AnimGraph");
static_assert(offsetof(Slider_00_PostAnimBP_C_AnimGraph, InPose) == 0x000000, "Member 'Slider_00_PostAnimBP_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(Slider_00_PostAnimBP_C_AnimGraph, Param_AnimGraph) == 0x000010, "Member 'Slider_00_PostAnimBP_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function Slider_00_PostAnimBP.Slider_00_PostAnimBP_C.ExecuteUbergraph_Slider_00_PostAnimBP
// 0x0004 (0x0004 - 0x0000)
struct Slider_00_PostAnimBP_C_ExecuteUbergraph_Slider_00_PostAnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Slider_00_PostAnimBP_C_ExecuteUbergraph_Slider_00_PostAnimBP) == 0x000004, "Wrong alignment on Slider_00_PostAnimBP_C_ExecuteUbergraph_Slider_00_PostAnimBP");
static_assert(sizeof(Slider_00_PostAnimBP_C_ExecuteUbergraph_Slider_00_PostAnimBP) == 0x000004, "Wrong size on Slider_00_PostAnimBP_C_ExecuteUbergraph_Slider_00_PostAnimBP");
static_assert(offsetof(Slider_00_PostAnimBP_C_ExecuteUbergraph_Slider_00_PostAnimBP, EntryPoint) == 0x000000, "Member 'Slider_00_PostAnimBP_C_ExecuteUbergraph_Slider_00_PostAnimBP::EntryPoint' has a wrong offset!");

}

