#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialDropdownHeader

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialDropdownHeader.SocialDropdownHeader_C
// 0x0028 (0x02E0 - 0x02B8)
class USocialDropdownHeader_C final : public UMarinerSocialDropdownHeader
{
public:
	class UImage*                                 Devider;                                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULinkedPlatfromWidget_C*                LinkedPlatfromWidget1;                             // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULinkedPlatfromWidget_C*                LinkedPlatfromWidget2;                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULinkedPlatfromWidget_C*                LinkedPlatfromWidget3;                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULinkedPlatfromWidget_C*                LinkedPlatfromWidget4;                             // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialDropdownHeader_C">();
	}
	static class USocialDropdownHeader_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialDropdownHeader_C>();
	}
};
static_assert(alignof(USocialDropdownHeader_C) == 0x000008, "Wrong alignment on USocialDropdownHeader_C");
static_assert(sizeof(USocialDropdownHeader_C) == 0x0002E0, "Wrong size on USocialDropdownHeader_C");
static_assert(offsetof(USocialDropdownHeader_C, Devider) == 0x0002B8, "Member 'USocialDropdownHeader_C::Devider' has a wrong offset!");
static_assert(offsetof(USocialDropdownHeader_C, LinkedPlatfromWidget1) == 0x0002C0, "Member 'USocialDropdownHeader_C::LinkedPlatfromWidget1' has a wrong offset!");
static_assert(offsetof(USocialDropdownHeader_C, LinkedPlatfromWidget2) == 0x0002C8, "Member 'USocialDropdownHeader_C::LinkedPlatfromWidget2' has a wrong offset!");
static_assert(offsetof(USocialDropdownHeader_C, LinkedPlatfromWidget3) == 0x0002D0, "Member 'USocialDropdownHeader_C::LinkedPlatfromWidget3' has a wrong offset!");
static_assert(offsetof(USocialDropdownHeader_C, LinkedPlatfromWidget4) == 0x0002D8, "Member 'USocialDropdownHeader_C::LinkedPlatfromWidget4' has a wrong offset!");

}

