#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialMenuPartyWidget

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialMenuPartyWidget.SocialMenuPartyWidget_C
// 0x0020 (0x0480 - 0x0460)
class USocialMenuPartyWidget_C final : public UMarinerPartyWidget
{
public:
	class UFriendWidget_C*                        FriendWidget;                                      // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFriendWidget_C*                        FriendWidget_C_1;                                  // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFriendWidget_C*                        FriendWidget_C_2;                                  // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFriendWidget_C*                        FriendWidget_C_3;                                  // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialMenuPartyWidget_C">();
	}
	static class USocialMenuPartyWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialMenuPartyWidget_C>();
	}
};
static_assert(alignof(USocialMenuPartyWidget_C) == 0x000008, "Wrong alignment on USocialMenuPartyWidget_C");
static_assert(sizeof(USocialMenuPartyWidget_C) == 0x000480, "Wrong size on USocialMenuPartyWidget_C");
static_assert(offsetof(USocialMenuPartyWidget_C, FriendWidget) == 0x000460, "Member 'USocialMenuPartyWidget_C::FriendWidget' has a wrong offset!");
static_assert(offsetof(USocialMenuPartyWidget_C, FriendWidget_C_1) == 0x000468, "Member 'USocialMenuPartyWidget_C::FriendWidget_C_1' has a wrong offset!");
static_assert(offsetof(USocialMenuPartyWidget_C, FriendWidget_C_2) == 0x000470, "Member 'USocialMenuPartyWidget_C::FriendWidget_C_2' has a wrong offset!");
static_assert(offsetof(USocialMenuPartyWidget_C, FriendWidget_C_3) == 0x000478, "Member 'USocialMenuPartyWidget_C::FriendWidget_C_3' has a wrong offset!");

}

