#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SoftCurrencyButton

#include "Basic.hpp"

#include "Mariner_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function SoftCurrencyButton.SoftCurrencyButton_C.ExecuteUbergraph_SoftCurrencyButton
// 0x0038 (0x0038 - 0x0000)
struct SoftCurrencyButton_C_ExecuteUbergraph_SoftCurrencyButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2418[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0010(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0020(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoftCurrencyButton_C_ExecuteUbergraph_SoftCurrencyButton) == 0x000008, "Wrong alignment on SoftCurrencyButton_C_ExecuteUbergraph_SoftCurrencyButton");
static_assert(sizeof(SoftCurrencyButton_C_ExecuteUbergraph_SoftCurrencyButton) == 0x000038, "Wrong size on SoftCurrencyButton_C_ExecuteUbergraph_SoftCurrencyButton");
static_assert(offsetof(SoftCurrencyButton_C_ExecuteUbergraph_SoftCurrencyButton, EntryPoint) == 0x000000, "Member 'SoftCurrencyButton_C_ExecuteUbergraph_SoftCurrencyButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(SoftCurrencyButton_C_ExecuteUbergraph_SoftCurrencyButton, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'SoftCurrencyButton_C_ExecuteUbergraph_SoftCurrencyButton::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoftCurrencyButton_C_ExecuteUbergraph_SoftCurrencyButton, Temp_struct_Variable) == 0x000010, "Member 'SoftCurrencyButton_C_ExecuteUbergraph_SoftCurrencyButton::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(SoftCurrencyButton_C_ExecuteUbergraph_SoftCurrencyButton, Temp_delegate_Variable) == 0x000020, "Member 'SoftCurrencyButton_C_ExecuteUbergraph_SoftCurrencyButton::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(SoftCurrencyButton_C_ExecuteUbergraph_SoftCurrencyButton, CallFunc_PostEvent_ReturnValue) == 0x000030, "Member 'SoftCurrencyButton_C_ExecuteUbergraph_SoftCurrencyButton::CallFunc_PostEvent_ReturnValue' has a wrong offset!");

// Function SoftCurrencyButton.SoftCurrencyButton_C.GetAssets
// 0x0070 (0x0070 - 0x0000)
struct SoftCurrencyButton_C_GetAssets final
{
public:
	struct FMarinerSettingButtonAssets            ReturnValue;                                       // 0x0000(0x0038)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference)
	struct FMarinerSettingButtonAssets            K2Node_MakeStruct_MarinerSettingButtonAssets;      // 0x0038(0x0038)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(SoftCurrencyButton_C_GetAssets) == 0x000008, "Wrong alignment on SoftCurrencyButton_C_GetAssets");
static_assert(sizeof(SoftCurrencyButton_C_GetAssets) == 0x000070, "Wrong size on SoftCurrencyButton_C_GetAssets");
static_assert(offsetof(SoftCurrencyButton_C_GetAssets, ReturnValue) == 0x000000, "Member 'SoftCurrencyButton_C_GetAssets::ReturnValue' has a wrong offset!");
static_assert(offsetof(SoftCurrencyButton_C_GetAssets, K2Node_MakeStruct_MarinerSettingButtonAssets) == 0x000038, "Member 'SoftCurrencyButton_C_GetAssets::K2Node_MakeStruct_MarinerSettingButtonAssets' has a wrong offset!");

}

