#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SoftCurrencyButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SoftCurrencyButton.SoftCurrencyButton_C
// 0x0040 (0x04F8 - 0x04B8)
class USoftCurrencyButton_C final : public UMarinerSettingButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoveredAnim;                                       // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Highlight;                                         // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LabelText;                                         // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Material;                                          // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerButton*                         OverlayButton;                                     // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SoftCurrencyButton(int32 EntryPoint);
	void BndEvt__OverlayButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();

	struct FMarinerSettingButtonAssets GetAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SoftCurrencyButton_C">();
	}
	static class USoftCurrencyButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoftCurrencyButton_C>();
	}
};
static_assert(alignof(USoftCurrencyButton_C) == 0x000008, "Wrong alignment on USoftCurrencyButton_C");
static_assert(sizeof(USoftCurrencyButton_C) == 0x0004F8, "Wrong size on USoftCurrencyButton_C");
static_assert(offsetof(USoftCurrencyButton_C, UberGraphFrame) == 0x0004B8, "Member 'USoftCurrencyButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USoftCurrencyButton_C, HoveredAnim) == 0x0004C0, "Member 'USoftCurrencyButton_C::HoveredAnim' has a wrong offset!");
static_assert(offsetof(USoftCurrencyButton_C, Background) == 0x0004C8, "Member 'USoftCurrencyButton_C::Background' has a wrong offset!");
static_assert(offsetof(USoftCurrencyButton_C, Highlight) == 0x0004D0, "Member 'USoftCurrencyButton_C::Highlight' has a wrong offset!");
static_assert(offsetof(USoftCurrencyButton_C, Image_0) == 0x0004D8, "Member 'USoftCurrencyButton_C::Image_0' has a wrong offset!");
static_assert(offsetof(USoftCurrencyButton_C, LabelText) == 0x0004E0, "Member 'USoftCurrencyButton_C::LabelText' has a wrong offset!");
static_assert(offsetof(USoftCurrencyButton_C, Material) == 0x0004E8, "Member 'USoftCurrencyButton_C::Material' has a wrong offset!");
static_assert(offsetof(USoftCurrencyButton_C, OverlayButton) == 0x0004F0, "Member 'USoftCurrencyButton_C::OverlayButton' has a wrong offset!");

}

