#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpeedBoostCameraEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SpeedBoostCameraEffect.SpeedBoostCameraEffect_C
// 0x0020 (0x02F0 - 0x02D0)
class ASpeedBoostCameraEffect_C final : public AMarinerCameraLensEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class APlayerCameraManager*                   PlayerCameraManager;                               // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraAnimInst*                        CameraAnim;                                        // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SpeedBoostCameraEffect(int32 EntryPoint);
	void BP_OnDisabled();
	void BP_OnEnabled();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SpeedBoostCameraEffect_C">();
	}
	static class ASpeedBoostCameraEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASpeedBoostCameraEffect_C>();
	}
};
static_assert(alignof(ASpeedBoostCameraEffect_C) == 0x000010, "Wrong alignment on ASpeedBoostCameraEffect_C");
static_assert(sizeof(ASpeedBoostCameraEffect_C) == 0x0002F0, "Wrong size on ASpeedBoostCameraEffect_C");
static_assert(offsetof(ASpeedBoostCameraEffect_C, UberGraphFrame) == 0x0002D0, "Member 'ASpeedBoostCameraEffect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASpeedBoostCameraEffect_C, PlayerCameraManager) == 0x0002D8, "Member 'ASpeedBoostCameraEffect_C::PlayerCameraManager' has a wrong offset!");
static_assert(offsetof(ASpeedBoostCameraEffect_C, CameraAnim) == 0x0002E0, "Member 'ASpeedBoostCameraEffect_C::CameraAnim' has a wrong offset!");

}

