#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpeedBoostCameraEffect

#include "Basic.hpp"


namespace SDK::Params
{

// Function SpeedBoostCameraEffect.SpeedBoostCameraEffect_C.ExecuteUbergraph_SpeedBoostCameraEffect
// 0x0050 (0x0050 - 0x0000)
struct SpeedBoostCameraEffect_C_ExecuteUbergraph_SpeedBoostCameraEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27B8[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMarinerPlayerController*               K2Node_DynamicCast_AsMariner_Player_Controller;    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27B9[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMarinerPlayerController*               K2Node_DynamicCast_AsMariner_Player_Controller_1;  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27BA[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraAnimInst*                        CallFunc_PlayCameraAnim_ReturnValue;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpeedBoostCameraEffect_C_ExecuteUbergraph_SpeedBoostCameraEffect) == 0x000008, "Wrong alignment on SpeedBoostCameraEffect_C_ExecuteUbergraph_SpeedBoostCameraEffect");
static_assert(sizeof(SpeedBoostCameraEffect_C_ExecuteUbergraph_SpeedBoostCameraEffect) == 0x000050, "Wrong size on SpeedBoostCameraEffect_C_ExecuteUbergraph_SpeedBoostCameraEffect");
static_assert(offsetof(SpeedBoostCameraEffect_C_ExecuteUbergraph_SpeedBoostCameraEffect, EntryPoint) == 0x000000, "Member 'SpeedBoostCameraEffect_C_ExecuteUbergraph_SpeedBoostCameraEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(SpeedBoostCameraEffect_C_ExecuteUbergraph_SpeedBoostCameraEffect, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'SpeedBoostCameraEffect_C_ExecuteUbergraph_SpeedBoostCameraEffect::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpeedBoostCameraEffect_C_ExecuteUbergraph_SpeedBoostCameraEffect, CallFunc_GetOwner_ReturnValue_1) == 0x000010, "Member 'SpeedBoostCameraEffect_C_ExecuteUbergraph_SpeedBoostCameraEffect::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpeedBoostCameraEffect_C_ExecuteUbergraph_SpeedBoostCameraEffect, CallFunc_GetController_ReturnValue) == 0x000018, "Member 'SpeedBoostCameraEffect_C_ExecuteUbergraph_SpeedBoostCameraEffect::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpeedBoostCameraEffect_C_ExecuteUbergraph_SpeedBoostCameraEffect, CallFunc_GetController_ReturnValue_1) == 0x000020, "Member 'SpeedBoostCameraEffect_C_ExecuteUbergraph_SpeedBoostCameraEffect::CallFunc_GetController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpeedBoostCameraEffect_C_ExecuteUbergraph_SpeedBoostCameraEffect, K2Node_DynamicCast_AsMariner_Player_Controller) == 0x000028, "Member 'SpeedBoostCameraEffect_C_ExecuteUbergraph_SpeedBoostCameraEffect::K2Node_DynamicCast_AsMariner_Player_Controller' has a wrong offset!");
static_assert(offsetof(SpeedBoostCameraEffect_C_ExecuteUbergraph_SpeedBoostCameraEffect, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'SpeedBoostCameraEffect_C_ExecuteUbergraph_SpeedBoostCameraEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SpeedBoostCameraEffect_C_ExecuteUbergraph_SpeedBoostCameraEffect, K2Node_DynamicCast_AsMariner_Player_Controller_1) == 0x000038, "Member 'SpeedBoostCameraEffect_C_ExecuteUbergraph_SpeedBoostCameraEffect::K2Node_DynamicCast_AsMariner_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(SpeedBoostCameraEffect_C_ExecuteUbergraph_SpeedBoostCameraEffect, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'SpeedBoostCameraEffect_C_ExecuteUbergraph_SpeedBoostCameraEffect::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SpeedBoostCameraEffect_C_ExecuteUbergraph_SpeedBoostCameraEffect, CallFunc_PlayCameraAnim_ReturnValue) == 0x000048, "Member 'SpeedBoostCameraEffect_C_ExecuteUbergraph_SpeedBoostCameraEffect::CallFunc_PlayCameraAnim_ReturnValue' has a wrong offset!");

}

