#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StartScreenMenu

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Mariner_structs.hpp"
#include "MangoClient_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function StartScreenMenu.StartScreenMenu_C.ExecuteUbergraph_StartScreenMenu
// 0x0708 (0x0708 - 0x0000)
struct StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLoadedTotemDataResponse               K2Node_CustomEvent_TotemData;                      // 0x0018(0x0150)(ConstParm)
	TDelegate<void(struct FLoadedTotemDataResponse& TotemData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0168(0x0010)(ZeroConstructor, NoDestructor)
	struct FLoadedTotemDataResponse               Temp_struct_Variable;                              // 0x0178(0x0150)()
	bool                                          K2Node_Event_bFromSubMenu;                         // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMarinerRocketTotemCollection          K2Node_MakeStruct_MarinerRocketTotemCollection;    // 0x02D8(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMarinerGameInstance*                   K2Node_DynamicCast_AsMariner_Game_Instance;        // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerInputOverlay*                   CallFunc_GetInputOverlay_ReturnValue;              // 0x0320(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue;              // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetControllerConfiguration_ReturnValue;   // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerInputGlobals*                   CallFunc_GetInputGlobals_ReturnValue;              // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlatformPC_ReturnValue;                 // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMangoPlayerManager*                    CallFunc_Get_ReturnValue;                          // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMangoProfile                          CallFunc_GetMangoProfile_ReturnValue;              // 0x0358(0x02E0)(ConstParm)
	class UMarinerGameGlobals*                    CallFunc_GetGameGlobals_ReturnValue;               // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerLoadTotemDataFromProfile*       CallFunc_LoadTotemDataForProfile_ReturnValue;      // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMarinerRocketTotemCollection          CallFunc_GetDefaultRocketTotemCollection_ReturnValue; // 0x0648(0x0038)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_681[0x3];                                      // 0x0681(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0684(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0694(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_695[0x3];                                      // 0x0695(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARocketTotem_C*>                 CallFunc_GetAllActorsOfClass_OutActors;            // 0x0698(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x06A8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class ARocketTotem_C*                         CallFunc_Array_Get_Item;                           // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x06C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x06C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x06C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x06C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x06CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CB[0x5];                                      // 0x06CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x06D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DA[0x6];                                      // 0x06DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMusicManager_C*                        CallFunc_GetMusicManager_MusicManager;             // 0x06E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurrentlyInGameplayMap_ReturnValue;     // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E9[0x7];                                      // 0x06E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x06F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x06F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLoggingIn_ReturnValue;                  // 0x06F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FA[0x6];                                      // 0x06FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu) == 0x000008, "Wrong alignment on StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu");
static_assert(sizeof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu) == 0x000708, "Wrong size on StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, EntryPoint) == 0x000000, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, K2Node_CustomEvent_TotemData) == 0x000018, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::K2Node_CustomEvent_TotemData' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000168, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, Temp_struct_Variable) == 0x000178, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, K2Node_Event_bFromSubMenu) == 0x0002C8, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::K2Node_Event_bFromSubMenu' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, CallFunc_GetGameInstance_ReturnValue) == 0x0002D0, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, K2Node_MakeStruct_MarinerRocketTotemCollection) == 0x0002D8, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::K2Node_MakeStruct_MarinerRocketTotemCollection' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, K2Node_DynamicCast_AsMariner_Game_Instance) == 0x000310, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::K2Node_DynamicCast_AsMariner_Game_Instance' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, K2Node_DynamicCast_bSuccess) == 0x000318, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, CallFunc_GetInputOverlay_ReturnValue) == 0x000320, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::CallFunc_GetInputOverlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, CallFunc_GetUserSettings_ReturnValue) == 0x000328, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::CallFunc_GetUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, CallFunc_GetControllerConfiguration_ReturnValue) == 0x000330, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::CallFunc_GetControllerConfiguration_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, CallFunc_GetInputGlobals_ReturnValue) == 0x000338, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::CallFunc_GetInputGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, CallFunc_IsPlatformPC_ReturnValue) == 0x000340, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::CallFunc_IsPlatformPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, CallFunc_GetPlayerController_ReturnValue) == 0x000348, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, CallFunc_Get_ReturnValue) == 0x000350, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, CallFunc_GetMangoProfile_ReturnValue) == 0x000358, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::CallFunc_GetMangoProfile_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, CallFunc_GetGameGlobals_ReturnValue) == 0x000638, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::CallFunc_GetGameGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, CallFunc_LoadTotemDataForProfile_ReturnValue) == 0x000640, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::CallFunc_LoadTotemDataForProfile_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, CallFunc_GetDefaultRocketTotemCollection_ReturnValue) == 0x000648, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::CallFunc_GetDefaultRocketTotemCollection_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, CallFunc_IsValid_ReturnValue) == 0x000680, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, Temp_delegate_Variable) == 0x000684, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, Temp_bool_Variable) == 0x000694, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, CallFunc_GetAllActorsOfClass_OutActors) == 0x000698, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, Temp_struct_Variable_1) == 0x0006A8, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, CallFunc_Array_Get_Item) == 0x0006B8, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, CallFunc_PostEvent_ReturnValue) == 0x0006C0, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, CallFunc_Array_Length_ReturnValue) == 0x0006C4, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, Temp_byte_Variable) == 0x0006C8, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, CallFunc_Greater_IntInt_ReturnValue) == 0x0006C9, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, Temp_byte_Variable_1) == 0x0006CA, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, CallFunc_GetGameInstance_ReturnValue_1) == 0x0006D0, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, CallFunc_IsValid_ReturnValue_1) == 0x0006D8, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, K2Node_Select_Default) == 0x0006D9, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, CallFunc_GetMusicManager_MusicManager) == 0x0006E0, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::CallFunc_GetMusicManager_MusicManager' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, CallFunc_IsCurrentlyInGameplayMap_ReturnValue) == 0x0006E8, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::CallFunc_IsCurrentlyInGameplayMap_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, CallFunc_PlayAnimation_ReturnValue) == 0x0006F0, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, CallFunc_Not_PreBool_ReturnValue) == 0x0006F8, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, CallFunc_IsLoggingIn_ReturnValue) == 0x0006F9, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::CallFunc_IsLoggingIn_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu, CallFunc_PlayAnimation_ReturnValue_1) == 0x000700, "Member 'StartScreenMenu_C_ExecuteUbergraph_StartScreenMenu::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function StartScreenMenu.StartScreenMenu_C.BP_OnEntered
// 0x0001 (0x0001 - 0x0000)
struct StartScreenMenu_C_BP_OnEntered final
{
public:
	bool                                          bFromSubMenu;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StartScreenMenu_C_BP_OnEntered) == 0x000001, "Wrong alignment on StartScreenMenu_C_BP_OnEntered");
static_assert(sizeof(StartScreenMenu_C_BP_OnEntered) == 0x000001, "Wrong size on StartScreenMenu_C_BP_OnEntered");
static_assert(offsetof(StartScreenMenu_C_BP_OnEntered, bFromSubMenu) == 0x000000, "Member 'StartScreenMenu_C_BP_OnEntered::bFromSubMenu' has a wrong offset!");

// Function StartScreenMenu.StartScreenMenu_C.TotemDataLoaded_E6365B1243E89F9E28F03BBA77B71D34
// 0x0150 (0x0150 - 0x0000)
struct StartScreenMenu_C_TotemDataLoaded_E6365B1243E89F9E28F03BBA77B71D34 final
{
public:
	struct FLoadedTotemDataResponse               TotemData;                                         // 0x0000(0x0150)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(StartScreenMenu_C_TotemDataLoaded_E6365B1243E89F9E28F03BBA77B71D34) == 0x000008, "Wrong alignment on StartScreenMenu_C_TotemDataLoaded_E6365B1243E89F9E28F03BBA77B71D34");
static_assert(sizeof(StartScreenMenu_C_TotemDataLoaded_E6365B1243E89F9E28F03BBA77B71D34) == 0x000150, "Wrong size on StartScreenMenu_C_TotemDataLoaded_E6365B1243E89F9E28F03BBA77B71D34");
static_assert(offsetof(StartScreenMenu_C_TotemDataLoaded_E6365B1243E89F9E28F03BBA77B71D34, TotemData) == 0x000000, "Member 'StartScreenMenu_C_TotemDataLoaded_E6365B1243E89F9E28F03BBA77B71D34::TotemData' has a wrong offset!");

// Function StartScreenMenu.StartScreenMenu_C.HandleInput
// 0x0020 (0x0020 - 0x0000)
struct StartScreenMenu_C_HandleInput final
{
public:
	EMarinerInputActions                          InInput;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlatformPC_ReturnValue;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HandleInput_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerAsyncUIFlowHandler*             CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsyncFlowCommon_C*                     K2Node_DynamicCast_AsAsync_Flow_Common;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StartScreenMenu_C_HandleInput) == 0x000008, "Wrong alignment on StartScreenMenu_C_HandleInput");
static_assert(sizeof(StartScreenMenu_C_HandleInput) == 0x000020, "Wrong size on StartScreenMenu_C_HandleInput");
static_assert(offsetof(StartScreenMenu_C_HandleInput, InInput) == 0x000000, "Member 'StartScreenMenu_C_HandleInput::InInput' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_HandleInput, ReturnValue) == 0x000001, "Member 'StartScreenMenu_C_HandleInput::ReturnValue' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_HandleInput, CallFunc_IsPlatformPC_ReturnValue) == 0x000002, "Member 'StartScreenMenu_C_HandleInput::CallFunc_IsPlatformPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_HandleInput, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000003, "Member 'StartScreenMenu_C_HandleInput::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_HandleInput, CallFunc_HandleInput_ReturnValue) == 0x000004, "Member 'StartScreenMenu_C_HandleInput::CallFunc_HandleInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_HandleInput, CallFunc_BooleanAND_ReturnValue) == 0x000005, "Member 'StartScreenMenu_C_HandleInput::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_HandleInput, CallFunc_Get_ReturnValue) == 0x000008, "Member 'StartScreenMenu_C_HandleInput::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_HandleInput, K2Node_DynamicCast_AsAsync_Flow_Common) == 0x000010, "Member 'StartScreenMenu_C_HandleInput::K2Node_DynamicCast_AsAsync_Flow_Common' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_HandleInput, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'StartScreenMenu_C_HandleInput::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function StartScreenMenu.StartScreenMenu_C.OnLoginComplete
// 0x0020 (0x0020 - 0x0000)
struct StartScreenMenu_C_OnLoginComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerAsyncUIFlowHandler*             CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsyncFlowOnboarding_C*                 K2Node_DynamicCast_AsAsync_Flow_Onboarding;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMarinerOnboardingStates                      CallFunc_GetOnboardingState_ReturnValue;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StartScreenMenu_C_OnLoginComplete) == 0x000008, "Wrong alignment on StartScreenMenu_C_OnLoginComplete");
static_assert(sizeof(StartScreenMenu_C_OnLoginComplete) == 0x000020, "Wrong size on StartScreenMenu_C_OnLoginComplete");
static_assert(offsetof(StartScreenMenu_C_OnLoginComplete, ReturnValue) == 0x000000, "Member 'StartScreenMenu_C_OnLoginComplete::ReturnValue' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_OnLoginComplete, CallFunc_Get_ReturnValue) == 0x000008, "Member 'StartScreenMenu_C_OnLoginComplete::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_OnLoginComplete, K2Node_DynamicCast_AsAsync_Flow_Onboarding) == 0x000010, "Member 'StartScreenMenu_C_OnLoginComplete::K2Node_DynamicCast_AsAsync_Flow_Onboarding' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_OnLoginComplete, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'StartScreenMenu_C_OnLoginComplete::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_OnLoginComplete, CallFunc_GetOnboardingState_ReturnValue) == 0x000019, "Member 'StartScreenMenu_C_OnLoginComplete::CallFunc_GetOnboardingState_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_OnLoginComplete, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00001A, "Member 'StartScreenMenu_C_OnLoginComplete::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_OnLoginComplete, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00001B, "Member 'StartScreenMenu_C_OnLoginComplete::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_OnLoginComplete, CallFunc_BooleanOR_ReturnValue) == 0x00001C, "Member 'StartScreenMenu_C_OnLoginComplete::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function StartScreenMenu.StartScreenMenu_C.UpdateLocalizedTitle
// 0x0048 (0x0048 - 0x0000)
struct StartScreenMenu_C_UpdateLocalizedTitle final
{
public:
	TArray<class FString>                         SupportedLocales;                                  // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	class UMarinerGameUserSettings*               CallFunc_GetUserSettings_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSavedCulture_ReturnValue;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StartScreenMenu_C_UpdateLocalizedTitle) == 0x000008, "Wrong alignment on StartScreenMenu_C_UpdateLocalizedTitle");
static_assert(sizeof(StartScreenMenu_C_UpdateLocalizedTitle) == 0x000048, "Wrong size on StartScreenMenu_C_UpdateLocalizedTitle");
static_assert(offsetof(StartScreenMenu_C_UpdateLocalizedTitle, SupportedLocales) == 0x000000, "Member 'StartScreenMenu_C_UpdateLocalizedTitle::SupportedLocales' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_UpdateLocalizedTitle, Temp_bool_Variable) == 0x000010, "Member 'StartScreenMenu_C_UpdateLocalizedTitle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(StartScreenMenu_C_UpdateLocalizedTitle, Temp_byte_Variable) == 0x000011, "Member 'StartScreenMenu_C_UpdateLocalizedTitle::Temp_byte_Variable' has a wrong offset!");
