#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StatsFrame

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "MangoClient_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function StatsFrame.StatsFrame_C.ExecuteUbergraph_StatsFrame
// 0x01D8 (0x01D8 - 0x0000)
struct StatsFrame_C_ExecuteUbergraph_StatsFrame final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2197[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class UMarinerUIGlobals*                      CallFunc_GetUIGlobals_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMatchEnd                              K2Node_Event_MatchEndData;                         // 0x0020(0x0068)(ConstParm)
	struct FMatchEndPlayer                        K2Node_Event_MatchEndPlayerData;                   // 0x0088(0x00E8)()
	bool                                          K2Node_Event_bIsLocalPlayer;                       // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsClientTeam;                        // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2198[0x2];                                     // 0x0172(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Rank;                                 // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMarinerInputInterface> CallFunc_SetActiveInputWidget_InputWidget_CastInput; // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2199[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0190(0x0018)()
	int32                                         K2Node_ComponentBoundEvent_SelectedIndex;          // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219A[0x4];                                     // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219B[0x1];                                     // 0x01BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x01BC(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219C[0x3];                                     // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StatsFrame_C_ExecuteUbergraph_StatsFrame) == 0x000008, "Wrong alignment on StatsFrame_C_ExecuteUbergraph_StatsFrame");
static_assert(sizeof(StatsFrame_C_ExecuteUbergraph_StatsFrame) == 0x0001D8, "Wrong size on StatsFrame_C_ExecuteUbergraph_StatsFrame");
static_assert(offsetof(StatsFrame_C_ExecuteUbergraph_StatsFrame, EntryPoint) == 0x000000, "Member 'StatsFrame_C_ExecuteUbergraph_StatsFrame::EntryPoint' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_ExecuteUbergraph_StatsFrame, Temp_struct_Variable) == 0x000008, "Member 'StatsFrame_C_ExecuteUbergraph_StatsFrame::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_ExecuteUbergraph_StatsFrame, CallFunc_GetUIGlobals_ReturnValue) == 0x000018, "Member 'StatsFrame_C_ExecuteUbergraph_StatsFrame::CallFunc_GetUIGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_ExecuteUbergraph_StatsFrame, K2Node_Event_MatchEndData) == 0x000020, "Member 'StatsFrame_C_ExecuteUbergraph_StatsFrame::K2Node_Event_MatchEndData' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_ExecuteUbergraph_StatsFrame, K2Node_Event_MatchEndPlayerData) == 0x000088, "Member 'StatsFrame_C_ExecuteUbergraph_StatsFrame::K2Node_Event_MatchEndPlayerData' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_ExecuteUbergraph_StatsFrame, K2Node_Event_bIsLocalPlayer) == 0x000170, "Member 'StatsFrame_C_ExecuteUbergraph_StatsFrame::K2Node_Event_bIsLocalPlayer' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_ExecuteUbergraph_StatsFrame, K2Node_Event_bIsClientTeam) == 0x000171, "Member 'StatsFrame_C_ExecuteUbergraph_StatsFrame::K2Node_Event_bIsClientTeam' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_ExecuteUbergraph_StatsFrame, K2Node_Event_Rank) == 0x000174, "Member 'StatsFrame_C_ExecuteUbergraph_StatsFrame::K2Node_Event_Rank' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_ExecuteUbergraph_StatsFrame, CallFunc_SetActiveInputWidget_InputWidget_CastInput) == 0x000178, "Member 'StatsFrame_C_ExecuteUbergraph_StatsFrame::CallFunc_SetActiveInputWidget_InputWidget_CastInput' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_ExecuteUbergraph_StatsFrame, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000188, "Member 'StatsFrame_C_ExecuteUbergraph_StatsFrame::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_ExecuteUbergraph_StatsFrame, CallFunc_Conv_StringToText_ReturnValue) == 0x000190, "Member 'StatsFrame_C_ExecuteUbergraph_StatsFrame::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_ExecuteUbergraph_StatsFrame, K2Node_ComponentBoundEvent_SelectedIndex) == 0x0001A8, "Member 'StatsFrame_C_ExecuteUbergraph_StatsFrame::K2Node_ComponentBoundEvent_SelectedIndex' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_ExecuteUbergraph_StatsFrame, CallFunc_GetOwningPlayer_ReturnValue) == 0x0001B0, "Member 'StatsFrame_C_ExecuteUbergraph_StatsFrame::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_ExecuteUbergraph_StatsFrame, Temp_byte_Variable) == 0x0001B8, "Member 'StatsFrame_C_ExecuteUbergraph_StatsFrame::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_ExecuteUbergraph_StatsFrame, Temp_byte_Variable_1) == 0x0001B9, "Member 'StatsFrame_C_ExecuteUbergraph_StatsFrame::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_ExecuteUbergraph_StatsFrame, Temp_bool_Variable) == 0x0001BA, "Member 'StatsFrame_C_ExecuteUbergraph_StatsFrame::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_ExecuteUbergraph_StatsFrame, Temp_delegate_Variable) == 0x0001BC, "Member 'StatsFrame_C_ExecuteUbergraph_StatsFrame::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_ExecuteUbergraph_StatsFrame, K2Node_Select_Default) == 0x0001CC, "Member 'StatsFrame_C_ExecuteUbergraph_StatsFrame::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_ExecuteUbergraph_StatsFrame, CallFunc_PostEvent_ReturnValue) == 0x0001D0, "Member 'StatsFrame_C_ExecuteUbergraph_StatsFrame::CallFunc_PostEvent_ReturnValue' has a wrong offset!");

// Function StatsFrame.StatsFrame_C.BndEvt__Bound_PlayerPostGameWidget_K2Node_ComponentBoundEvent_0_OnSelectionIndexChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct StatsFrame_C_BndEvt__Bound_PlayerPostGameWidget_K2Node_ComponentBoundEvent_0_OnSelectionIndexChangedEvent__DelegateSignature final
{
public:
	int32                                         SelectedIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StatsFrame_C_BndEvt__Bound_PlayerPostGameWidget_K2Node_ComponentBoundEvent_0_OnSelectionIndexChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on StatsFrame_C_BndEvt__Bound_PlayerPostGameWidget_K2Node_ComponentBoundEvent_0_OnSelectionIndexChangedEvent__DelegateSignature");
static_assert(sizeof(StatsFrame_C_BndEvt__Bound_PlayerPostGameWidget_K2Node_ComponentBoundEvent_0_OnSelectionIndexChangedEvent__DelegateSignature) == 0x000004, "Wrong size on StatsFrame_C_BndEvt__Bound_PlayerPostGameWidget_K2Node_ComponentBoundEvent_0_OnSelectionIndexChangedEvent__DelegateSignature");
static_assert(offsetof(StatsFrame_C_BndEvt__Bound_PlayerPostGameWidget_K2Node_ComponentBoundEvent_0_OnSelectionIndexChangedEvent__DelegateSignature, SelectedIndex) == 0x000000, "Member 'StatsFrame_C_BndEvt__Bound_PlayerPostGameWidget_K2Node_ComponentBoundEvent_0_OnSelectionIndexChangedEvent__DelegateSignature::SelectedIndex' has a wrong offset!");

// Function StatsFrame.StatsFrame_C.PopulatePlayerStats
// 0x0158 (0x0158 - 0x0000)
struct StatsFrame_C_PopulatePlayerStats final
{
public:
	struct FMatchEnd                              MatchEndData;                                      // 0x0000(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
	struct FMatchEndPlayer                        MatchEndPlayerData;                                // 0x0068(0x00E8)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          bIsLocalPlayer;                                    // 0x0150(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsClientTeam;                                     // 0x0151(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219D[0x2];                                     // 0x0152(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param_Rank;                                        // 0x0154(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StatsFrame_C_PopulatePlayerStats) == 0x000008, "Wrong alignment on StatsFrame_C_PopulatePlayerStats");
static_assert(sizeof(StatsFrame_C_PopulatePlayerStats) == 0x000158, "Wrong size on StatsFrame_C_PopulatePlayerStats");
static_assert(offsetof(StatsFrame_C_PopulatePlayerStats, MatchEndData) == 0x000000, "Member 'StatsFrame_C_PopulatePlayerStats::MatchEndData' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_PopulatePlayerStats, MatchEndPlayerData) == 0x000068, "Member 'StatsFrame_C_PopulatePlayerStats::MatchEndPlayerData' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_PopulatePlayerStats, bIsLocalPlayer) == 0x000150, "Member 'StatsFrame_C_PopulatePlayerStats::bIsLocalPlayer' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_PopulatePlayerStats, bIsClientTeam) == 0x000151, "Member 'StatsFrame_C_PopulatePlayerStats::bIsClientTeam' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_PopulatePlayerStats, Param_Rank) == 0x000154, "Member 'StatsFrame_C_PopulatePlayerStats::Param_Rank' has a wrong offset!");

// Function StatsFrame.StatsFrame_C.PopulatePlayer
// 0x0170 (0x0170 - 0x0000)
struct StatsFrame_C_PopulatePlayer final
{
public:
	struct FMatchEnd                              MatchEnd;                                          // 0x0000(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FMatchEndPlayer                        MatchEndPlayer;                                    // 0x0068(0x00E8)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsLocalPlayer;                                     // 0x0150(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsClientTeam;                                      // 0x0151(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219E[0x6];                                     // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0158(0x0018)()
};
static_assert(alignof(StatsFrame_C_PopulatePlayer) == 0x000008, "Wrong alignment on StatsFrame_C_PopulatePlayer");
static_assert(sizeof(StatsFrame_C_PopulatePlayer) == 0x000170, "Wrong size on StatsFrame_C_PopulatePlayer");
static_assert(offsetof(StatsFrame_C_PopulatePlayer, MatchEnd) == 0x000000, "Member 'StatsFrame_C_PopulatePlayer::MatchEnd' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_PopulatePlayer, MatchEndPlayer) == 0x000068, "Member 'StatsFrame_C_PopulatePlayer::MatchEndPlayer' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_PopulatePlayer, IsLocalPlayer) == 0x000150, "Member 'StatsFrame_C_PopulatePlayer::IsLocalPlayer' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_PopulatePlayer, IsClientTeam) == 0x000151, "Member 'StatsFrame_C_PopulatePlayer::IsClientTeam' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_PopulatePlayer, CallFunc_Conv_StringToText_ReturnValue) == 0x000158, "Member 'StatsFrame_C_PopulatePlayer::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function StatsFrame.StatsFrame_C.PopulateEmpty
// 0x0001 (0x0001 - 0x0000)
struct StatsFrame_C_PopulateEmpty final
{
public:
	bool                                          IsClientTeam;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StatsFrame_C_PopulateEmpty) == 0x000001, "Wrong alignment on StatsFrame_C_PopulateEmpty");
static_assert(sizeof(StatsFrame_C_PopulateEmpty) == 0x000001, "Wrong size on StatsFrame_C_PopulateEmpty");
static_assert(offsetof(StatsFrame_C_PopulateEmpty, IsClientTeam) == 0x000000, "Member 'StatsFrame_C_PopulateEmpty::IsClientTeam' has a wrong offset!");

// Function StatsFrame.StatsFrame_C.SetBackground
// 0x0001 (0x0001 - 0x0000)
struct StatsFrame_C_SetBackground final
{
public:
	bool                                          IsClientTeam;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StatsFrame_C_SetBackground) == 0x000001, "Wrong alignment on StatsFrame_C_SetBackground");
static_assert(sizeof(StatsFrame_C_SetBackground) == 0x000001, "Wrong size on StatsFrame_C_SetBackground");
static_assert(offsetof(StatsFrame_C_SetBackground, IsClientTeam) == 0x000000, "Member 'StatsFrame_C_SetBackground::IsClientTeam' has a wrong offset!");

// Function StatsFrame.StatsFrame_C.SetPlayerName
// 0x0080 (0x0080 - 0x0000)
struct StatsFrame_C_SetPlayerName final
{
public:
	class FText                                   Param_PlayerName;                                  // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsLocalPlayer;                                     // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EMarinerGameOutcome                           GameOutcome;                                       // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219F[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            CallFunc_GetColor_Color;                           // 0x0020(0x0028)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTruncatedUserName_ReturnValue;         // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0068(0x0018)()
};
static_assert(alignof(StatsFrame_C_SetPlayerName) == 0x000008, "Wrong alignment on StatsFrame_C_SetPlayerName");
static_assert(sizeof(StatsFrame_C_SetPlayerName) == 0x000080, "Wrong size on StatsFrame_C_SetPlayerName");
static_assert(offsetof(StatsFrame_C_SetPlayerName, Param_PlayerName) == 0x000000, "Member 'StatsFrame_C_SetPlayerName::Param_PlayerName' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetPlayerName, IsLocalPlayer) == 0x000018, "Member 'StatsFrame_C_SetPlayerName::IsLocalPlayer' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetPlayerName, GameOutcome) == 0x000019, "Member 'StatsFrame_C_SetPlayerName::GameOutcome' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetPlayerName, CallFunc_GetColor_Color) == 0x000020, "Member 'StatsFrame_C_SetPlayerName::CallFunc_GetColor_Color' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetPlayerName, CallFunc_Conv_TextToString_ReturnValue) == 0x000048, "Member 'StatsFrame_C_SetPlayerName::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetPlayerName, CallFunc_GetTruncatedUserName_ReturnValue) == 0x000058, "Member 'StatsFrame_C_SetPlayerName::CallFunc_GetTruncatedUserName_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetPlayerName, CallFunc_Conv_StringToText_ReturnValue) == 0x000068, "Member 'StatsFrame_C_SetPlayerName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function StatsFrame.StatsFrame_C.SetIcon
// 0x0120 (0x0120 - 0x0000)
struct StatsFrame_C_SetIcon final
{
public:
	struct FMatchEndPlayer                        MatchEndPlayer;                                    // 0x0000(0x00E8)(BlueprintVisible, BlueprintReadOnly, Parm)
	TDelegate<void(struct FSlateBrush& Brush)>    K2Node_CreateDelegate_OutputDelegate;              // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GetMarinerGlobals_IsValid;                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21A0[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGlobals*                        CallFunc_GetMarinerGlobals_ReturnValue;            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerGameGlobals*                    CallFunc_GetGameGlobals_ReturnValue;               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerPlayableCharacter*              CallFunc_GetCharacterDataByEngineID_ReturnValue;   // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UMarinerSkinCollectionDataAsset*  CallFunc_GetSkinByEngineID_ReturnValue;            // 0x0118(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StatsFrame_C_SetIcon) == 0x000008, "Wrong alignment on StatsFrame_C_SetIcon");
static_assert(sizeof(StatsFrame_C_SetIcon) == 0x000120, "Wrong size on StatsFrame_C_SetIcon");
static_assert(offsetof(StatsFrame_C_SetIcon, MatchEndPlayer) == 0x000000, "Member 'StatsFrame_C_SetIcon::MatchEndPlayer' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetIcon, K2Node_CreateDelegate_OutputDelegate) == 0x0000E8, "Member 'StatsFrame_C_SetIcon::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetIcon, CallFunc_GetMarinerGlobals_IsValid) == 0x0000F8, "Member 'StatsFrame_C_SetIcon::CallFunc_GetMarinerGlobals_IsValid' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetIcon, CallFunc_GetMarinerGlobals_ReturnValue) == 0x000100, "Member 'StatsFrame_C_SetIcon::CallFunc_GetMarinerGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetIcon, CallFunc_GetGameGlobals_ReturnValue) == 0x000108, "Member 'StatsFrame_C_SetIcon::CallFunc_GetGameGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetIcon, CallFunc_GetCharacterDataByEngineID_ReturnValue) == 0x000110, "Member 'StatsFrame_C_SetIcon::CallFunc_GetCharacterDataByEngineID_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetIcon, CallFunc_GetSkinByEngineID_ReturnValue) == 0x000118, "Member 'StatsFrame_C_SetIcon::CallFunc_GetSkinByEngineID_ReturnValue' has a wrong offset!");

// Function StatsFrame.StatsFrame_C.SetStats
// 0x0238 (0x0238 - 0x0000)
struct StatsFrame_C_SetStats final
{
public:
	struct FMatchEnd                              MatchEnd;                                          // 0x0000(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FMatchEndPlayer                        MatchEndPlayer;                                    // 0x0068(0x00E8)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsLocalPlayer;                                     // 0x0150(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21A1[0x3];                                     // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x0154(0x0008)(NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            CallFunc_GetColor_Color;                           // 0x0160(0x0028)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21A2[0x4];                                     // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class FText>                CallFunc_GetPostGameModeStats_Stats;               // 0x0190(0x0050)(ZeroConstructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21A3[0x4];                                     // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x01E8(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value;                           // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21A4[0x6];                                     // 0x020A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0210(0x0018)()
	class UStatData_C*                            CallFunc_Create_ReturnValue;                       // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StatsFrame_C_SetStats) == 0x000008, "Wrong alignment on StatsFrame_C_SetStats");
static_assert(sizeof(StatsFrame_C_SetStats) == 0x000238, "Wrong size on StatsFrame_C_SetStats");
static_assert(offsetof(StatsFrame_C_SetStats, MatchEnd) == 0x000000, "Member 'StatsFrame_C_SetStats::MatchEnd' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetStats, MatchEndPlayer) == 0x000068, "Member 'StatsFrame_C_SetStats::MatchEndPlayer' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetStats, IsLocalPlayer) == 0x000150, "Member 'StatsFrame_C_SetStats::IsLocalPlayer' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetStats, K2Node_MakeStruct_SlateChildSize) == 0x000154, "Member 'StatsFrame_C_SetStats::K2Node_MakeStruct_SlateChildSize' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetStats, Temp_int_Loop_Counter_Variable) == 0x00015C, "Member 'StatsFrame_C_SetStats::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetStats, CallFunc_GetColor_Color) == 0x000160, "Member 'StatsFrame_C_SetStats::CallFunc_GetColor_Color' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetStats, CallFunc_Add_IntInt_ReturnValue) == 0x000188, "Member 'StatsFrame_C_SetStats::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetStats, CallFunc_GetPostGameModeStats_Stats) == 0x000190, "Member 'StatsFrame_C_SetStats::CallFunc_GetPostGameModeStats_Stats' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetStats, Temp_int_Array_Index_Variable) == 0x0001E0, "Member 'StatsFrame_C_SetStats::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetStats, CallFunc_Map_Keys_Keys) == 0x0001E8, "Member 'StatsFrame_C_SetStats::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetStats, CallFunc_Array_Get_Item) == 0x0001F8, "Member 'StatsFrame_C_SetStats::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetStats, CallFunc_Array_Length_ReturnValue) == 0x000200, "Member 'StatsFrame_C_SetStats::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetStats, CallFunc_Map_Find_Value) == 0x000204, "Member 'StatsFrame_C_SetStats::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetStats, CallFunc_Map_Find_ReturnValue) == 0x000208, "Member 'StatsFrame_C_SetStats::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetStats, CallFunc_Less_IntInt_ReturnValue) == 0x000209, "Member 'StatsFrame_C_SetStats::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetStats, CallFunc_Conv_IntToText_ReturnValue) == 0x000210, "Member 'StatsFrame_C_SetStats::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetStats, CallFunc_Create_ReturnValue) == 0x000228, "Member 'StatsFrame_C_SetStats::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetStats, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000230, "Member 'StatsFrame_C_SetStats::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

// Function StatsFrame.StatsFrame_C.SetCharacterLevel
// 0x0008 (0x0008 - 0x0000)
struct StatsFrame_C_SetCharacterLevel final
{
public:
	int32                                         Param_CharacterLevel;                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLocalPlayer;                                     // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsClientTeam;                                      // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsRanked;                                          // 0x0006(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StatsFrame_C_SetCharacterLevel) == 0x000004, "Wrong alignment on StatsFrame_C_SetCharacterLevel");
static_assert(sizeof(StatsFrame_C_SetCharacterLevel) == 0x000008, "Wrong size on StatsFrame_C_SetCharacterLevel");
static_assert(offsetof(StatsFrame_C_SetCharacterLevel, Param_CharacterLevel) == 0x000000, "Member 'StatsFrame_C_SetCharacterLevel::Param_CharacterLevel' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetCharacterLevel, IsLocalPlayer) == 0x000004, "Member 'StatsFrame_C_SetCharacterLevel::IsLocalPlayer' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetCharacterLevel, IsClientTeam) == 0x000005, "Member 'StatsFrame_C_SetCharacterLevel::IsClientTeam' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetCharacterLevel, IsRanked) == 0x000006, "Member 'StatsFrame_C_SetCharacterLevel::IsRanked' has a wrong offset!");

// Function StatsFrame.StatsFrame_C.OnLoadSmallPortrait
// 0x00A0 (0x00A0 - 0x0000)
struct StatsFrame_C_OnLoadSmallPortrait final
{
public:
	struct FSlateBrush                            Brush;                                             // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21A5[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StatsFrame_C_OnLoadSmallPortrait) == 0x000008, "Wrong alignment on StatsFrame_C_OnLoadSmallPortrait");
static_assert(sizeof(StatsFrame_C_OnLoadSmallPortrait) == 0x0000A0, "Wrong size on StatsFrame_C_OnLoadSmallPortrait");
static_assert(offsetof(StatsFrame_C_OnLoadSmallPortrait, Brush) == 0x000000, "Member 'StatsFrame_C_OnLoadSmallPortrait::Brush' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_OnLoadSmallPortrait, K2Node_DynamicCast_AsTexture_2D) == 0x000088, "Member 'StatsFrame_C_OnLoadSmallPortrait::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_OnLoadSmallPortrait, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'StatsFrame_C_OnLoadSmallPortrait::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_OnLoadSmallPortrait, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000098, "Member 'StatsFrame_C_OnLoadSmallPortrait::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function StatsFrame.StatsFrame_C.GetColor
// 0x00B8 (0x00B8 - 0x0000)
struct StatsFrame_C_GetColor final
{
public:
	bool                                          IsLocalPlayer;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EMarinerGameOutcome                           GameOutcome;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21A6[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            Color;                                             // 0x0008(0x0028)(Parm, OutParm)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21A7[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21A8[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21A9[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x006C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x007C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21AA[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0090(0x0028)()
};
static_assert(alignof(StatsFrame_C_GetColor) == 0x000008, "Wrong alignment on StatsFrame_C_GetColor");
static_assert(sizeof(StatsFrame_C_GetColor) == 0x0000B8, "Wrong size on StatsFrame_C_GetColor");
static_assert(offsetof(StatsFrame_C_GetColor, IsLocalPlayer) == 0x000000, "Member 'StatsFrame_C_GetColor::IsLocalPlayer' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_GetColor, GameOutcome) == 0x000001, "Member 'StatsFrame_C_GetColor::GameOutcome' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_GetColor, Color) == 0x000008, "Member 'StatsFrame_C_GetColor::Color' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_GetColor, Temp_struct_Variable) == 0x000030, "Member 'StatsFrame_C_GetColor::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_GetColor, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000040, "Member 'StatsFrame_C_GetColor::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_GetColor, Temp_struct_Variable_1) == 0x000044, "Member 'StatsFrame_C_GetColor::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_GetColor, Temp_bool_Variable) == 0x000054, "Member 'StatsFrame_C_GetColor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_GetColor, Temp_struct_Variable_2) == 0x000058, "Member 'StatsFrame_C_GetColor::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_GetColor, Temp_bool_Variable_1) == 0x000068, "Member 'StatsFrame_C_GetColor::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_GetColor, K2Node_Select_Default) == 0x00006C, "Member 'StatsFrame_C_GetColor::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_GetColor, K2Node_Select_Default_1) == 0x00007C, "Member 'StatsFrame_C_GetColor::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_GetColor, K2Node_MakeStruct_SlateColor) == 0x000090, "Member 'StatsFrame_C_GetColor::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function StatsFrame.StatsFrame_C.SetRank
// 0x000C (0x000C - 0x0000)
struct StatsFrame_C_SetRank final
{
public:
	int32                                         Param_Rank;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRankedSession;                                   // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StatsFrame_C_SetRank) == 0x000004, "Wrong alignment on StatsFrame_C_SetRank");
static_assert(sizeof(StatsFrame_C_SetRank) == 0x00000C, "Wrong size on StatsFrame_C_SetRank");
static_assert(offsetof(StatsFrame_C_SetRank, Param_Rank) == 0x000000, "Member 'StatsFrame_C_SetRank::Param_Rank' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetRank, IsRankedSession) == 0x000004, "Member 'StatsFrame_C_SetRank::IsRankedSession' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetRank, Temp_byte_Variable) == 0x000005, "Member 'StatsFrame_C_SetRank::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(StatsFrame_C_SetRank, Temp_byte_Variable_1) == 0x000006, "Member 'StatsFrame_C_SetRank::Temp_byte_Variable_1' has a wrong offset!");
