#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StatsFrame

#include "Basic.hpp"

#include "MangoClient_structs.hpp"
#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"
#include "UMG_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StatsFrame.StatsFrame_C
// 0x0070 (0x0328 - 0x02B8)
class UStatsFrame_C final : public UMarinerStatsFrame
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetSwitcher*                        BGSwitcher;                                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CharacterIcon;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterLevelWidget_C*                CharacterLevel;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EnemyBG;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Platform;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlayerBG;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerName;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 QuitterStatOverlay;                                // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URankWidget_C*                          Rank;                                              // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               RankPanel;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         StatPanel;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_StatsFrame(int32 EntryPoint);
	void BndEvt__Bound_PlayerPostGameWidget_K2Node_ComponentBoundEvent_0_OnSelectionIndexChangedEvent__DelegateSignature(int32 SelectedIndex);
	void PopulatePlayerStats(const struct FMatchEnd& MatchEndData, const struct FMatchEndPlayer& MatchEndPlayerData, bool bIsLocalPlayer, bool bIsClientTeam, int32 Rank_0);
	void PopulatePlayer(const struct FMatchEnd& MatchEnd, const struct FMatchEndPlayer& MatchEndPlayer, bool IsLocalPlayer, bool IsClientTeam);
	void PopulateEmpty(bool IsClientTeam);
	void SetBackground(bool IsClientTeam);
	void SetPlayerName(const class FText& PlayerName_0, bool IsLocalPlayer, EMarinerGameOutcome GameOutcome);
	void SetIcon(const struct FMatchEndPlayer& MatchEndPlayer);
	void SetStats(const struct FMatchEnd& MatchEnd, const struct FMatchEndPlayer& MatchEndPlayer, bool IsLocalPlayer);
	void SetCharacterLevel(int32 CharacterLevel_0, bool IsLocalPlayer, bool IsClientTeam, bool IsRanked);
	void OnLoadSmallPortrait(struct FSlateBrush& Brush);
	void GetColor(bool IsLocalPlayer, EMarinerGameOutcome GameOutcome, struct FSlateColor* Color);
	void SetRank(int32 Rank_0, bool IsRankedSession);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StatsFrame_C">();
	}
	static class UStatsFrame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStatsFrame_C>();
	}
};
static_assert(alignof(UStatsFrame_C) == 0x000008, "Wrong alignment on UStatsFrame_C");
static_assert(sizeof(UStatsFrame_C) == 0x000328, "Wrong size on UStatsFrame_C");
static_assert(offsetof(UStatsFrame_C, UberGraphFrame) == 0x0002B8, "Member 'UStatsFrame_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStatsFrame_C, BGSwitcher) == 0x0002C0, "Member 'UStatsFrame_C::BGSwitcher' has a wrong offset!");
static_assert(offsetof(UStatsFrame_C, CharacterIcon) == 0x0002C8, "Member 'UStatsFrame_C::CharacterIcon' has a wrong offset!");
static_assert(offsetof(UStatsFrame_C, CharacterLevel) == 0x0002D0, "Member 'UStatsFrame_C::CharacterLevel' has a wrong offset!");
static_assert(offsetof(UStatsFrame_C, EnemyBG) == 0x0002D8, "Member 'UStatsFrame_C::EnemyBG' has a wrong offset!");
static_assert(offsetof(UStatsFrame_C, Image_0) == 0x0002E0, "Member 'UStatsFrame_C::Image_0' has a wrong offset!");
static_assert(offsetof(UStatsFrame_C, Image_1) == 0x0002E8, "Member 'UStatsFrame_C::Image_1' has a wrong offset!");
static_assert(offsetof(UStatsFrame_C, Platform) == 0x0002F0, "Member 'UStatsFrame_C::Platform' has a wrong offset!");
static_assert(offsetof(UStatsFrame_C, PlayerBG) == 0x0002F8, "Member 'UStatsFrame_C::PlayerBG' has a wrong offset!");
static_assert(offsetof(UStatsFrame_C, PlayerName) == 0x000300, "Member 'UStatsFrame_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UStatsFrame_C, QuitterStatOverlay) == 0x000308, "Member 'UStatsFrame_C::QuitterStatOverlay' has a wrong offset!");
static_assert(offsetof(UStatsFrame_C, Rank) == 0x000310, "Member 'UStatsFrame_C::Rank' has a wrong offset!");
static_assert(offsetof(UStatsFrame_C, RankPanel) == 0x000318, "Member 'UStatsFrame_C::RankPanel' has a wrong offset!");
static_assert(offsetof(UStatsFrame_C, StatPanel) == 0x000320, "Member 'UStatsFrame_C::StatPanel' has a wrong offset!");

}

