#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StepperWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StepperWidget.StepperWidget_C
// 0x0060 (0x0290 - 0x0230)
class UStepperWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMarinerButton*                         Decrement;                                         // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DecrementText;                                     // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerButton*                         Incremement;                                       // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             IncrementText;                                     // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PrimarySelection;                                  // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FString>                         StepperValues;                                     // 0x0260(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         CurrentIndex;                                      // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DefaultSelection;                                  // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldWrap;                                       // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F46[0x7];                                     // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastInlineDelegateProperty_             StepperSelectionChanged;                           // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void StepperSelectionChanged__DelegateSignature();
	void ExecuteUbergraph_StepperWidget(int32 EntryPoint);
	void BndEvt__Decrement_K2Node_ComponentBoundEvent_29_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Incremement_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Initialize(TArray<class FString>& StepperValueSet, bool ShouldWrap, int32 StartingIndex);
	void SetSteppers();
	void GetCurrentSelection(class FString* CurrentSelection);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StepperWidget_C">();
	}
	static class UStepperWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStepperWidget_C>();
	}
};
static_assert(alignof(UStepperWidget_C) == 0x000008, "Wrong alignment on UStepperWidget_C");
static_assert(sizeof(UStepperWidget_C) == 0x000290, "Wrong size on UStepperWidget_C");
static_assert(offsetof(UStepperWidget_C, UberGraphFrame) == 0x000230, "Member 'UStepperWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStepperWidget_C, Decrement) == 0x000238, "Member 'UStepperWidget_C::Decrement' has a wrong offset!");
static_assert(offsetof(UStepperWidget_C, DecrementText) == 0x000240, "Member 'UStepperWidget_C::DecrementText' has a wrong offset!");
static_assert(offsetof(UStepperWidget_C, Incremement) == 0x000248, "Member 'UStepperWidget_C::Incremement' has a wrong offset!");
static_assert(offsetof(UStepperWidget_C, IncrementText) == 0x000250, "Member 'UStepperWidget_C::IncrementText' has a wrong offset!");
static_assert(offsetof(UStepperWidget_C, PrimarySelection) == 0x000258, "Member 'UStepperWidget_C::PrimarySelection' has a wrong offset!");
static_assert(offsetof(UStepperWidget_C, StepperValues) == 0x000260, "Member 'UStepperWidget_C::StepperValues' has a wrong offset!");
static_assert(offsetof(UStepperWidget_C, CurrentIndex) == 0x000270, "Member 'UStepperWidget_C::CurrentIndex' has a wrong offset!");
static_assert(offsetof(UStepperWidget_C, DefaultSelection) == 0x000274, "Member 'UStepperWidget_C::DefaultSelection' has a wrong offset!");
static_assert(offsetof(UStepperWidget_C, bShouldWrap) == 0x000278, "Member 'UStepperWidget_C::bShouldWrap' has a wrong offset!");
static_assert(offsetof(UStepperWidget_C, StepperSelectionChanged) == 0x000280, "Member 'UStepperWidget_C::StepperSelectionChanged' has a wrong offset!");

}

