#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StepperWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function StepperWidget.StepperWidget_C.ExecuteUbergraph_StepperWidget
// 0x001C (0x001C - 0x0000)
struct StepperWidget_C_ExecuteUbergraph_StepperWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StepperWidget_C_ExecuteUbergraph_StepperWidget) == 0x000004, "Wrong alignment on StepperWidget_C_ExecuteUbergraph_StepperWidget");
static_assert(sizeof(StepperWidget_C_ExecuteUbergraph_StepperWidget) == 0x00001C, "Wrong size on StepperWidget_C_ExecuteUbergraph_StepperWidget");
static_assert(offsetof(StepperWidget_C_ExecuteUbergraph_StepperWidget, EntryPoint) == 0x000000, "Member 'StepperWidget_C_ExecuteUbergraph_StepperWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(StepperWidget_C_ExecuteUbergraph_StepperWidget, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'StepperWidget_C_ExecuteUbergraph_StepperWidget::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StepperWidget_C_ExecuteUbergraph_StepperWidget, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'StepperWidget_C_ExecuteUbergraph_StepperWidget::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StepperWidget_C_ExecuteUbergraph_StepperWidget, CallFunc_Array_LastIndex_ReturnValue) == 0x00000C, "Member 'StepperWidget_C_ExecuteUbergraph_StepperWidget::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(StepperWidget_C_ExecuteUbergraph_StepperWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'StepperWidget_C_ExecuteUbergraph_StepperWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StepperWidget_C_ExecuteUbergraph_StepperWidget, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'StepperWidget_C_ExecuteUbergraph_StepperWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(StepperWidget_C_ExecuteUbergraph_StepperWidget, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000018, "Member 'StepperWidget_C_ExecuteUbergraph_StepperWidget::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function StepperWidget.StepperWidget_C.Initialize
// 0x0018 (0x0018 - 0x0000)
struct StepperWidget_C_Initialize final
{
public:
	TArray<class FString>                         StepperValueSet;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	bool                                          ShouldWrap;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StartingIndex;                                     // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StepperWidget_C_Initialize) == 0x000008, "Wrong alignment on StepperWidget_C_Initialize");
static_assert(sizeof(StepperWidget_C_Initialize) == 0x000018, "Wrong size on StepperWidget_C_Initialize");
static_assert(offsetof(StepperWidget_C_Initialize, StepperValueSet) == 0x000000, "Member 'StepperWidget_C_Initialize::StepperValueSet' has a wrong offset!");
static_assert(offsetof(StepperWidget_C_Initialize, ShouldWrap) == 0x000010, "Member 'StepperWidget_C_Initialize::ShouldWrap' has a wrong offset!");
static_assert(offsetof(StepperWidget_C_Initialize, StartingIndex) == 0x000014, "Member 'StepperWidget_C_Initialize::StartingIndex' has a wrong offset!");

// Function StepperWidget.StepperWidget_C.SetSteppers
// 0x00A0 (0x00A0 - 0x0000)
struct StepperWidget_C_SetSteppers final
{
public:
	class FString                                 IncrementString;                                   // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 DecrementString;                                   // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CenterString;                                      // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue_1;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0058(0x0018)()
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_1;            // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0080(0x0018)()
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StepperWidget_C_SetSteppers) == 0x000008, "Wrong alignment on StepperWidget_C_SetSteppers");
static_assert(sizeof(StepperWidget_C_SetSteppers) == 0x0000A0, "Wrong size on StepperWidget_C_SetSteppers");
static_assert(offsetof(StepperWidget_C_SetSteppers, IncrementString) == 0x000000, "Member 'StepperWidget_C_SetSteppers::IncrementString' has a wrong offset!");
static_assert(offsetof(StepperWidget_C_SetSteppers, DecrementString) == 0x000010, "Member 'StepperWidget_C_SetSteppers::DecrementString' has a wrong offset!");
static_assert(offsetof(StepperWidget_C_SetSteppers, CenterString) == 0x000020, "Member 'StepperWidget_C_SetSteppers::CenterString' has a wrong offset!");
static_assert(offsetof(StepperWidget_C_SetSteppers, CallFunc_NotEqual_StrStr_ReturnValue) == 0x000030, "Member 'StepperWidget_C_SetSteppers::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(StepperWidget_C_SetSteppers, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'StepperWidget_C_SetSteppers::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StepperWidget_C_SetSteppers, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'StepperWidget_C_SetSteppers::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(StepperWidget_C_SetSteppers, CallFunc_NotEqual_StrStr_ReturnValue_1) == 0x000050, "Member 'StepperWidget_C_SetSteppers::CallFunc_NotEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StepperWidget_C_SetSteppers, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000058, "Member 'StepperWidget_C_SetSteppers::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StepperWidget_C_SetSteppers, CallFunc_Array_LastIndex_ReturnValue) == 0x000070, "Member 'StepperWidget_C_SetSteppers::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(StepperWidget_C_SetSteppers, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000074, "Member 'StepperWidget_C_SetSteppers::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StepperWidget_C_SetSteppers, CallFunc_Subtract_IntInt_ReturnValue) == 0x000078, "Member 'StepperWidget_C_SetSteppers::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StepperWidget_C_SetSteppers, CallFunc_Array_LastIndex_ReturnValue_1) == 0x00007C, "Member 'StepperWidget_C_SetSteppers::CallFunc_Array_LastIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StepperWidget_C_SetSteppers, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000080, "Member 'StepperWidget_C_SetSteppers::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(StepperWidget_C_SetSteppers, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000098, "Member 'StepperWidget_C_SetSteppers::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function StepperWidget.StepperWidget_C.GetCurrentSelection
// 0x0010 (0x0010 - 0x0000)
struct StepperWidget_C_GetCurrentSelection final
{
public:
	class FString                                 CurrentSelection;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(StepperWidget_C_GetCurrentSelection) == 0x000008, "Wrong alignment on StepperWidget_C_GetCurrentSelection");
static_assert(sizeof(StepperWidget_C_GetCurrentSelection) == 0x000010, "Wrong size on StepperWidget_C_GetCurrentSelection");
static_assert(offsetof(StepperWidget_C_GetCurrentSelection, CurrentSelection) == 0x000000, "Member 'StepperWidget_C_GetCurrentSelection::CurrentSelection' has a wrong offset!");

}

