#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StoreBundlesMenu

#include "Basic.hpp"

#include "Mariner_structs.hpp"
#include "MangoClient_structs.hpp"


namespace SDK::Params
{

// Function StoreBundlesMenu.StoreBundlesMenu_C.ExecuteUbergraph_StoreBundlesMenu
// 0x0020 (0x0020 - 0x0000)
struct StoreBundlesMenu_C_ExecuteUbergraph_StoreBundlesMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMarinerInputInterface> CallFunc_SetActiveInputWidget_InputWidget_CastInput; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bFromSubMenu;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreBundlesMenu_C_ExecuteUbergraph_StoreBundlesMenu) == 0x000008, "Wrong alignment on StoreBundlesMenu_C_ExecuteUbergraph_StoreBundlesMenu");
static_assert(sizeof(StoreBundlesMenu_C_ExecuteUbergraph_StoreBundlesMenu) == 0x000020, "Wrong size on StoreBundlesMenu_C_ExecuteUbergraph_StoreBundlesMenu");
static_assert(offsetof(StoreBundlesMenu_C_ExecuteUbergraph_StoreBundlesMenu, EntryPoint) == 0x000000, "Member 'StoreBundlesMenu_C_ExecuteUbergraph_StoreBundlesMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_ExecuteUbergraph_StoreBundlesMenu, CallFunc_SetActiveInputWidget_InputWidget_CastInput) == 0x000008, "Member 'StoreBundlesMenu_C_ExecuteUbergraph_StoreBundlesMenu::CallFunc_SetActiveInputWidget_InputWidget_CastInput' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_ExecuteUbergraph_StoreBundlesMenu, K2Node_Event_bFromSubMenu) == 0x000018, "Member 'StoreBundlesMenu_C_ExecuteUbergraph_StoreBundlesMenu::K2Node_Event_bFromSubMenu' has a wrong offset!");

// Function StoreBundlesMenu.StoreBundlesMenu_C.BP_OnEntered
// 0x0001 (0x0001 - 0x0000)
struct StoreBundlesMenu_C_BP_OnEntered final
{
public:
	bool                                          bFromSubMenu;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreBundlesMenu_C_BP_OnEntered) == 0x000001, "Wrong alignment on StoreBundlesMenu_C_BP_OnEntered");
static_assert(sizeof(StoreBundlesMenu_C_BP_OnEntered) == 0x000001, "Wrong size on StoreBundlesMenu_C_BP_OnEntered");
static_assert(offsetof(StoreBundlesMenu_C_BP_OnEntered, bFromSubMenu) == 0x000000, "Member 'StoreBundlesMenu_C_BP_OnEntered::bFromSubMenu' has a wrong offset!");

// Function StoreBundlesMenu.StoreBundlesMenu_C.PopulateOffers
// 0x0140 (0x0140 - 0x0000)
struct StoreBundlesMenu_C_PopulateOffers final
{
public:
	int32                                         NextIndex;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UMarinerLayeredButton* Instance)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UStoreBundleButton_C*                   CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMangoCMSManager*                       CallFunc_Get_ReturnValue;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FMangoNativeOffer>              CallFunc_GetAllNativeOffers_ReturnValue;           // 0x0038(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMangoNativeOffer                      CallFunc_Array_Get_Item;                           // 0x0050(0x00C0)()
	class UStoreBundleButton_C*                   K2Node_DynamicCast_AsStore_Bundle_Button;          // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0128(0x0018)()
};
static_assert(alignof(StoreBundlesMenu_C_PopulateOffers) == 0x000008, "Wrong alignment on StoreBundlesMenu_C_PopulateOffers");
static_assert(sizeof(StoreBundlesMenu_C_PopulateOffers) == 0x000140, "Wrong size on StoreBundlesMenu_C_PopulateOffers");
static_assert(offsetof(StoreBundlesMenu_C_PopulateOffers, NextIndex) == 0x000000, "Member 'StoreBundlesMenu_C_PopulateOffers::NextIndex' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_PopulateOffers, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'StoreBundlesMenu_C_PopulateOffers::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_PopulateOffers, Temp_int_Array_Index_Variable) == 0x000008, "Member 'StoreBundlesMenu_C_PopulateOffers::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_PopulateOffers, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'StoreBundlesMenu_C_PopulateOffers::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_PopulateOffers, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'StoreBundlesMenu_C_PopulateOffers::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_PopulateOffers, CallFunc_Create_ReturnValue) == 0x000020, "Member 'StoreBundlesMenu_C_PopulateOffers::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_PopulateOffers, CallFunc_Get_ReturnValue) == 0x000028, "Member 'StoreBundlesMenu_C_PopulateOffers::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_PopulateOffers, CallFunc_AddChild_ReturnValue) == 0x000030, "Member 'StoreBundlesMenu_C_PopulateOffers::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_PopulateOffers, CallFunc_GetAllNativeOffers_ReturnValue) == 0x000038, "Member 'StoreBundlesMenu_C_PopulateOffers::CallFunc_GetAllNativeOffers_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_PopulateOffers, CallFunc_GetChildAt_ReturnValue) == 0x000048, "Member 'StoreBundlesMenu_C_PopulateOffers::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_PopulateOffers, CallFunc_Array_Get_Item) == 0x000050, "Member 'StoreBundlesMenu_C_PopulateOffers::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_PopulateOffers, K2Node_DynamicCast_AsStore_Bundle_Button) == 0x000110, "Member 'StoreBundlesMenu_C_PopulateOffers::K2Node_DynamicCast_AsStore_Bundle_Button' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_PopulateOffers, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'StoreBundlesMenu_C_PopulateOffers::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_PopulateOffers, CallFunc_Array_Length_ReturnValue) == 0x00011C, "Member 'StoreBundlesMenu_C_PopulateOffers::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_PopulateOffers, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000120, "Member 'StoreBundlesMenu_C_PopulateOffers::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_PopulateOffers, CallFunc_Less_IntInt_ReturnValue) == 0x000121, "Member 'StoreBundlesMenu_C_PopulateOffers::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_PopulateOffers, CallFunc_Conv_StringToText_ReturnValue) == 0x000128, "Member 'StoreBundlesMenu_C_PopulateOffers::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function StoreBundlesMenu.StoreBundlesMenu_C.OnItemSelected
// 0x00D8 (0x00D8 - 0x0000)
struct StoreBundlesMenu_C_OnItemSelected final
{
public:
	class UMarinerLayeredButton*                  ButtonInstance;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStoreBundleButton_C*                   K2Node_DynamicCast_AsStore_Bundle_Button;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanPurchaseNativeOffer_CanPurchase;       // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMangoNativeOffer                      CallFunc_GetAssociatedOffer_Offer;                 // 0x0018(0x00C0)()
};
static_assert(alignof(StoreBundlesMenu_C_OnItemSelected) == 0x000008, "Wrong alignment on StoreBundlesMenu_C_OnItemSelected");
static_assert(sizeof(StoreBundlesMenu_C_OnItemSelected) == 0x0000D8, "Wrong size on StoreBundlesMenu_C_OnItemSelected");
static_assert(offsetof(StoreBundlesMenu_C_OnItemSelected, ButtonInstance) == 0x000000, "Member 'StoreBundlesMenu_C_OnItemSelected::ButtonInstance' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_OnItemSelected, K2Node_DynamicCast_AsStore_Bundle_Button) == 0x000008, "Member 'StoreBundlesMenu_C_OnItemSelected::K2Node_DynamicCast_AsStore_Bundle_Button' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_OnItemSelected, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'StoreBundlesMenu_C_OnItemSelected::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_OnItemSelected, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000011, "Member 'StoreBundlesMenu_C_OnItemSelected::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_OnItemSelected, CallFunc_CanPurchaseNativeOffer_CanPurchase) == 0x000012, "Member 'StoreBundlesMenu_C_OnItemSelected::CallFunc_CanPurchaseNativeOffer_CanPurchase' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_OnItemSelected, CallFunc_GetAssociatedOffer_Offer) == 0x000018, "Member 'StoreBundlesMenu_C_OnItemSelected::CallFunc_GetAssociatedOffer_Offer' has a wrong offset!");

// Function StoreBundlesMenu.StoreBundlesMenu_C.UpdatePrompts
// 0x0128 (0x0128 - 0x0000)
struct StoreBundlesMenu_C_UpdatePrompts final
{
public:
	bool                                          CallFunc_CanPurchaseNativeOffer_CanPurchase;       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMarinerPromptData                     K2Node_MakeStruct_MarinerPromptData;               // 0x0008(0x0118)()
	bool                                          CallFunc_AddHostPrompt_ReturnValue;                // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ClearHostPrompts_ReturnValue;             // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreBundlesMenu_C_UpdatePrompts) == 0x000008, "Wrong alignment on StoreBundlesMenu_C_UpdatePrompts");
static_assert(sizeof(StoreBundlesMenu_C_UpdatePrompts) == 0x000128, "Wrong size on StoreBundlesMenu_C_UpdatePrompts");
static_assert(offsetof(StoreBundlesMenu_C_UpdatePrompts, CallFunc_CanPurchaseNativeOffer_CanPurchase) == 0x000000, "Member 'StoreBundlesMenu_C_UpdatePrompts::CallFunc_CanPurchaseNativeOffer_CanPurchase' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_UpdatePrompts, K2Node_MakeStruct_MarinerPromptData) == 0x000008, "Member 'StoreBundlesMenu_C_UpdatePrompts::K2Node_MakeStruct_MarinerPromptData' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_UpdatePrompts, CallFunc_AddHostPrompt_ReturnValue) == 0x000120, "Member 'StoreBundlesMenu_C_UpdatePrompts::CallFunc_AddHostPrompt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_UpdatePrompts, CallFunc_ClearHostPrompts_ReturnValue) == 0x000121, "Member 'StoreBundlesMenu_C_UpdatePrompts::CallFunc_ClearHostPrompts_ReturnValue' has a wrong offset!");

// Function StoreBundlesMenu.StoreBundlesMenu_C.HandleInput
// 0x0020 (0x0020 - 0x0000)
struct StoreBundlesMenu_C_HandleInput final
{
public:
	EMarinerInputActions                          InInput;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HandleInput_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanPurchaseNativeOffer_CanPurchase;       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerAsyncUIFlowHandler*             CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsyncFlowOffers_C*                     K2Node_DynamicCast_AsAsync_Flow_Offers;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreBundlesMenu_C_HandleInput) == 0x000008, "Wrong alignment on StoreBundlesMenu_C_HandleInput");
static_assert(sizeof(StoreBundlesMenu_C_HandleInput) == 0x000020, "Wrong size on StoreBundlesMenu_C_HandleInput");
static_assert(offsetof(StoreBundlesMenu_C_HandleInput, InInput) == 0x000000, "Member 'StoreBundlesMenu_C_HandleInput::InInput' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_HandleInput, ReturnValue) == 0x000001, "Member 'StoreBundlesMenu_C_HandleInput::ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_HandleInput, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'StoreBundlesMenu_C_HandleInput::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_HandleInput, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000003, "Member 'StoreBundlesMenu_C_HandleInput::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_HandleInput, CallFunc_HandleInput_ReturnValue) == 0x000004, "Member 'StoreBundlesMenu_C_HandleInput::CallFunc_HandleInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_HandleInput, CallFunc_BooleanOR_ReturnValue) == 0x000005, "Member 'StoreBundlesMenu_C_HandleInput::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_HandleInput, CallFunc_CanPurchaseNativeOffer_CanPurchase) == 0x000006, "Member 'StoreBundlesMenu_C_HandleInput::CallFunc_CanPurchaseNativeOffer_CanPurchase' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_HandleInput, CallFunc_Get_ReturnValue) == 0x000008, "Member 'StoreBundlesMenu_C_HandleInput::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_HandleInput, K2Node_DynamicCast_AsAsync_Flow_Offers) == 0x000010, "Member 'StoreBundlesMenu_C_HandleInput::K2Node_DynamicCast_AsAsync_Flow_Offers' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_HandleInput, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'StoreBundlesMenu_C_HandleInput::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function StoreBundlesMenu.StoreBundlesMenu_C.CanPurchaseNativeOffer
// 0x0003 (0x0003 - 0x0000)
struct StoreBundlesMenu_C_CanPurchaseNativeOffer final
{
public:
	bool                                          CanPurchase;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreBundlesMenu_C_CanPurchaseNativeOffer) == 0x000001, "Wrong alignment on StoreBundlesMenu_C_CanPurchaseNativeOffer");
static_assert(sizeof(StoreBundlesMenu_C_CanPurchaseNativeOffer) == 0x000003, "Wrong size on StoreBundlesMenu_C_CanPurchaseNativeOffer");
static_assert(offsetof(StoreBundlesMenu_C_CanPurchaseNativeOffer, CanPurchase) == 0x000000, "Member 'StoreBundlesMenu_C_CanPurchaseNativeOffer::CanPurchase' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_CanPurchaseNativeOffer, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'StoreBundlesMenu_C_CanPurchaseNativeOffer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreBundlesMenu_C_CanPurchaseNativeOffer, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'StoreBundlesMenu_C_CanPurchaseNativeOffer::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

