#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StoreCategoryButton

#include "Basic.hpp"

#include "MangoClient_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StoreCategoryButton.StoreCategoryButton_C
// 0x0130 (0x30A8 - 0x2F78)
class UStoreCategoryButton_C final : public UMarinerLayeredButton
{
public:
	class UWidgetAnimation*                       UnhoveredAnim;                                     // 0x2F78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoveredAnim;                                       // 0x2F80(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             AuxiliaryTextAuxText;                              // 0x2F88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x2F90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Border;                                            // 0x2F98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x2FA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x2FA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Material;                                          // 0x2FB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PrimaryText;                                       // 0x2FB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultPromptBanner_C*                 PromptBanner;                                      // 0x2FC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               RootSizeBox;                                       // 0x2FC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FMangoPurchaseOffer                    CategoryOffer;                                     // 0x2FD0(0x00D8)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void SetCategoryText(const class FText& InText);
	void SetAssociatedOffer(const struct FMangoPurchaseOffer& InOffer);
	void GetAssociatedOffer(struct FMangoPurchaseOffer* Offer);

	struct FMarinerLayeredButtonAssets GetAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StoreCategoryButton_C">();
	}
	static class UStoreCategoryButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStoreCategoryButton_C>();
	}
};
static_assert(alignof(UStoreCategoryButton_C) == 0x000008, "Wrong alignment on UStoreCategoryButton_C");
static_assert(sizeof(UStoreCategoryButton_C) == 0x0030A8, "Wrong size on UStoreCategoryButton_C");
static_assert(offsetof(UStoreCategoryButton_C, UnhoveredAnim) == 0x002F78, "Member 'UStoreCategoryButton_C::UnhoveredAnim' has a wrong offset!");
static_assert(offsetof(UStoreCategoryButton_C, HoveredAnim) == 0x002F80, "Member 'UStoreCategoryButton_C::HoveredAnim' has a wrong offset!");
static_assert(offsetof(UStoreCategoryButton_C, AuxiliaryTextAuxText) == 0x002F88, "Member 'UStoreCategoryButton_C::AuxiliaryTextAuxText' has a wrong offset!");
static_assert(offsetof(UStoreCategoryButton_C, Background) == 0x002F90, "Member 'UStoreCategoryButton_C::Background' has a wrong offset!");
static_assert(offsetof(UStoreCategoryButton_C, Border) == 0x002F98, "Member 'UStoreCategoryButton_C::Border' has a wrong offset!");
static_assert(offsetof(UStoreCategoryButton_C, Button) == 0x002FA0, "Member 'UStoreCategoryButton_C::Button' has a wrong offset!");
static_assert(offsetof(UStoreCategoryButton_C, Icon) == 0x002FA8, "Member 'UStoreCategoryButton_C::Icon' has a wrong offset!");
static_assert(offsetof(UStoreCategoryButton_C, Material) == 0x002FB0, "Member 'UStoreCategoryButton_C::Material' has a wrong offset!");
static_assert(offsetof(UStoreCategoryButton_C, PrimaryText) == 0x002FB8, "Member 'UStoreCategoryButton_C::PrimaryText' has a wrong offset!");
static_assert(offsetof(UStoreCategoryButton_C, PromptBanner) == 0x002FC0, "Member 'UStoreCategoryButton_C::PromptBanner' has a wrong offset!");
static_assert(offsetof(UStoreCategoryButton_C, RootSizeBox) == 0x002FC8, "Member 'UStoreCategoryButton_C::RootSizeBox' has a wrong offset!");
static_assert(offsetof(UStoreCategoryButton_C, CategoryOffer) == 0x002FD0, "Member 'UStoreCategoryButton_C::CategoryOffer' has a wrong offset!");

}

