#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StoreCategoryButton

#include "Basic.hpp"

#include "MangoClient_structs.hpp"
#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function StoreCategoryButton.StoreCategoryButton_C.SetCategoryText
// 0x0018 (0x0018 - 0x0000)
struct StoreCategoryButton_C_SetCategoryText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(StoreCategoryButton_C_SetCategoryText) == 0x000008, "Wrong alignment on StoreCategoryButton_C_SetCategoryText");
static_assert(sizeof(StoreCategoryButton_C_SetCategoryText) == 0x000018, "Wrong size on StoreCategoryButton_C_SetCategoryText");
static_assert(offsetof(StoreCategoryButton_C_SetCategoryText, InText) == 0x000000, "Member 'StoreCategoryButton_C_SetCategoryText::InText' has a wrong offset!");

// Function StoreCategoryButton.StoreCategoryButton_C.SetAssociatedOffer
// 0x00D8 (0x00D8 - 0x0000)
struct StoreCategoryButton_C_SetAssociatedOffer final
{
public:
	struct FMangoPurchaseOffer                    InOffer;                                           // 0x0000(0x00D8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(StoreCategoryButton_C_SetAssociatedOffer) == 0x000008, "Wrong alignment on StoreCategoryButton_C_SetAssociatedOffer");
static_assert(sizeof(StoreCategoryButton_C_SetAssociatedOffer) == 0x0000D8, "Wrong size on StoreCategoryButton_C_SetAssociatedOffer");
static_assert(offsetof(StoreCategoryButton_C_SetAssociatedOffer, InOffer) == 0x000000, "Member 'StoreCategoryButton_C_SetAssociatedOffer::InOffer' has a wrong offset!");

// Function StoreCategoryButton.StoreCategoryButton_C.GetAssociatedOffer
// 0x00D8 (0x00D8 - 0x0000)
struct StoreCategoryButton_C_GetAssociatedOffer final
{
public:
	struct FMangoPurchaseOffer                    Offer;                                             // 0x0000(0x00D8)(Parm, OutParm)
};
static_assert(alignof(StoreCategoryButton_C_GetAssociatedOffer) == 0x000008, "Wrong alignment on StoreCategoryButton_C_GetAssociatedOffer");
static_assert(sizeof(StoreCategoryButton_C_GetAssociatedOffer) == 0x0000D8, "Wrong size on StoreCategoryButton_C_GetAssociatedOffer");
static_assert(offsetof(StoreCategoryButton_C_GetAssociatedOffer, Offer) == 0x000000, "Member 'StoreCategoryButton_C_GetAssociatedOffer::Offer' has a wrong offset!");

// Function StoreCategoryButton.StoreCategoryButton_C.GetAssets
// 0x00D0 (0x00D0 - 0x0000)
struct StoreCategoryButton_C_GetAssets final
{
public:
	struct FMarinerLayeredButtonAssets            ReturnValue;                                       // 0x0000(0x0068)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference)
	struct FMarinerLayeredButtonAssets            K2Node_MakeStruct_MarinerLayeredButtonAssets;      // 0x0068(0x0068)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(StoreCategoryButton_C_GetAssets) == 0x000008, "Wrong alignment on StoreCategoryButton_C_GetAssets");
static_assert(sizeof(StoreCategoryButton_C_GetAssets) == 0x0000D0, "Wrong size on StoreCategoryButton_C_GetAssets");
static_assert(offsetof(StoreCategoryButton_C_GetAssets, ReturnValue) == 0x000000, "Member 'StoreCategoryButton_C_GetAssets::ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreCategoryButton_C_GetAssets, K2Node_MakeStruct_MarinerLayeredButtonAssets) == 0x000068, "Member 'StoreCategoryButton_C_GetAssets::K2Node_MakeStruct_MarinerLayeredButtonAssets' has a wrong offset!");

}

