#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StoreBundleButton

#include "Basic.hpp"

#include "MangoClient_structs.hpp"
#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function StoreBundleButton.StoreBundleButton_C.SetCategoryText
// 0x0018 (0x0018 - 0x0000)
struct StoreBundleButton_C_SetCategoryText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(StoreBundleButton_C_SetCategoryText) == 0x000008, "Wrong alignment on StoreBundleButton_C_SetCategoryText");
static_assert(sizeof(StoreBundleButton_C_SetCategoryText) == 0x000018, "Wrong size on StoreBundleButton_C_SetCategoryText");
static_assert(offsetof(StoreBundleButton_C_SetCategoryText, InText) == 0x000000, "Member 'StoreBundleButton_C_SetCategoryText::InText' has a wrong offset!");

// Function StoreBundleButton.StoreBundleButton_C.SetAssociatedOffer
// 0x00D8 (0x00D8 - 0x0000)
struct StoreBundleButton_C_SetAssociatedOffer final
{
public:
	struct FMangoNativeOffer                      InOffer;                                           // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F50[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoInventoryManager*                 CallFunc_Get_ReturnValue;                          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNativeOfferOwned_ReturnValue;           // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreBundleButton_C_SetAssociatedOffer) == 0x000008, "Wrong alignment on StoreBundleButton_C_SetAssociatedOffer");
static_assert(sizeof(StoreBundleButton_C_SetAssociatedOffer) == 0x0000D8, "Wrong size on StoreBundleButton_C_SetAssociatedOffer");
static_assert(offsetof(StoreBundleButton_C_SetAssociatedOffer, InOffer) == 0x000000, "Member 'StoreBundleButton_C_SetAssociatedOffer::InOffer' has a wrong offset!");
static_assert(offsetof(StoreBundleButton_C_SetAssociatedOffer, CallFunc_Not_PreBool_ReturnValue) == 0x0000C0, "Member 'StoreBundleButton_C_SetAssociatedOffer::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreBundleButton_C_SetAssociatedOffer, CallFunc_Get_ReturnValue) == 0x0000C8, "Member 'StoreBundleButton_C_SetAssociatedOffer::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreBundleButton_C_SetAssociatedOffer, CallFunc_IsNativeOfferOwned_ReturnValue) == 0x0000D0, "Member 'StoreBundleButton_C_SetAssociatedOffer::CallFunc_IsNativeOfferOwned_ReturnValue' has a wrong offset!");

// Function StoreBundleButton.StoreBundleButton_C.GetAssociatedOffer
// 0x00C0 (0x00C0 - 0x0000)
struct StoreBundleButton_C_GetAssociatedOffer final
{
public:
	struct FMangoNativeOffer                      Offer;                                             // 0x0000(0x00C0)(Parm, OutParm)
};
static_assert(alignof(StoreBundleButton_C_GetAssociatedOffer) == 0x000008, "Wrong alignment on StoreBundleButton_C_GetAssociatedOffer");
static_assert(sizeof(StoreBundleButton_C_GetAssociatedOffer) == 0x0000C0, "Wrong size on StoreBundleButton_C_GetAssociatedOffer");
static_assert(offsetof(StoreBundleButton_C_GetAssociatedOffer, Offer) == 0x000000, "Member 'StoreBundleButton_C_GetAssociatedOffer::Offer' has a wrong offset!");

// Function StoreBundleButton.StoreBundleButton_C.GetAssets
// 0x00D0 (0x00D0 - 0x0000)
struct StoreBundleButton_C_GetAssets final
{
public:
	struct FMarinerLayeredButtonAssets            ReturnValue;                                       // 0x0000(0x0068)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference)
	struct FMarinerLayeredButtonAssets            K2Node_MakeStruct_MarinerLayeredButtonAssets;      // 0x0068(0x0068)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(StoreBundleButton_C_GetAssets) == 0x000008, "Wrong alignment on StoreBundleButton_C_GetAssets");
static_assert(sizeof(StoreBundleButton_C_GetAssets) == 0x0000D0, "Wrong size on StoreBundleButton_C_GetAssets");
static_assert(offsetof(StoreBundleButton_C_GetAssets, ReturnValue) == 0x000000, "Member 'StoreBundleButton_C_GetAssets::ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreBundleButton_C_GetAssets, K2Node_MakeStruct_MarinerLayeredButtonAssets) == 0x000068, "Member 'StoreBundleButton_C_GetAssets::K2Node_MakeStruct_MarinerLayeredButtonAssets' has a wrong offset!");

}

