#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StoreCharactersMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StoreCharactersMenu.StoreCharactersMenu_C
// 0x0050 (0x0530 - 0x04E0)
class UStoreCharactersMenu_C final : public UMarinerMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCharacterStoreButton_C*                CharacterStoreButton;                              // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterStoreButton_C*                CharacterStoreButton_23;                           // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterStoreButton_C*                CharacterStoreButton_24;                           // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterStoreButton_C*                CharacterStoreButton_25;                           // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterStoreButton_C*                CharacterStoreButton_C_28;                         // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterStoreButton_C*                CharacterStoreButton_C_29;                         // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterStoreButton_C*                CharacterStoreButton_C_30;                         // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterStoreButton_C*                CharacterStoreButton_C_31;                         // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerGridPanel*                      ContentPanel;                                      // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_StoreCharactersMenu(int32 EntryPoint);
	void OnItemSelected(class UMarinerLayeredButton* ButtonInstance);
	void OnChildHighlightChanged();
	void BP_OnEntered(bool bFromSubMenu);
	void LoadFinished_2585ECF1418A0A154D23F7847E3DF951(const TArray<class UItemLoadResponse*>& LoadedDataResponse);
	void LoadFailed_2585ECF1418A0A154D23F7847E3DF951();
	void PopulateOffers();
	void UpdatePrompts();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StoreCharactersMenu_C">();
	}
	static class UStoreCharactersMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStoreCharactersMenu_C>();
	}
};
static_assert(alignof(UStoreCharactersMenu_C) == 0x000008, "Wrong alignment on UStoreCharactersMenu_C");
static_assert(sizeof(UStoreCharactersMenu_C) == 0x000530, "Wrong size on UStoreCharactersMenu_C");
static_assert(offsetof(UStoreCharactersMenu_C, UberGraphFrame) == 0x0004E0, "Member 'UStoreCharactersMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStoreCharactersMenu_C, CharacterStoreButton) == 0x0004E8, "Member 'UStoreCharactersMenu_C::CharacterStoreButton' has a wrong offset!");
static_assert(offsetof(UStoreCharactersMenu_C, CharacterStoreButton_23) == 0x0004F0, "Member 'UStoreCharactersMenu_C::CharacterStoreButton_23' has a wrong offset!");
static_assert(offsetof(UStoreCharactersMenu_C, CharacterStoreButton_24) == 0x0004F8, "Member 'UStoreCharactersMenu_C::CharacterStoreButton_24' has a wrong offset!");
static_assert(offsetof(UStoreCharactersMenu_C, CharacterStoreButton_25) == 0x000500, "Member 'UStoreCharactersMenu_C::CharacterStoreButton_25' has a wrong offset!");
static_assert(offsetof(UStoreCharactersMenu_C, CharacterStoreButton_C_28) == 0x000508, "Member 'UStoreCharactersMenu_C::CharacterStoreButton_C_28' has a wrong offset!");
static_assert(offsetof(UStoreCharactersMenu_C, CharacterStoreButton_C_29) == 0x000510, "Member 'UStoreCharactersMenu_C::CharacterStoreButton_C_29' has a wrong offset!");
static_assert(offsetof(UStoreCharactersMenu_C, CharacterStoreButton_C_30) == 0x000518, "Member 'UStoreCharactersMenu_C::CharacterStoreButton_C_30' has a wrong offset!");
static_assert(offsetof(UStoreCharactersMenu_C, CharacterStoreButton_C_31) == 0x000520, "Member 'UStoreCharactersMenu_C::CharacterStoreButton_C_31' has a wrong offset!");
static_assert(offsetof(UStoreCharactersMenu_C, ContentPanel) == 0x000528, "Member 'UStoreCharactersMenu_C::ContentPanel' has a wrong offset!");

}

