#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StoreRocketbuxMenu

#include "Basic.hpp"

#include "Mariner_structs.hpp"
#include "MangoClient_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function StoreRocketbuxMenu.StoreRocketbuxMenu_C.ExecuteUbergraph_StoreRocketbuxMenu
// 0x0080 (0x0080 - 0x0000)
struct StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlatformPS4_ReturnValue;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bFromSubMenu;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2419[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMarinerInputInterface> CallFunc_SetActiveInputWidget_InputWidget_CastInput; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UMangoInventoryManager*                 CallFunc_Get_ReturnValue;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bToSubLayer;                          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoveSelf_ReturnValue;                   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241A[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerGameInstance*                   CallFunc_GetMarinerGameInstance_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FMarinerServerTravelConfig& Config)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class UMarinerAsyncUIFlowHandler*             CallFunc_Get_ReturnValue_1;                        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsyncFlowInGameStore_C*                K2Node_DynamicCast_AsAsync_Flow_in_Game_Store;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetInGameStoreActive_ReturnValue;         // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241B[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerAsyncUIFlowHandler*             CallFunc_Get_ReturnValue_2;                        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsyncFlowInGameStore_C*                K2Node_DynamicCast_AsAsync_Flow_in_Game_Store_1;   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetInGameStoreActive_ReturnValue_1;       // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu) == 0x000008, "Wrong alignment on StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu");
static_assert(sizeof(StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu) == 0x000080, "Wrong size on StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu");
static_assert(offsetof(StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu, EntryPoint) == 0x000000, "Member 'StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu, CallFunc_IsPlatformPS4_ReturnValue) == 0x000004, "Member 'StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu::CallFunc_IsPlatformPS4_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu, K2Node_Event_bFromSubMenu) == 0x000005, "Member 'StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu::K2Node_Event_bFromSubMenu' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu, CallFunc_SetActiveInputWidget_InputWidget_CastInput) == 0x000008, "Member 'StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu::CallFunc_SetActiveInputWidget_InputWidget_CastInput' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu, CallFunc_Get_ReturnValue) == 0x000028, "Member 'StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu, K2Node_Event_bToSubLayer) == 0x000030, "Member 'StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu::K2Node_Event_bToSubLayer' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu, CallFunc_RemoveSelf_ReturnValue) == 0x000031, "Member 'StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu::CallFunc_RemoveSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu, CallFunc_GetMarinerGameInstance_ReturnValue) == 0x000038, "Member 'StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu::CallFunc_GetMarinerGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu, CallFunc_Get_ReturnValue_1) == 0x000050, "Member 'StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu, K2Node_DynamicCast_AsAsync_Flow_in_Game_Store) == 0x000058, "Member 'StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu::K2Node_DynamicCast_AsAsync_Flow_in_Game_Store' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu, CallFunc_SetInGameStoreActive_ReturnValue) == 0x000061, "Member 'StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu::CallFunc_SetInGameStoreActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu, CallFunc_Get_ReturnValue_2) == 0x000068, "Member 'StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu::CallFunc_Get_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu, K2Node_DynamicCast_AsAsync_Flow_in_Game_Store_1) == 0x000070, "Member 'StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu::K2Node_DynamicCast_AsAsync_Flow_in_Game_Store_1' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu, CallFunc_SetInGameStoreActive_ReturnValue_1) == 0x000079, "Member 'StoreRocketbuxMenu_C_ExecuteUbergraph_StoreRocketbuxMenu::CallFunc_SetInGameStoreActive_ReturnValue_1' has a wrong offset!");

// Function StoreRocketbuxMenu.StoreRocketbuxMenu_C.BP_OnExited
// 0x0001 (0x0001 - 0x0000)
struct StoreRocketbuxMenu_C_BP_OnExited final
{
public:
	bool                                          bToSubLayer;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreRocketbuxMenu_C_BP_OnExited) == 0x000001, "Wrong alignment on StoreRocketbuxMenu_C_BP_OnExited");
static_assert(sizeof(StoreRocketbuxMenu_C_BP_OnExited) == 0x000001, "Wrong size on StoreRocketbuxMenu_C_BP_OnExited");
static_assert(offsetof(StoreRocketbuxMenu_C_BP_OnExited, bToSubLayer) == 0x000000, "Member 'StoreRocketbuxMenu_C_BP_OnExited::bToSubLayer' has a wrong offset!");

// Function StoreRocketbuxMenu.StoreRocketbuxMenu_C.BP_OnEntered
// 0x0001 (0x0001 - 0x0000)
struct StoreRocketbuxMenu_C_BP_OnEntered final
{
public:
	bool                                          bFromSubMenu;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreRocketbuxMenu_C_BP_OnEntered) == 0x000001, "Wrong alignment on StoreRocketbuxMenu_C_BP_OnEntered");
static_assert(sizeof(StoreRocketbuxMenu_C_BP_OnEntered) == 0x000001, "Wrong size on StoreRocketbuxMenu_C_BP_OnEntered");
static_assert(offsetof(StoreRocketbuxMenu_C_BP_OnEntered, bFromSubMenu) == 0x000000, "Member 'StoreRocketbuxMenu_C_BP_OnEntered::bFromSubMenu' has a wrong offset!");

// Function StoreRocketbuxMenu.StoreRocketbuxMenu_C.PopulateNativeOffers
// 0x0130 (0x0130 - 0x0000)
struct StoreRocketbuxMenu_C_PopulateNativeOffers final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UMarinerLayeredButton* Instance, bool bFromKeyboard, bool bFromMouse)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241C[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoTxnManager*                       CallFunc_Get_ReturnValue;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMangoCMSManager*                       CallFunc_Get_ReturnValue_1;                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAllowedToPurchase_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241D[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMangoNativeOffer>              CallFunc_GetAllNativeOffers_ReturnValue;           // 0x0038(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FMangoNativeOffer                      CallFunc_Array_Get_Item;                           // 0x0048(0x00C0)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241E[0x2];                                     // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UDefaultStoreNativeOfferButton_C*       CallFunc_Create_ReturnValue;                       // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UMarinerLayeredButton* Instance)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue;               // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreRocketbuxMenu_C_PopulateNativeOffers) == 0x000008, "Wrong alignment on StoreRocketbuxMenu_C_PopulateNativeOffers");
static_assert(sizeof(StoreRocketbuxMenu_C_PopulateNativeOffers) == 0x000130, "Wrong size on StoreRocketbuxMenu_C_PopulateNativeOffers");
static_assert(offsetof(StoreRocketbuxMenu_C_PopulateNativeOffers, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'StoreRocketbuxMenu_C_PopulateNativeOffers::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_PopulateNativeOffers, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'StoreRocketbuxMenu_C_PopulateNativeOffers::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_PopulateNativeOffers, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'StoreRocketbuxMenu_C_PopulateNativeOffers::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_PopulateNativeOffers, Temp_int_Array_Index_Variable) == 0x000018, "Member 'StoreRocketbuxMenu_C_PopulateNativeOffers::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_PopulateNativeOffers, CallFunc_Get_ReturnValue) == 0x000020, "Member 'StoreRocketbuxMenu_C_PopulateNativeOffers::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_PopulateNativeOffers, CallFunc_Get_ReturnValue_1) == 0x000028, "Member 'StoreRocketbuxMenu_C_PopulateNativeOffers::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_PopulateNativeOffers, CallFunc_IsAllowedToPurchase_ReturnValue) == 0x000030, "Member 'StoreRocketbuxMenu_C_PopulateNativeOffers::CallFunc_IsAllowedToPurchase_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_PopulateNativeOffers, CallFunc_GetAllNativeOffers_ReturnValue) == 0x000038, "Member 'StoreRocketbuxMenu_C_PopulateNativeOffers::CallFunc_GetAllNativeOffers_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_PopulateNativeOffers, CallFunc_Array_Get_Item) == 0x000048, "Member 'StoreRocketbuxMenu_C_PopulateNativeOffers::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_PopulateNativeOffers, CallFunc_Array_Length_ReturnValue) == 0x000108, "Member 'StoreRocketbuxMenu_C_PopulateNativeOffers::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_PopulateNativeOffers, CallFunc_Less_IntInt_ReturnValue) == 0x00010C, "Member 'StoreRocketbuxMenu_C_PopulateNativeOffers::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_PopulateNativeOffers, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00010D, "Member 'StoreRocketbuxMenu_C_PopulateNativeOffers::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_PopulateNativeOffers, CallFunc_Create_ReturnValue) == 0x000110, "Member 'StoreRocketbuxMenu_C_PopulateNativeOffers::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_PopulateNativeOffers, K2Node_CreateDelegate_OutputDelegate_1) == 0x000118, "Member 'StoreRocketbuxMenu_C_PopulateNativeOffers::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_PopulateNativeOffers, CallFunc_AddChildToGrid_ReturnValue) == 0x000128, "Member 'StoreRocketbuxMenu_C_PopulateNativeOffers::CallFunc_AddChildToGrid_ReturnValue' has a wrong offset!");

// Function StoreRocketbuxMenu.StoreRocketbuxMenu_C.OnNativeOfferSelected
// 0x0030 (0x0030 - 0x0000)
struct StoreRocketbuxMenu_C_OnNativeOfferSelected final
{
public:
	class UMarinerLayeredButton*                  ButtonInstance;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerAsyncUIFlowHandler*             CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDefaultStoreNativeOfferButton_C*       K2Node_DynamicCast_AsDefault_Store_Native_Offer_Button; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241F[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncFlowOffers_C*                     K2Node_DynamicCast_AsAsync_Flow_Offers;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreRocketbuxMenu_C_OnNativeOfferSelected) == 0x000008, "Wrong alignment on StoreRocketbuxMenu_C_OnNativeOfferSelected");
static_assert(sizeof(StoreRocketbuxMenu_C_OnNativeOfferSelected) == 0x000030, "Wrong size on StoreRocketbuxMenu_C_OnNativeOfferSelected");
static_assert(offsetof(StoreRocketbuxMenu_C_OnNativeOfferSelected, ButtonInstance) == 0x000000, "Member 'StoreRocketbuxMenu_C_OnNativeOfferSelected::ButtonInstance' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_OnNativeOfferSelected, CallFunc_Get_ReturnValue) == 0x000008, "Member 'StoreRocketbuxMenu_C_OnNativeOfferSelected::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_OnNativeOfferSelected, K2Node_DynamicCast_AsDefault_Store_Native_Offer_Button) == 0x000010, "Member 'StoreRocketbuxMenu_C_OnNativeOfferSelected::K2Node_DynamicCast_AsDefault_Store_Native_Offer_Button' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_OnNativeOfferSelected, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'StoreRocketbuxMenu_C_OnNativeOfferSelected::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_OnNativeOfferSelected, K2Node_DynamicCast_AsAsync_Flow_Offers) == 0x000020, "Member 'StoreRocketbuxMenu_C_OnNativeOfferSelected::K2Node_DynamicCast_AsAsync_Flow_Offers' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_OnNativeOfferSelected, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'StoreRocketbuxMenu_C_OnNativeOfferSelected::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function StoreRocketbuxMenu.StoreRocketbuxMenu_C.UpdatePrompts
// 0x0128 (0x0128 - 0x0000)
struct StoreRocketbuxMenu_C_UpdatePrompts final
{
public:
	bool                                          CallFunc_ClearHostPrompts_ReturnValue;             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2420[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMarinerPromptData                     K2Node_MakeStruct_MarinerPromptData;               // 0x0008(0x0118)()
	bool                                          CallFunc_AddHostPrompt_ReturnValue;                // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreRocketbuxMenu_C_UpdatePrompts) == 0x000008, "Wrong alignment on StoreRocketbuxMenu_C_UpdatePrompts");
static_assert(sizeof(StoreRocketbuxMenu_C_UpdatePrompts) == 0x000128, "Wrong size on StoreRocketbuxMenu_C_UpdatePrompts");
static_assert(offsetof(StoreRocketbuxMenu_C_UpdatePrompts, CallFunc_ClearHostPrompts_ReturnValue) == 0x000000, "Member 'StoreRocketbuxMenu_C_UpdatePrompts::CallFunc_ClearHostPrompts_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_UpdatePrompts, K2Node_MakeStruct_MarinerPromptData) == 0x000008, "Member 'StoreRocketbuxMenu_C_UpdatePrompts::K2Node_MakeStruct_MarinerPromptData' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_UpdatePrompts, CallFunc_AddHostPrompt_ReturnValue) == 0x000120, "Member 'StoreRocketbuxMenu_C_UpdatePrompts::CallFunc_AddHostPrompt_ReturnValue' has a wrong offset!");

// Function StoreRocketbuxMenu.StoreRocketbuxMenu_C.RefreshNativeOffers
// 0x0030 (0x0030 - 0x0000)
struct StoreRocketbuxMenu_C_RefreshNativeOffers final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2421[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2422[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDefaultStoreNativeOfferButton_C*       K2Node_DynamicCast_AsDefault_Store_Native_Offer_Button; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2423[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2424[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreRocketbuxMenu_C_RefreshNativeOffers) == 0x000008, "Wrong alignment on StoreRocketbuxMenu_C_RefreshNativeOffers");
static_assert(sizeof(StoreRocketbuxMenu_C_RefreshNativeOffers) == 0x000030, "Wrong size on StoreRocketbuxMenu_C_RefreshNativeOffers");
static_assert(offsetof(StoreRocketbuxMenu_C_RefreshNativeOffers, Temp_int_Variable) == 0x000000, "Member 'StoreRocketbuxMenu_C_RefreshNativeOffers::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_RefreshNativeOffers, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'StoreRocketbuxMenu_C_RefreshNativeOffers::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_RefreshNativeOffers, CallFunc_GetChildrenCount_ReturnValue) == 0x000010, "Member 'StoreRocketbuxMenu_C_RefreshNativeOffers::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_RefreshNativeOffers, K2Node_DynamicCast_AsDefault_Store_Native_Offer_Button) == 0x000018, "Member 'StoreRocketbuxMenu_C_RefreshNativeOffers::K2Node_DynamicCast_AsDefault_Store_Native_Offer_Button' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_RefreshNativeOffers, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'StoreRocketbuxMenu_C_RefreshNativeOffers::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_RefreshNativeOffers, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'StoreRocketbuxMenu_C_RefreshNativeOffers::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_RefreshNativeOffers, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000028, "Member 'StoreRocketbuxMenu_C_RefreshNativeOffers::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_RefreshNativeOffers, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'StoreRocketbuxMenu_C_RefreshNativeOffers::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function StoreRocketbuxMenu.StoreRocketbuxMenu_C.OnNativeOfferHighlighted
// 0x0078 (0x0078 - 0x0000)
struct StoreRocketbuxMenu_C_OnNativeOfferHighlighted final
{
public:
	class UMarinerLayeredButton*                  ButtonInstance;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Highlighted;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFromMouse;                                        // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2425[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDefaultStoreNativeOfferButton_C*       K2Node_DynamicCast_AsDefault_Store_Native_Offer_Button; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlatformPS4_ReturnValue;                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlatformX1_ReturnValue;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2426[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoTxnManager*                       CallFunc_Get_ReturnValue;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetStringsForNativeOfferId_OutTitle;      // 0x0028(0x0018)()
	class FText                                   CallFunc_GetStringsForNativeOfferId_OutDescription; // 0x0040(0x0018)()
	class FText                                   CallFunc_GetStringsForNativeOfferId_OutLongDescription; // 0x0058(0x0018)()
	bool                                          CallFunc_GetStringsForNativeOfferId_ReturnValue;   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreRocketbuxMenu_C_OnNativeOfferHighlighted) == 0x000008, "Wrong alignment on StoreRocketbuxMenu_C_OnNativeOfferHighlighted");
static_assert(sizeof(StoreRocketbuxMenu_C_OnNativeOfferHighlighted) == 0x000078, "Wrong size on StoreRocketbuxMenu_C_OnNativeOfferHighlighted");
static_assert(offsetof(StoreRocketbuxMenu_C_OnNativeOfferHighlighted, ButtonInstance) == 0x000000, "Member 'StoreRocketbuxMenu_C_OnNativeOfferHighlighted::ButtonInstance' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_OnNativeOfferHighlighted, Highlighted) == 0x000008, "Member 'StoreRocketbuxMenu_C_OnNativeOfferHighlighted::Highlighted' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_OnNativeOfferHighlighted, bFromMouse) == 0x000009, "Member 'StoreRocketbuxMenu_C_OnNativeOfferHighlighted::bFromMouse' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_OnNativeOfferHighlighted, K2Node_DynamicCast_AsDefault_Store_Native_Offer_Button) == 0x000010, "Member 'StoreRocketbuxMenu_C_OnNativeOfferHighlighted::K2Node_DynamicCast_AsDefault_Store_Native_Offer_Button' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_OnNativeOfferHighlighted, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'StoreRocketbuxMenu_C_OnNativeOfferHighlighted::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_OnNativeOfferHighlighted, CallFunc_IsPlatformPS4_ReturnValue) == 0x000019, "Member 'StoreRocketbuxMenu_C_OnNativeOfferHighlighted::CallFunc_IsPlatformPS4_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_OnNativeOfferHighlighted, CallFunc_IsPlatformX1_ReturnValue) == 0x00001A, "Member 'StoreRocketbuxMenu_C_OnNativeOfferHighlighted::CallFunc_IsPlatformX1_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_OnNativeOfferHighlighted, CallFunc_BooleanOR_ReturnValue) == 0x00001B, "Member 'StoreRocketbuxMenu_C_OnNativeOfferHighlighted::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_OnNativeOfferHighlighted, CallFunc_Get_ReturnValue) == 0x000020, "Member 'StoreRocketbuxMenu_C_OnNativeOfferHighlighted::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_OnNativeOfferHighlighted, CallFunc_GetStringsForNativeOfferId_OutTitle) == 0x000028, "Member 'StoreRocketbuxMenu_C_OnNativeOfferHighlighted::CallFunc_GetStringsForNativeOfferId_OutTitle' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_OnNativeOfferHighlighted, CallFunc_GetStringsForNativeOfferId_OutDescription) == 0x000040, "Member 'StoreRocketbuxMenu_C_OnNativeOfferHighlighted::CallFunc_GetStringsForNativeOfferId_OutDescription' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_OnNativeOfferHighlighted, CallFunc_GetStringsForNativeOfferId_OutLongDescription) == 0x000058, "Member 'StoreRocketbuxMenu_C_OnNativeOfferHighlighted::CallFunc_GetStringsForNativeOfferId_OutLongDescription' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_OnNativeOfferHighlighted, CallFunc_GetStringsForNativeOfferId_ReturnValue) == 0x000070, "Member 'StoreRocketbuxMenu_C_OnNativeOfferHighlighted::CallFunc_GetStringsForNativeOfferId_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_OnNativeOfferHighlighted, CallFunc_BooleanAND_ReturnValue) == 0x000071, "Member 'StoreRocketbuxMenu_C_OnNativeOfferHighlighted::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function StoreRocketbuxMenu.StoreRocketbuxMenu_C.UpdateOriginAccessPanel
// 0x00A8 (0x00A8 - 0x0000)
struct StoreRocketbuxMenu_C_UpdateOriginAccessPanel final
{
public:
	class UTexture2D*                             Temp_object_Variable;                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlatformPC_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2427[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMangoTxnManager*                       CallFunc_Get_ReturnValue;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetOriginAccessDiscountActive_OutDiscountPercent; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetOriginAccessDiscountActive_ReturnValue; // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2428[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2429[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_242A[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0018)()
};
static_assert(alignof(StoreRocketbuxMenu_C_UpdateOriginAccessPanel) == 0x000008, "Wrong alignment on StoreRocketbuxMenu_C_UpdateOriginAccessPanel");
static_assert(sizeof(StoreRocketbuxMenu_C_UpdateOriginAccessPanel) == 0x0000A8, "Wrong size on StoreRocketbuxMenu_C_UpdateOriginAccessPanel");
static_assert(offsetof(StoreRocketbuxMenu_C_UpdateOriginAccessPanel, Temp_object_Variable) == 0x000000, "Member 'StoreRocketbuxMenu_C_UpdateOriginAccessPanel::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_UpdateOriginAccessPanel, Temp_object_Variable_1) == 0x000008, "Member 'StoreRocketbuxMenu_C_UpdateOriginAccessPanel::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_UpdateOriginAccessPanel, CallFunc_IsPlatformPC_ReturnValue) == 0x000010, "Member 'StoreRocketbuxMenu_C_UpdateOriginAccessPanel::CallFunc_IsPlatformPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_UpdateOriginAccessPanel, Temp_bool_Variable) == 0x000011, "Member 'StoreRocketbuxMenu_C_UpdateOriginAccessPanel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_UpdateOriginAccessPanel, K2Node_Select_Default) == 0x000018, "Member 'StoreRocketbuxMenu_C_UpdateOriginAccessPanel::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_UpdateOriginAccessPanel, CallFunc_Get_ReturnValue) == 0x000020, "Member 'StoreRocketbuxMenu_C_UpdateOriginAccessPanel::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_UpdateOriginAccessPanel, CallFunc_GetOriginAccessDiscountActive_OutDiscountPercent) == 0x000028, "Member 'StoreRocketbuxMenu_C_UpdateOriginAccessPanel::CallFunc_GetOriginAccessDiscountActive_OutDiscountPercent' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_UpdateOriginAccessPanel, CallFunc_GetOriginAccessDiscountActive_ReturnValue) == 0x00002C, "Member 'StoreRocketbuxMenu_C_UpdateOriginAccessPanel::CallFunc_GetOriginAccessDiscountActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_UpdateOriginAccessPanel, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000030, "Member 'StoreRocketbuxMenu_C_UpdateOriginAccessPanel::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_UpdateOriginAccessPanel, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000034, "Member 'StoreRocketbuxMenu_C_UpdateOriginAccessPanel::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_UpdateOriginAccessPanel, CallFunc_Round_ReturnValue) == 0x000038, "Member 'StoreRocketbuxMenu_C_UpdateOriginAccessPanel::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_UpdateOriginAccessPanel, CallFunc_BooleanAND_ReturnValue) == 0x00003C, "Member 'StoreRocketbuxMenu_C_UpdateOriginAccessPanel::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_UpdateOriginAccessPanel, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'StoreRocketbuxMenu_C_UpdateOriginAccessPanel::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_UpdateOriginAccessPanel, K2Node_MakeArray_Array) == 0x000080, "Member 'StoreRocketbuxMenu_C_UpdateOriginAccessPanel::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_UpdateOriginAccessPanel, CallFunc_Format_ReturnValue) == 0x000090, "Member 'StoreRocketbuxMenu_C_UpdateOriginAccessPanel::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function StoreRocketbuxMenu.StoreRocketbuxMenu_C.HandleInput
// 0x0020 (0x0020 - 0x0000)
struct StoreRocketbuxMenu_C_HandleInput final
{
public:
	EMarinerInputActions                          InInput;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_242B[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMarinerInputInterface> CallFunc_HandleInput_self_CastInput;               // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HandleInput_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HandleInput_ReturnValue_1;                // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreRocketbuxMenu_C_HandleInput) == 0x000008, "Wrong alignment on StoreRocketbuxMenu_C_HandleInput");
static_assert(sizeof(StoreRocketbuxMenu_C_HandleInput) == 0x000020, "Wrong size on StoreRocketbuxMenu_C_HandleInput");
static_assert(offsetof(StoreRocketbuxMenu_C_HandleInput, InInput) == 0x000000, "Member 'StoreRocketbuxMenu_C_HandleInput::InInput' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_HandleInput, ReturnValue) == 0x000001, "Member 'StoreRocketbuxMenu_C_HandleInput::ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_HandleInput, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'StoreRocketbuxMenu_C_HandleInput::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_HandleInput, CallFunc_HandleInput_self_CastInput) == 0x000008, "Member 'StoreRocketbuxMenu_C_HandleInput::CallFunc_HandleInput_self_CastInput' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_HandleInput, CallFunc_HandleInput_ReturnValue) == 0x000018, "Member 'StoreRocketbuxMenu_C_HandleInput::CallFunc_HandleInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_HandleInput, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000019, "Member 'StoreRocketbuxMenu_C_HandleInput::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_HandleInput, CallFunc_BooleanOR_ReturnValue) == 0x00001A, "Member 'StoreRocketbuxMenu_C_HandleInput::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_HandleInput, CallFunc_HandleInput_ReturnValue_1) == 0x00001B, "Member 'StoreRocketbuxMenu_C_HandleInput::CallFunc_HandleInput_ReturnValue_1' has a wrong offset!");

// Function StoreRocketbuxMenu.StoreRocketbuxMenu_C.OnServerTravelPreloadStarted
// 0x0058 (0x0058 - 0x0000)
struct StoreRocketbuxMenu_C_OnServerTravelPreloadStarted final
{
public:
	struct FMarinerServerTravelConfig             Config;                                            // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UMarinerAsyncUIFlowHandler*             CallFunc_Get_ReturnValue;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsyncFlowInGameStore_C*                K2Node_DynamicCast_AsAsync_Flow_in_Game_Store;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetInGameStoreActive_ReturnValue;         // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreRocketbuxMenu_C_OnServerTravelPreloadStarted) == 0x000008, "Wrong alignment on StoreRocketbuxMenu_C_OnServerTravelPreloadStarted");
static_assert(sizeof(StoreRocketbuxMenu_C_OnServerTravelPreloadStarted) == 0x000058, "Wrong size on StoreRocketbuxMenu_C_OnServerTravelPreloadStarted");
static_assert(offsetof(StoreRocketbuxMenu_C_OnServerTravelPreloadStarted, Config) == 0x000000, "Member 'StoreRocketbuxMenu_C_OnServerTravelPreloadStarted::Config' has a wrong offset!");
static_assert(offsetof(StoreRocketbuxMenu_C_OnServerTravelPreloadStarted, CallFunc_Get_ReturnValue) == 0x000040, "Member 'StoreRocketbuxMenu_C_OnServerTravelPreloadStarted::CallFunc_Get_ReturnValue' has a wrong offset!");
