#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SummaryRadialRank

#include "Basic.hpp"

#include "MangoClient_structs.hpp"
#include "Mariner_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function SummaryRadialRank.SummaryRadialRank_C.InitFromProgression
// 0x0098 (0x0098 - 0x0000)
struct SummaryRadialRank_C_InitFromProgression final
{
public:
	struct FMangoPlaylistResult                   PlaylistMatchProgress;                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	float                                         DurationPerLevelSeconds;                           // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FinalDelaySeconds;                                 // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0030(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Fraction_ReturnValue;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Fraction_ReturnValue_1;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221A[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0058(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0068(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0078(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SummaryRadialRank_C_InitFromProgression) == 0x000008, "Wrong alignment on SummaryRadialRank_C_InitFromProgression");
static_assert(sizeof(SummaryRadialRank_C_InitFromProgression) == 0x000098, "Wrong size on SummaryRadialRank_C_InitFromProgression");
static_assert(offsetof(SummaryRadialRank_C_InitFromProgression, PlaylistMatchProgress) == 0x000000, "Member 'SummaryRadialRank_C_InitFromProgression::PlaylistMatchProgress' has a wrong offset!");
static_assert(offsetof(SummaryRadialRank_C_InitFromProgression, DurationPerLevelSeconds) == 0x000020, "Member 'SummaryRadialRank_C_InitFromProgression::DurationPerLevelSeconds' has a wrong offset!");
static_assert(offsetof(SummaryRadialRank_C_InitFromProgression, FinalDelaySeconds) == 0x000024, "Member 'SummaryRadialRank_C_InitFromProgression::FinalDelaySeconds' has a wrong offset!");
static_assert(offsetof(SummaryRadialRank_C_InitFromProgression, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'SummaryRadialRank_C_InitFromProgression::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(SummaryRadialRank_C_InitFromProgression, Temp_delegate_Variable) == 0x000030, "Member 'SummaryRadialRank_C_InitFromProgression::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(SummaryRadialRank_C_InitFromProgression, CallFunc_FTrunc_ReturnValue) == 0x000040, "Member 'SummaryRadialRank_C_InitFromProgression::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(SummaryRadialRank_C_InitFromProgression, CallFunc_Fraction_ReturnValue) == 0x000044, "Member 'SummaryRadialRank_C_InitFromProgression::CallFunc_Fraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(SummaryRadialRank_C_InitFromProgression, CallFunc_FTrunc_ReturnValue_1) == 0x000048, "Member 'SummaryRadialRank_C_InitFromProgression::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SummaryRadialRank_C_InitFromProgression, CallFunc_Fraction_ReturnValue_1) == 0x00004C, "Member 'SummaryRadialRank_C_InitFromProgression::CallFunc_Fraction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SummaryRadialRank_C_InitFromProgression, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'SummaryRadialRank_C_InitFromProgression::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SummaryRadialRank_C_InitFromProgression, CallFunc_Greater_IntInt_ReturnValue) == 0x000051, "Member 'SummaryRadialRank_C_InitFromProgression::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SummaryRadialRank_C_InitFromProgression, Temp_struct_Variable) == 0x000058, "Member 'SummaryRadialRank_C_InitFromProgression::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(SummaryRadialRank_C_InitFromProgression, Temp_delegate_Variable_1) == 0x000068, "Member 'SummaryRadialRank_C_InitFromProgression::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(SummaryRadialRank_C_InitFromProgression, Temp_struct_Variable_1) == 0x000078, "Member 'SummaryRadialRank_C_InitFromProgression::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(SummaryRadialRank_C_InitFromProgression, CallFunc_GetPlayerController_ReturnValue_1) == 0x000088, "Member 'SummaryRadialRank_C_InitFromProgression::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SummaryRadialRank_C_InitFromProgression, CallFunc_PostEvent_ReturnValue) == 0x000090, "Member 'SummaryRadialRank_C_InitFromProgression::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SummaryRadialRank_C_InitFromProgression, CallFunc_PostEvent_ReturnValue_1) == 0x000094, "Member 'SummaryRadialRank_C_InitFromProgression::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");

// Function SummaryRadialRank.SummaryRadialRank_C.SetRadialProgress
// 0x0028 (0x0028 - 0x0000)
struct SummaryRadialRank_C_SetRadialProgress final
{
public:
	struct FMangoPlaylistResult                   Mango_Playlist_Result;                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	float                                         CallFunc_Fraction_ReturnValue;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SummaryRadialRank_C_SetRadialProgress) == 0x000008, "Wrong alignment on SummaryRadialRank_C_SetRadialProgress");
static_assert(sizeof(SummaryRadialRank_C_SetRadialProgress) == 0x000028, "Wrong size on SummaryRadialRank_C_SetRadialProgress");
static_assert(offsetof(SummaryRadialRank_C_SetRadialProgress, Mango_Playlist_Result) == 0x000000, "Member 'SummaryRadialRank_C_SetRadialProgress::Mango_Playlist_Result' has a wrong offset!");
static_assert(offsetof(SummaryRadialRank_C_SetRadialProgress, CallFunc_Fraction_ReturnValue) == 0x000020, "Member 'SummaryRadialRank_C_SetRadialProgress::CallFunc_Fraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(SummaryRadialRank_C_SetRadialProgress, CallFunc_FTrunc_ReturnValue) == 0x000024, "Member 'SummaryRadialRank_C_SetRadialProgress::CallFunc_FTrunc_ReturnValue' has a wrong offset!");

// Function SummaryRadialRank.SummaryRadialRank_C.GetAnimations
// 0x0030 (0x0030 - 0x0000)
struct SummaryRadialRank_C_GetAnimations final
{
public:
	struct FMarinerAnimatedProgressWidgetAnimations ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FMarinerAnimatedProgressWidgetAnimations K2Node_MakeStruct_MarinerAnimatedProgressWidgetAnimations; // 0x0018(0x0018)(NoDestructor)
};
static_assert(alignof(SummaryRadialRank_C_GetAnimations) == 0x000008, "Wrong alignment on SummaryRadialRank_C_GetAnimations");
static_assert(sizeof(SummaryRadialRank_C_GetAnimations) == 0x000030, "Wrong size on SummaryRadialRank_C_GetAnimations");
static_assert(offsetof(SummaryRadialRank_C_GetAnimations, ReturnValue) == 0x000000, "Member 'SummaryRadialRank_C_GetAnimations::ReturnValue' has a wrong offset!");
static_assert(offsetof(SummaryRadialRank_C_GetAnimations, K2Node_MakeStruct_MarinerAnimatedProgressWidgetAnimations) == 0x000018, "Member 'SummaryRadialRank_C_GetAnimations::K2Node_MakeStruct_MarinerAnimatedProgressWidgetAnimations' has a wrong offset!");

}

