#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SuperSpeedBoostCameraEffect

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function SuperSpeedBoostCameraEffect.SuperSpeedBoostCameraEffect_C.ExecuteUbergraph_SuperSpeedBoostCameraEffect
// 0x0030 (0x0030 - 0x0000)
struct SuperSpeedBoostCameraEffect_C_ExecuteUbergraph_SuperSpeedBoostCameraEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0018(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SuperSpeedBoostCameraEffect_C_ExecuteUbergraph_SuperSpeedBoostCameraEffect) == 0x000008, "Wrong alignment on SuperSpeedBoostCameraEffect_C_ExecuteUbergraph_SuperSpeedBoostCameraEffect");
static_assert(sizeof(SuperSpeedBoostCameraEffect_C_ExecuteUbergraph_SuperSpeedBoostCameraEffect) == 0x000030, "Wrong size on SuperSpeedBoostCameraEffect_C_ExecuteUbergraph_SuperSpeedBoostCameraEffect");
static_assert(offsetof(SuperSpeedBoostCameraEffect_C_ExecuteUbergraph_SuperSpeedBoostCameraEffect, EntryPoint) == 0x000000, "Member 'SuperSpeedBoostCameraEffect_C_ExecuteUbergraph_SuperSpeedBoostCameraEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(SuperSpeedBoostCameraEffect_C_ExecuteUbergraph_SuperSpeedBoostCameraEffect, Temp_struct_Variable) == 0x000008, "Member 'SuperSpeedBoostCameraEffect_C_ExecuteUbergraph_SuperSpeedBoostCameraEffect::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(SuperSpeedBoostCameraEffect_C_ExecuteUbergraph_SuperSpeedBoostCameraEffect, Temp_delegate_Variable) == 0x000018, "Member 'SuperSpeedBoostCameraEffect_C_ExecuteUbergraph_SuperSpeedBoostCameraEffect::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(SuperSpeedBoostCameraEffect_C_ExecuteUbergraph_SuperSpeedBoostCameraEffect, CallFunc_PostEvent_ReturnValue) == 0x000028, "Member 'SuperSpeedBoostCameraEffect_C_ExecuteUbergraph_SuperSpeedBoostCameraEffect::CallFunc_PostEvent_ReturnValue' has a wrong offset!");

}

