#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TabBackground

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TabBackground.TabBackground_C
// 0x0018 (0x0248 - 0x0230)
class UTabBackground_C final : public UUserWidget
{
public:
	class UImage*                                 Image_47;                                          // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_74;                                          // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shadow;                                            // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TabBackground_C">();
	}
	static class UTabBackground_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTabBackground_C>();
	}
};
static_assert(alignof(UTabBackground_C) == 0x000008, "Wrong alignment on UTabBackground_C");
static_assert(sizeof(UTabBackground_C) == 0x000248, "Wrong size on UTabBackground_C");
static_assert(offsetof(UTabBackground_C, Image_47) == 0x000230, "Member 'UTabBackground_C::Image_47' has a wrong offset!");
static_assert(offsetof(UTabBackground_C, Image_74) == 0x000238, "Member 'UTabBackground_C::Image_74' has a wrong offset!");
static_assert(offsetof(UTabBackground_C, Shadow) == 0x000240, "Member 'UTabBackground_C::Shadow' has a wrong offset!");

}

