#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ThumbStickDebug

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ThumbStickDebug.ThumbStickDebug_C
// 0x0038 (0x0268 - 0x0230)
class UThumbStickDebug_C final : public UUserWidget
{
public:
	class UImage*                                 Center;                                            // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DeadZonedInput;                                    // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FinalInput;                                        // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Inner;                                             // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Outer_0;                                           // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RawInput;                                          // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         RadiusWidth;                                       // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateRawInput(const struct FVector2D& InInput);
	void UpdateDeadZonedInput(const struct FVector2D& InInput);
	void UpdateFinalInput(const struct FVector2D& InInput);
	void UpdateIsPegged(bool bIsPegged);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ThumbStickDebug_C">();
	}
	static class UThumbStickDebug_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UThumbStickDebug_C>();
	}
};
static_assert(alignof(UThumbStickDebug_C) == 0x000008, "Wrong alignment on UThumbStickDebug_C");
static_assert(sizeof(UThumbStickDebug_C) == 0x000268, "Wrong size on UThumbStickDebug_C");
static_assert(offsetof(UThumbStickDebug_C, Center) == 0x000230, "Member 'UThumbStickDebug_C::Center' has a wrong offset!");
static_assert(offsetof(UThumbStickDebug_C, DeadZonedInput) == 0x000238, "Member 'UThumbStickDebug_C::DeadZonedInput' has a wrong offset!");
static_assert(offsetof(UThumbStickDebug_C, FinalInput) == 0x000240, "Member 'UThumbStickDebug_C::FinalInput' has a wrong offset!");
static_assert(offsetof(UThumbStickDebug_C, Inner) == 0x000248, "Member 'UThumbStickDebug_C::Inner' has a wrong offset!");
static_assert(offsetof(UThumbStickDebug_C, Outer_0) == 0x000250, "Member 'UThumbStickDebug_C::Outer_0' has a wrong offset!");
static_assert(offsetof(UThumbStickDebug_C, RawInput) == 0x000258, "Member 'UThumbStickDebug_C::RawInput' has a wrong offset!");
static_assert(offsetof(UThumbStickDebug_C, RadiusWidth) == 0x000260, "Member 'UThumbStickDebug_C::RadiusWidth' has a wrong offset!");

}

