#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ThumbStickDebug

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ThumbStickDebug.ThumbStickDebug_C.UpdateRawInput
// 0x0010 (0x0010 - 0x0000)
struct ThumbStickDebug_C_UpdateRawInput final
{
public:
	struct FVector2D                              InInput;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ThumbStickDebug_C_UpdateRawInput) == 0x000004, "Wrong alignment on ThumbStickDebug_C_UpdateRawInput");
static_assert(sizeof(ThumbStickDebug_C_UpdateRawInput) == 0x000010, "Wrong size on ThumbStickDebug_C_UpdateRawInput");
static_assert(offsetof(ThumbStickDebug_C_UpdateRawInput, InInput) == 0x000000, "Member 'ThumbStickDebug_C_UpdateRawInput::InInput' has a wrong offset!");
static_assert(offsetof(ThumbStickDebug_C_UpdateRawInput, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x000008, "Member 'ThumbStickDebug_C_UpdateRawInput::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");

// Function ThumbStickDebug.ThumbStickDebug_C.UpdateDeadZonedInput
// 0x0010 (0x0010 - 0x0000)
struct ThumbStickDebug_C_UpdateDeadZonedInput final
{
public:
	struct FVector2D                              InInput;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ThumbStickDebug_C_UpdateDeadZonedInput) == 0x000004, "Wrong alignment on ThumbStickDebug_C_UpdateDeadZonedInput");
static_assert(sizeof(ThumbStickDebug_C_UpdateDeadZonedInput) == 0x000010, "Wrong size on ThumbStickDebug_C_UpdateDeadZonedInput");
static_assert(offsetof(ThumbStickDebug_C_UpdateDeadZonedInput, InInput) == 0x000000, "Member 'ThumbStickDebug_C_UpdateDeadZonedInput::InInput' has a wrong offset!");
static_assert(offsetof(ThumbStickDebug_C_UpdateDeadZonedInput, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x000008, "Member 'ThumbStickDebug_C_UpdateDeadZonedInput::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");

// Function ThumbStickDebug.ThumbStickDebug_C.UpdateFinalInput
// 0x0010 (0x0010 - 0x0000)
struct ThumbStickDebug_C_UpdateFinalInput final
{
public:
	struct FVector2D                              InInput;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ThumbStickDebug_C_UpdateFinalInput) == 0x000004, "Wrong alignment on ThumbStickDebug_C_UpdateFinalInput");
static_assert(sizeof(ThumbStickDebug_C_UpdateFinalInput) == 0x000010, "Wrong size on ThumbStickDebug_C_UpdateFinalInput");
static_assert(offsetof(ThumbStickDebug_C_UpdateFinalInput, InInput) == 0x000000, "Member 'ThumbStickDebug_C_UpdateFinalInput::InInput' has a wrong offset!");
static_assert(offsetof(ThumbStickDebug_C_UpdateFinalInput, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x000008, "Member 'ThumbStickDebug_C_UpdateFinalInput::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");

// Function ThumbStickDebug.ThumbStickDebug_C.UpdateIsPegged
// 0x0080 (0x0080 - 0x0000)
struct ThumbStickDebug_C_UpdateIsPegged final
{
public:
	bool                                          bIsPegged;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EAE[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0030(0x0028)()
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0058(0x0028)()
};
static_assert(alignof(ThumbStickDebug_C_UpdateIsPegged) == 0x000008, "Wrong alignment on ThumbStickDebug_C_UpdateIsPegged");
static_assert(sizeof(ThumbStickDebug_C_UpdateIsPegged) == 0x000080, "Wrong size on ThumbStickDebug_C_UpdateIsPegged");
static_assert(offsetof(ThumbStickDebug_C_UpdateIsPegged, bIsPegged) == 0x000000, "Member 'ThumbStickDebug_C_UpdateIsPegged::bIsPegged' has a wrong offset!");
static_assert(offsetof(ThumbStickDebug_C_UpdateIsPegged, Temp_bool_Variable) == 0x000001, "Member 'ThumbStickDebug_C_UpdateIsPegged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ThumbStickDebug_C_UpdateIsPegged, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'ThumbStickDebug_C_UpdateIsPegged::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(ThumbStickDebug_C_UpdateIsPegged, K2Node_MakeStruct_SlateColor_1) == 0x000030, "Member 'ThumbStickDebug_C_UpdateIsPegged::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(ThumbStickDebug_C_UpdateIsPegged, K2Node_Select_Default) == 0x000058, "Member 'ThumbStickDebug_C_UpdateIsPegged::K2Node_Select_Default' has a wrong offset!");

}

