#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TotemCustomization_Home

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MangoClient_structs.hpp"
#include "Mariner_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TotemCustomization_Home.TotemCustomization_Home_C
// 0x0370 (0x0850 - 0x04E0)
class UTotemCustomization_Home_C final : public UMarinerMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMarinerGridPanel*                      ContentPanel;                                      // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterFeatureCMSItemButton_C*       EditTotemBorderBtn;                                // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterFeatureCMSItemButton_C*       EditTotemCompanionBtn;                             // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterFeatureCMSItemButton_C*       EditTotemPatternBtn;                               // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterFeatureCMSItemButton_C*       EditTotemShapeBtn;                                 // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterFeatureCMSItemButton_C*       EditTotemStandBtn;                                 // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterFeatureCMSItemButton_C*       EditTotemSymbolBtn;                                // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterFeatureCMSItemButton_C*       EditTotemVFXBtn;                                   // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ARocketTotem_C*                         TotemObject;                                       // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMarinerRocketTotemCollection          CachedTotemCollection;                             // 0x0530(0x0038)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class ACharacterCustomizationSpawner_C*       CharacterCustomizationSpawner;                     // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMangoProfile                          CachedProfile;                                     // 0x0570(0x02E0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_TotemCustomization_Home(int32 EntryPoint);
	void BP_OnExited(bool bToSubLayer);
	void BndEvt__EditTotemCompanionBtn_K2Node_ComponentBoundEvent_3_OnLayeredButtonEvent__DelegateSignature(class UMarinerLayeredButton* Instance);
	void Destruct();
	void RestartTotemVFX_EG();
	void OnMangoProfileUpdated();
	void RefreshButtons();
	void BndEvt__EditTotemStandBtn_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature(class UMarinerLayeredButton* Instance);
	void Construct();
	void BndEvt__EditTotemPatternBtn_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature(class UMarinerLayeredButton* Instance);
	void BndEvt__EditTotemVFXBtn_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature(class UMarinerLayeredButton* Instance);
	void BndEvt__EditTotemSymbolBtn_K2Node_ComponentBoundEvent_25_OnLayeredButtonEvent__DelegateSignature(class UMarinerLayeredButton* Instance);
	void BndEvt__EditTotemShapeBtn_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature(class UMarinerLayeredButton* Instance);
	void BndEvt__EditTotemBorderBtn_K2Node_ComponentBoundEvent_12_OnLayeredButtonEvent__DelegateSignature(class UMarinerLayeredButton* Instance);
	void BndEvt__EditTotemBaseBtn_K2Node_ComponentBoundEvent_200_OnLayeredButtonEvent__DelegateSignature(class UMarinerLayeredButton* Instance);
	void BP_OnEntered(bool bFromSubMenu);
	void LoadFinished_1D3F43834E9246C2522023AD05FD851E(const TArray<class UItemLoadResponse*>& ItemData);
	void LoadFailed_1D3F43834E9246C2522023AD05FD851E();
	void TotemDataLoaded_3F958DAA47B324DD04A61C96B2471B93(const struct FLoadedTotemDataResponse& TotemData);
	void TotemDataLoadFailed_3F958DAA47B324DD04A61C96B2471B93();
	void DoesCacheHaveChanges(bool* HasChanges);
	void UpdatePrompts();
	void RestartTotemVFX();
	void HandleTotemCollection(const struct FLoadedTotemDataResponse& TotemData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TotemCustomization_Home_C">();
	}
	static class UTotemCustomization_Home_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTotemCustomization_Home_C>();
	}
};
static_assert(alignof(UTotemCustomization_Home_C) == 0x000008, "Wrong alignment on UTotemCustomization_Home_C");
static_assert(sizeof(UTotemCustomization_Home_C) == 0x000850, "Wrong size on UTotemCustomization_Home_C");
static_assert(offsetof(UTotemCustomization_Home_C, UberGraphFrame) == 0x0004E0, "Member 'UTotemCustomization_Home_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTotemCustomization_Home_C, ContentPanel) == 0x0004E8, "Member 'UTotemCustomization_Home_C::ContentPanel' has a wrong offset!");
static_assert(offsetof(UTotemCustomization_Home_C, EditTotemBorderBtn) == 0x0004F0, "Member 'UTotemCustomization_Home_C::EditTotemBorderBtn' has a wrong offset!");
static_assert(offsetof(UTotemCustomization_Home_C, EditTotemCompanionBtn) == 0x0004F8, "Member 'UTotemCustomization_Home_C::EditTotemCompanionBtn' has a wrong offset!");
static_assert(offsetof(UTotemCustomization_Home_C, EditTotemPatternBtn) == 0x000500, "Member 'UTotemCustomization_Home_C::EditTotemPatternBtn' has a wrong offset!");
static_assert(offsetof(UTotemCustomization_Home_C, EditTotemShapeBtn) == 0x000508, "Member 'UTotemCustomization_Home_C::EditTotemShapeBtn' has a wrong offset!");
static_assert(offsetof(UTotemCustomization_Home_C, EditTotemStandBtn) == 0x000510, "Member 'UTotemCustomization_Home_C::EditTotemStandBtn' has a wrong offset!");
static_assert(offsetof(UTotemCustomization_Home_C, EditTotemSymbolBtn) == 0x000518, "Member 'UTotemCustomization_Home_C::EditTotemSymbolBtn' has a wrong offset!");
static_assert(offsetof(UTotemCustomization_Home_C, EditTotemVFXBtn) == 0x000520, "Member 'UTotemCustomization_Home_C::EditTotemVFXBtn' has a wrong offset!");
static_assert(offsetof(UTotemCustomization_Home_C, TotemObject) == 0x000528, "Member 'UTotemCustomization_Home_C::TotemObject' has a wrong offset!");
static_assert(offsetof(UTotemCustomization_Home_C, CachedTotemCollection) == 0x000530, "Member 'UTotemCustomization_Home_C::CachedTotemCollection' has a wrong offset!");
static_assert(offsetof(UTotemCustomization_Home_C, CharacterCustomizationSpawner) == 0x000568, "Member 'UTotemCustomization_Home_C::CharacterCustomizationSpawner' has a wrong offset!");
static_assert(offsetof(UTotemCustomization_Home_C, CachedProfile) == 0x000570, "Member 'UTotemCustomization_Home_C::CachedProfile' has a wrong offset!");

}

