#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TotemCustomizationMenu_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InventoryBaseMenu_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TotemCustomizationMenu_Base.TotemCustomizationMenu_Base_C
// 0x0018 (0x1320 - 0x1308)
class UTotemCustomizationMenu_Base_C : public UInventoryBaseMenu_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_TotemCustomizationMenu_Base_C;      // 0x1308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ARocketTotem_C*                         TotemVisualizer;                                   // 0x1310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTotemCustomization_Home_C*             TotemMenuHome;                                     // 0x1318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TotemCustomizationMenu_Base(int32 EntryPoint);
	void Construct();
	void Destruct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TotemCustomizationMenu_Base_C">();
	}
	static class UTotemCustomizationMenu_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTotemCustomizationMenu_Base_C>();
	}
};
static_assert(alignof(UTotemCustomizationMenu_Base_C) == 0x000008, "Wrong alignment on UTotemCustomizationMenu_Base_C");
static_assert(sizeof(UTotemCustomizationMenu_Base_C) == 0x001320, "Wrong size on UTotemCustomizationMenu_Base_C");
static_assert(offsetof(UTotemCustomizationMenu_Base_C, UberGraphFrame_TotemCustomizationMenu_Base_C) == 0x001308, "Member 'UTotemCustomizationMenu_Base_C::UberGraphFrame_TotemCustomizationMenu_Base_C' has a wrong offset!");
static_assert(offsetof(UTotemCustomizationMenu_Base_C, TotemVisualizer) == 0x001310, "Member 'UTotemCustomizationMenu_Base_C::TotemVisualizer' has a wrong offset!");
static_assert(offsetof(UTotemCustomizationMenu_Base_C, TotemMenuHome) == 0x001318, "Member 'UTotemCustomizationMenu_Base_C::TotemMenuHome' has a wrong offset!");

}

