#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TotemCustomization_Shape

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TotemCustomization_Shape.TotemCustomization_Shape_C.ExecuteUbergraph_TotemCustomization_Shape
// 0x0138 (0x0138 - 0x0000)
struct TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_237C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerItemLoadResponseButton*         K2Node_Event_ButtonInstance;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UMarinerCMSItemDataAsset*               CallFunc_GetLoadedCMSItemDataAsset_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0090(0x0018)()
	class UMarinerRocketTotemShapeDataAsset*      K2Node_DynamicCast_AsMariner_Rocket_Totem_Shape_Data_Asset; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_237D[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00B8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F8(0x0010)(ZeroConstructor, ReferenceParm)
	class UMarinerCMSItemDataAsset*               K2Node_Event_Item;                                 // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0110(0x0018)()
	class UMarinerRocketTotemShapeDataAsset*      K2Node_DynamicCast_AsMariner_Rocket_Totem_Shape_Data_Asset_1; // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape) == 0x000008, "Wrong alignment on TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape");
static_assert(sizeof(TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape) == 0x000138, "Wrong size on TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape");
static_assert(offsetof(TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape, EntryPoint) == 0x000000, "Member 'TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape::EntryPoint' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape, K2Node_Event_ButtonInstance) == 0x000008, "Member 'TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape::K2Node_Event_ButtonInstance' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape, CallFunc_GetDisplayName_ReturnValue) == 0x000010, "Member 'TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape, CallFunc_GetLoadedCMSItemDataAsset_ReturnValue) == 0x000020, "Member 'TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape::CallFunc_GetLoadedCMSItemDataAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape, CallFunc_GetDisplayName_ReturnValue_1) == 0x000040, "Member 'TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000090, "Member 'TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape, K2Node_DynamicCast_AsMariner_Rocket_Totem_Shape_Data_Asset) == 0x0000A8, "Member 'TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape::K2Node_DynamicCast_AsMariner_Rocket_Totem_Shape_Data_Asset' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000B8, "Member 'TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape, K2Node_MakeArray_Array) == 0x0000F8, "Member 'TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape, K2Node_Event_Item) == 0x000108, "Member 'TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape::K2Node_Event_Item' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape, CallFunc_Format_ReturnValue) == 0x000110, "Member 'TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape, K2Node_DynamicCast_AsMariner_Rocket_Totem_Shape_Data_Asset_1) == 0x000128, "Member 'TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape::K2Node_DynamicCast_AsMariner_Rocket_Totem_Shape_Data_Asset_1' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape, K2Node_DynamicCast_bSuccess_1) == 0x000130, "Member 'TotemCustomization_Shape_C_ExecuteUbergraph_TotemCustomization_Shape::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function TotemCustomization_Shape.TotemCustomization_Shape_C.OnProfileItemEquipped
// 0x0008 (0x0008 - 0x0000)
struct TotemCustomization_Shape_C_OnProfileItemEquipped final
{
public:
	class UMarinerCMSItemDataAsset*               Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TotemCustomization_Shape_C_OnProfileItemEquipped) == 0x000008, "Wrong alignment on TotemCustomization_Shape_C_OnProfileItemEquipped");
static_assert(sizeof(TotemCustomization_Shape_C_OnProfileItemEquipped) == 0x000008, "Wrong size on TotemCustomization_Shape_C_OnProfileItemEquipped");
static_assert(offsetof(TotemCustomization_Shape_C_OnProfileItemEquipped, Item) == 0x000000, "Member 'TotemCustomization_Shape_C_OnProfileItemEquipped::Item' has a wrong offset!");

// Function TotemCustomization_Shape.TotemCustomization_Shape_C.VisualizeSelectedButton
// 0x0008 (0x0008 - 0x0000)
struct TotemCustomization_Shape_C_VisualizeSelectedButton final
{
public:
	class UMarinerItemLoadResponseButton*         ButtonInstance;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TotemCustomization_Shape_C_VisualizeSelectedButton) == 0x000008, "Wrong alignment on TotemCustomization_Shape_C_VisualizeSelectedButton");
static_assert(sizeof(TotemCustomization_Shape_C_VisualizeSelectedButton) == 0x000008, "Wrong size on TotemCustomization_Shape_C_VisualizeSelectedButton");
static_assert(offsetof(TotemCustomization_Shape_C_VisualizeSelectedButton, ButtonInstance) == 0x000000, "Member 'TotemCustomization_Shape_C_VisualizeSelectedButton::ButtonInstance' has a wrong offset!");

}

