#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TotemCustomization_Companion

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TotemCustomization_Companion.TotemCustomization_Companion_C.ExecuteUbergraph_TotemCustomization_Companion
// 0x0138 (0x0138 - 0x0000)
struct TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerItemLoadResponseButton*         K2Node_Event_ButtonInstance;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerCMSItemDataAsset*               CallFunc_GetLoadedCMSItemDataAsset_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerRocketTotemCompanionDataAsset*  K2Node_DynamicCast_AsMariner_Rocket_Totem_Companion_Data_Asset; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0040)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00A0(0x0018)()
	class UMarinerCMSItemDataAsset*               K2Node_Event_Item;                                 // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00C0(0x0040)(HasGetValueTypeHash)
	class UMarinerRocketTotemCompanionDataAsset*  K2Node_DynamicCast_AsMariner_Rocket_Totem_Companion_Data_Asset_1; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0110(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0120(0x0018)()
};
static_assert(alignof(TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion) == 0x000008, "Wrong alignment on TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion");
static_assert(sizeof(TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion) == 0x000138, "Wrong size on TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion");
static_assert(offsetof(TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion, EntryPoint) == 0x000000, "Member 'TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion::EntryPoint' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion, K2Node_Event_ButtonInstance) == 0x000008, "Member 'TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion::K2Node_Event_ButtonInstance' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion, CallFunc_GetLoadedCMSItemDataAsset_ReturnValue) == 0x000010, "Member 'TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion::CallFunc_GetLoadedCMSItemDataAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion, K2Node_DynamicCast_AsMariner_Rocket_Totem_Companion_Data_Asset) == 0x000018, "Member 'TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion::K2Node_DynamicCast_AsMariner_Rocket_Totem_Companion_Data_Asset' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion, CallFunc_GetDisplayName_ReturnValue) == 0x000028, "Member 'TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion, CallFunc_GetDisplayName_ReturnValue_1) == 0x000090, "Member 'TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000A0, "Member 'TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion, K2Node_Event_Item) == 0x0000B8, "Member 'TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion::K2Node_Event_Item' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000C0, "Member 'TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion, K2Node_DynamicCast_AsMariner_Rocket_Totem_Companion_Data_Asset_1) == 0x000100, "Member 'TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion::K2Node_DynamicCast_AsMariner_Rocket_Totem_Companion_Data_Asset_1' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion, K2Node_DynamicCast_bSuccess_1) == 0x000108, "Member 'TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion, K2Node_MakeArray_Array) == 0x000110, "Member 'TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion, CallFunc_Format_ReturnValue) == 0x000120, "Member 'TotemCustomization_Companion_C_ExecuteUbergraph_TotemCustomization_Companion::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function TotemCustomization_Companion.TotemCustomization_Companion_C.OnProfileItemEquipped
// 0x0008 (0x0008 - 0x0000)
struct TotemCustomization_Companion_C_OnProfileItemEquipped final
{
public:
	class UMarinerCMSItemDataAsset*               Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TotemCustomization_Companion_C_OnProfileItemEquipped) == 0x000008, "Wrong alignment on TotemCustomization_Companion_C_OnProfileItemEquipped");
static_assert(sizeof(TotemCustomization_Companion_C_OnProfileItemEquipped) == 0x000008, "Wrong size on TotemCustomization_Companion_C_OnProfileItemEquipped");
static_assert(offsetof(TotemCustomization_Companion_C_OnProfileItemEquipped, Item) == 0x000000, "Member 'TotemCustomization_Companion_C_OnProfileItemEquipped::Item' has a wrong offset!");

// Function TotemCustomization_Companion.TotemCustomization_Companion_C.VisualizeSelectedButton
// 0x0008 (0x0008 - 0x0000)
struct TotemCustomization_Companion_C_VisualizeSelectedButton final
{
public:
	class UMarinerItemLoadResponseButton*         ButtonInstance;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TotemCustomization_Companion_C_VisualizeSelectedButton) == 0x000008, "Wrong alignment on TotemCustomization_Companion_C_VisualizeSelectedButton");
static_assert(sizeof(TotemCustomization_Companion_C_VisualizeSelectedButton) == 0x000008, "Wrong size on TotemCustomization_Companion_C_VisualizeSelectedButton");
static_assert(offsetof(TotemCustomization_Companion_C_VisualizeSelectedButton, ButtonInstance) == 0x000000, "Member 'TotemCustomization_Companion_C_VisualizeSelectedButton::ButtonInstance' has a wrong offset!");

}

