#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TotemCustomization_Home

#include "Basic.hpp"

#include "Mariner_structs.hpp"
#include "MangoClient_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TotemCustomization_Home.TotemCustomization_Home_C.ExecuteUbergraph_TotemCustomization_Home
// 0x0AD0 (0x0AD0 - 0x0000)
struct TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UItemLoadResponse*>              Temp_object_Variable;                              // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerLoadEquippedDataForLocalProfile* CallFunc_LoadEquippedDataForLocalProfile_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemLoadResponse*                      CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bFromSubMenu;                         // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerLayeredButton*                  K2Node_ComponentBoundEvent_Instance_7;             // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerLayeredButton*                  K2Node_ComponentBoundEvent_Instance_6;             // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuStackLayer*                 CallFunc_PushLayerToActiveStack_ReturnValue;       // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue_1;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerLayeredButton*                  K2Node_ComponentBoundEvent_Instance_5;             // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuStackLayer*                 CallFunc_PushLayerToActiveStack_ReturnValue_1;     // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue_2;             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerLayeredButton*                  K2Node_ComponentBoundEvent_Instance_4;             // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuStackLayer*                 CallFunc_PushLayerToActiveStack_ReturnValue_2;     // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue_3;             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerLayeredButton*                  K2Node_ComponentBoundEvent_Instance_3;             // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuStackLayer*                 CallFunc_PushLayerToActiveStack_ReturnValue_3;     // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue_4;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerLayeredButton*                  K2Node_ComponentBoundEvent_Instance_2;             // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuStackLayer*                 CallFunc_PushLayerToActiveStack_ReturnValue_4;     // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue_5;             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuStackLayer*                 CallFunc_PushLayerToActiveStack_ReturnValue_5;     // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ARocketTotem_C*>                 CallFunc_GetAllActorsOfClass_OutActors;            // 0x00F0(0x0010)(ZeroConstructor, ReferenceParm)
	class ARocketTotem_C*                         CallFunc_Array_Get_Item_1;                         // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ACharacterCustomizationSpawner_C*> CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0110(0x0010)(ZeroConstructor, ReferenceParm)
	class ACharacterCustomizationSpawner_C*       CallFunc_Array_Get_Item_2;                         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UItemLoadResponse*>              K2Node_CustomEvent_ItemData;                       // 0x0130(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(TArray<class UItemLoadResponse*>& ItemData)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0140(0x0010)(ZeroConstructor, NoDestructor)
	class UMarinerGameGlobals*                    CallFunc_GetGameGlobals_ReturnValue;               // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMarinerRocketTotemCollection          CallFunc_GetDefaultRocketTotemCollection_ReturnValue; // 0x0158(0x0038)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMarinerLayeredButton*                  K2Node_ComponentBoundEvent_Instance_1;             // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue_6;             // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuStackLayer*                 CallFunc_PushLayerToActiveStack_ReturnValue_6;     // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMarinerInputInterface> CallFunc_SetActiveInputWidget_InputWidget_CastInput; // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x01B8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLoadedTotemDataResponse               Temp_struct_Variable;                              // 0x01D8(0x0150)()
	TArray<class UObject*>                        K2Node_MakeArray_Array;                            // 0x0328(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_RegisterControllerInteractables_ReturnValue; // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLoadedTotemDataResponse               K2Node_CustomEvent_TotemData;                      // 0x0340(0x0150)(ConstParm)
	TDelegate<void(struct FLoadedTotemDataResponse& TotemData)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0490(0x0010)(ZeroConstructor, NoDestructor)
	class UMangoPlayerManager*                    CallFunc_Get_ReturnValue;                          // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMangoPlayerManager*                    CallFunc_Get_ReturnValue_1;                        // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMangoProfile                          CallFunc_GetMangoProfile_ReturnValue;              // 0x04B0(0x02E0)(ConstParm)
	struct FMangoProfile                          CallFunc_GetMangoProfile_ReturnValue_1;            // 0x0790(0x02E0)(ConstParm)
	class UMarinerLoadTotemDataFromProfile*       CallFunc_LoadTotemDataForProfile_ReturnValue;      // 0x0A70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0A78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0A79(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A7A[0x6];                                      // 0x0A7A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        K2Node_MakeArray_Array_1;                          // 0x0A80(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FRotator                               CallFunc_GetStartingRotation_ReturnValue;          // 0x0A90(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0A9C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9D[0x3];                                      // 0x0A9D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarinerLayeredButton*                  K2Node_ComponentBoundEvent_Instance;               // 0x0AA0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuManager*                    CallFunc_GetMenuManager_ReturnValue_7;             // 0x0AA8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMarinerMenuStackLayer*                 CallFunc_PushLayerToActiveStack_ReturnValue_7;     // 0x0AB0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bToSubLayer;                          // 0x0AB8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AB9[0x7];                                      // 0x0AB9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMangoPlayerManager*                    CallFunc_Get_ReturnValue_2;                        // 0x0AC0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMangoPlayerManager*                    CallFunc_Get_ReturnValue_3;                        // 0x0AC8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home) == 0x000008, "Wrong alignment on TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home");
static_assert(sizeof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home) == 0x000AD0, "Wrong size on TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, EntryPoint) == 0x000000, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::EntryPoint' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, Temp_object_Variable) == 0x000008, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_LoadEquippedDataForLocalProfile_ReturnValue) == 0x000030, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_LoadEquippedDataForLocalProfile_ReturnValue' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_Array_Get_Item) == 0x000050, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, K2Node_SwitchEnum_CmpSuccess) == 0x000058, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, K2Node_Event_bFromSubMenu) == 0x000059, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::K2Node_Event_bFromSubMenu' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, K2Node_ComponentBoundEvent_Instance_7) == 0x000060, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::K2Node_ComponentBoundEvent_Instance_7' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_GetMenuManager_ReturnValue) == 0x000068, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, K2Node_ComponentBoundEvent_Instance_6) == 0x000070, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::K2Node_ComponentBoundEvent_Instance_6' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_PushLayerToActiveStack_ReturnValue) == 0x000078, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_PushLayerToActiveStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_GetMenuManager_ReturnValue_1) == 0x000080, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_GetMenuManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, K2Node_ComponentBoundEvent_Instance_5) == 0x000088, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::K2Node_ComponentBoundEvent_Instance_5' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_PushLayerToActiveStack_ReturnValue_1) == 0x000090, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_PushLayerToActiveStack_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_GetMenuManager_ReturnValue_2) == 0x000098, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_GetMenuManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, K2Node_ComponentBoundEvent_Instance_4) == 0x0000A0, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::K2Node_ComponentBoundEvent_Instance_4' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_PushLayerToActiveStack_ReturnValue_2) == 0x0000A8, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_PushLayerToActiveStack_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_GetMenuManager_ReturnValue_3) == 0x0000B0, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_GetMenuManager_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, K2Node_ComponentBoundEvent_Instance_3) == 0x0000B8, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::K2Node_ComponentBoundEvent_Instance_3' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_PushLayerToActiveStack_ReturnValue_3) == 0x0000C0, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_PushLayerToActiveStack_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_GetMenuManager_ReturnValue_4) == 0x0000C8, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_GetMenuManager_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, K2Node_ComponentBoundEvent_Instance_2) == 0x0000D0, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::K2Node_ComponentBoundEvent_Instance_2' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_PushLayerToActiveStack_ReturnValue_4) == 0x0000D8, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_PushLayerToActiveStack_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_GetMenuManager_ReturnValue_5) == 0x0000E0, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_GetMenuManager_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_PushLayerToActiveStack_ReturnValue_5) == 0x0000E8, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_PushLayerToActiveStack_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_GetAllActorsOfClass_OutActors) == 0x0000F0, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_Array_Get_Item_1) == 0x000100, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_Array_Length_ReturnValue_1) == 0x000108, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_Greater_IntInt_ReturnValue) == 0x00010C, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000110, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_Array_Get_Item_2) == 0x000120, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_Array_Length_ReturnValue_2) == 0x000128, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00012C, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, K2Node_CustomEvent_ItemData) == 0x000130, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::K2Node_CustomEvent_ItemData' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, K2Node_CreateDelegate_OutputDelegate_2) == 0x000140, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_GetGameGlobals_ReturnValue) == 0x000150, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_GetGameGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_GetDefaultRocketTotemCollection_ReturnValue) == 0x000158, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_GetDefaultRocketTotemCollection_ReturnValue' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, K2Node_ComponentBoundEvent_Instance_1) == 0x000190, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::K2Node_ComponentBoundEvent_Instance_1' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_GetMenuManager_ReturnValue_6) == 0x000198, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_GetMenuManager_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_PushLayerToActiveStack_ReturnValue_6) == 0x0001A0, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_PushLayerToActiveStack_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_SetActiveInputWidget_InputWidget_CastInput) == 0x0001A8, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_SetActiveInputWidget_InputWidget_CastInput' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001B8, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, Temp_int_Loop_Counter_Variable) == 0x0001C8, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_Less_IntInt_ReturnValue) == 0x0001CC, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_Add_IntInt_ReturnValue) == 0x0001D0, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, Temp_struct_Variable) == 0x0001D8, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, K2Node_MakeArray_Array) == 0x000328, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_RegisterControllerInteractables_ReturnValue) == 0x000338, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_RegisterControllerInteractables_ReturnValue' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, K2Node_CustomEvent_TotemData) == 0x000340, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::K2Node_CustomEvent_TotemData' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, K2Node_CreateDelegate_OutputDelegate_4) == 0x000490, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_Get_ReturnValue) == 0x0004A0, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_Get_ReturnValue_1) == 0x0004A8, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_GetMangoProfile_ReturnValue) == 0x0004B0, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_GetMangoProfile_ReturnValue' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_GetMangoProfile_ReturnValue_1) == 0x000790, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_GetMangoProfile_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_LoadTotemDataForProfile_ReturnValue) == 0x000A70, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_LoadTotemDataForProfile_ReturnValue' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000A78, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_IsValid_ReturnValue_1) == 0x000A79, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, K2Node_MakeArray_Array_1) == 0x000A80, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_GetStartingRotation_ReturnValue) == 0x000A90, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_GetStartingRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000A9C, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, K2Node_ComponentBoundEvent_Instance) == 0x000AA0, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::K2Node_ComponentBoundEvent_Instance' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_GetMenuManager_ReturnValue_7) == 0x000AA8, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_GetMenuManager_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_PushLayerToActiveStack_ReturnValue_7) == 0x000AB0, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_PushLayerToActiveStack_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, K2Node_Event_bToSubLayer) == 0x000AB8, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::K2Node_Event_bToSubLayer' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_Get_ReturnValue_2) == 0x000AC0, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_Get_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home, CallFunc_Get_ReturnValue_3) == 0x000AC8, "Member 'TotemCustomization_Home_C_ExecuteUbergraph_TotemCustomization_Home::CallFunc_Get_ReturnValue_3' has a wrong offset!");

// Function TotemCustomization_Home.TotemCustomization_Home_C.BP_OnExited
// 0x0001 (0x0001 - 0x0000)
struct TotemCustomization_Home_C_BP_OnExited final
{
public:
	bool                                          bToSubLayer;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TotemCustomization_Home_C_BP_OnExited) == 0x000001, "Wrong alignment on TotemCustomization_Home_C_BP_OnExited");
static_assert(sizeof(TotemCustomization_Home_C_BP_OnExited) == 0x000001, "Wrong size on TotemCustomization_Home_C_BP_OnExited");
static_assert(offsetof(TotemCustomization_Home_C_BP_OnExited, bToSubLayer) == 0x000000, "Member 'TotemCustomization_Home_C_BP_OnExited::bToSubLayer' has a wrong offset!");

// Function TotemCustomization_Home.TotemCustomization_Home_C.BndEvt__EditTotemCompanionBtn_K2Node_ComponentBoundEvent_3_OnLayeredButtonEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TotemCustomization_Home_C_BndEvt__EditTotemCompanionBtn_K2Node_ComponentBoundEvent_3_OnLayeredButtonEvent__DelegateSignature final
{
public:
	class UMarinerLayeredButton*                  Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TotemCustomization_Home_C_BndEvt__EditTotemCompanionBtn_K2Node_ComponentBoundEvent_3_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on TotemCustomization_Home_C_BndEvt__EditTotemCompanionBtn_K2Node_ComponentBoundEvent_3_OnLayeredButtonEvent__DelegateSignature");
static_assert(sizeof(TotemCustomization_Home_C_BndEvt__EditTotemCompanionBtn_K2Node_ComponentBoundEvent_3_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong size on TotemCustomization_Home_C_BndEvt__EditTotemCompanionBtn_K2Node_ComponentBoundEvent_3_OnLayeredButtonEvent__DelegateSignature");
static_assert(offsetof(TotemCustomization_Home_C_BndEvt__EditTotemCompanionBtn_K2Node_ComponentBoundEvent_3_OnLayeredButtonEvent__DelegateSignature, Instance) == 0x000000, "Member 'TotemCustomization_Home_C_BndEvt__EditTotemCompanionBtn_K2Node_ComponentBoundEvent_3_OnLayeredButtonEvent__DelegateSignature::Instance' has a wrong offset!");

// Function TotemCustomization_Home.TotemCustomization_Home_C.BndEvt__EditTotemStandBtn_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TotemCustomization_Home_C_BndEvt__EditTotemStandBtn_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature final
{
public:
	class UMarinerLayeredButton*                  Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TotemCustomization_Home_C_BndEvt__EditTotemStandBtn_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on TotemCustomization_Home_C_BndEvt__EditTotemStandBtn_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature");
static_assert(sizeof(TotemCustomization_Home_C_BndEvt__EditTotemStandBtn_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong size on TotemCustomization_Home_C_BndEvt__EditTotemStandBtn_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature");
static_assert(offsetof(TotemCustomization_Home_C_BndEvt__EditTotemStandBtn_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature, Instance) == 0x000000, "Member 'TotemCustomization_Home_C_BndEvt__EditTotemStandBtn_K2Node_ComponentBoundEvent_2_OnLayeredButtonEvent__DelegateSignature::Instance' has a wrong offset!");

// Function TotemCustomization_Home.TotemCustomization_Home_C.BndEvt__EditTotemPatternBtn_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TotemCustomization_Home_C_BndEvt__EditTotemPatternBtn_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature final
{
public:
	class UMarinerLayeredButton*                  Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TotemCustomization_Home_C_BndEvt__EditTotemPatternBtn_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on TotemCustomization_Home_C_BndEvt__EditTotemPatternBtn_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature");
static_assert(sizeof(TotemCustomization_Home_C_BndEvt__EditTotemPatternBtn_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong size on TotemCustomization_Home_C_BndEvt__EditTotemPatternBtn_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature");
static_assert(offsetof(TotemCustomization_Home_C_BndEvt__EditTotemPatternBtn_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature, Instance) == 0x000000, "Member 'TotemCustomization_Home_C_BndEvt__EditTotemPatternBtn_K2Node_ComponentBoundEvent_1_OnLayeredButtonEvent__DelegateSignature::Instance' has a wrong offset!");

// Function TotemCustomization_Home.TotemCustomization_Home_C.BndEvt__EditTotemVFXBtn_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TotemCustomization_Home_C_BndEvt__EditTotemVFXBtn_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature final
{
public:
	class UMarinerLayeredButton*                  Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TotemCustomization_Home_C_BndEvt__EditTotemVFXBtn_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on TotemCustomization_Home_C_BndEvt__EditTotemVFXBtn_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature");
static_assert(sizeof(TotemCustomization_Home_C_BndEvt__EditTotemVFXBtn_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong size on TotemCustomization_Home_C_BndEvt__EditTotemVFXBtn_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature");
static_assert(offsetof(TotemCustomization_Home_C_BndEvt__EditTotemVFXBtn_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature, Instance) == 0x000000, "Member 'TotemCustomization_Home_C_BndEvt__EditTotemVFXBtn_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature::Instance' has a wrong offset!");

// Function TotemCustomization_Home.TotemCustomization_Home_C.BndEvt__EditTotemSymbolBtn_K2Node_ComponentBoundEvent_25_OnLayeredButtonEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TotemCustomization_Home_C_BndEvt__EditTotemSymbolBtn_K2Node_ComponentBoundEvent_25_OnLayeredButtonEvent__DelegateSignature final
{
public:
	class UMarinerLayeredButton*                  Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TotemCustomization_Home_C_BndEvt__EditTotemSymbolBtn_K2Node_ComponentBoundEvent_25_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on TotemCustomization_Home_C_BndEvt__EditTotemSymbolBtn_K2Node_ComponentBoundEvent_25_OnLayeredButtonEvent__DelegateSignature");
static_assert(sizeof(TotemCustomization_Home_C_BndEvt__EditTotemSymbolBtn_K2Node_ComponentBoundEvent_25_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong size on TotemCustomization_Home_C_BndEvt__EditTotemSymbolBtn_K2Node_ComponentBoundEvent_25_OnLayeredButtonEvent__DelegateSignature");
static_assert(offsetof(TotemCustomization_Home_C_BndEvt__EditTotemSymbolBtn_K2Node_ComponentBoundEvent_25_OnLayeredButtonEvent__DelegateSignature, Instance) == 0x000000, "Member 'TotemCustomization_Home_C_BndEvt__EditTotemSymbolBtn_K2Node_ComponentBoundEvent_25_OnLayeredButtonEvent__DelegateSignature::Instance' has a wrong offset!");

// Function TotemCustomization_Home.TotemCustomization_Home_C.BndEvt__EditTotemShapeBtn_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TotemCustomization_Home_C_BndEvt__EditTotemShapeBtn_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature final
{
public:
	class UMarinerLayeredButton*                  Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TotemCustomization_Home_C_BndEvt__EditTotemShapeBtn_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on TotemCustomization_Home_C_BndEvt__EditTotemShapeBtn_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature");
static_assert(sizeof(TotemCustomization_Home_C_BndEvt__EditTotemShapeBtn_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong size on TotemCustomization_Home_C_BndEvt__EditTotemShapeBtn_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature");
static_assert(offsetof(TotemCustomization_Home_C_BndEvt__EditTotemShapeBtn_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature, Instance) == 0x000000, "Member 'TotemCustomization_Home_C_BndEvt__EditTotemShapeBtn_K2Node_ComponentBoundEvent_0_OnLayeredButtonEvent__DelegateSignature::Instance' has a wrong offset!");

// Function TotemCustomization_Home.TotemCustomization_Home_C.BndEvt__EditTotemBorderBtn_K2Node_ComponentBoundEvent_12_OnLayeredButtonEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TotemCustomization_Home_C_BndEvt__EditTotemBorderBtn_K2Node_ComponentBoundEvent_12_OnLayeredButtonEvent__DelegateSignature final
{
public:
	class UMarinerLayeredButton*                  Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TotemCustomization_Home_C_BndEvt__EditTotemBorderBtn_K2Node_ComponentBoundEvent_12_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on TotemCustomization_Home_C_BndEvt__EditTotemBorderBtn_K2Node_ComponentBoundEvent_12_OnLayeredButtonEvent__DelegateSignature");
static_assert(sizeof(TotemCustomization_Home_C_BndEvt__EditTotemBorderBtn_K2Node_ComponentBoundEvent_12_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong size on TotemCustomization_Home_C_BndEvt__EditTotemBorderBtn_K2Node_ComponentBoundEvent_12_OnLayeredButtonEvent__DelegateSignature");
static_assert(offsetof(TotemCustomization_Home_C_BndEvt__EditTotemBorderBtn_K2Node_ComponentBoundEvent_12_OnLayeredButtonEvent__DelegateSignature, Instance) == 0x000000, "Member 'TotemCustomization_Home_C_BndEvt__EditTotemBorderBtn_K2Node_ComponentBoundEvent_12_OnLayeredButtonEvent__DelegateSignature::Instance' has a wrong offset!");

// Function TotemCustomization_Home.TotemCustomization_Home_C.BndEvt__EditTotemBaseBtn_K2Node_ComponentBoundEvent_200_OnLayeredButtonEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TotemCustomization_Home_C_BndEvt__EditTotemBaseBtn_K2Node_ComponentBoundEvent_200_OnLayeredButtonEvent__DelegateSignature final
{
public:
	class UMarinerLayeredButton*                  Instance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TotemCustomization_Home_C_BndEvt__EditTotemBaseBtn_K2Node_ComponentBoundEvent_200_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong alignment on TotemCustomization_Home_C_BndEvt__EditTotemBaseBtn_K2Node_ComponentBoundEvent_200_OnLayeredButtonEvent__DelegateSignature");
static_assert(sizeof(TotemCustomization_Home_C_BndEvt__EditTotemBaseBtn_K2Node_ComponentBoundEvent_200_OnLayeredButtonEvent__DelegateSignature) == 0x000008, "Wrong size on TotemCustomization_Home_C_BndEvt__EditTotemBaseBtn_K2Node_ComponentBoundEvent_200_OnLayeredButtonEvent__DelegateSignature");
static_assert(offsetof(TotemCustomization_Home_C_BndEvt__EditTotemBaseBtn_K2Node_ComponentBoundEvent_200_OnLayeredButtonEvent__DelegateSignature, Instance) == 0x000000, "Member 'TotemCustomization_Home_C_BndEvt__EditTotemBaseBtn_K2Node_ComponentBoundEvent_200_OnLayeredButtonEvent__DelegateSignature::Instance' has a wrong offset!");

// Function TotemCustomization_Home.TotemCustomization_Home_C.BP_OnEntered
// 0x0001 (0x0001 - 0x0000)
struct TotemCustomization_Home_C_BP_OnEntered final
{
public:
	bool                                          bFromSubMenu;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TotemCustomization_Home_C_BP_OnEntered) == 0x000001, "Wrong alignment on TotemCustomization_Home_C_BP_OnEntered");
static_assert(sizeof(TotemCustomization_Home_C_BP_OnEntered) == 0x000001, "Wrong size on TotemCustomization_Home_C_BP_OnEntered");
static_assert(offsetof(TotemCustomization_Home_C_BP_OnEntered, bFromSubMenu) == 0x000000, "Member 'TotemCustomization_Home_C_BP_OnEntered::bFromSubMenu' has a wrong offset!");

// Function TotemCustomization_Home.TotemCustomization_Home_C.LoadFinished_1D3F43834E9246C2522023AD05FD851E
// 0x0010 (0x0010 - 0x0000)
struct TotemCustomization_Home_C_LoadFinished_1D3F43834E9246C2522023AD05FD851E final
{
public:
	TArray<class UItemLoadResponse*>              ItemData;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(TotemCustomization_Home_C_LoadFinished_1D3F43834E9246C2522023AD05FD851E) == 0x000008, "Wrong alignment on TotemCustomization_Home_C_LoadFinished_1D3F43834E9246C2522023AD05FD851E");
static_assert(sizeof(TotemCustomization_Home_C_LoadFinished_1D3F43834E9246C2522023AD05FD851E) == 0x000010, "Wrong size on TotemCustomization_Home_C_LoadFinished_1D3F43834E9246C2522023AD05FD851E");
static_assert(offsetof(TotemCustomization_Home_C_LoadFinished_1D3F43834E9246C2522023AD05FD851E, ItemData) == 0x000000, "Member 'TotemCustomization_Home_C_LoadFinished_1D3F43834E9246C2522023AD05FD851E::ItemData' has a wrong offset!");

// Function TotemCustomization_Home.TotemCustomization_Home_C.TotemDataLoaded_3F958DAA47B324DD04A61C96B2471B93
// 0x0150 (0x0150 - 0x0000)
struct TotemCustomization_Home_C_TotemDataLoaded_3F958DAA47B324DD04A61C96B2471B93 final
{
public:
	struct FLoadedTotemDataResponse               TotemData;                                         // 0x0000(0x0150)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(TotemCustomization_Home_C_TotemDataLoaded_3F958DAA47B324DD04A61C96B2471B93) == 0x000008, "Wrong alignment on TotemCustomization_Home_C_TotemDataLoaded_3F958DAA47B324DD04A61C96B2471B93");
static_assert(sizeof(TotemCustomization_Home_C_TotemDataLoaded_3F958DAA47B324DD04A61C96B2471B93) == 0x000150, "Wrong size on TotemCustomization_Home_C_TotemDataLoaded_3F958DAA47B324DD04A61C96B2471B93");
static_assert(offsetof(TotemCustomization_Home_C_TotemDataLoaded_3F958DAA47B324DD04A61C96B2471B93, TotemData) == 0x000000, "Member 'TotemCustomization_Home_C_TotemDataLoaded_3F958DAA47B324DD04A61C96B2471B93::TotemData' has a wrong offset!");

// Function TotemCustomization_Home.TotemCustomization_Home_C.DoesCacheHaveChanges
// 0x0008 (0x0008 - 0x0000)
struct TotemCustomization_Home_C_DoesCacheHaveChanges final
{
public:
	bool                                          HasChanges;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TotemCustomization_Home_C_DoesCacheHaveChanges) == 0x000001, "Wrong alignment on TotemCustomization_Home_C_DoesCacheHaveChanges");
static_assert(sizeof(TotemCustomization_Home_C_DoesCacheHaveChanges) == 0x000008, "Wrong size on TotemCustomization_Home_C_DoesCacheHaveChanges");
static_assert(offsetof(TotemCustomization_Home_C_DoesCacheHaveChanges, HasChanges) == 0x000000, "Member 'TotemCustomization_Home_C_DoesCacheHaveChanges::HasChanges' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_DoesCacheHaveChanges, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'TotemCustomization_Home_C_DoesCacheHaveChanges::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_DoesCacheHaveChanges, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'TotemCustomization_Home_C_DoesCacheHaveChanges::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_DoesCacheHaveChanges, CallFunc_IsValid_ReturnValue_2) == 0x000003, "Member 'TotemCustomization_Home_C_DoesCacheHaveChanges::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_DoesCacheHaveChanges, CallFunc_IsValid_ReturnValue_3) == 0x000004, "Member 'TotemCustomization_Home_C_DoesCacheHaveChanges::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_DoesCacheHaveChanges, CallFunc_IsValid_ReturnValue_4) == 0x000005, "Member 'TotemCustomization_Home_C_DoesCacheHaveChanges::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_DoesCacheHaveChanges, CallFunc_IsValid_ReturnValue_5) == 0x000006, "Member 'TotemCustomization_Home_C_DoesCacheHaveChanges::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_DoesCacheHaveChanges, CallFunc_IsValid_ReturnValue_6) == 0x000007, "Member 'TotemCustomization_Home_C_DoesCacheHaveChanges::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");

// Function TotemCustomization_Home.TotemCustomization_Home_C.UpdatePrompts
// 0x0120 (0x0120 - 0x0000)
struct TotemCustomization_Home_C_UpdatePrompts final
{
public:
	struct FMarinerPromptData                     K2Node_MakeStruct_MarinerPromptData;               // 0x0000(0x0118)()
	bool                                          CallFunc_ClearHostPrompts_ReturnValue;             // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddHostPrompt_ReturnValue;                // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TotemCustomization_Home_C_UpdatePrompts) == 0x000008, "Wrong alignment on TotemCustomization_Home_C_UpdatePrompts");
static_assert(sizeof(TotemCustomization_Home_C_UpdatePrompts) == 0x000120, "Wrong size on TotemCustomization_Home_C_UpdatePrompts");
static_assert(offsetof(TotemCustomization_Home_C_UpdatePrompts, K2Node_MakeStruct_MarinerPromptData) == 0x000000, "Member 'TotemCustomization_Home_C_UpdatePrompts::K2Node_MakeStruct_MarinerPromptData' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_UpdatePrompts, CallFunc_ClearHostPrompts_ReturnValue) == 0x000118, "Member 'TotemCustomization_Home_C_UpdatePrompts::CallFunc_ClearHostPrompts_ReturnValue' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_UpdatePrompts, CallFunc_AddHostPrompt_ReturnValue) == 0x000119, "Member 'TotemCustomization_Home_C_UpdatePrompts::CallFunc_AddHostPrompt_ReturnValue' has a wrong offset!");

// Function TotemCustomization_Home.TotemCustomization_Home_C.HandleTotemCollection
// 0x0198 (0x0198 - 0x0000)
struct TotemCustomization_Home_C_HandleTotemCollection final
{
public:
	struct FLoadedTotemDataResponse               TotemData;                                         // 0x0000(0x0150)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FMarinerRocketTotemCollection          K2Node_MakeStruct_MarinerRocketTotemCollection;    // 0x0150(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_2;      // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_3;      // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_4;      // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_5;      // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_6;      // 0x018E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x018F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0193(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TotemCustomization_Home_C_HandleTotemCollection) == 0x000008, "Wrong alignment on TotemCustomization_Home_C_HandleTotemCollection");
static_assert(sizeof(TotemCustomization_Home_C_HandleTotemCollection) == 0x000198, "Wrong size on TotemCustomization_Home_C_HandleTotemCollection");
static_assert(offsetof(TotemCustomization_Home_C_HandleTotemCollection, TotemData) == 0x000000, "Member 'TotemCustomization_Home_C_HandleTotemCollection::TotemData' has a wrong offset!");
static_assert(offsetof(TotemCustomization_Home_C_HandleTotemCollection, K2Node_MakeStruct_MarinerRocketTotemCollection) == 0x000150, "Member 'TotemCustomization_Home_C_HandleTotemCollection::K2Node_MakeStruct_MarinerRocketTotemCollection' has a wrong offset!");
