#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnviewedItemWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UnviewedItemWidget.UnviewedItemWidget_C
// 0x0020 (0x0250 - 0x0230)
class UUnviewedItemWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NoticeAnim;                                        // 0x0238(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 GlowCircle;                                        // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NoticeIcon;                                        // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UnviewedItemWidget(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UnviewedItemWidget_C">();
	}
	static class UUnviewedItemWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUnviewedItemWidget_C>();
	}
};
static_assert(alignof(UUnviewedItemWidget_C) == 0x000008, "Wrong alignment on UUnviewedItemWidget_C");
static_assert(sizeof(UUnviewedItemWidget_C) == 0x000250, "Wrong size on UUnviewedItemWidget_C");
static_assert(offsetof(UUnviewedItemWidget_C, UberGraphFrame) == 0x000230, "Member 'UUnviewedItemWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUnviewedItemWidget_C, NoticeAnim) == 0x000238, "Member 'UUnviewedItemWidget_C::NoticeAnim' has a wrong offset!");
static_assert(offsetof(UUnviewedItemWidget_C, GlowCircle) == 0x000240, "Member 'UUnviewedItemWidget_C::GlowCircle' has a wrong offset!");
static_assert(offsetof(UUnviewedItemWidget_C, NoticeIcon) == 0x000248, "Member 'UUnviewedItemWidget_C::NoticeIcon' has a wrong offset!");

}

