#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UpsellMessageBox

#include "Basic.hpp"

#include "Mariner_structs.hpp"
#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UpsellMessageBox.UpsellMessageBox_C
// 0x0030 (0x04C0 - 0x0490)
class UUpsellMessageBox_C final : public UMarinerMessageBox
{
public:
	class UImage*                                 Bound_BackgroundImage;                             // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_80;                                          // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_259;                                         // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Material;                                          // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMarinerScrollBox*                      ScrollBox;                                         // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	bool HandleInput(EMarinerInputActions InInput);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UpsellMessageBox_C">();
	}
	static class UUpsellMessageBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUpsellMessageBox_C>();
	}
};
static_assert(alignof(UUpsellMessageBox_C) == 0x000008, "Wrong alignment on UUpsellMessageBox_C");
static_assert(sizeof(UUpsellMessageBox_C) == 0x0004C0, "Wrong size on UUpsellMessageBox_C");
static_assert(offsetof(UUpsellMessageBox_C, Bound_BackgroundImage) == 0x000490, "Member 'UUpsellMessageBox_C::Bound_BackgroundImage' has a wrong offset!");
static_assert(offsetof(UUpsellMessageBox_C, Image) == 0x000498, "Member 'UUpsellMessageBox_C::Image' has a wrong offset!");
static_assert(offsetof(UUpsellMessageBox_C, Image_80) == 0x0004A0, "Member 'UUpsellMessageBox_C::Image_80' has a wrong offset!");
static_assert(offsetof(UUpsellMessageBox_C, Image_259) == 0x0004A8, "Member 'UUpsellMessageBox_C::Image_259' has a wrong offset!");
static_assert(offsetof(UUpsellMessageBox_C, Material) == 0x0004B0, "Member 'UUpsellMessageBox_C::Material' has a wrong offset!");
static_assert(offsetof(UUpsellMessageBox_C, ScrollBox) == 0x0004B8, "Member 'UUpsellMessageBox_C::ScrollBox' has a wrong offset!");

}

