#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UpsellMessageBox

#include "Basic.hpp"

#include "Mariner_structs.hpp"


namespace SDK::Params
{

// Function UpsellMessageBox.UpsellMessageBox_C.HandleInput
// 0x0020 (0x0020 - 0x0000)
struct UpsellMessageBox_C_HandleInput final
{
public:
	EMarinerInputActions                          InInput;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMarinerInputInterface> CallFunc_HandleInput_self_CastInput;               // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HandleInput_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HandleInput_ReturnValue_1;                // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UpsellMessageBox_C_HandleInput) == 0x000008, "Wrong alignment on UpsellMessageBox_C_HandleInput");
static_assert(sizeof(UpsellMessageBox_C_HandleInput) == 0x000020, "Wrong size on UpsellMessageBox_C_HandleInput");
static_assert(offsetof(UpsellMessageBox_C_HandleInput, InInput) == 0x000000, "Member 'UpsellMessageBox_C_HandleInput::InInput' has a wrong offset!");
static_assert(offsetof(UpsellMessageBox_C_HandleInput, ReturnValue) == 0x000001, "Member 'UpsellMessageBox_C_HandleInput::ReturnValue' has a wrong offset!");
static_assert(offsetof(UpsellMessageBox_C_HandleInput, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'UpsellMessageBox_C_HandleInput::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UpsellMessageBox_C_HandleInput, CallFunc_HandleInput_self_CastInput) == 0x000008, "Member 'UpsellMessageBox_C_HandleInput::CallFunc_HandleInput_self_CastInput' has a wrong offset!");
static_assert(offsetof(UpsellMessageBox_C_HandleInput, CallFunc_HandleInput_ReturnValue) == 0x000018, "Member 'UpsellMessageBox_C_HandleInput::CallFunc_HandleInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(UpsellMessageBox_C_HandleInput, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000019, "Member 'UpsellMessageBox_C_HandleInput::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UpsellMessageBox_C_HandleInput, CallFunc_BooleanOR_ReturnValue) == 0x00001A, "Member 'UpsellMessageBox_C_HandleInput::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UpsellMessageBox_C_HandleInput, CallFunc_HandleInput_ReturnValue_1) == 0x00001B, "Member 'UpsellMessageBox_C_HandleInput::CallFunc_HandleInput_ReturnValue_1' has a wrong offset!");

}

