#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UserAgreementMenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function UserAgreementMenu.UserAgreementMenu_C.ExecuteUbergraph_UserAgreementMenu
// 0x0008 (0x0008 - 0x0000)
struct UserAgreementMenu_C_ExecuteUbergraph_UserAgreementMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlatformPC_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlatformPS4_ReturnValue;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlatformX1_ReturnValue;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UserAgreementMenu_C_ExecuteUbergraph_UserAgreementMenu) == 0x000004, "Wrong alignment on UserAgreementMenu_C_ExecuteUbergraph_UserAgreementMenu");
static_assert(sizeof(UserAgreementMenu_C_ExecuteUbergraph_UserAgreementMenu) == 0x000008, "Wrong size on UserAgreementMenu_C_ExecuteUbergraph_UserAgreementMenu");
static_assert(offsetof(UserAgreementMenu_C_ExecuteUbergraph_UserAgreementMenu, EntryPoint) == 0x000000, "Member 'UserAgreementMenu_C_ExecuteUbergraph_UserAgreementMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(UserAgreementMenu_C_ExecuteUbergraph_UserAgreementMenu, CallFunc_IsPlatformPC_ReturnValue) == 0x000004, "Member 'UserAgreementMenu_C_ExecuteUbergraph_UserAgreementMenu::CallFunc_IsPlatformPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(UserAgreementMenu_C_ExecuteUbergraph_UserAgreementMenu, CallFunc_IsPlatformPS4_ReturnValue) == 0x000005, "Member 'UserAgreementMenu_C_ExecuteUbergraph_UserAgreementMenu::CallFunc_IsPlatformPS4_ReturnValue' has a wrong offset!");
static_assert(offsetof(UserAgreementMenu_C_ExecuteUbergraph_UserAgreementMenu, CallFunc_IsPlatformX1_ReturnValue) == 0x000006, "Member 'UserAgreementMenu_C_ExecuteUbergraph_UserAgreementMenu::CallFunc_IsPlatformX1_ReturnValue' has a wrong offset!");

}

