#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UtilityFunctionLibrary

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function UtilityFunctionLibrary.UtilityFunctionLibrary_C.GetVectorRounded
// 0x0058 (0x0058 - 0x0000)
struct UtilityFunctionLibrary_C_GetVectorRounded final
{
public:
	struct FVector                                InVector;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25DA[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RoundedVector;                                     // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_1;                      // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_2;                      // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UtilityFunctionLibrary_C_GetVectorRounded) == 0x000008, "Wrong alignment on UtilityFunctionLibrary_C_GetVectorRounded");
static_assert(sizeof(UtilityFunctionLibrary_C_GetVectorRounded) == 0x000058, "Wrong size on UtilityFunctionLibrary_C_GetVectorRounded");
static_assert(offsetof(UtilityFunctionLibrary_C_GetVectorRounded, InVector) == 0x000000, "Member 'UtilityFunctionLibrary_C_GetVectorRounded::InVector' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_GetVectorRounded, __WorldContext) == 0x000010, "Member 'UtilityFunctionLibrary_C_GetVectorRounded::__WorldContext' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_GetVectorRounded, RoundedVector) == 0x000018, "Member 'UtilityFunctionLibrary_C_GetVectorRounded::RoundedVector' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_GetVectorRounded, CallFunc_BreakVector_X) == 0x000024, "Member 'UtilityFunctionLibrary_C_GetVectorRounded::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_GetVectorRounded, CallFunc_BreakVector_Y) == 0x000028, "Member 'UtilityFunctionLibrary_C_GetVectorRounded::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_GetVectorRounded, CallFunc_BreakVector_Z) == 0x00002C, "Member 'UtilityFunctionLibrary_C_GetVectorRounded::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_GetVectorRounded, CallFunc_Round_ReturnValue) == 0x000030, "Member 'UtilityFunctionLibrary_C_GetVectorRounded::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_GetVectorRounded, CallFunc_Round_ReturnValue_1) == 0x000034, "Member 'UtilityFunctionLibrary_C_GetVectorRounded::CallFunc_Round_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_GetVectorRounded, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000038, "Member 'UtilityFunctionLibrary_C_GetVectorRounded::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_GetVectorRounded, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00003C, "Member 'UtilityFunctionLibrary_C_GetVectorRounded::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_GetVectorRounded, CallFunc_Round_ReturnValue_2) == 0x000040, "Member 'UtilityFunctionLibrary_C_GetVectorRounded::CallFunc_Round_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_GetVectorRounded, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x000044, "Member 'UtilityFunctionLibrary_C_GetVectorRounded::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_GetVectorRounded, CallFunc_MakeVector_ReturnValue) == 0x000048, "Member 'UtilityFunctionLibrary_C_GetVectorRounded::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function UtilityFunctionLibrary.UtilityFunctionLibrary_C.GetRotatorFloored
// 0x0058 (0x0058 - 0x0000)
struct UtilityFunctionLibrary_C_GetRotatorFloored final
{
public:
	struct FRotator                               InRotator;                                         // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25DB[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RoundedRotator;                                    // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue_1;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue_2;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UtilityFunctionLibrary_C_GetRotatorFloored) == 0x000008, "Wrong alignment on UtilityFunctionLibrary_C_GetRotatorFloored");
static_assert(sizeof(UtilityFunctionLibrary_C_GetRotatorFloored) == 0x000058, "Wrong size on UtilityFunctionLibrary_C_GetRotatorFloored");
static_assert(offsetof(UtilityFunctionLibrary_C_GetRotatorFloored, InRotator) == 0x000000, "Member 'UtilityFunctionLibrary_C_GetRotatorFloored::InRotator' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_GetRotatorFloored, __WorldContext) == 0x000010, "Member 'UtilityFunctionLibrary_C_GetRotatorFloored::__WorldContext' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_GetRotatorFloored, RoundedRotator) == 0x000018, "Member 'UtilityFunctionLibrary_C_GetRotatorFloored::RoundedRotator' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_GetRotatorFloored, CallFunc_BreakRotator_Roll) == 0x000024, "Member 'UtilityFunctionLibrary_C_GetRotatorFloored::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_GetRotatorFloored, CallFunc_BreakRotator_Pitch) == 0x000028, "Member 'UtilityFunctionLibrary_C_GetRotatorFloored::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_GetRotatorFloored, CallFunc_BreakRotator_Yaw) == 0x00002C, "Member 'UtilityFunctionLibrary_C_GetRotatorFloored::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_GetRotatorFloored, CallFunc_FFloor_ReturnValue) == 0x000030, "Member 'UtilityFunctionLibrary_C_GetRotatorFloored::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_GetRotatorFloored, CallFunc_FFloor_ReturnValue_1) == 0x000034, "Member 'UtilityFunctionLibrary_C_GetRotatorFloored::CallFunc_FFloor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_GetRotatorFloored, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000038, "Member 'UtilityFunctionLibrary_C_GetRotatorFloored::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_GetRotatorFloored, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00003C, "Member 'UtilityFunctionLibrary_C_GetRotatorFloored::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_GetRotatorFloored, CallFunc_FFloor_ReturnValue_2) == 0x000040, "Member 'UtilityFunctionLibrary_C_GetRotatorFloored::CallFunc_FFloor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_GetRotatorFloored, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x000044, "Member 'UtilityFunctionLibrary_C_GetRotatorFloored::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_GetRotatorFloored, CallFunc_MakeRotator_ReturnValue) == 0x000048, "Member 'UtilityFunctionLibrary_C_GetRotatorFloored::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");

// Function UtilityFunctionLibrary.UtilityFunctionLibrary_C.GetRandomXForwardUnitVectorInCircle
// 0x0030 (0x0030 - 0x0000)
struct UtilityFunctionLibrary_C_GetRandomXForwardUnitVectorInCircle final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                UnitVector;                                        // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UtilityFunctionLibrary_C_GetRandomXForwardUnitVectorInCircle) == 0x000008, "Wrong alignment on UtilityFunctionLibrary_C_GetRandomXForwardUnitVectorInCircle");
static_assert(sizeof(UtilityFunctionLibrary_C_GetRandomXForwardUnitVectorInCircle) == 0x000030, "Wrong size on UtilityFunctionLibrary_C_GetRandomXForwardUnitVectorInCircle");
static_assert(offsetof(UtilityFunctionLibrary_C_GetRandomXForwardUnitVectorInCircle, __WorldContext) == 0x000000, "Member 'UtilityFunctionLibrary_C_GetRandomXForwardUnitVectorInCircle::__WorldContext' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_GetRandomXForwardUnitVectorInCircle, UnitVector) == 0x000008, "Member 'UtilityFunctionLibrary_C_GetRandomXForwardUnitVectorInCircle::UnitVector' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_GetRandomXForwardUnitVectorInCircle, CallFunc_MakeVector_ReturnValue) == 0x000014, "Member 'UtilityFunctionLibrary_C_GetRandomXForwardUnitVectorInCircle::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_GetRandomXForwardUnitVectorInCircle, CallFunc_RandomFloatInRange_ReturnValue) == 0x000020, "Member 'UtilityFunctionLibrary_C_GetRandomXForwardUnitVectorInCircle::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_GetRandomXForwardUnitVectorInCircle, CallFunc_RotateAngleAxis_ReturnValue) == 0x000024, "Member 'UtilityFunctionLibrary_C_GetRandomXForwardUnitVectorInCircle::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");

// Function UtilityFunctionLibrary.UtilityFunctionLibrary_C.LogCollision
// 0x00E0 (0x00E0 - 0x0000)
struct UtilityFunctionLibrary_C_LogCollision final
{
public:
	class UPrimitiveComponent*                    Primitive;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x000C(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25DC[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionChannel                             CallFunc_GetCollisionObjectType_ReturnValue;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25DD[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCollisionProfileName_ReturnValue;      // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25DE[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ECollisionEnabled                             CallFunc_GetCollisionEnabled_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25DF[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UtilityFunctionLibrary_C_LogCollision) == 0x000008, "Wrong alignment on UtilityFunctionLibrary_C_LogCollision");
static_assert(sizeof(UtilityFunctionLibrary_C_LogCollision) == 0x0000E0, "Wrong size on UtilityFunctionLibrary_C_LogCollision");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCollision, Primitive) == 0x000000, "Member 'UtilityFunctionLibrary_C_LogCollision::Primitive' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCollision, Duration) == 0x000008, "Member 'UtilityFunctionLibrary_C_LogCollision::Duration' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCollision, Color) == 0x00000C, "Member 'UtilityFunctionLibrary_C_LogCollision::Color' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCollision, __WorldContext) == 0x000020, "Member 'UtilityFunctionLibrary_C_LogCollision::__WorldContext' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCollision, CallFunc_GetCollisionObjectType_ReturnValue) == 0x000028, "Member 'UtilityFunctionLibrary_C_LogCollision::CallFunc_GetCollisionObjectType_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCollision, CallFunc_GetCollisionProfileName_ReturnValue) == 0x00002C, "Member 'UtilityFunctionLibrary_C_LogCollision::CallFunc_GetCollisionProfileName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCollision, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000038, "Member 'UtilityFunctionLibrary_C_LogCollision::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCollision, CallFunc_Conv_NameToString_ReturnValue) == 0x000048, "Member 'UtilityFunctionLibrary_C_LogCollision::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCollision, CallFunc_GetCollisionEnabled_ReturnValue) == 0x000058, "Member 'UtilityFunctionLibrary_C_LogCollision::CallFunc_GetCollisionEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCollision, CallFunc_GetDisplayName_ReturnValue) == 0x000060, "Member 'UtilityFunctionLibrary_C_LogCollision::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCollision, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x000070, "Member 'UtilityFunctionLibrary_C_LogCollision::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCollision, CallFunc_Concat_StrStr_ReturnValue) == 0x000080, "Member 'UtilityFunctionLibrary_C_LogCollision::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCollision, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000090, "Member 'UtilityFunctionLibrary_C_LogCollision::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCollision, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000A0, "Member 'UtilityFunctionLibrary_C_LogCollision::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCollision, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000B0, "Member 'UtilityFunctionLibrary_C_LogCollision::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCollision, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000C0, "Member 'UtilityFunctionLibrary_C_LogCollision::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCollision, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0000D0, "Member 'UtilityFunctionLibrary_C_LogCollision::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");

// Function UtilityFunctionLibrary.UtilityFunctionLibrary_C.DrawCharacterSoundHostility
// 0x0188 (0x0188 - 0x0000)
struct UtilityFunctionLibrary_C_DrawCharacterSoundHostility final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25E0[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_2;                            // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_3;                            // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x008C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsOfClass_OutActors;            // 0x00A0(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25E1[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25E2[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25E3[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_GetComponentByClass_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRTPCValue_Value;                       // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERTPCValueType                                CallFunc_GetRTPCValue_OutputValueType;             // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x010E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25E4[0x1];                                     // 0x010F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25E5[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default_1;                           // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility) == 0x000008, "Wrong alignment on UtilityFunctionLibrary_C_DrawCharacterSoundHostility");
static_assert(sizeof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility) == 0x000188, "Wrong size on UtilityFunctionLibrary_C_DrawCharacterSoundHostility");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, __WorldContext) == 0x000000, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::__WorldContext' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, Temp_struct_Variable) == 0x000008, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, Temp_struct_Variable_1) == 0x000018, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, Temp_struct_Variable_2) == 0x000028, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, Temp_int_Variable) == 0x000038, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, Temp_string_Variable) == 0x000040, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, Temp_string_Variable_1) == 0x000050, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, Temp_string_Variable_2) == 0x000060, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, Temp_string_Variable_3) == 0x000070, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::Temp_string_Variable_3' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, Temp_int_Loop_Counter_Variable) == 0x000080, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, CallFunc_Add_IntInt_ReturnValue) == 0x000084, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, Temp_int_Array_Index_Variable) == 0x000088, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, Temp_struct_Variable_3) == 0x00008C, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, Temp_int_Variable_1) == 0x00009C, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, CallFunc_GetAllActorsOfClass_OutActors) == 0x0000A0, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, CallFunc_Array_Length_ReturnValue) == 0x0000B0, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, CallFunc_Less_IntInt_ReturnValue) == 0x0000C0, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, CallFunc_GetDisplayName_ReturnValue) == 0x0000C8, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, CallFunc_Concat_StrStr_ReturnValue) == 0x0000D8, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, CallFunc_DoesImplementInterface_ReturnValue) == 0x0000E8, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000F0, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, CallFunc_GetComponentByClass_ReturnValue) == 0x000100, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, CallFunc_GetRTPCValue_Value) == 0x000108, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::CallFunc_GetRTPCValue_Value' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, CallFunc_GetRTPCValue_OutputValueType) == 0x00010C, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::CallFunc_GetRTPCValue_OutputValueType' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, CallFunc_IsValid_ReturnValue) == 0x00010D, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x00010E, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, CallFunc_FTrunc_ReturnValue) == 0x000110, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, CallFunc_Conv_FloatToString_ReturnValue) == 0x000118, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000128, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, K2Node_Select_Default) == 0x000138, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000148, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, K2Node_Select_Default_1) == 0x000158, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000168, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawCharacterSoundHostility, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000178, "Member 'UtilityFunctionLibrary_C_DrawCharacterSoundHostility::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");

// Function UtilityFunctionLibrary.UtilityFunctionLibrary_C.DrawDebugCapsule2
// 0x0098 (0x0098 - 0x0000)
struct UtilityFunctionLibrary_C_DrawDebugCapsule2 final
{
public:
	struct FVector                                PointA;                                            // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PointB;                                            // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LineColor;                                         // 0x001C(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Thickness;                                         // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25E6[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UtilityFunctionLibrary_C_DrawDebugCapsule2) == 0x000008, "Wrong alignment on UtilityFunctionLibrary_C_DrawDebugCapsule2");
static_assert(sizeof(UtilityFunctionLibrary_C_DrawDebugCapsule2) == 0x000098, "Wrong size on UtilityFunctionLibrary_C_DrawDebugCapsule2");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawDebugCapsule2, PointA) == 0x000000, "Member 'UtilityFunctionLibrary_C_DrawDebugCapsule2::PointA' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawDebugCapsule2, PointB) == 0x00000C, "Member 'UtilityFunctionLibrary_C_DrawDebugCapsule2::PointB' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawDebugCapsule2, Radius) == 0x000018, "Member 'UtilityFunctionLibrary_C_DrawDebugCapsule2::Radius' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawDebugCapsule2, LineColor) == 0x00001C, "Member 'UtilityFunctionLibrary_C_DrawDebugCapsule2::LineColor' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawDebugCapsule2, Duration) == 0x00002C, "Member 'UtilityFunctionLibrary_C_DrawDebugCapsule2::Duration' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawDebugCapsule2, Thickness) == 0x000030, "Member 'UtilityFunctionLibrary_C_DrawDebugCapsule2::Thickness' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawDebugCapsule2, __WorldContext) == 0x000038, "Member 'UtilityFunctionLibrary_C_DrawDebugCapsule2::__WorldContext' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawDebugCapsule2, CallFunc_FindLookAtRotation_ReturnValue) == 0x000040, "Member 'UtilityFunctionLibrary_C_DrawDebugCapsule2::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawDebugCapsule2, CallFunc_GetUpVector_ReturnValue) == 0x00004C, "Member 'UtilityFunctionLibrary_C_DrawDebugCapsule2::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawDebugCapsule2, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000058, "Member 'UtilityFunctionLibrary_C_DrawDebugCapsule2::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawDebugCapsule2, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000064, "Member 'UtilityFunctionLibrary_C_DrawDebugCapsule2::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawDebugCapsule2, CallFunc_Add_VectorVector_ReturnValue) == 0x000070, "Member 'UtilityFunctionLibrary_C_DrawDebugCapsule2::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawDebugCapsule2, CallFunc_VSize_ReturnValue) == 0x00007C, "Member 'UtilityFunctionLibrary_C_DrawDebugCapsule2::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawDebugCapsule2, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000080, "Member 'UtilityFunctionLibrary_C_DrawDebugCapsule2::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawDebugCapsule2, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00008C, "Member 'UtilityFunctionLibrary_C_DrawDebugCapsule2::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawDebugCapsule2, CallFunc_Add_FloatFloat_ReturnValue) == 0x000090, "Member 'UtilityFunctionLibrary_C_DrawDebugCapsule2::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function UtilityFunctionLibrary.UtilityFunctionLibrary_C.DrawDebugCapsuleComp
// 0x0048 (0x0048 - 0x0000)
struct UtilityFunctionLibrary_C_DrawDebugCapsuleComp final
{
public:
	class UCapsuleComponent*                      Capsule;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LineColor;                                         // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Thickness;                                         // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetScaledCapsuleRadius_ReturnValue;       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UtilityFunctionLibrary_C_DrawDebugCapsuleComp) == 0x000008, "Wrong alignment on UtilityFunctionLibrary_C_DrawDebugCapsuleComp");
static_assert(sizeof(UtilityFunctionLibrary_C_DrawDebugCapsuleComp) == 0x000048, "Wrong size on UtilityFunctionLibrary_C_DrawDebugCapsuleComp");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawDebugCapsuleComp, Capsule) == 0x000000, "Member 'UtilityFunctionLibrary_C_DrawDebugCapsuleComp::Capsule' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawDebugCapsuleComp, LineColor) == 0x000008, "Member 'UtilityFunctionLibrary_C_DrawDebugCapsuleComp::LineColor' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawDebugCapsuleComp, Duration) == 0x000018, "Member 'UtilityFunctionLibrary_C_DrawDebugCapsuleComp::Duration' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawDebugCapsuleComp, Thickness) == 0x00001C, "Member 'UtilityFunctionLibrary_C_DrawDebugCapsuleComp::Thickness' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawDebugCapsuleComp, __WorldContext) == 0x000020, "Member 'UtilityFunctionLibrary_C_DrawDebugCapsuleComp::__WorldContext' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawDebugCapsuleComp, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000028, "Member 'UtilityFunctionLibrary_C_DrawDebugCapsuleComp::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawDebugCapsuleComp, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000034, "Member 'UtilityFunctionLibrary_C_DrawDebugCapsuleComp::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawDebugCapsuleComp, CallFunc_GetScaledCapsuleRadius_ReturnValue) == 0x000040, "Member 'UtilityFunctionLibrary_C_DrawDebugCapsuleComp::CallFunc_GetScaledCapsuleRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_DrawDebugCapsuleComp, CallFunc_GetScaledCapsuleHalfHeight_ReturnValue) == 0x000044, "Member 'UtilityFunctionLibrary_C_DrawDebugCapsuleComp::CallFunc_GetScaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");

// Function UtilityFunctionLibrary.UtilityFunctionLibrary_C.LogCharacterMoveTime
// 0x00C0 (0x00C0 - 0x0000)
struct UtilityFunctionLibrary_C_LogCharacterMoveTime final
{
public:
	class AMarinerCharacter*                      Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Log;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bPrintToScreen;                                    // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25E7[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25E8[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25E9[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentClientTime_ReturnValue;         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25EA[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default;                             // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UtilityFunctionLibrary_C_LogCharacterMoveTime) == 0x000008, "Wrong alignment on UtilityFunctionLibrary_C_LogCharacterMoveTime");
static_assert(sizeof(UtilityFunctionLibrary_C_LogCharacterMoveTime) == 0x0000C0, "Wrong size on UtilityFunctionLibrary_C_LogCharacterMoveTime");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCharacterMoveTime, Character) == 0x000000, "Member 'UtilityFunctionLibrary_C_LogCharacterMoveTime::Character' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCharacterMoveTime, Log) == 0x000008, "Member 'UtilityFunctionLibrary_C_LogCharacterMoveTime::Log' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCharacterMoveTime, bPrintToScreen) == 0x000018, "Member 'UtilityFunctionLibrary_C_LogCharacterMoveTime::bPrintToScreen' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCharacterMoveTime, __WorldContext) == 0x000020, "Member 'UtilityFunctionLibrary_C_LogCharacterMoveTime::__WorldContext' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCharacterMoveTime, Temp_bool_Variable) == 0x000028, "Member 'UtilityFunctionLibrary_C_LogCharacterMoveTime::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCharacterMoveTime, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'UtilityFunctionLibrary_C_LogCharacterMoveTime::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCharacterMoveTime, CallFunc_IsLocallyControlled_ReturnValue) == 0x000040, "Member 'UtilityFunctionLibrary_C_LogCharacterMoveTime::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCharacterMoveTime, CallFunc_HasAuthority_ReturnValue) == 0x000041, "Member 'UtilityFunctionLibrary_C_LogCharacterMoveTime::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCharacterMoveTime, CallFunc_HasAuthority_ReturnValue_1) == 0x000042, "Member 'UtilityFunctionLibrary_C_LogCharacterMoveTime::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCharacterMoveTime, CallFunc_BooleanOR_ReturnValue) == 0x000043, "Member 'UtilityFunctionLibrary_C_LogCharacterMoveTime::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCharacterMoveTime, Temp_string_Variable) == 0x000048, "Member 'UtilityFunctionLibrary_C_LogCharacterMoveTime::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCharacterMoveTime, CallFunc_GetCurrentClientTime_ReturnValue) == 0x000058, "Member 'UtilityFunctionLibrary_C_LogCharacterMoveTime::CallFunc_GetCurrentClientTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCharacterMoveTime, CallFunc_Conv_FloatToString_ReturnValue) == 0x000060, "Member 'UtilityFunctionLibrary_C_LogCharacterMoveTime::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCharacterMoveTime, Temp_string_Variable_1) == 0x000070, "Member 'UtilityFunctionLibrary_C_LogCharacterMoveTime::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCharacterMoveTime, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000080, "Member 'UtilityFunctionLibrary_C_LogCharacterMoveTime::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCharacterMoveTime, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000090, "Member 'UtilityFunctionLibrary_C_LogCharacterMoveTime::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCharacterMoveTime, K2Node_Select_Default) == 0x0000A0, "Member 'UtilityFunctionLibrary_C_LogCharacterMoveTime::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UtilityFunctionLibrary_C_LogCharacterMoveTime, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000B0, "Member 'UtilityFunctionLibrary_C_LogCharacterMoveTime::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");

// Function UtilityFunctionLibrary.UtilityFunctionLibrary_C.GetXYDistanceSquared
// 0x0050 (0x0050 - 0x0000)
struct UtilityFunctionLibrary_C_GetXYDistanceSquared final
{
public:
	struct FVector                                VectorA;                                           // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                VectorB;                                           // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         XYDistanceSquared;                                 // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
