#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WhiteTextGamepadPrompt

#include "Basic.hpp"

#include "Mariner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WhiteTextGamepadPrompt.WhiteTextGamepadPrompt_C
// 0x0028 (0x0400 - 0x03D8)
class UWhiteTextGamepadPrompt_C final : public UMarinerGamepadPrompt
{
public:
	class UTextBlock*                             OutputText;                                        // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlusText;                                          // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PrimaryGamepadIcon;                                // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PromptImage;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SecondaryGamepadIcon;                              // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FMarinerGamepadPromptAssets GetPromptAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WhiteTextGamepadPrompt_C">();
	}
	static class UWhiteTextGamepadPrompt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWhiteTextGamepadPrompt_C>();
	}
};
static_assert(alignof(UWhiteTextGamepadPrompt_C) == 0x000008, "Wrong alignment on UWhiteTextGamepadPrompt_C");
static_assert(sizeof(UWhiteTextGamepadPrompt_C) == 0x000400, "Wrong size on UWhiteTextGamepadPrompt_C");
static_assert(offsetof(UWhiteTextGamepadPrompt_C, OutputText) == 0x0003D8, "Member 'UWhiteTextGamepadPrompt_C::OutputText' has a wrong offset!");
static_assert(offsetof(UWhiteTextGamepadPrompt_C, PlusText) == 0x0003E0, "Member 'UWhiteTextGamepadPrompt_C::PlusText' has a wrong offset!");
static_assert(offsetof(UWhiteTextGamepadPrompt_C, PrimaryGamepadIcon) == 0x0003E8, "Member 'UWhiteTextGamepadPrompt_C::PrimaryGamepadIcon' has a wrong offset!");
static_assert(offsetof(UWhiteTextGamepadPrompt_C, PromptImage) == 0x0003F0, "Member 'UWhiteTextGamepadPrompt_C::PromptImage' has a wrong offset!");
static_assert(offsetof(UWhiteTextGamepadPrompt_C, SecondaryGamepadIcon) == 0x0003F8, "Member 'UWhiteTextGamepadPrompt_C::SecondaryGamepadIcon' has a wrong offset!");

}

